------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/00b_dummyData_create_multiple_stps.log
  log type:  text
 opened on:  26 Sep 2022, 17:56:20

. 
. *program for replacing stps that is called below
. program drop _all

. program replaceSTPs
  1.         local low=0
  2.         *divide total dataset by number of stps (=31)
.         local increase=int(_N/31)
  3.         *replace stps 5-9
.         foreach i of numlist 5/9 {
  4.                 local high=`low'+`increase'
  5.                 replace stp="E5400000`i'" if _n>`low'& _n<`high'
  6.                 local low=`low'+ `increase'
  7.         }
  8.         count
  9.         *replace all other stps
.         *reset lower limit to take account that 5/9 have been done already
.         local low=`increase'*5 
 10.         foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
 11.                 local high=`low'+`increase'
 12.                 replace stp="E540000`i'" if _n>`low'& _n<`high'
 13.                 local low=`low'+ `increase'
 14.         }
 15.         count
 16.         *tidy up remainder
.         replace stp="E54000005" if stp=="STP1"
 17. end

. 
. 
. *(1)=========Create separate stps for cases============
. import delimited ./output/covid_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 12,851 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     12,851      100.00      100.00
------------+-----------------------------------
      Total |     12,851      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
  12,851
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
(413 real changes made)
  12,851
(48 real changes made)

. *tabulate after changes
. tab stp, miss

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        461        3.59        3.59
  E54000006 |        413        3.21        6.80
  E54000007 |        413        3.21       10.01
  E54000008 |        413        3.21       13.23
  E54000009 |        413        3.21       16.44
  E54000010 |        413        3.21       19.66
  E54000012 |        413        3.21       22.87
  E54000013 |        413        3.21       26.08
  E54000014 |        413        3.21       29.30
  E54000015 |        413        3.21       32.51
  E54000016 |        413        3.21       35.72
  E54000017 |        413        3.21       38.94
  E54000020 |        413        3.21       42.15
  E54000021 |        413        3.21       45.37
  E54000022 |        413        3.21       48.58
  E54000023 |        413        3.21       51.79
  E54000024 |        413        3.21       55.01
  E54000025 |        413        3.21       58.22
  E54000026 |        413        3.21       61.43
  E54000027 |        413        3.21       64.65
  E54000029 |        413        3.21       67.86
  E54000033 |        413        3.21       71.08
  E54000035 |        413        3.21       74.29
  E54000036 |        413        3.21       77.50
  E54000037 |        413        3.21       80.72
  E54000040 |        413        3.21       83.93
  E54000041 |        413        3.21       87.14
  E54000042 |        413        3.21       90.36
  E54000043 |        413        3.21       93.57
  E54000044 |        413        3.21       96.79
  E54000049 |        413        3.21      100.00
------------+-----------------------------------
      Total |     12,851      100.00

. *export output
. export delimited using "./output/covid_matching.csv", replace
file ./output/covid_matching.csv saved

. 
. 
. 
. 
. *(2)=========Create separate stps for comparators============
. import delimited ./output/contemporary_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(9 vars, 28,952 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     28,952      100.00      100.00
------------+-----------------------------------
      Total |     28,952      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
  28,952
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
(932 real changes made)
  28,952
(60 real changes made)

. *tabulate after changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        992        3.43        3.43
  E54000006 |        932        3.22        6.65
  E54000007 |        932        3.22        9.86
  E54000008 |        932        3.22       13.08
  E54000009 |        932        3.22       16.30
  E54000010 |        932        3.22       19.52
  E54000012 |        932        3.22       22.74
  E54000013 |        932        3.22       25.96
  E54000014 |        932        3.22       29.18
  E54000015 |        932        3.22       32.40
  E54000016 |        932        3.22       35.62
  E54000017 |        932        3.22       38.84
  E54000020 |        932        3.22       42.06
  E54000021 |        932        3.22       45.27
  E54000022 |        932        3.22       48.49
  E54000023 |        932        3.22       51.71
  E54000024 |        932        3.22       54.93
  E54000025 |        932        3.22       58.15
  E54000026 |        932        3.22       61.37
  E54000027 |        932        3.22       64.59
  E54000029 |        932        3.22       67.81
  E54000033 |        932        3.22       71.03
  E54000035 |        932        3.22       74.25
  E54000036 |        932        3.22       77.47
  E54000037 |        932        3.22       80.69
  E54000040 |        932        3.22       83.90
  E54000041 |        932        3.22       87.12
  E54000042 |        932        3.22       90.34
  E54000043 |        932        3.22       93.56
  E54000044 |        932        3.22       96.78
  E54000049 |        932        3.22      100.00
------------+-----------------------------------
      Total |     28,952      100.00

. *export output
. export delimited using "./output/contemporary_matching.csv", replace
file ./output/contemporary_matching.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/00b_dummyData_create_multiple_stps.log
  log type:  text
 closed on:  26 Sep 2022, 17:56:20
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
