------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/00b_dummyData_create_multiple_stps.log
  log type:  text
 opened on:  17 Oct 2022, 01:05:39

. 
. *program for replacing stps that is called below
. program drop _all

. program replaceSTPs
  1.         local low=0
  2.         *divide total dataset by number of stps (=31)
.         local increase=int(_N/31)
  3.         *replace stps 5-9
.         foreach i of numlist 5/9 {
  4.                 local high=`low'+`increase'
  5.                 replace stp="E5400000`i'" if _n>`low'& _n<`high'
  6.                 local low=`low'+ `increase'
  7.         }
  8.         count
  9.         *replace all other stps
.         *reset lower limit to take account that 5/9 have been done already
.         local low=`increase'*5 
 10.         foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
 11.                 local high=`low'+`increase'
 12.                 replace stp="E540000`i'" if _n>`low'& _n<`high'
 13.                 local low=`low'+ `increase'
 14.         }
 15.         count
 16.         *tidy up remainder
.         replace stp="E54000005" if stp=="STP1"
 17. end

. 
. 
. *(1)=========Create separate stps for cases============
. import delimited ./output/covid_community_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(11 vars, 12,723 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     12,723      100.00      100.00
------------+-----------------------------------
      Total |     12,723      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
  12,723
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
(409 real changes made)
  12,723
(44 real changes made)

. *tabulate after changes
. tab stp, miss

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        453        3.56        3.56
  E54000006 |        409        3.21        6.78
  E54000007 |        409        3.21        9.99
  E54000008 |        409        3.21       13.20
  E54000009 |        409        3.21       16.42
  E54000010 |        409        3.21       19.63
  E54000012 |        409        3.21       22.85
  E54000013 |        409        3.21       26.06
  E54000014 |        409        3.21       29.28
  E54000015 |        409        3.21       32.49
  E54000016 |        409        3.21       35.71
  E54000017 |        409        3.21       38.92
  E54000020 |        409        3.21       42.14
  E54000021 |        409        3.21       45.35
  E54000022 |        409        3.21       48.57
  E54000023 |        409        3.21       51.78
  E54000024 |        409        3.21       54.99
  E54000025 |        409        3.21       58.21
  E54000026 |        409        3.21       61.42
  E54000027 |        409        3.21       64.64
  E54000029 |        409        3.21       67.85
  E54000033 |        409        3.21       71.07
  E54000035 |        409        3.21       74.28
  E54000036 |        409        3.21       77.50
  E54000037 |        409        3.21       80.71
  E54000040 |        409        3.21       83.93
  E54000041 |        409        3.21       87.14
  E54000042 |        409        3.21       90.36
  E54000043 |        409        3.21       93.57
  E54000044 |        409        3.21       96.79
  E54000049 |        409        3.21      100.00
------------+-----------------------------------
      Total |     12,723      100.00

. *export output
. export delimited using "./output/covid_community_matching.csv", replace
file ./output/covid_community_matching.csv saved

. 
. 
. 
. 
. *(2)=========Create separate stps for comparators============
. import delimited ./output/contemporary_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(9 vars, 28,882 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     28,882      100.00      100.00
------------+-----------------------------------
      Total |     28,882      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
  28,882
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
  28,882
(52 real changes made)

. *tabulate after changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        982        3.40        3.40
  E54000006 |        930        3.22        6.62
  E54000007 |        930        3.22        9.84
  E54000008 |        930        3.22       13.06
  E54000009 |        930        3.22       16.28
  E54000010 |        930        3.22       19.50
  E54000012 |        930        3.22       22.72
  E54000013 |        930        3.22       25.94
  E54000014 |        930        3.22       29.16
  E54000015 |        930        3.22       32.38
  E54000016 |        930        3.22       35.60
  E54000017 |        930        3.22       38.82
  E54000020 |        930        3.22       42.04
  E54000021 |        930        3.22       45.26
  E54000022 |        930        3.22       48.48
  E54000023 |        930        3.22       51.70
  E54000024 |        930        3.22       54.92
  E54000025 |        930        3.22       58.14
  E54000026 |        930        3.22       61.36
  E54000027 |        930        3.22       64.58
  E54000029 |        930        3.22       67.80
  E54000033 |        930        3.22       71.02
  E54000035 |        930        3.22       74.24
  E54000036 |        930        3.22       77.46
  E54000037 |        930        3.22       80.68
  E54000040 |        930        3.22       83.90
  E54000041 |        930        3.22       87.12
  E54000042 |        930        3.22       90.34
  E54000043 |        930        3.22       93.56
  E54000044 |        930        3.22       96.78
  E54000049 |        930        3.22      100.00
------------+-----------------------------------
      Total |     28,882      100.00

. *export output
. export delimited using "./output/contemporary_matching.csv", replace
file ./output/contemporary_matching.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/00b_dummyData_create_multiple_stps.log
  log type:  text
 closed on:  17 Oct 2022, 01:05:40
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
