------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/00b_dummyData_create_multiple_stps.log
  log type:  text
 opened on:  15 Sep 2022, 15:47:21

. 
. *program for replacing stps that is called below
. program drop _all

. program replaceSTPs
  1.         local low=0
  2.         *divide total dataset by number of stps (=31)
.         local increase=int(_N/31)
  3.         *replace stps 5-9
.         foreach i of numlist 5/9 {
  4.                 local high=`low'+`increase'
  5.                 replace stp="E5400000`i'" if _n>`low'& _n<`high'
  6.                 local low=`low'+ `increase'
  7.         }
  8.         count
  9.         *replace all other stps
.         *reset lower limit to take account that 5/9 have been done already
.         local low=`increase'*5 
 10.         foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
 11.                 local high=`low'+`increase'
 12.                 replace stp="E540000`i'" if _n>`low'& _n<`high'
 13.                 local low=`low'+ `increase'
 14.         }
 15.         count
 16.         *tidy up remainder
.         replace stp="E54000005" if stp=="STP1"
 17. end

. 
. 
. *(1)=========Create separate stps for cases============
. import delimited ./output/covid_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(6 vars, 13,224 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     13,224      100.00      100.00
------------+-----------------------------------
      Total |     13,224      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
  13,224
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
(425 real changes made)
  13,224
(49 real changes made)

. *tabulate after changes
. tab stp, miss

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        474        3.58        3.58
  E54000006 |        425        3.21        6.80
  E54000007 |        425        3.21       10.01
  E54000008 |        425        3.21       13.23
  E54000009 |        425        3.21       16.44
  E54000010 |        425        3.21       19.65
  E54000012 |        425        3.21       22.87
  E54000013 |        425        3.21       26.08
  E54000014 |        425        3.21       29.30
  E54000015 |        425        3.21       32.51
  E54000016 |        425        3.21       35.72
  E54000017 |        425        3.21       38.94
  E54000020 |        425        3.21       42.15
  E54000021 |        425        3.21       45.36
  E54000022 |        425        3.21       48.58
  E54000023 |        425        3.21       51.79
  E54000024 |        425        3.21       55.01
  E54000025 |        425        3.21       58.22
  E54000026 |        425        3.21       61.43
  E54000027 |        425        3.21       64.65
  E54000029 |        425        3.21       67.86
  E54000033 |        425        3.21       71.08
  E54000035 |        425        3.21       74.29
  E54000036 |        425        3.21       77.50
  E54000037 |        425        3.21       80.72
  E54000040 |        425        3.21       83.93
  E54000041 |        425        3.21       87.14
  E54000042 |        425        3.21       90.36
  E54000043 |        425        3.21       93.57
  E54000044 |        425        3.21       96.79
  E54000049 |        425        3.21      100.00
------------+-----------------------------------
      Total |     13,224      100.00

. *export output
. export delimited using "./output/covid_matching.csv", replace
file ./output/covid_matching.csv saved

. 
. 
. 
. 
. *(2)=========Create separate stps for comparators============
. import delimited ./output/contemporary_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(5 vars, 28,985 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     28,985      100.00      100.00
------------+-----------------------------------
      Total |     28,985      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
  28,985
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
  28,985
(31 real changes made)

. *tabulate after changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        965        3.33        3.33
  E54000006 |        934        3.22        6.55
  E54000007 |        934        3.22        9.77
  E54000008 |        934        3.22       13.00
  E54000009 |        934        3.22       16.22
  E54000010 |        934        3.22       19.44
  E54000012 |        934        3.22       22.66
  E54000013 |        934        3.22       25.89
  E54000014 |        934        3.22       29.11
  E54000015 |        934        3.22       32.33
  E54000016 |        934        3.22       35.55
  E54000017 |        934        3.22       38.78
  E54000020 |        934        3.22       42.00
  E54000021 |        934        3.22       45.22
  E54000022 |        934        3.22       48.44
  E54000023 |        934        3.22       51.66
  E54000024 |        934        3.22       54.89
  E54000025 |        934        3.22       58.11
  E54000026 |        934        3.22       61.33
  E54000027 |        934        3.22       64.55
  E54000029 |        934        3.22       67.78
  E54000033 |        934        3.22       71.00
  E54000035 |        934        3.22       74.22
  E54000036 |        934        3.22       77.44
  E54000037 |        934        3.22       80.67
  E54000040 |        934        3.22       83.89
  E54000041 |        934        3.22       87.11
  E54000042 |        934        3.22       90.33
  E54000043 |        934        3.22       93.56
  E54000044 |        934        3.22       96.78
  E54000049 |        934        3.22      100.00
------------+-----------------------------------
      Total |     28,985      100.00

. *export output
. export delimited using "./output/contemporary_matching.csv", replace
file ./output/contemporary_matching.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/00b_dummyData_create_multiple_stps.log
  log type:  text
 closed on:  15 Sep 2022, 15:47:22
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
