------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/00b_dummyData_create_multiple_stps.log
  log type:  text
 opened on:  11 Oct 2022, 23:09:31

. 
. *program for replacing stps that is called below
. program drop _all

. program replaceSTPs
  1.         local low=0
  2.         *divide total dataset by number of stps (=31)
.         local increase=int(_N/31)
  3.         *replace stps 5-9
.         foreach i of numlist 5/9 {
  4.                 local high=`low'+`increase'
  5.                 replace stp="E5400000`i'" if _n>`low'& _n<`high'
  6.                 local low=`low'+ `increase'
  7.         }
  8.         count
  9.         *replace all other stps
.         *reset lower limit to take account that 5/9 have been done already
.         local low=`increase'*5 
 10.         foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
 11.                 local high=`low'+`increase'
 12.                 replace stp="E540000`i'" if _n>`low'& _n<`high'
 13.                 local low=`low'+ `increase'
 14.         }
 15.         count
 16.         *tidy up remainder
.         replace stp="E54000005" if stp=="STP1"
 17. end

. 
. 
. *(1)=========Create separate stps for cases============
. import delimited ./output/covid_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 12,885 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     12,885      100.00      100.00
------------+-----------------------------------
      Total |     12,885      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
  12,885
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
(414 real changes made)
  12,885
(51 real changes made)

. *tabulate after changes
. tab stp, miss

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        465        3.61        3.61
  E54000006 |        414        3.21        6.82
  E54000007 |        414        3.21       10.03
  E54000008 |        414        3.21       13.25
  E54000009 |        414        3.21       16.46
  E54000010 |        414        3.21       19.67
  E54000012 |        414        3.21       22.89
  E54000013 |        414        3.21       26.10
  E54000014 |        414        3.21       29.31
  E54000015 |        414        3.21       32.53
  E54000016 |        414        3.21       35.74
  E54000017 |        414        3.21       38.95
  E54000020 |        414        3.21       42.17
  E54000021 |        414        3.21       45.38
  E54000022 |        414        3.21       48.59
  E54000023 |        414        3.21       51.80
  E54000024 |        414        3.21       55.02
  E54000025 |        414        3.21       58.23
  E54000026 |        414        3.21       61.44
  E54000027 |        414        3.21       64.66
  E54000029 |        414        3.21       67.87
  E54000033 |        414        3.21       71.08
  E54000035 |        414        3.21       74.30
  E54000036 |        414        3.21       77.51
  E54000037 |        414        3.21       80.72
  E54000040 |        414        3.21       83.93
  E54000041 |        414        3.21       87.15
  E54000042 |        414        3.21       90.36
  E54000043 |        414        3.21       93.57
  E54000044 |        414        3.21       96.79
  E54000049 |        414        3.21      100.00
------------+-----------------------------------
      Total |     12,885      100.00

. *export output
. export delimited using "./output/covid_matching.csv", replace
file ./output/covid_matching.csv saved

. 
. 
. 
. 
. *(2)=========Create separate stps for comparators============
. import delimited ./output/contemporary_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(9 vars, 28,804 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     28,804      100.00      100.00
------------+-----------------------------------
      Total |     28,804      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
  28,804
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
  28,804
(36 real changes made)

. *tabulate after changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        964        3.35        3.35
  E54000006 |        928        3.22        6.57
  E54000007 |        928        3.22        9.79
  E54000008 |        928        3.22       13.01
  E54000009 |        928        3.22       16.23
  E54000010 |        928        3.22       19.46
  E54000012 |        928        3.22       22.68
  E54000013 |        928        3.22       25.90
  E54000014 |        928        3.22       29.12
  E54000015 |        928        3.22       32.34
  E54000016 |        928        3.22       35.56
  E54000017 |        928        3.22       38.79
  E54000020 |        928        3.22       42.01
  E54000021 |        928        3.22       45.23
  E54000022 |        928        3.22       48.45
  E54000023 |        928        3.22       51.67
  E54000024 |        928        3.22       54.90
  E54000025 |        928        3.22       58.12
  E54000026 |        928        3.22       61.34
  E54000027 |        928        3.22       64.56
  E54000029 |        928        3.22       67.78
  E54000033 |        928        3.22       71.00
  E54000035 |        928        3.22       74.23
  E54000036 |        928        3.22       77.45
  E54000037 |        928        3.22       80.67
  E54000040 |        928        3.22       83.89
  E54000041 |        928        3.22       87.11
  E54000042 |        928        3.22       90.33
  E54000043 |        928        3.22       93.56
  E54000044 |        928        3.22       96.78
  E54000049 |        928        3.22      100.00
------------+-----------------------------------
      Total |     28,804      100.00

. *export output
. export delimited using "./output/contemporary_matching.csv", replace
file ./output/contemporary_matching.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/00b_dummyData_create_multiple_stps.log
  log type:  text
 closed on:  11 Oct 2022, 23:09:32
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
