-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 opened on:  19 Jul 2023, 12:46:52

. clear

. 
. capture noisily import delimited ./output/covid_matching_2017.csv, clear
(10 vars, 14,597 obs)

. keep patient_id covid_date

. tempfile covid_list_2017

. save `covid_list_2017', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. 
. capture noisily import delimited ./output/input_2017_matching.csv, delimiter(
> comma) varnames(1) case(preserve) clear
(16 vars, 50,000 obs)

. append using `covid_list_2017', force

. duplicates drop patient_id, force

Duplicates in terms of patient_id

(1,445 observations deleted)

. drop if covid_date!=""
(13,152 observations deleted)

. drop covid_date

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,762 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before February 2017
. drop if has_follow_up==0
(1,973 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,852 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,755 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,642 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2017
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2017 = . if !inrange(baseline_creatinine_feb20
> 17, 20, 3000)
(14,104 real changes made, 14,104 to missing)

. gen mgdl_baseline_creatinine_feb2017 = baseline_creatinine_feb2017/88.4
(14,104 missing values generated)

. gen min_baseline_creatinine_feb2017=.
(32,016 missing values generated)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,166 real changes made)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,746 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 329  if male==0
(9,166 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 411  if male==1
(8,746 real changes made)

. replace min_baseline_creatinine_feb2017 = 1 if min_baseline_creatinine_feb201
> 7<1
(11,335 real changes made)

. gen max_baseline_creatinine_feb2017=.
(32,016 missing values generated)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,166 real changes made)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,746 real changes made)

. replace max_baseline_creatinine_feb2017 = max_baseline_creatinine_feb2017^-1.
> 209
(17,912 real changes made)

. replace max_baseline_creatinine_feb2017 = 1 if max_baseline_creatinine_feb201
> 7>1
(20,681 real changes made)

. gen egfr_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017*max_ba
> seline_creatinine_feb2017*141
(14,104 missing values generated)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*(
> 0.993^age)
(17,912 real changes made)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*1
> .018 if male==0
(9,166 real changes made)

. drop if egfr_baseline_creatinine_feb2017 <15
(0 observations deleted)

. drop baseline_creatinine_feb2017

. drop mgdl_baseline_creatinine_feb2017

. drop min_baseline_creatinine_feb2017

. drop max_baseline_creatinine_feb2017

. drop egfr_baseline_creatinine_feb2017

. 
. * Deceased
. drop if deceased==1
(3,224 observations deleted)

. drop deceased

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        418        1.45        1.45
         19 |        386        1.34        2.79
         20 |        468        1.63        4.42
         21 |        476        1.65        6.07
         22 |        482        1.67        7.75
         23 |        449        1.56        9.30
         24 |        450        1.56       10.87
         25 |        505        1.75       12.62
         26 |        520        1.81       14.43
         27 |        493        1.71       16.14
         28 |        533        1.85       17.99
         29 |        490        1.70       19.69
         30 |        536        1.86       21.55
         31 |        509        1.77       23.32
         32 |        453        1.57       24.90
         33 |        480        1.67       26.56
         34 |        469        1.63       28.19
         35 |        473        1.64       29.83
         36 |        461        1.60       31.44
         37 |        476        1.65       33.09
         38 |        501        1.74       34.83
         39 |        460        1.60       36.43
         40 |        436        1.51       37.94
         41 |        439        1.52       39.47
         42 |        423        1.47       40.93
         43 |        445        1.55       42.48
         44 |        404        1.40       43.88
         45 |        534        1.85       45.74
         46 |        494        1.72       47.45
         47 |        509        1.77       49.22
         48 |        505        1.75       50.98
         49 |        509        1.77       52.74
         50 |        500        1.74       54.48
         51 |        514        1.79       56.27
         52 |        570        1.98       58.25
         53 |        494        1.72       59.96
         54 |        471        1.64       61.60
         55 |        481        1.67       63.27
         56 |        446        1.55       64.82
         57 |        448        1.56       66.37
         58 |        499        1.73       68.11
         59 |        482        1.67       69.78
         60 |        404        1.40       71.18
         61 |        383        1.33       72.51
         62 |        392        1.36       73.87
         63 |        376        1.31       75.18
         64 |        398        1.38       76.56
         65 |        358        1.24       77.81
         66 |        366        1.27       79.08
         67 |        372        1.29       80.37
         68 |        355        1.23       81.60
         69 |        370        1.29       82.89
         70 |        372        1.29       84.18
         71 |        346        1.20       85.38
         72 |        358        1.24       86.62
         73 |        353        1.23       87.85
         74 |        380        1.32       89.17
         75 |        269        0.93       90.10
         76 |        264        0.92       91.02
         77 |        257        0.89       91.91
         78 |        239        0.83       92.74
         79 |        251        0.87       93.62
         80 |        179        0.62       94.24
         81 |        192        0.67       94.90
         82 |        185        0.64       95.55
         83 |        180        0.63       96.17
         84 |        201        0.70       96.87
         85 |         96        0.33       97.20
         86 |        104        0.36       97.57
         87 |        123        0.43       97.99
         88 |        109        0.38       98.37
         89 |        125        0.43       98.81
         90 |         54        0.19       98.99
         91 |         63        0.22       99.21
         92 |         46        0.16       99.37
         93 |         49        0.17       99.54
         94 |         54        0.19       99.73
         95 |         10        0.03       99.76
         96 |         13        0.05       99.81
         97 |         11        0.04       99.85
         98 |         14        0.05       99.90
         99 |         18        0.06       99.96
        100 |          1        0.00       99.96
        101 |          2        0.01       99.97
        102 |          2        0.01       99.98
        103 |          2        0.01       99.98
        104 |          2        0.01       99.99
        105 |          2        0.01      100.00
        109 |          1        0.00      100.00
------------+-----------------------------------
      Total |     28,792      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,666       50.94       50.94
       Male |     14,126       49.06      100.00
------------+-----------------------------------
      Total |     28,792      100.00

. 
. export delimited using "./output/2017_matching.csv", replace
(note: file ./output/2017_matching.csv not found)
file ./output/2017_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 closed on:  19 Jul 2023, 12:46:54
-------------------------------------------------------------------------------
