-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 opened on:  24 Nov 2022, 16:50:31

. clear

. 
. import delimited ./output/input_2017_matching.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(16 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,457 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before
. drop if has_follow_up==0
(1,977 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,875 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,747 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,693 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2017
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2017 = . if !inrange(baseline_creatinine_feb20
> 17, 20, 3000)
(14,202 real changes made, 14,202 to missing)

. gen mgdl_baseline_creatinine_feb2017 = baseline_creatinine_feb2017/88.4
(14,202 missing values generated)

. gen min_baseline_creatinine_feb2017=.
(32,251 missing values generated)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,232 real changes made)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,817 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 329  if male==0
(9,232 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 411  if male==1
(8,817 real changes made)

. replace min_baseline_creatinine_feb2017 = 1 if min_baseline_creatinine_feb201
> 7<1
(11,314 real changes made)

. gen max_baseline_creatinine_feb2017=.
(32,251 missing values generated)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,232 real changes made)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,817 real changes made)

. replace max_baseline_creatinine_feb2017 = max_baseline_creatinine_feb2017^-1.
> 209
(18,049 real changes made)

. replace max_baseline_creatinine_feb2017 = 1 if max_baseline_creatinine_feb201
> 7>1
(20,937 real changes made)

. gen egfr_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017*max_ba
> seline_creatinine_feb2017*141
(14,202 missing values generated)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*(
> 0.993^age)
(18,049 real changes made)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*1
> .018 if male==0
(9,232 real changes made)

. drop if egfr_baseline_creatinine_feb2017 <15
(0 observations deleted)

. drop baseline_creatinine_feb2017

. drop mgdl_baseline_creatinine_feb2017

. drop min_baseline_creatinine_feb2017

. drop max_baseline_creatinine_feb2017

. drop egfr_baseline_creatinine_feb2017

. 
. * Deceased
. drop if deceased==1
(3,284 observations deleted)

. drop deceased

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        444        1.53        1.53
         19 |        406        1.40        2.93
         20 |        457        1.58        4.51
         21 |        444        1.53        6.04
         22 |        479        1.65        7.70
         23 |        482        1.66        9.36
         24 |        479        1.65       11.02
         25 |        510        1.76       12.78
         26 |        532        1.84       14.61
         27 |        496        1.71       16.33
         28 |        542        1.87       18.20
         29 |        544        1.88       20.07
         30 |        497        1.72       21.79
         31 |        508        1.75       23.54
         32 |        471        1.63       25.17
         33 |        498        1.72       26.89
         34 |        501        1.73       28.62
         35 |        475        1.64       30.26
         36 |        507        1.75       32.01
         37 |        512        1.77       33.78
         38 |        456        1.57       35.35
         39 |        504        1.74       37.09
         40 |        418        1.44       38.53
         41 |        461        1.59       40.12
         42 |        475        1.64       41.76
         43 |        473        1.63       43.40
         44 |        451        1.56       44.95
         45 |        509        1.76       46.71
         46 |        483        1.67       48.38
         47 |        476        1.64       50.02
         48 |        449        1.55       51.57
         49 |        487        1.68       53.25
         50 |        482        1.66       54.92
         51 |        466        1.61       56.53
         52 |        493        1.70       58.23
         53 |        528        1.82       60.05
         54 |        496        1.71       61.76
         55 |        423        1.46       63.22
         56 |        475        1.64       64.86
         57 |        483        1.67       66.53
         58 |        527        1.82       68.35
         59 |        452        1.56       69.91
         60 |        422        1.46       71.37
         61 |        378        1.30       72.67
         62 |        406        1.40       74.07
         63 |        432        1.49       75.57
         64 |        380        1.31       76.88
         65 |        394        1.36       78.24
         66 |        384        1.33       79.56
         67 |        349        1.20       80.77
         68 |        355        1.23       81.99
         69 |        370        1.28       83.27
         70 |        364        1.26       84.53
         71 |        339        1.17       85.70
         72 |        368        1.27       86.97
         73 |        327        1.13       88.10
         74 |        359        1.24       89.34
         75 |        239        0.83       90.16
         76 |        242        0.84       91.00
         77 |        242        0.84       91.83
         78 |        245        0.85       92.68
         79 |        299        1.03       93.71
         80 |        202        0.70       94.41
         81 |        175        0.60       95.01
         82 |        176        0.61       95.62
         83 |        180        0.62       96.24
         84 |        202        0.70       96.94
         85 |        109        0.38       97.31
         86 |        110        0.38       97.69
         87 |        126        0.43       98.13
         88 |        112        0.39       98.52
         89 |        117        0.40       98.92
         90 |         41        0.14       99.06
         91 |         53        0.18       99.24
         92 |         50        0.17       99.42
         93 |         46        0.16       99.58
         94 |         47        0.16       99.74
         95 |         12        0.04       99.78
         96 |         19        0.07       99.84
         97 |         10        0.03       99.88
         98 |         10        0.03       99.91
         99 |         19        0.07       99.98
        100 |          2        0.01       99.99
        102 |          1        0.00       99.99
        104 |          1        0.00       99.99
        107 |          2        0.01      100.00
------------+-----------------------------------
      Total |     28,967      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,779       51.02       51.02
       Male |     14,188       48.98      100.00
------------+-----------------------------------
      Total |     28,967      100.00

. 
. export delimited using "./output/2017_matching.csv", replace
(note: file ./output/2017_matching.csv not found)
file ./output/2017_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 closed on:  24 Nov 2022, 16:50:33
-------------------------------------------------------------------------------
