-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 opened on:  23 Oct 2022, 23:48:11

. clear

. 
. import delimited ./output/input_2017_matching.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,714 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before
. drop if has_follow_up==0
(1,940 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,854 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,736 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,687 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2017
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2017 = . if !inrange(baseline_creatinine_feb20
> 17, 20, 3000)
(14,101 real changes made, 14,101 to missing)

. gen mgdl_baseline_creatinine_feb2017 = baseline_creatinine_feb2017/88.4
(14,101 missing values generated)

. gen min_baseline_creatinine_feb2017=.
(32,069 missing values generated)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,218 real changes made)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,750 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 329  if male==0
(9,218 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 411  if male==1
(8,750 real changes made)

. replace min_baseline_creatinine_feb2017 = 1 if min_baseline_creatinine_feb201
> 7<1
(11,367 real changes made)

. gen max_baseline_creatinine_feb2017=.
(32,069 missing values generated)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,218 real changes made)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,750 real changes made)

. replace max_baseline_creatinine_feb2017 = max_baseline_creatinine_feb2017^-1.
> 209
(17,968 real changes made)

. replace max_baseline_creatinine_feb2017 = 1 if max_baseline_creatinine_feb201
> 7>1
(20,702 real changes made)

. gen egfr_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017*max_ba
> seline_creatinine_feb2017*141
(14,101 missing values generated)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*(
> 0.993^age)
(17,968 real changes made)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*1
> .018 if male==0
(9,218 real changes made)

. drop if egfr_baseline_creatinine_feb2017 <15
(0 observations deleted)

. drop baseline_creatinine_feb2017

. drop mgdl_baseline_creatinine_feb2017

. drop min_baseline_creatinine_feb2017

. drop max_baseline_creatinine_feb2017

. drop egfr_baseline_creatinine_feb2017

. 
. * Deceased
. drop if deceased==1
(3,181 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        420        1.45        1.45
         19 |        376        1.30        2.76
         20 |        455        1.58        4.33
         21 |        452        1.56        5.90
         22 |        471        1.63        7.53
         23 |        478        1.65        9.18
         24 |        446        1.54       10.72
         25 |        488        1.69       12.41
         26 |        502        1.74       14.15
         27 |        517        1.79       15.94
         28 |        527        1.82       17.77
         29 |        473        1.64       19.40
         30 |        501        1.73       21.14
         31 |        488        1.69       22.83
         32 |        491        1.70       24.53
         33 |        516        1.79       26.31
         34 |        496        1.72       28.03
         35 |        495        1.71       29.74
         36 |        496        1.72       31.46
         37 |        463        1.60       33.06
         38 |        480        1.66       34.72
         39 |        480        1.66       36.39
         40 |        478        1.65       38.04
         41 |        443        1.53       39.57
         42 |        435        1.51       41.08
         43 |        451        1.56       42.64
         44 |        450        1.56       44.20
         45 |        530        1.83       46.03
         46 |        498        1.72       47.76
         47 |        524        1.81       49.57
         48 |        514        1.78       51.35
         49 |        448        1.55       52.90
         50 |        479        1.66       54.56
         51 |        544        1.88       56.44
         52 |        501        1.73       58.18
         53 |        521        1.80       59.98
         54 |        513        1.78       61.76
         55 |        458        1.59       63.34
         56 |        450        1.56       64.90
         57 |        445        1.54       66.44
         58 |        478        1.65       68.09
         59 |        476        1.65       69.74
         60 |        394        1.36       71.11
         61 |        430        1.49       72.59
         62 |        382        1.32       73.92
         63 |        391        1.35       75.27
         64 |        391        1.35       76.62
         65 |        373        1.29       77.91
         66 |        350        1.21       79.13
         67 |        356        1.23       80.36
         68 |        395        1.37       81.73
         69 |        395        1.37       83.09
         70 |        380        1.32       84.41
         71 |        367        1.27       85.68
         72 |        340        1.18       86.86
         73 |        322        1.11       87.97
         74 |        364        1.26       89.23
         75 |        258        0.89       90.12
         76 |        242        0.84       90.96
         77 |        251        0.87       91.83
         78 |        258        0.89       92.72
         79 |        263        0.91       93.63
         80 |        155        0.54       94.17
         81 |        202        0.70       94.87
         82 |        202        0.70       95.57
         83 |        166        0.57       96.14
         84 |        198        0.69       96.83
         85 |        121        0.42       97.25
         86 |         94        0.33       97.57
         87 |        119        0.41       97.99
         88 |        124        0.43       98.41
         89 |        113        0.39       98.81
         90 |         58        0.20       99.01
         91 |         57        0.20       99.20
         92 |         59        0.20       99.41
         93 |         45        0.16       99.56
         94 |         52        0.18       99.74
         95 |         11        0.04       99.78
         96 |         15        0.05       99.83
         97 |          8        0.03       99.86
         98 |         16        0.06       99.92
         99 |         11        0.04       99.95
        102 |          3        0.01       99.97
        104 |          2        0.01       99.97
        106 |          3        0.01       99.98
        108 |          1        0.00       99.99
        109 |          4        0.01      100.00
------------+-----------------------------------
      Total |     28,888      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,447        5.01        5.01
          1 |      5,466       18.92       23.93
          2 |      5,555       19.23       43.16
          3 |      5,403       18.70       61.86
          4 |      5,446       18.85       80.72
          5 |      5,571       19.28      100.00
------------+-----------------------------------
      Total |     28,888      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,832       51.34       51.34
       Male |     14,056       48.66      100.00
------------+-----------------------------------
      Total |     28,888      100.00

. 
. export delimited using "./output/2017_matching.csv", replace
(note: file ./output/2017_matching.csv not found)
file ./output/2017_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 closed on:  23 Oct 2022, 23:48:12
-------------------------------------------------------------------------------
