-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 opened on:  24 Dec 2022, 12:03:26

. clear

. 
. import delimited ./output/input_2017_matching.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(16 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,693 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before
. drop if has_follow_up==0
(1,968 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,850 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,790 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,722 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2017
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2017 = . if !inrange(baseline_creatinine_feb20
> 17, 20, 3000)
(14,075 real changes made, 14,075 to missing)

. gen mgdl_baseline_creatinine_feb2017 = baseline_creatinine_feb2017/88.4
(14,075 missing values generated)

. gen min_baseline_creatinine_feb2017=.
(31,977 missing values generated)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,104 real changes made)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,798 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 329  if male==0
(9,104 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 411  if male==1
(8,798 real changes made)

. replace min_baseline_creatinine_feb2017 = 1 if min_baseline_creatinine_feb201
> 7<1
(11,385 real changes made)

. gen max_baseline_creatinine_feb2017=.
(31,977 missing values generated)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,104 real changes made)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,798 real changes made)

. replace max_baseline_creatinine_feb2017 = max_baseline_creatinine_feb2017^-1.
> 209
(17,902 real changes made)

. replace max_baseline_creatinine_feb2017 = 1 if max_baseline_creatinine_feb201
> 7>1
(20,592 real changes made)

. gen egfr_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017*max_ba
> seline_creatinine_feb2017*141
(14,075 missing values generated)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*(
> 0.993^age)
(17,902 real changes made)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*1
> .018 if male==0
(9,104 real changes made)

. drop if egfr_baseline_creatinine_feb2017 <15
(0 observations deleted)

. drop baseline_creatinine_feb2017

. drop mgdl_baseline_creatinine_feb2017

. drop min_baseline_creatinine_feb2017

. drop max_baseline_creatinine_feb2017

. drop egfr_baseline_creatinine_feb2017

. 
. * Deceased
. drop if deceased==1
(3,152 observations deleted)

. drop deceased

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        410        1.42        1.42
         19 |        439        1.52        2.95
         20 |        429        1.49        4.43
         21 |        502        1.74        6.18
         22 |        395        1.37        7.55
         23 |        467        1.62        9.17
         24 |        440        1.53       10.69
         25 |        480        1.67       12.36
         26 |        491        1.70       14.06
         27 |        544        1.89       15.95
         28 |        532        1.85       17.79
         29 |        525        1.82       19.61
         30 |        471        1.63       21.25
         31 |        496        1.72       22.97
         32 |        511        1.77       24.74
         33 |        484        1.68       26.42
         34 |        487        1.69       28.11
         35 |        497        1.72       29.84
         36 |        481        1.67       31.50
         37 |        503        1.75       33.25
         38 |        475        1.65       34.90
         39 |        501        1.74       36.63
         40 |        423        1.47       38.10
         41 |        442        1.53       39.64
         42 |        425        1.47       41.11
         43 |        450        1.56       42.67
         44 |        456        1.58       44.25
         45 |        494        1.71       45.97
         46 |        482        1.67       47.64
         47 |        524        1.82       49.46
         48 |        478        1.66       51.12
         49 |        478        1.66       52.77
         50 |        488        1.69       54.47
         51 |        517        1.79       56.26
         52 |        519        1.80       58.06
         53 |        512        1.78       59.84
         54 |        482        1.67       61.51
         55 |        465        1.61       63.12
         56 |        453        1.57       64.69
         57 |        506        1.76       66.45
         58 |        445        1.54       67.99
         59 |        471        1.63       69.63
         60 |        415        1.44       71.07
         61 |        382        1.33       72.39
         62 |        420        1.46       73.85
         63 |        395        1.37       75.22
         64 |        384        1.33       76.55
         65 |        357        1.24       77.79
         66 |        383        1.33       79.12
         67 |        388        1.35       80.46
         68 |        363        1.26       81.72
         69 |        377        1.31       83.03
         70 |        325        1.13       84.16
         71 |        378        1.31       85.47
         72 |        364        1.26       86.73
         73 |        336        1.17       87.90
         74 |        369        1.28       89.18
         75 |        289        1.00       90.18
         76 |        264        0.92       91.10
         77 |        236        0.82       91.92
         78 |        250        0.87       92.78
         79 |        263        0.91       93.70
         80 |        161        0.56       94.25
         81 |        176        0.61       94.87
         82 |        176        0.61       95.48
         83 |        190        0.66       96.14
         84 |        205        0.71       96.85
         85 |        116        0.40       97.25
         86 |        120        0.42       97.67
         87 |        107        0.37       98.04
         88 |        117        0.41       98.44
         89 |        100        0.35       98.79
         90 |         54        0.19       98.98
         91 |         55        0.19       99.17
         92 |         55        0.19       99.36
         93 |         64        0.22       99.58
         94 |         49        0.17       99.75
         95 |         18        0.06       99.81
         96 |          7        0.02       99.84
         97 |         14        0.05       99.89
         98 |         15        0.05       99.94
         99 |         10        0.03       99.97
        100 |          2        0.01       99.98
        101 |          1        0.00       99.98
        103 |          1        0.00       99.99
        104 |          2        0.01       99.99
        106 |          1        0.00      100.00
        109 |          1        0.00      100.00
------------+-----------------------------------
      Total |     28,825      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,664       50.87       50.87
       Male |     14,161       49.13      100.00
------------+-----------------------------------
      Total |     28,825      100.00

. 
. export delimited using "./output/2017_matching.csv", replace
(note: file ./output/2017_matching.csv not found)
file ./output/2017_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 closed on:  24 Dec 2022, 12:03:32
-------------------------------------------------------------------------------
