-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 opened on:   2 Nov 2022, 16:11:28

. clear

. 
. import delimited ./output/input_2017_matching.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,783 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before
. drop if has_follow_up==0
(1,940 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,835 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,785 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,667 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2017
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2017 = . if !inrange(baseline_creatinine_feb20
> 17, 20, 3000)
(14,081 real changes made, 14,081 to missing)

. gen mgdl_baseline_creatinine_feb2017 = baseline_creatinine_feb2017/88.4
(14,081 missing values generated)

. gen min_baseline_creatinine_feb2017=.
(31,990 missing values generated)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,180 real changes made)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,729 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 329  if male==0
(9,180 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 411  if male==1
(8,729 real changes made)

. replace min_baseline_creatinine_feb2017 = 1 if min_baseline_creatinine_feb201
> 7<1
(11,345 real changes made)

. gen max_baseline_creatinine_feb2017=.
(31,990 missing values generated)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,180 real changes made)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,729 real changes made)

. replace max_baseline_creatinine_feb2017 = max_baseline_creatinine_feb2017^-1.
> 209
(17,909 real changes made)

. replace max_baseline_creatinine_feb2017 = 1 if max_baseline_creatinine_feb201
> 7>1
(20,645 real changes made)

. gen egfr_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017*max_ba
> seline_creatinine_feb2017*141
(14,081 missing values generated)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*(
> 0.993^age)
(17,909 real changes made)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*1
> .018 if male==0
(9,180 real changes made)

. drop if egfr_baseline_creatinine_feb2017 <15
(0 observations deleted)

. drop baseline_creatinine_feb2017

. drop mgdl_baseline_creatinine_feb2017

. drop min_baseline_creatinine_feb2017

. drop max_baseline_creatinine_feb2017

. drop egfr_baseline_creatinine_feb2017

. 
. * Deceased
. drop if deceased==1
(3,164 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        422        1.46        1.46
         19 |        391        1.36        2.82
         20 |        489        1.70        4.52
         21 |        431        1.50        6.01
         22 |        439        1.52        7.53
         23 |        438        1.52        9.05
         24 |        463        1.61       10.66
         25 |        499        1.73       12.39
         26 |        482        1.67       14.06
         27 |        523        1.81       15.88
         28 |        477        1.65       17.53
         29 |        482        1.67       19.20
         30 |        532        1.85       21.05
         31 |        490        1.70       22.75
         32 |        527        1.83       24.58
         33 |        504        1.75       26.33
         34 |        475        1.65       27.97
         35 |        470        1.63       29.61
         36 |        469        1.63       31.23
         37 |        451        1.56       32.80
         38 |        465        1.61       34.41
         39 |        484        1.68       36.09
         40 |        462        1.60       37.69
         41 |        453        1.57       39.26
         42 |        447        1.55       40.81
         43 |        449        1.56       42.37
         44 |        457        1.59       43.96
         45 |        505        1.75       45.71
         46 |        463        1.61       47.31
         47 |        468        1.62       48.94
         48 |        495        1.72       50.66
         49 |        490        1.70       52.36
         50 |        523        1.81       54.17
         51 |        503        1.74       55.91
         52 |        524        1.82       57.73
         53 |        540        1.87       59.61
         54 |        530        1.84       61.44
         55 |        504        1.75       63.19
         56 |        451        1.56       64.76
         57 |        477        1.65       66.41
         58 |        460        1.60       68.01
         59 |        507        1.76       69.77
         60 |        376        1.30       71.07
         61 |        372        1.29       72.36
         62 |        371        1.29       73.65
         63 |        389        1.35       75.00
         64 |        435        1.51       76.51
         65 |        372        1.29       77.80
         66 |        383        1.33       79.13
         67 |        370        1.28       80.41
         68 |        385        1.34       81.75
         69 |        409        1.42       83.16
         70 |        364        1.26       84.43
         71 |        374        1.30       85.72
         72 |        346        1.20       86.92
         73 |        354        1.23       88.15
         74 |        358        1.24       89.39
         75 |        252        0.87       90.27
         76 |        269        0.93       91.20
         77 |        240        0.83       92.03
         78 |        242        0.84       92.87
         79 |        264        0.92       93.79
         80 |        175        0.61       94.40
         81 |        166        0.58       94.97
         82 |        187        0.65       95.62
         83 |        176        0.61       96.23
         84 |        209        0.73       96.96
         85 |        129        0.45       97.41
         86 |         94        0.33       97.73
         87 |        127        0.44       98.17
         88 |        116        0.40       98.57
         89 |        112        0.39       98.96
         90 |         45        0.16       99.12
         91 |         40        0.14       99.26
         92 |         44        0.15       99.41
         93 |         45        0.16       99.57
         94 |         39        0.14       99.70
         95 |         20        0.07       99.77
         96 |         13        0.05       99.82
         97 |         12        0.04       99.86
         98 |         10        0.03       99.89
         99 |         15        0.05       99.94
        100 |          1        0.00       99.95
        101 |          5        0.02       99.97
        105 |          5        0.02       99.98
        106 |          4        0.01      100.00
        109 |          1        0.00      100.00
------------+-----------------------------------
      Total |     28,826      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,453        5.04        5.04
          1 |      5,570       19.32       24.36
          2 |      5,369       18.63       42.99
          3 |      5,445       18.89       61.88
          4 |      5,570       19.32       81.20
          5 |      5,419       18.80      100.00
------------+-----------------------------------
      Total |     28,826      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,692       50.97       50.97
       Male |     14,134       49.03      100.00
------------+-----------------------------------
      Total |     28,826      100.00

. 
. export delimited using "./output/2017_matching.csv", replace
(note: file ./output/2017_matching.csv not found)
file ./output/2017_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 closed on:   2 Nov 2022, 16:11:30
-------------------------------------------------------------------------------
