-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 opened on:   5 Apr 2023, 10:23:04

. clear

. 
. capture noisily import delimited ./output/covid_matching_2017.csv, clear
(10 vars, 14,759 obs)

. keep patient_id covid_date

. tempfile covid_list_2017

. save `covid_list_2017', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. 
. capture noisily import delimited ./output/input_2017_matching.csv, delimiter(
> comma) varnames(1) case(preserve) clear
(16 vars, 50,000 obs)

. append using `covid_list_2017', force

. duplicates drop patient_id, force

Duplicates in terms of patient_id

(1,456 observations deleted)

. drop if covid_date!=""
(13,303 observations deleted)

. drop covid_date

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,476 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before February 2017
. drop if has_follow_up==0
(1,949 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,856 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,806 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,689 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2017
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2017 = . if !inrange(baseline_creatinine_feb20
> 17, 20, 3000)
(14,273 real changes made, 14,273 to missing)

. gen mgdl_baseline_creatinine_feb2017 = baseline_creatinine_feb2017/88.4
(14,273 missing values generated)

. gen min_baseline_creatinine_feb2017=.
(32,224 missing values generated)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,083 real changes made)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,868 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 329  if male==0
(9,083 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 411  if male==1
(8,868 real changes made)

. replace min_baseline_creatinine_feb2017 = 1 if min_baseline_creatinine_feb201
> 7<1
(11,317 real changes made)

. gen max_baseline_creatinine_feb2017=.
(32,224 missing values generated)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,083 real changes made)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,868 real changes made)

. replace max_baseline_creatinine_feb2017 = max_baseline_creatinine_feb2017^-1.
> 209
(17,951 real changes made)

. replace max_baseline_creatinine_feb2017 = 1 if max_baseline_creatinine_feb201
> 7>1
(20,907 real changes made)

. gen egfr_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017*max_ba
> seline_creatinine_feb2017*141
(14,273 missing values generated)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*(
> 0.993^age)
(17,951 real changes made)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*1
> .018 if male==0
(9,083 real changes made)

. drop if egfr_baseline_creatinine_feb2017 <15
(0 observations deleted)

. drop baseline_creatinine_feb2017

. drop mgdl_baseline_creatinine_feb2017

. drop min_baseline_creatinine_feb2017

. drop max_baseline_creatinine_feb2017

. drop egfr_baseline_creatinine_feb2017

. 
. * Deceased
. drop if deceased==1
(3,211 observations deleted)

. drop deceased

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        421        1.45        1.45
         19 |        395        1.36        2.81
         20 |        469        1.62        4.43
         21 |        465        1.60        6.03
         22 |        485        1.67        7.70
         23 |        459        1.58        9.29
         24 |        445        1.53       10.82
         25 |        439        1.51       12.33
         26 |        547        1.89       14.22
         27 |        502        1.73       15.95
         28 |        520        1.79       17.74
         29 |        482        1.66       19.40
         30 |        497        1.71       21.11
         31 |        493        1.70       22.81
         32 |        507        1.75       24.56
         33 |        503        1.73       26.30
         34 |        494        1.70       28.00
         35 |        465        1.60       29.60
         36 |        459        1.58       31.18
         37 |        491        1.69       32.87
         38 |        470        1.62       34.49
         39 |        488        1.68       36.18
         40 |        445        1.53       37.71
         41 |        470        1.62       39.33
         42 |        451        1.55       40.89
         43 |        482        1.66       42.55
         44 |        436        1.50       44.05
         45 |        463        1.60       45.65
         46 |        518        1.79       47.43
         47 |        497        1.71       49.14
         48 |        513        1.77       50.91
         49 |        507        1.75       52.66
         50 |        537        1.85       54.51
         51 |        501        1.73       56.24
         52 |        537        1.85       58.09
         53 |        489        1.69       59.77
         54 |        517        1.78       61.56
         55 |        491        1.69       63.25
         56 |        505        1.74       64.99
         57 |        464        1.60       66.59
         58 |        496        1.71       68.30
         59 |        485        1.67       69.97
         60 |        406        1.40       71.37
         61 |        387        1.33       72.70
         62 |        403        1.39       74.09
         63 |        397        1.37       75.46
         64 |        455        1.57       77.03
         65 |        379        1.31       78.33
         66 |        383        1.32       79.65
         67 |        369        1.27       80.93
         68 |        381        1.31       82.24
         69 |        382        1.32       83.56
         70 |        316        1.09       84.64
         71 |        373        1.29       85.93
         72 |        355        1.22       87.15
         73 |        374        1.29       88.44
         74 |        352        1.21       89.66
         75 |        262        0.90       90.56
         76 |        237        0.82       91.38
         77 |        253        0.87       92.25
         78 |        259        0.89       93.14
         79 |        227        0.78       93.92
         80 |        188        0.65       94.57
         81 |        187        0.64       95.22
         82 |        178        0.61       95.83
         83 |        168        0.58       96.41
         84 |        199        0.69       97.09
         85 |        111        0.38       97.48
         86 |        103        0.36       97.83
         87 |        102        0.35       98.18
         88 |        104        0.36       98.54
         89 |        104        0.36       98.90
         90 |         46        0.16       99.06
         91 |         52        0.18       99.24
         92 |         41        0.14       99.38
         93 |         61        0.21       99.59
         94 |         46        0.16       99.75
         95 |         20        0.07       99.82
         96 |         10        0.03       99.85
         97 |          7        0.02       99.88
         98 |         15        0.05       99.93
         99 |          8        0.03       99.96
        101 |          1        0.00       99.96
        102 |          1        0.00       99.96
        103 |          3        0.01       99.97
        104 |          1        0.00       99.98
        105 |          2        0.01       99.98
        106 |          2        0.01       99.99
        107 |          2        0.01      100.00
        108 |          1        0.00      100.00
------------+-----------------------------------
      Total |     29,013      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,791       50.98       50.98
       Male |     14,222       49.02      100.00
------------+-----------------------------------
      Total |     29,013      100.00

. 
. export delimited using "./output/2017_matching.csv", replace
(note: file ./output/2017_matching.csv not found)
file ./output/2017_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 closed on:   5 Apr 2023, 10:23:05
-------------------------------------------------------------------------------
