-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 opened on:  27 Oct 2022, 12:00:31

. clear

. 
. import delimited ./output/input_2017_matching.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,750 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before
. drop if has_follow_up==0
(1,935 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,881 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,761 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,719 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2017
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2017 = . if !inrange(baseline_creatinine_feb20
> 17, 20, 3000)
(14,031 real changes made, 14,031 to missing)

. gen mgdl_baseline_creatinine_feb2017 = baseline_creatinine_feb2017/88.4
(14,031 missing values generated)

. gen min_baseline_creatinine_feb2017=.
(31,954 missing values generated)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,135 real changes made)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,788 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 329  if male==0
(9,135 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 411  if male==1
(8,788 real changes made)

. replace min_baseline_creatinine_feb2017 = 1 if min_baseline_creatinine_feb201
> 7<1
(11,397 real changes made)

. gen max_baseline_creatinine_feb2017=.
(31,954 missing values generated)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,135 real changes made)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,788 real changes made)

. replace max_baseline_creatinine_feb2017 = max_baseline_creatinine_feb2017^-1.
> 209
(17,923 real changes made)

. replace max_baseline_creatinine_feb2017 = 1 if max_baseline_creatinine_feb201
> 7>1
(20,557 real changes made)

. gen egfr_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017*max_ba
> seline_creatinine_feb2017*141
(14,031 missing values generated)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*(
> 0.993^age)
(17,923 real changes made)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*1
> .018 if male==0
(9,135 real changes made)

. drop if egfr_baseline_creatinine_feb2017 <15
(0 observations deleted)

. drop baseline_creatinine_feb2017

. drop mgdl_baseline_creatinine_feb2017

. drop min_baseline_creatinine_feb2017

. drop max_baseline_creatinine_feb2017

. drop egfr_baseline_creatinine_feb2017

. 
. * Deceased
. drop if deceased==1
(3,132 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        431        1.50        1.50
         19 |        392        1.36        2.86
         20 |        470        1.63        4.49
         21 |        451        1.56        6.05
         22 |        453        1.57        7.62
         23 |        455        1.58        9.20
         24 |        432        1.50       10.70
         25 |        478        1.66       12.36
         26 |        474        1.64       14.00
         27 |        503        1.75       15.75
         28 |        499        1.73       17.48
         29 |        514        1.78       19.26
         30 |        460        1.60       20.86
         31 |        462        1.60       22.46
         32 |        483        1.68       24.14
         33 |        473        1.64       25.78
         34 |        509        1.77       27.54
         35 |        484        1.68       29.22
         36 |        490        1.70       30.92
         37 |        464        1.61       32.53
         38 |        477        1.65       34.19
         39 |        492        1.71       35.90
         40 |        431        1.50       37.39
         41 |        466        1.62       39.01
         42 |        405        1.41       40.41
         43 |        421        1.46       41.87
         44 |        466        1.62       43.49
         45 |        471        1.63       45.13
         46 |        514        1.78       46.91
         47 |        509        1.77       48.67
         48 |        506        1.76       50.43
         49 |        499        1.73       52.16
         50 |        535        1.86       54.02
         51 |        551        1.91       55.93
         52 |        533        1.85       57.78
         53 |        496        1.72       59.50
         54 |        523        1.81       61.31
         55 |        485        1.68       63.00
         56 |        474        1.64       64.64
         57 |        476        1.65       66.29
         58 |        483        1.68       67.97
         59 |        479        1.66       69.63
         60 |        389        1.35       70.98
         61 |        456        1.58       72.56
         62 |        381        1.32       73.88
         63 |        389        1.35       75.23
         64 |        420        1.46       76.69
         65 |        338        1.17       77.86
         66 |        385        1.34       79.20
         67 |        372        1.29       80.49
         68 |        397        1.38       81.87
         69 |        346        1.20       83.07
         70 |        357        1.24       84.31
         71 |        367        1.27       85.58
         72 |        350        1.21       86.79
         73 |        322        1.12       87.91
         74 |        369        1.28       89.19
         75 |        264        0.92       90.11
         76 |        225        0.78       90.89
         77 |        249        0.86       91.75
         78 |        271        0.94       92.69
         79 |        247        0.86       93.55
         80 |        175        0.61       94.16
         81 |        206        0.71       94.87
         82 |        199        0.69       95.56
         83 |        171        0.59       96.16
         84 |        184        0.64       96.79
         85 |         95        0.33       97.12
         86 |        111        0.39       97.51
         87 |        121        0.42       97.93
         88 |        120        0.42       98.35
         89 |        103        0.36       98.70
         90 |         54        0.19       98.89
         91 |         61        0.21       99.10
         92 |         60        0.21       99.31
         93 |         55        0.19       99.50
         94 |         46        0.16       99.66
         95 |         19        0.07       99.73
         96 |         12        0.04       99.77
         97 |         20        0.07       99.84
         98 |         15        0.05       99.89
         99 |         15        0.05       99.94
        100 |          2        0.01       99.95
        101 |          1        0.00       99.95
        103 |          3        0.01       99.96
        104 |          2        0.01       99.97
        106 |          2        0.01       99.98
        107 |          3        0.01       99.99
        108 |          2        0.01       99.99
        109 |          2        0.01      100.00
------------+-----------------------------------
      Total |     28,822      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,458        5.06        5.06
          1 |      5,541       19.22       24.28
          2 |      5,394       18.71       43.00
          3 |      5,495       19.07       62.06
          4 |      5,444       18.89       80.95
          5 |      5,490       19.05      100.00
------------+-----------------------------------
      Total |     28,822      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,727       51.10       51.10
       Male |     14,095       48.90      100.00
------------+-----------------------------------
      Total |     28,822      100.00

. 
. export delimited using "./output/2017_matching.csv", replace
(note: file ./output/2017_matching.csv not found)
file ./output/2017_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 closed on:  27 Oct 2022, 12:00:33
-------------------------------------------------------------------------------
