-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 opened on:   1 Nov 2022, 14:12:35

. clear

. 
. import delimited ./output/input_2017_matching.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,420 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before
. drop if has_follow_up==0
(1,960 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,859 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,771 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,701 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2017
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace creatinine_feb2017 = . if !inrange(creatinine_feb2017, 20, 3000)
(14,230 real changes made, 14,230 to missing)

. gen mgdl_creatinine_feb2017 = creatinine_feb2017/88.4
(14,230 missing values generated)

. gen min_creatinine_feb2017=.
(32,289 missing values generated)

. replace min_creatinine_feb2017 = mgdl_creatinine_feb2017/0.7 if male==0
(9,149 real changes made)

. replace min_creatinine_feb2017 = mgdl_creatinine_feb2017/0.9 if male==1
(8,910 real changes made)

. replace min_creatinine_feb2017 = min_creatinine_feb2017^-0.329  if male==0
(9,149 real changes made)

. replace min_creatinine_feb2017 = min_creatinine_feb2017^-0.411  if male==1
(8,910 real changes made)

. replace min_creatinine_feb2017 = 1 if min_creatinine_feb2017<1
(11,237 real changes made)

. gen max_creatinine_feb2017=.
(32,289 missing values generated)

. replace max_creatinine_feb2017 = mgdl_creatinine_feb2017/0.7 if male==0
(9,149 real changes made)

. replace max_creatinine_feb2017 = mgdl_creatinine_feb2017/0.9 if male==1
(8,910 real changes made)

. replace max_creatinine_feb2017 = max_creatinine_feb2017^-1.209
(18,059 real changes made)

. replace max_creatinine_feb2017 = 1 if max_creatinine_feb2017>1
(21,052 real changes made)

. gen egfr_creatinine_feb2017 = min_creatinine_feb2017*max_creatinine_feb2017*1
> 41
(14,230 missing values generated)

. replace egfr_creatinine_feb2017 = egfr_creatinine_feb2017*(0.993^age)
(18,059 real changes made)

. replace egfr_creatinine_feb2017 = egfr_creatinine_feb2017*1.018 if male==0
(9,149 real changes made)

. drop if egfr_creatinine_feb2017 <15
(0 observations deleted)

. drop creatinine_feb2017

. drop mgdl_creatinine_feb2017

. drop min_creatinine_feb2017

. drop max_creatinine_feb2017

. drop egfr_creatinine_feb2017

. 
. * Deceased
. drop if deceased==1
(3,248 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        401        1.38        1.38
         19 |        429        1.48        2.86
         20 |        475        1.64        4.49
         21 |        441        1.52        6.01
         22 |        495        1.70        7.72
         23 |        457        1.57        9.29
         24 |        449        1.55       10.84
         25 |        510        1.76       12.59
         26 |        479        1.65       14.24
         27 |        490        1.69       15.93
         28 |        502        1.73       17.66
         29 |        545        1.88       19.53
         30 |        485        1.67       21.20
         31 |        478        1.65       22.85
         32 |        511        1.76       24.61
         33 |        493        1.70       26.31
         34 |        501        1.73       28.03
         35 |        446        1.54       29.57
         36 |        463        1.59       31.16
         37 |        474        1.63       32.80
         38 |        480        1.65       34.45
         39 |        472        1.63       36.07
         40 |        449        1.55       37.62
         41 |        484        1.67       39.29
         42 |        453        1.56       40.85
         43 |        440        1.52       42.36
         44 |        448        1.54       43.90
         45 |        507        1.75       45.65
         46 |        492        1.69       47.34
         47 |        502        1.73       49.07
         48 |        491        1.69       50.76
         49 |        493        1.70       52.46
         50 |        504        1.74       54.20
         51 |        512        1.76       55.96
         52 |        491        1.69       57.65
         53 |        533        1.84       59.48
         54 |        487        1.68       61.16
         55 |        469        1.61       62.78
         56 |        481        1.66       64.43
         57 |        479        1.65       66.08
         58 |        478        1.65       67.73
         59 |        427        1.47       69.20
         60 |        410        1.41       70.61
         61 |        409        1.41       72.02
         62 |        416        1.43       73.45
         63 |        437        1.50       74.96
         64 |        427        1.47       76.43
         65 |        392        1.35       77.78
         66 |        347        1.19       78.97
         67 |        393        1.35       80.32
         68 |        408        1.40       81.73
         69 |        369        1.27       83.00
         70 |        340        1.17       84.17
         71 |        357        1.23       85.40
         72 |        374        1.29       86.69
         73 |        341        1.17       87.86
         74 |        357        1.23       89.09
         75 |        282        0.97       90.06
         76 |        286        0.98       91.05
         77 |        242        0.83       91.88
         78 |        245        0.84       92.72
         79 |        256        0.88       93.61
         80 |        173        0.60       94.20
         81 |        199        0.69       94.89
         82 |        207        0.71       95.60
         83 |        193        0.66       96.26
         84 |        192        0.66       96.93
         85 |        115        0.40       97.32
         86 |        134        0.46       97.78
         87 |         87        0.30       98.08
         88 |        118        0.41       98.49
         89 |        114        0.39       98.88
         90 |         57        0.20       99.08
         91 |         37        0.13       99.20
         92 |         54        0.19       99.39
         93 |         52        0.18       99.57
         94 |         51        0.18       99.75
         95 |         17        0.06       99.80
         96 |         18        0.06       99.87
         97 |         12        0.04       99.91
         98 |          7        0.02       99.93
         99 |          6        0.02       99.95
        100 |          3        0.01       99.96
        101 |          1        0.00       99.97
        102 |          2        0.01       99.97
        104 |          1        0.00       99.98
        105 |          1        0.00       99.98
        106 |          1        0.00       99.98
        107 |          1        0.00       99.99
        108 |          2        0.01       99.99
        109 |          2        0.01      100.00
------------+-----------------------------------
      Total |     29,041      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,417        4.88        4.88
          1 |      5,508       18.97       23.85
          2 |      5,515       18.99       42.84
          3 |      5,548       19.10       61.94
          4 |      5,475       18.85       80.79
          5 |      5,578       19.21      100.00
------------+-----------------------------------
      Total |     29,041      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,789       50.92       50.92
       Male |     14,252       49.08      100.00
------------+-----------------------------------
      Total |     29,041      100.00

. 
. export delimited using "./output/2017_matching.csv", replace
(note: file ./output/2017_matching.csv not found)
file ./output/2017_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 closed on:   1 Nov 2022, 14:12:37
-------------------------------------------------------------------------------
