-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 opened on:  21 Nov 2022, 21:53:30

. clear

. 
. import delimited ./output/input_2017_matching.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(16 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,550 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before
. drop if has_follow_up==0
(1,978 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,834 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,808 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,671 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2017
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2017 = . if !inrange(baseline_creatinine_feb20
> 17, 20, 3000)
(14,139 real changes made, 14,139 to missing)

. gen mgdl_baseline_creatinine_feb2017 = baseline_creatinine_feb2017/88.4
(14,139 missing values generated)

. gen min_baseline_creatinine_feb2017=.
(32,159 missing values generated)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,108 real changes made)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,912 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 329  if male==0
(9,108 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 411  if male==1
(8,912 real changes made)

. replace min_baseline_creatinine_feb2017 = 1 if min_baseline_creatinine_feb201
> 7<1
(11,460 real changes made)

. gen max_baseline_creatinine_feb2017=.
(32,159 missing values generated)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,108 real changes made)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,912 real changes made)

. replace max_baseline_creatinine_feb2017 = max_baseline_creatinine_feb2017^-1.
> 209
(18,020 real changes made)

. replace max_baseline_creatinine_feb2017 = 1 if max_baseline_creatinine_feb201
> 7>1
(20,699 real changes made)

. gen egfr_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017*max_ba
> seline_creatinine_feb2017*141
(14,139 missing values generated)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*(
> 0.993^age)
(18,020 real changes made)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*1
> .018 if male==0
(9,108 real changes made)

. drop if egfr_baseline_creatinine_feb2017 <15
(0 observations deleted)

. drop baseline_creatinine_feb2017

. drop mgdl_baseline_creatinine_feb2017

. drop min_baseline_creatinine_feb2017

. drop max_baseline_creatinine_feb2017

. drop egfr_baseline_creatinine_feb2017

. 
. * Deceased
. drop if deceased==1
(3,159 observations deleted)

. drop deceased

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        423        1.46        1.46
         19 |        432        1.49        2.95
         20 |        479        1.65        4.60
         21 |        450        1.55        6.15
         22 |        477        1.64        7.80
         23 |        460        1.59        9.38
         24 |        448        1.54       10.93
         25 |        502        1.73       12.66
         26 |        499        1.72       14.38
         27 |        505        1.74       16.12
         28 |        498        1.72       17.84
         29 |        512        1.77       19.60
         30 |        469        1.62       21.22
         31 |        507        1.75       22.97
         32 |        499        1.72       24.69
         33 |        482        1.66       26.35
         34 |        521        1.80       28.15
         35 |        479        1.65       29.80
         36 |        500        1.72       31.52
         37 |        478        1.65       33.17
         38 |        506        1.74       34.92
         39 |        457        1.58       36.49
         40 |        436        1.50       38.00
         41 |        449        1.55       39.54
         42 |        455        1.57       41.11
         43 |        434        1.50       42.61
         44 |        465        1.60       44.21
         45 |        487        1.68       45.89
         46 |        542        1.87       47.76
         47 |        464        1.60       49.36
         48 |        529        1.82       51.19
         49 |        494        1.70       52.89
         50 |        571        1.97       54.86
         51 |        468        1.61       56.47
         52 |        492        1.70       58.17
         53 |        525        1.81       59.98
         54 |        516        1.78       61.76
         55 |        475        1.64       63.40
         56 |        483        1.67       65.06
         57 |        466        1.61       66.67
         58 |        488        1.68       68.35
         59 |        481        1.66       70.01
         60 |        415        1.43       71.44
         61 |        387        1.33       72.78
         62 |        396        1.37       74.14
         63 |        404        1.39       75.53
         64 |        389        1.34       76.88
         65 |        377        1.30       78.18
         66 |        398        1.37       79.55
         67 |        433        1.49       81.04
         68 |        376        1.30       82.34
         69 |        361        1.24       83.58
         70 |        394        1.36       84.94
         71 |        355        1.22       86.17
         72 |        349        1.20       87.37
         73 |        326        1.12       88.49
         74 |        357        1.23       89.72
         75 |        234        0.81       90.53
         76 |        247        0.85       91.38
         77 |        250        0.86       92.24
         78 |        234        0.81       93.05
         79 |        213        0.73       93.79
         80 |        175        0.60       94.39
         81 |        184        0.63       95.02
         82 |        171        0.59       95.61
         83 |        197        0.68       96.29
         84 |        189        0.65       96.94
         85 |        105        0.36       97.31
         86 |        110        0.38       97.69
         87 |         96        0.33       98.02
         88 |        120        0.41       98.43
         89 |        108        0.37       98.80
         90 |         56        0.19       99.00
         91 |         48        0.17       99.16
         92 |         61        0.21       99.37
         93 |         50        0.17       99.54
         94 |         47        0.16       99.71
         95 |         15        0.05       99.76
         96 |         15        0.05       99.81
         97 |         15        0.05       99.86
         98 |         14        0.05       99.91
         99 |         11        0.04       99.95
        100 |          3        0.01       99.96
        101 |          2        0.01       99.97
        102 |          1        0.00       99.97
        103 |          2        0.01       99.98
        104 |          2        0.01       99.98
        105 |          3        0.01       99.99
        108 |          1        0.00      100.00
        109 |          1        0.00      100.00
------------+-----------------------------------
      Total |     29,000      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,731       50.80       50.80
       Male |     14,269       49.20      100.00
------------+-----------------------------------
      Total |     29,000      100.00

. 
. export delimited using "./output/2017_matching.csv", replace
(note: file ./output/2017_matching.csv not found)
file ./output/2017_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 closed on:  21 Nov 2022, 21:53:32
-------------------------------------------------------------------------------
