-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 opened on:  26 Oct 2022, 12:05:11

. clear

. 
. import delimited ./output/input_2017_matching.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,690 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before
. drop if has_follow_up==0
(1,967 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,863 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,751 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,693 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2017
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2017 = . if !inrange(baseline_creatinine_feb20
> 17, 20, 3000)
(13,954 real changes made, 13,954 to missing)

. gen mgdl_baseline_creatinine_feb2017 = baseline_creatinine_feb2017/88.4
(13,954 missing values generated)

. gen min_baseline_creatinine_feb2017=.
(32,036 missing values generated)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,212 real changes made)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,870 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 329  if male==0
(9,212 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 411  if male==1
(8,870 real changes made)

. replace min_baseline_creatinine_feb2017 = 1 if min_baseline_creatinine_feb201
> 7<1
(11,514 real changes made)

. gen max_baseline_creatinine_feb2017=.
(32,036 missing values generated)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,212 real changes made)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,870 real changes made)

. replace max_baseline_creatinine_feb2017 = max_baseline_creatinine_feb2017^-1.
> 209
(18,082 real changes made)

. replace max_baseline_creatinine_feb2017 = 1 if max_baseline_creatinine_feb201
> 7>1
(20,522 real changes made)

. gen egfr_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017*max_ba
> seline_creatinine_feb2017*141
(13,954 missing values generated)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*(
> 0.993^age)
(18,082 real changes made)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*1
> .018 if male==0
(9,212 real changes made)

. drop if egfr_baseline_creatinine_feb2017 <15
(0 observations deleted)

. drop baseline_creatinine_feb2017

. drop mgdl_baseline_creatinine_feb2017

. drop min_baseline_creatinine_feb2017

. drop max_baseline_creatinine_feb2017

. drop egfr_baseline_creatinine_feb2017

. 
. * Deceased
. drop if deceased==1
(3,180 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        390        1.35        1.35
         19 |        392        1.36        2.71
         20 |        485        1.68        4.39
         21 |        426        1.48        5.87
         22 |        476        1.65        7.52
         23 |        468        1.62        9.14
         24 |        473        1.64       10.78
         25 |        532        1.84       12.62
         26 |        522        1.81       14.43
         27 |        513        1.78       16.21
         28 |        465        1.61       17.82
         29 |        493        1.71       19.53
         30 |        460        1.59       21.12
         31 |        483        1.67       22.80
         32 |        485        1.68       24.48
         33 |        493        1.71       26.19
         34 |        474        1.64       27.83
         35 |        482        1.67       29.50
         36 |        467        1.62       31.12
         37 |        448        1.55       32.67
         38 |        471        1.63       34.30
         39 |        495        1.72       36.02
         40 |        459        1.59       37.61
         41 |        437        1.51       39.12
         42 |        446        1.55       40.67
         43 |        459        1.59       42.26
         44 |        420        1.46       43.71
         45 |        503        1.74       45.46
         46 |        504        1.75       47.20
         47 |        497        1.72       48.93
         48 |        478        1.66       50.58
         49 |        480        1.66       52.25
         50 |        505        1.75       54.00
         51 |        495        1.72       55.71
         52 |        525        1.82       57.53
         53 |        515        1.78       59.32
         54 |        517        1.79       61.11
         55 |        506        1.75       62.86
         56 |        497        1.72       64.58
         57 |        497        1.72       66.31
         58 |        505        1.75       68.06
         59 |        430        1.49       69.55
         60 |        389        1.35       70.89
         61 |        410        1.42       72.31
         62 |        419        1.45       73.77
         63 |        438        1.52       75.28
         64 |        400        1.39       76.67
         65 |        374        1.30       77.97
         66 |        374        1.30       79.26
         67 |        387        1.34       80.60
         68 |        352        1.22       81.82
         69 |        372        1.29       83.11
         70 |        383        1.33       84.44
         71 |        386        1.34       85.78
         72 |        355        1.23       87.01
         73 |        398        1.38       88.39
         74 |        350        1.21       89.60
         75 |        237        0.82       90.42
         76 |        232        0.80       91.23
         77 |        241        0.84       92.06
         78 |        238        0.82       92.89
         79 |        242        0.84       93.72
         80 |        193        0.67       94.39
         81 |        178        0.62       95.01
         82 |        188        0.65       95.66
         83 |        199        0.69       96.35
         84 |        190        0.66       97.01
         85 |        113        0.39       97.40
         86 |         96        0.33       97.73
         87 |        117        0.41       98.14
         88 |        117        0.41       98.54
         89 |        100        0.35       98.89
         90 |         50        0.17       99.06
         91 |         42        0.15       99.21
         92 |         42        0.15       99.36
         93 |         48        0.17       99.52
         94 |         53        0.18       99.71
         95 |         16        0.06       99.76
         96 |         13        0.05       99.81
         97 |         13        0.05       99.85
         98 |         15        0.05       99.90
         99 |         17        0.06       99.96
        100 |          1        0.00       99.97
        102 |          3        0.01       99.98
        104 |          2        0.01       99.98
        105 |          2        0.01       99.99
        106 |          1        0.00       99.99
        107 |          1        0.00      100.00
        109 |          1        0.00      100.00
------------+-----------------------------------
      Total |     28,856      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,484        5.14        5.14
          1 |      5,584       19.35       24.49
          2 |      5,396       18.70       43.19
          3 |      5,349       18.54       61.73
          4 |      5,503       19.07       80.80
          5 |      5,540       19.20      100.00
------------+-----------------------------------
      Total |     28,856      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,545       50.41       50.41
       Male |     14,311       49.59      100.00
------------+-----------------------------------
      Total |     28,856      100.00

. 
. export delimited using "./output/2017_matching.csv", replace
(note: file ./output/2017_matching.csv not found)
file ./output/2017_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 closed on:  26 Oct 2022, 12:05:13
-------------------------------------------------------------------------------
