-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 opened on:  24 Jan 2023, 18:20:09

. clear

. 
. capture noisily import delimited ./output/covid_matching_2017.csv, clear
(10 vars, 15,338 obs)

. keep patient_id covid_date

. tempfile covid_list_2017

. save `covid_list_2017', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. 
. capture noisily import delimited ./output/input_2017_matching.csv, delimiter(
> comma) varnames(1) case(preserve) clear
(16 vars, 50,000 obs)

. append using `covid_list_2017', force

. duplicates drop patient_id, force

Duplicates in terms of patient_id

(1,536 observations deleted)

. drop if covid_date!=""
(13,802 observations deleted)

. drop covid_date

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,658 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before
. drop if has_follow_up==0
(1,957 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,880 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,780 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,652 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2017
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2017 = . if !inrange(baseline_creatinine_feb20
> 17, 20, 3000)
(14,131 real changes made, 14,131 to missing)

. gen mgdl_baseline_creatinine_feb2017 = baseline_creatinine_feb2017/88.4
(14,131 missing values generated)

. gen min_baseline_creatinine_feb2017=.
(32,073 missing values generated)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,053 real changes made)

. replace min_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,889 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 329  if male==0
(9,053 real changes made)

. replace min_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017^-0.
> 411  if male==1
(8,889 real changes made)

. replace min_baseline_creatinine_feb2017 = 1 if min_baseline_creatinine_feb201
> 7<1
(11,272 real changes made)

. gen max_baseline_creatinine_feb2017=.
(32,073 missing values generated)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 7 if male==0
(9,053 real changes made)

. replace max_baseline_creatinine_feb2017 = mgdl_baseline_creatinine_feb2017/0.
> 9 if male==1
(8,889 real changes made)

. replace max_baseline_creatinine_feb2017 = max_baseline_creatinine_feb2017^-1.
> 209
(17,942 real changes made)

. replace max_baseline_creatinine_feb2017 = 1 if max_baseline_creatinine_feb201
> 7>1
(20,801 real changes made)

. gen egfr_baseline_creatinine_feb2017 = min_baseline_creatinine_feb2017*max_ba
> seline_creatinine_feb2017*141
(14,131 missing values generated)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*(
> 0.993^age)
(17,942 real changes made)

. replace egfr_baseline_creatinine_feb2017 = egfr_baseline_creatinine_feb2017*1
> .018 if male==0
(9,053 real changes made)

. drop if egfr_baseline_creatinine_feb2017 <15
(0 observations deleted)

. drop baseline_creatinine_feb2017

. drop mgdl_baseline_creatinine_feb2017

. drop min_baseline_creatinine_feb2017

. drop max_baseline_creatinine_feb2017

. drop egfr_baseline_creatinine_feb2017

. 
. * Deceased
. drop if deceased==1
(3,134 observations deleted)

. drop deceased

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        368        1.27        1.27
         19 |        402        1.39        2.66
         20 |        487        1.68        4.34
         21 |        450        1.55        5.90
         22 |        447        1.54        7.44
         23 |        520        1.80        9.24
         24 |        499        1.72       10.96
         25 |        498        1.72       12.69
         26 |        466        1.61       14.30
         27 |        510        1.76       16.06
         28 |        548        1.89       17.95
         29 |        525        1.81       19.77
         30 |        496        1.71       21.48
         31 |        474        1.64       23.12
         32 |        509        1.76       24.88
         33 |        508        1.76       26.63
         34 |        517        1.79       28.42
         35 |        477        1.65       30.07
         36 |        468        1.62       31.68
         37 |        467        1.61       33.30
         38 |        479        1.66       34.95
         39 |        456        1.58       36.53
         40 |        443        1.53       38.06
         41 |        432        1.49       39.55
         42 |        445        1.54       41.09
         43 |        466        1.61       42.70
         44 |        463        1.60       44.30
         45 |        488        1.69       45.99
         46 |        530        1.83       47.82
         47 |        489        1.69       49.51
         48 |        475        1.64       51.15
         49 |        501        1.73       52.88
         50 |        515        1.78       54.66
         51 |        506        1.75       56.41
         52 |        563        1.95       58.35
         53 |        494        1.71       60.06
         54 |        528        1.82       61.89
         55 |        462        1.60       63.48
         56 |        476        1.64       65.13
         57 |        455        1.57       66.70
         58 |        465        1.61       68.31
         59 |        464        1.60       69.91
         60 |        425        1.47       71.38
         61 |        399        1.38       72.76
         62 |        398        1.38       74.13
         63 |        429        1.48       75.61
         64 |        406        1.40       77.02
         65 |        370        1.28       78.30
         66 |        388        1.34       79.64
         67 |        331        1.14       80.78
         68 |        364        1.26       82.04
         69 |        385        1.33       83.37
         70 |        344        1.19       84.56
         71 |        331        1.14       85.70
         72 |        339        1.17       86.87
         73 |        355        1.23       88.10
         74 |        339        1.17       89.27
         75 |        250        0.86       90.13
         76 |        255        0.88       91.02
         77 |        233        0.81       91.82
         78 |        247        0.85       92.67
         79 |        255        0.88       93.56
         80 |        197        0.68       94.24
         81 |        172        0.59       94.83
         82 |        201        0.69       95.53
         83 |        195        0.67       96.20
         84 |        210        0.73       96.92
         85 |        100        0.35       97.27
         86 |        119        0.41       97.68
         87 |        123        0.43       98.11
         88 |        129        0.45       98.55
         89 |        104        0.36       98.91
         90 |         45        0.16       99.07
         91 |         41        0.14       99.21
         92 |         45        0.16       99.36
         93 |         48        0.17       99.53
         94 |         50        0.17       99.70
         95 |          9        0.03       99.73
         96 |         19        0.07       99.80
         97 |         17        0.06       99.86
         98 |         11        0.04       99.90
         99 |         16        0.06       99.95
        100 |          3        0.01       99.96
        101 |          2        0.01       99.97
        102 |          1        0.00       99.97
        103 |          1        0.00       99.98
        104 |          1        0.00       99.98
        105 |          1        0.00       99.98
        106 |          2        0.01       99.99
        109 |          3        0.01      100.00
------------+-----------------------------------
      Total |     28,939      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,628       50.55       50.55
       Male |     14,311       49.45      100.00
------------+-----------------------------------
      Total |     28,939      100.00

. 
. export delimited using "./output/2017_matching.csv", replace
(note: file ./output/2017_matching.csv not found)
file ./output/2017_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_matching.log
  log type:  text
 closed on:  24 Jan 2023, 18:20:13
-------------------------------------------------------------------------------
