-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/2019_ckd.log
  log type:  text
 opened on:  19 Jan 2023, 16:27:17

. clear

. 
. import delimited ./output/input_2019.csv, delimiter(comma) varnames(1) case(preserve) 
file ./output/input_2019.csv not found
r(601);

end of do-file

r(601);

. cd ..
C:\Users\lsh1703468\Documents

. cd repos/ckd-healthcare-use
unable to change to repos/ckd-healthcare-use
r(170);

. cd repos\ckd-healthcare-use
unable to change to repos\ckd-healthcare-use
r(170);

. cd repo\ckd-healthcare-use
C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD3190_000000.tmp"

. sysdir set PLUS ./analysis/adofiles

. sysdir set PERSONAL ./analysis/adofiles

. pwd
C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use

. 
. cap log close
