-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_matching.log
  log type:  text
 opened on:   1 Nov 2022, 14:16:33

. clear

. 
. import delimited ./output/input_2020_matching.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(21 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,540 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,955 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,861 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,800 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,743 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace creatinine_feb2020 = . if !inrange(creatinine_feb2020, 20, 3000)
(14,131 real changes made, 14,131 to missing)

. gen mgdl_creatinine_feb2020 = creatinine_feb2020/88.4
(14,131 missing values generated)

. gen min_creatinine_feb2020=.
(32,101 missing values generated)

. replace min_creatinine_feb2020 = mgdl_creatinine_feb2020/0.7 if male==0
(9,059 real changes made)

. replace min_creatinine_feb2020 = mgdl_creatinine_feb2020/0.9 if male==1
(8,911 real changes made)

. replace min_creatinine_feb2020 = min_creatinine_feb2020^-0.329  if male==0
(9,059 real changes made)

. replace min_creatinine_feb2020 = min_creatinine_feb2020^-0.411  if male==1
(8,911 real changes made)

. replace min_creatinine_feb2020 = 1 if min_creatinine_feb2020<1
(11,383 real changes made)

. gen max_creatinine_feb2020=.
(32,101 missing values generated)

. replace max_creatinine_feb2020 = mgdl_creatinine_feb2020/0.7 if male==0
(9,059 real changes made)

. replace max_creatinine_feb2020 = mgdl_creatinine_feb2020/0.9 if male==1
(8,911 real changes made)

. replace max_creatinine_feb2020 = max_creatinine_feb2020^-1.209
(17,970 real changes made)

. replace max_creatinine_feb2020 = 1 if max_creatinine_feb2020>1
(20,718 real changes made)

. gen egfr_creatinine_feb2020 = min_creatinine_feb2020*max_creatinine_feb2020*1
> 41
(14,131 missing values generated)

. replace egfr_creatinine_feb2020 = egfr_creatinine_feb2020*(0.993^age)
(17,970 real changes made)

. replace egfr_creatinine_feb2020 = egfr_creatinine_feb2020*1.018 if male==0
(9,059 real changes made)

. drop if egfr_creatinine_feb2020 <15
(0 observations deleted)

. drop creatinine_feb2020

. drop mgdl_creatinine_feb2020

. drop min_creatinine_feb2020

. drop max_creatinine_feb2020

. drop egfr_creatinine_feb2020

. 
. * Deceased
. drop if deceased==1
(3,218 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        409        1.42        1.42
         19 |        406        1.41        2.82
         20 |        481        1.67        4.49
         21 |        421        1.46        5.94
         22 |        480        1.66        7.61
         23 |        434        1.50        9.11
         24 |        453        1.57       10.68
         25 |        507        1.76       12.43
         26 |        488        1.69       14.12
         27 |        485        1.68       15.80
         28 |        513        1.78       17.58
         29 |        461        1.60       19.17
         30 |        495        1.71       20.89
         31 |        464        1.61       22.49
         32 |        480        1.66       24.16
         33 |        535        1.85       26.01
         34 |        493        1.71       27.72
         35 |        500        1.73       29.45
         36 |        527        1.82       31.27
         37 |        504        1.74       33.02
         38 |        475        1.64       34.66
         39 |        446        1.54       36.20
         40 |        410        1.42       37.62
         41 |        384        1.33       38.95
         42 |        438        1.52       40.47
         43 |        443        1.53       42.00
         44 |        463        1.60       43.61
         45 |        489        1.69       45.30
         46 |        485        1.68       46.98
         47 |        483        1.67       48.65
         48 |        488        1.69       50.34
         49 |        515        1.78       52.12
         50 |        519        1.80       53.92
         51 |        519        1.80       55.72
         52 |        544        1.88       57.60
         53 |        544        1.88       59.48
         54 |        538        1.86       61.35
         55 |        472        1.63       62.98
         56 |        486        1.68       64.66
         57 |        481        1.67       66.33
         58 |        475        1.64       67.97
         59 |        460        1.59       69.57
         60 |        441        1.53       71.09
         61 |        397        1.37       72.47
         62 |        373        1.29       73.76
         63 |        400        1.38       75.14
         64 |        383        1.33       76.47
         65 |        355        1.23       77.70
         66 |        408        1.41       79.11
         67 |        389        1.35       80.46
         68 |        375        1.30       81.76
         69 |        355        1.23       82.99
         70 |        360        1.25       84.23
         71 |        362        1.25       85.49
         72 |        338        1.17       86.66
         73 |        364        1.26       87.92
         74 |        379        1.31       89.23
         75 |        242        0.84       90.07
         76 |        250        0.87       90.93
         77 |        275        0.95       91.88
         78 |        230        0.80       92.68
         79 |        241        0.83       93.52
         80 |        177        0.61       94.13
         81 |        172        0.60       94.72
         82 |        186        0.64       95.37
         83 |        192        0.66       96.03
         84 |        197        0.68       96.71
         85 |        117        0.41       97.12
         86 |        120        0.42       97.53
         87 |        133        0.46       98.00
         88 |        143        0.50       98.49
         89 |        110        0.38       98.87
         90 |         42        0.15       99.02
         91 |         46        0.16       99.18
         92 |         51        0.18       99.35
         93 |         48        0.17       99.52
         94 |         56        0.19       99.71
         95 |         19        0.07       99.78
         96 |          8        0.03       99.81
         97 |          7        0.02       99.83
         98 |         15        0.05       99.88
         99 |         16        0.06       99.94
        100 |          3        0.01       99.95
        101 |          5        0.02       99.97
        104 |          2        0.01       99.97
        105 |          1        0.00       99.98
        106 |          1        0.00       99.98
        107 |          3        0.01       99.99
        108 |          2        0.01      100.00
        109 |          1        0.00      100.00
------------+-----------------------------------
      Total |     28,883      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,448        5.01        5.01
          1 |      5,540       19.18       24.19
          2 |      5,362       18.56       42.76
          3 |      5,391       18.66       61.42
          4 |      5,527       19.14       80.56
          5 |      5,615       19.44      100.00
------------+-----------------------------------
      Total |     28,883      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,640       50.69       50.69
       Male |     14,243       49.31      100.00
------------+-----------------------------------
      Total |     28,883      100.00

. 
. gen covid_date = date(covid_diagnosis_date, "YMD")
(12,894 missing values generated)

. format covid_date %td

. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)
(12,894 missing values generated)

. tab covid_month

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |        578        3.61        3.61
    apr2021 |        524        3.28        6.89
    apr2022 |        410        2.56        9.46
    aug2020 |        594        3.72       13.17
    aug2021 |        476        2.98       16.15
    aug2022 |        400        2.50       18.65
    dec2020 |        533        3.33       21.98
    dec2021 |        433        2.71       24.69
    feb2020 |        537        3.36       28.05
    feb2021 |        485        3.03       31.08
    feb2022 |        382        2.39       33.47
    jan2021 |        523        3.27       36.74
    jan2022 |        445        2.78       39.53
    jul2020 |        565        3.53       43.06
    jul2021 |        522        3.26       46.33
    jul2022 |        420        2.63       48.95
    jun2020 |        529        3.31       52.26
    jun2021 |        533        3.33       55.59
    jun2022 |        413        2.58       58.18
    mar2020 |        614        3.84       62.02
    mar2021 |        565        3.53       65.55
    mar2022 |        491        3.07       68.62
    may2020 |        620        3.88       72.50
    may2021 |        506        3.16       75.66
    may2022 |        465        2.91       78.57
    nov2020 |        545        3.41       81.98
    nov2021 |        470        2.94       84.92
    oct2020 |        565        3.53       88.45
    oct2021 |        499        3.12       91.58
    sep2020 |        542        3.39       94.97
    sep2021 |        433        2.71       97.67
    sep2022 |        372        2.33      100.00
------------+-----------------------------------
      Total |     15,989      100.00

. 
. 
. gen death_date1 = date(death_date, "YMD")
(25,999 missing values generated)

. format death_date1 %td

. gen death_date_string=string(death_date1, "%td")

. gen death_month=substr( death_date_string ,3,7)
(25,999 missing values generated)

. tab death_month

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         81        2.81        2.81
    apr2021 |         78        2.70        5.51
    apr2022 |         84        2.91        8.43
    aug2020 |         93        3.22       11.65
    aug2021 |        104        3.61       15.26
    aug2022 |         98        3.40       18.65
    dec2020 |         83        2.88       21.53
    dec2021 |        104        3.61       25.14
    feb2020 |         85        2.95       28.09
    feb2021 |         76        2.64       30.72
    feb2022 |         76        2.64       33.36
    jan2021 |         86        2.98       36.34
    jan2022 |        103        3.57       39.91
    jul2020 |         92        3.19       43.10
    jul2021 |         88        3.05       46.15
    jul2022 |        111        3.85       50.00
    jun2020 |         88        3.05       53.05
    jun2021 |         76        2.64       55.69
    jun2022 |         80        2.77       58.46
    mar2020 |         93        3.22       61.69
    mar2021 |        107        3.71       65.40
    mar2022 |        109        3.78       69.17
    may2020 |         96        3.33       72.50
    may2021 |         84        2.91       75.42
    may2022 |        102        3.54       78.95
    nov2020 |         78        2.70       81.66
    nov2021 |         82        2.84       84.50
    oct2020 |         91        3.16       87.66
    oct2021 |         85        2.95       90.60
    sep2020 |         85        2.95       93.55
    sep2021 |         93        3.22       96.78
    sep2022 |         93        3.22      100.00
------------+-----------------------------------
      Total |      2,884      100.00

. 
. 
. export delimited using "./output/2020_matching.csv", replace
(note: file ./output/2020_matching.csv not found)
file ./output/2020_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_matching.log
  log type:  text
 closed on:   1 Nov 2022, 14:16:35
-------------------------------------------------------------------------------
