-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_matching.log
  log type:  text
 opened on:   2 Nov 2022, 16:15:39

. clear

. 
. import delimited ./output/input_2020_matching.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(21 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,563 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(2,003 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,854 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,730 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,687 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,076 real changes made, 14,076 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,076 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,163 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,284 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,803 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,284 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,803 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,395 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,163 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,284 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,803 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(18,087 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,768 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,076 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(18,087 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,284 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. drop egfr_baseline_creatinine_feb2020

. 
. * Deceased
. drop if deceased==1
(3,209 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        445        1.54        1.54
         19 |        412        1.42        2.96
         20 |        450        1.55        4.51
         21 |        505        1.74        6.26
         22 |        447        1.54        7.80
         23 |        468        1.62        9.42
         24 |        437        1.51       10.93
         25 |        494        1.71       12.63
         26 |        495        1.71       14.34
         27 |        504        1.74       16.08
         28 |        536        1.85       17.94
         29 |        525        1.81       19.75
         30 |        486        1.68       21.43
         31 |        507        1.75       23.18
         32 |        470        1.62       24.80
         33 |        442        1.53       26.33
         34 |        484        1.67       28.00
         35 |        452        1.56       29.56
         36 |        488        1.69       31.25
         37 |        464        1.60       32.85
         38 |        484        1.67       34.52
         39 |        504        1.74       36.26
         40 |        440        1.52       37.78
         41 |        407        1.41       39.19
         42 |        476        1.64       40.83
         43 |        422        1.46       42.29
         44 |        414        1.43       43.72
         45 |        523        1.81       45.52
         46 |        492        1.70       47.22
         47 |        485        1.68       48.90
         48 |        488        1.69       50.58
         49 |        515        1.78       52.36
         50 |        541        1.87       54.23
         51 |        548        1.89       56.12
         52 |        471        1.63       57.75
         53 |        507        1.75       59.50
         54 |        507        1.75       61.25
         55 |        474        1.64       62.89
         56 |        470        1.62       64.51
         57 |        507        1.75       66.26
         58 |        488        1.69       67.95
         59 |        467        1.61       69.56
         60 |        422        1.46       71.02
         61 |        439        1.52       72.54
         62 |        426        1.47       74.01
         63 |        406        1.40       75.41
         64 |        408        1.41       76.82
         65 |        357        1.23       78.05
         66 |        376        1.30       79.35
         67 |        386        1.33       80.68
         68 |        324        1.12       81.80
         69 |        381        1.32       83.12
         70 |        382        1.32       84.44
         71 |        364        1.26       85.69
         72 |        345        1.19       86.89
         73 |        358        1.24       88.12
         74 |        358        1.24       89.36
         75 |        267        0.92       90.28
         76 |        228        0.79       91.07
         77 |        259        0.89       91.96
         78 |        240        0.83       92.79
         79 |        245        0.85       93.64
         80 |        203        0.70       94.34
         81 |        177        0.61       94.95
         82 |        182        0.63       95.58
         83 |        191        0.66       96.24
         84 |        181        0.63       96.86
         85 |        122        0.42       97.29
         86 |        108        0.37       97.66
         87 |        121        0.42       98.08
         88 |        111        0.38       98.46
         89 |        118        0.41       98.87
         90 |         38        0.13       99.00
         91 |         45        0.16       99.15
         92 |         72        0.25       99.40
         93 |         51        0.18       99.58
         94 |         48        0.17       99.74
         95 |         20        0.07       99.81
         96 |         12        0.04       99.85
         97 |          8        0.03       99.88
         98 |         14        0.05       99.93
         99 |         11        0.04       99.97
        101 |          5        0.02       99.99
        105 |          1        0.00       99.99
        107 |          1        0.00       99.99
        108 |          2        0.01      100.00
------------+-----------------------------------
      Total |     28,954      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,430        4.94        4.94
          1 |      5,581       19.28       24.21
          2 |      5,417       18.71       42.92
          3 |      5,451       18.83       61.75
          4 |      5,457       18.85       80.60
          5 |      5,618       19.40      100.00
------------+-----------------------------------
      Total |     28,954      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,781       51.05       51.05
       Male |     14,173       48.95      100.00
------------+-----------------------------------
      Total |     28,954      100.00

. 
. gen covid_date = date(covid_diagnosis_date, "YMD")
(12,924 missing values generated)

. format covid_date %td

. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)
(12,924 missing values generated)

. tab covid_month

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |        561        3.50        3.50
    apr2021 |        474        2.96        6.46
    apr2022 |        408        2.55        9.00
    aug2020 |        592        3.69       12.69
    aug2021 |        495        3.09       15.78
    aug2022 |        462        2.88       18.67
    dec2020 |        599        3.74       22.40
    dec2021 |        436        2.72       25.12
    feb2020 |        566        3.53       28.65
    feb2021 |        476        2.97       31.62
    feb2022 |        427        2.66       34.29
    jan2021 |        553        3.45       37.74
    jan2022 |        479        2.99       40.72
    jul2020 |        581        3.62       44.35
    jul2021 |        478        2.98       47.33
    jul2022 |        442        2.76       50.09
    jun2020 |        578        3.61       53.69
    jun2021 |        464        2.89       56.59
    jun2022 |        412        2.57       59.16
    mar2020 |        633        3.95       63.11
    mar2021 |        480        2.99       66.10
    mar2022 |        435        2.71       68.81
    may2020 |        579        3.61       72.43
    may2021 |        528        3.29       75.72
    may2022 |        447        2.79       78.51
    nov2020 |        542        3.38       81.89
    nov2021 |        493        3.08       84.97
    oct2020 |        556        3.47       88.43
    oct2021 |        472        2.94       91.38
    sep2020 |        599        3.74       95.12
    sep2021 |        407        2.54       97.65
    sep2022 |        376        2.35      100.00
------------+-----------------------------------
      Total |     16,030      100.00

. 
. 
. gen death_date1 = date(death_date, "YMD")
(26,080 missing values generated)

. format death_date1 %td

. gen death_date_string=string(death_date1, "%td")

. gen death_month=substr( death_date_string ,3,7)
(26,080 missing values generated)

. tab death_month

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         91        3.17        3.17
    apr2021 |         85        2.96        6.12
    apr2022 |         71        2.47        8.59
    aug2020 |         93        3.24       11.83
    aug2021 |         87        3.03       14.86
    aug2022 |         97        3.38       18.23
    dec2020 |         81        2.82       21.05
    dec2021 |         92        3.20       24.25
    feb2020 |         81        2.82       27.07
    feb2021 |         90        3.13       30.20
    feb2022 |         81        2.82       33.02
    jan2021 |         95        3.31       36.33
    jan2022 |         88        3.06       39.39
    jul2020 |         87        3.03       42.41
    jul2021 |         94        3.27       45.69
    jul2022 |         92        3.20       48.89
    jun2020 |        113        3.93       52.82
    jun2021 |         69        2.40       55.22
    jun2022 |         83        2.89       58.11
    mar2020 |         95        3.31       61.41
    mar2021 |         96        3.34       64.75
    mar2022 |         98        3.41       68.16
    may2020 |         82        2.85       71.02
    may2021 |        108        3.76       74.77
    may2022 |         78        2.71       77.49
    nov2020 |         88        3.06       80.55
    nov2021 |         97        3.38       83.92
    oct2020 |        105        3.65       87.58
    oct2021 |        100        3.48       91.06
    sep2020 |         79        2.75       93.81
    sep2021 |         89        3.10       96.90
    sep2022 |         89        3.10      100.00
------------+-----------------------------------
      Total |      2,874      100.00

. 
. 
. export delimited using "./output/2020_matching.csv", replace
(note: file ./output/2020_matching.csv not found)
file ./output/2020_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_matching.log
  log type:  text
 closed on:   2 Nov 2022, 16:15:40
-------------------------------------------------------------------------------
