-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_matching.log
  log type:  text
 opened on:  23 Oct 2022, 23:44:44

. clear

. 
. import delimited ./output/input_2020_matching.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(22 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,804 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,936 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,829 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,728 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,685 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,083 real changes made, 14,083 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,083 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,018 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,173 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,762 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,173 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,762 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,320 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,018 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,173 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,762 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(17,935 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,698 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,083 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(17,935 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,173 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. drop egfr_baseline_creatinine_feb2020

. 
. * Deceased
. drop if deceased==1
(3,241 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        380        1.32        1.32
         19 |        373        1.30        2.62
         20 |        431        1.50        4.11
         21 |        478        1.66        5.78
         22 |        453        1.57        7.35
         23 |        441        1.53        8.88
         24 |        525        1.82       10.71
         25 |        496        1.72       12.43
         26 |        492        1.71       14.14
         27 |        524        1.82       15.96
         28 |        516        1.79       17.75
         29 |        491        1.71       19.46
         30 |        493        1.71       21.17
         31 |        493        1.71       22.89
         32 |        487        1.69       24.58
         33 |        504        1.75       26.33
         34 |        482        1.67       28.01
         35 |        485        1.69       29.69
         36 |        471        1.64       31.33
         37 |        530        1.84       33.17
         38 |        501        1.74       34.91
         39 |        471        1.64       36.55
         40 |        439        1.53       38.07
         41 |        446        1.55       39.62
         42 |        407        1.41       41.04
         43 |        482        1.67       42.71
         44 |        443        1.54       44.25
         45 |        503        1.75       46.00
         46 |        500        1.74       47.74
         47 |        499        1.73       49.47
         48 |        517        1.80       51.27
         49 |        486        1.69       52.96
         50 |        490        1.70       54.66
         51 |        549        1.91       56.57
         52 |        478        1.66       58.23
         53 |        511        1.78       60.00
         54 |        533        1.85       61.85
         55 |        496        1.72       63.58
         56 |        432        1.50       65.08
         57 |        484        1.68       66.76
         58 |        457        1.59       68.35
         59 |        486        1.69       70.04
         60 |        409        1.42       71.46
         61 |        373        1.30       72.76
         62 |        428        1.49       74.24
         63 |        401        1.39       75.64
         64 |        415        1.44       77.08
         65 |        360        1.25       78.33
         66 |        362        1.26       79.59
         67 |        364        1.26       80.85
         68 |        374        1.30       82.15
         69 |        374        1.30       83.45
         70 |        339        1.18       84.63
         71 |        343        1.19       85.82
         72 |        347        1.21       87.03
         73 |        347        1.21       88.23
         74 |        333        1.16       89.39
         75 |        278        0.97       90.36
         76 |        248        0.86       91.22
         77 |        253        0.88       92.10
         78 |        233        0.81       92.91
         79 |        204        0.71       93.62
         80 |        206        0.72       94.33
         81 |        190        0.66       94.99
         82 |        178        0.62       95.61
         83 |        192        0.67       96.28
         84 |        192        0.67       96.95
         85 |        112        0.39       97.33
         86 |        123        0.43       97.76
         87 |        111        0.39       98.15
         88 |        103        0.36       98.51
         89 |         98        0.34       98.85
         90 |         48        0.17       99.01
         91 |         43        0.15       99.16
         92 |         48        0.17       99.33
         93 |         53        0.18       99.51
         94 |         52        0.18       99.69
         95 |         20        0.07       99.76
         96 |         14        0.05       99.81
         97 |         17        0.06       99.87
         98 |         12        0.04       99.91
         99 |         11        0.04       99.95
        100 |          1        0.00       99.95
        102 |          3        0.01       99.97
        103 |          4        0.01       99.98
        104 |          2        0.01       99.99
        105 |          1        0.00       99.99
        106 |          1        0.00       99.99
        108 |          1        0.00      100.00
        109 |          1        0.00      100.00
------------+-----------------------------------
      Total |     28,777      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,444        5.02        5.02
          1 |      5,474       19.02       24.04
          2 |      5,471       19.01       43.05
          3 |      5,521       19.19       62.24
          4 |      5,432       18.88       81.11
          5 |      5,435       18.89      100.00
------------+-----------------------------------
      Total |     28,777      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,779       51.36       51.36
       Male |     13,998       48.64      100.00
------------+-----------------------------------
      Total |     28,777      100.00

. 
. gen covid_date = date(covid_diagnosis_date, "YMD")
(12,782 missing values generated)

. format covid_date %td

. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)
(12,782 missing values generated)

. tab covid_month

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |        573        3.58        3.58
    apr2021 |        520        3.25        6.83
    apr2022 |        409        2.56        9.39
    aug2020 |        601        3.76       13.15
    aug2021 |        494        3.09       16.24
    aug2022 |        414        2.59       18.82
    dec2020 |        591        3.69       22.52
    dec2021 |        462        2.89       25.41
    feb2020 |        536        3.35       28.76
    feb2021 |        461        2.88       31.64
    feb2022 |        401        2.51       34.15
    jan2021 |        522        3.26       37.41
    jan2022 |        407        2.54       39.96
    jul2020 |        567        3.54       43.50
    jul2021 |        503        3.14       46.65
    jul2022 |        414        2.59       49.23
    jun2020 |        550        3.44       52.67
    jun2021 |        518        3.24       55.91
    jun2022 |        415        2.59       58.51
    mar2020 |        607        3.79       62.30
    mar2021 |        514        3.21       65.51
    mar2022 |        467        2.92       68.43
    may2020 |        591        3.69       72.13
    may2021 |        530        3.31       75.44
    may2022 |        448        2.80       78.24
    nov2020 |        570        3.56       81.81
    nov2021 |        509        3.18       84.99
    oct2020 |        554        3.46       88.45
    oct2021 |        468        2.93       91.38
    sep2020 |        502        3.14       94.52
    sep2021 |        486        3.04       97.56
    sep2022 |        391        2.44      100.00
------------+-----------------------------------
      Total |     15,995      100.00

. 
. 
. gen death_date1 = date(death_date, "YMD")
(27,120 missing values generated)

. format death_date1 %td

. gen death_date_string=string(death_date1, "%td")

. gen death_month=substr( death_date_string ,3,7)
(27,120 missing values generated)

. tab death_month

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         53        3.20        3.20
    apr2021 |         45        2.72        5.91
    apr2022 |         56        3.38        9.29
    aug2020 |         51        3.08       12.37
    aug2021 |         47        2.84       15.21
    aug2022 |         51        3.08       18.29
    dec2020 |         57        3.44       21.73
    dec2021 |         61        3.68       25.41
    feb2020 |         53        3.20       28.61
    feb2021 |         47        2.84       31.44
    feb2022 |         40        2.41       33.86
    jan2021 |         56        3.38       37.24
    jan2022 |         52        3.14       40.37
    jul2020 |         51        3.08       43.45
    jul2021 |         54        3.26       46.71
    jul2022 |         37        2.23       48.94
    jun2020 |         37        2.23       51.18
    jun2021 |         57        3.44       54.62
    jun2022 |         51        3.08       57.69
    mar2020 |         67        4.04       61.74
    mar2021 |         50        3.02       64.76
    mar2022 |         48        2.90       67.65
    may2020 |         56        3.38       71.03
    may2021 |         45        2.72       73.75
    may2022 |         58        3.50       77.25
    nov2020 |         52        3.14       80.39
    nov2021 |         56        3.38       83.77
    oct2020 |         60        3.62       87.39
    oct2021 |         58        3.50       90.89
    sep2020 |         46        2.78       93.66
    sep2021 |         51        3.08       96.74
    sep2022 |         54        3.26      100.00
------------+-----------------------------------
      Total |      1,657      100.00

. 
. 
. export delimited using "./output/2020_matching.csv", replace
(note: file ./output/2020_matching.csv not found)
file ./output/2020_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_matching.log
  log type:  text
 closed on:  23 Oct 2022, 23:44:47
-------------------------------------------------------------------------------
