-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_matching.log
  log type:  text
 opened on:  19 Jul 2023, 12:47:43

. clear

. 
. import delimited ./output/input_2020_matching.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(20 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,588 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before February 2020
. drop if has_follow_up==0
(1,995 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,875 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,800 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,692 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,110 real changes made, 14,110 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,110 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,050 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,106 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,834 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,106 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,834 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,387 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,050 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,106 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,834 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(17,940 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,663 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,110 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(17,940 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,106 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. drop egfr_baseline_creatinine_feb2020

. 
. * Deceased
. drop if deceased==1
(3,217 observations deleted)

. drop deceased

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        376        1.30        1.30
         19 |        374        1.30        2.60
         20 |        485        1.68        4.28
         21 |        505        1.75        6.03
         22 |        470        1.63        7.66
         23 |        466        1.62        9.28
         24 |        452        1.57       10.85
         25 |        489        1.70       12.54
         26 |        497        1.72       14.27
         27 |        492        1.71       15.97
         28 |        466        1.62       17.59
         29 |        513        1.78       19.37
         30 |        507        1.76       21.13
         31 |        505        1.75       22.88
         32 |        500        1.73       24.61
         33 |        480        1.66       26.28
         34 |        479        1.66       27.94
         35 |        504        1.75       29.69
         36 |        503        1.74       31.43
         37 |        472        1.64       33.07
         38 |        485        1.68       34.75
         39 |        501        1.74       36.49
         40 |        432        1.50       37.99
         41 |        432        1.50       39.49
         42 |        441        1.53       41.02
         43 |        463        1.61       42.62
         44 |        432        1.50       44.12
         45 |        489        1.70       45.82
         46 |        532        1.85       47.66
         47 |        505        1.75       49.41
         48 |        495        1.72       51.13
         49 |        480        1.66       52.79
         50 |        507        1.76       54.55
         51 |        494        1.71       56.27
         52 |        555        1.92       58.19
         53 |        513        1.78       59.97
         54 |        504        1.75       61.72
         55 |        432        1.50       63.22
         56 |        477        1.65       64.87
         57 |        467        1.62       66.49
         58 |        494        1.71       68.20
         59 |        481        1.67       69.87
         60 |        403        1.40       71.27
         61 |        412        1.43       72.70
         62 |        447        1.55       74.25
         63 |        407        1.41       75.66
         64 |        382        1.32       76.98
         65 |        350        1.21       78.20
         66 |        378        1.31       79.51
         67 |        339        1.18       80.69
         68 |        331        1.15       81.83
         69 |        365        1.27       83.10
         70 |        360        1.25       84.35
         71 |        356        1.23       85.58
         72 |        382        1.32       86.91
         73 |        341        1.18       88.09
         74 |        393        1.36       89.45
         75 |        257        0.89       90.34
         76 |        228        0.79       91.14
         77 |        241        0.84       91.97
         78 |        259        0.90       92.87
         79 |        261        0.91       93.77
         80 |        174        0.60       94.38
         81 |        170        0.59       94.97
         82 |        212        0.74       95.70
         83 |        175        0.61       96.31
         84 |        193        0.67       96.98
         85 |        106        0.37       97.35
         86 |        130        0.45       97.80
         87 |        121        0.42       98.22
         88 |        114        0.40       98.61
         89 |        102        0.35       98.97
         90 |         45        0.16       99.12
         91 |         44        0.15       99.28
         92 |         54        0.19       99.46
         93 |         41        0.14       99.60
         94 |         44        0.15       99.76
         95 |         12        0.04       99.80
         96 |         13        0.05       99.84
         97 |          9        0.03       99.88
         98 |         18        0.06       99.94
         99 |          9        0.03       99.97
        100 |          1        0.00       99.97
        101 |          1        0.00       99.98
        103 |          1        0.00       99.98
        105 |          1        0.00       99.98
        106 |          1        0.00       99.99
        107 |          2        0.01       99.99
        108 |          1        0.00      100.00
        109 |          1        0.00      100.00
------------+-----------------------------------
      Total |     28,833      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,597       50.63       50.63
       Male |     14,236       49.37      100.00
------------+-----------------------------------
      Total |     28,833      100.00

. 
. export delimited using "./output/2020_matching.csv", replace
(note: file ./output/2020_matching.csv not found)
file ./output/2020_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_matching.log
  log type:  text
 closed on:  19 Jul 2023, 12:47:45
-------------------------------------------------------------------------------
