-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_matching.log
  log type:  text
 opened on:  26 Oct 2022, 12:09:41

. clear

. 
. import delimited ./output/input_2020_matching.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(22 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,570 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,969 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,902 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,783 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,675 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,117 real changes made, 14,117 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,117 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,101 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,136 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,848 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,136 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,848 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,402 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,101 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,136 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,848 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(17,984 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,699 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,117 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(17,984 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,136 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. drop egfr_baseline_creatinine_feb2020

. 
. * Deceased
. drop if deceased==1
(3,179 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        402        1.39        1.39
         19 |        402        1.39        2.78
         20 |        435        1.50        4.28
         21 |        447        1.55        5.83
         22 |        477        1.65        7.48
         23 |        468        1.62        9.10
         24 |        477        1.65       10.75
         25 |        502        1.74       12.48
         26 |        530        1.83       14.31
         27 |        508        1.76       16.07
         28 |        523        1.81       17.88
         29 |        485        1.68       19.56
         30 |        512        1.77       21.33
         31 |        467        1.61       22.94
         32 |        506        1.75       24.69
         33 |        466        1.61       26.30
         34 |        496        1.71       28.02
         35 |        493        1.70       29.72
         36 |        457        1.58       31.30
         37 |        500        1.73       33.03
         38 |        465        1.61       34.64
         39 |        506        1.75       36.39
         40 |        438        1.51       37.90
         41 |        416        1.44       39.34
         42 |        407        1.41       40.75
         43 |        471        1.63       42.38
         44 |        484        1.67       44.05
         45 |        512        1.77       45.82
         46 |        491        1.70       47.52
         47 |        502        1.74       49.25
         48 |        525        1.82       51.07
         49 |        484        1.67       52.74
         50 |        516        1.78       54.53
         51 |        516        1.78       56.31
         52 |        541        1.87       58.18
         53 |        480        1.66       59.84
         54 |        543        1.88       61.72
         55 |        480        1.66       63.38
         56 |        457        1.58       64.96
         57 |        482        1.67       66.62
         58 |        457        1.58       68.20
         59 |        444        1.54       69.74
         60 |        421        1.46       71.19
         61 |        450        1.56       72.75
         62 |        422        1.46       74.21
         63 |        374        1.29       75.50
         64 |        394        1.36       76.87
         65 |        359        1.24       78.11
         66 |        397        1.37       79.48
         67 |        343        1.19       80.67
         68 |        359        1.24       81.91
         69 |        332        1.15       83.05
         70 |        370        1.28       84.33
         71 |        372        1.29       85.62
         72 |        347        1.20       86.82
         73 |        377        1.30       88.12
         74 |        403        1.39       89.52
         75 |        221        0.76       90.28
         76 |        240        0.83       91.11
         77 |        256        0.89       92.00
         78 |        233        0.81       92.80
         79 |        240        0.83       93.63
         80 |        169        0.58       94.22
         81 |        177        0.61       94.83
         82 |        211        0.73       95.56
         83 |        189        0.65       96.21
         84 |        186        0.64       96.85
         85 |        113        0.39       97.24
         86 |         93        0.32       97.57
         87 |        112        0.39       97.95
         88 |        124        0.43       98.38
         89 |        129        0.45       98.83
         90 |         58        0.20       99.03
         91 |         41        0.14       99.17
         92 |         52        0.18       99.35
         93 |         53        0.18       99.53
         94 |         56        0.19       99.73
         95 |         17        0.06       99.79
         96 |         17        0.06       99.84
         97 |         12        0.04       99.89
         98 |         12        0.04       99.93
         99 |         11        0.04       99.97
        101 |          2        0.01       99.97
        102 |          1        0.00       99.98
        103 |          1        0.00       99.98
        104 |          1        0.00       99.98
        105 |          1        0.00       99.99
        107 |          1        0.00       99.99
        108 |          1        0.00       99.99
        109 |          2        0.01      100.00
------------+-----------------------------------
      Total |     28,922      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,483        5.13        5.13
          1 |      5,364       18.55       23.67
          2 |      5,553       19.20       42.87
          3 |      5,588       19.32       62.19
          4 |      5,451       18.85       81.04
          5 |      5,483       18.96      100.00
------------+-----------------------------------
      Total |     28,922      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,674       50.74       50.74
       Male |     14,248       49.26      100.00
------------+-----------------------------------
      Total |     28,922      100.00

. 
. gen covid_date = date(covid_diagnosis_date, "YMD")
(12,882 missing values generated)

. format covid_date %td

. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)
(12,882 missing values generated)

. tab covid_month

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |        548        3.42        3.42
    apr2021 |        487        3.04        6.45
    apr2022 |        433        2.70        9.15
    aug2020 |        573        3.57       12.72
    aug2021 |        523        3.26       15.99
    aug2022 |        408        2.54       18.53
    dec2020 |        538        3.35       21.88
    dec2021 |        457        2.85       24.73
    feb2020 |        583        3.63       28.37
    feb2021 |        469        2.92       31.29
    feb2022 |        435        2.71       34.00
    jan2021 |        498        3.10       37.11
    jan2022 |        468        2.92       40.02
    jul2020 |        591        3.68       43.71
    jul2021 |        451        2.81       46.52
    jul2022 |        455        2.84       49.36
    jun2020 |        570        3.55       52.91
    jun2021 |        487        3.04       55.95
    jun2022 |        426        2.66       58.60
    mar2020 |        617        3.85       62.45
    mar2021 |        545        3.40       65.85
    mar2022 |        433        2.70       68.55
    may2020 |        589        3.67       72.22
    may2021 |        524        3.27       75.49
    may2022 |        435        2.71       78.20
    nov2020 |        557        3.47       81.67
    nov2021 |        454        2.83       84.50
    oct2020 |        579        3.61       88.11
    oct2021 |        502        3.13       91.24
    sep2020 |        571        3.56       94.80
    sep2021 |        458        2.86       97.66
    sep2022 |        376        2.34      100.00
------------+-----------------------------------
      Total |     16,040      100.00

. 
. 
. gen death_date1 = date(death_date, "YMD")
(27,292 missing values generated)

. format death_date1 %td

. gen death_date_string=string(death_date1, "%td")

. gen death_month=substr( death_date_string ,3,7)
(27,292 missing values generated)

. tab death_month

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         47        2.88        2.88
    apr2021 |         48        2.94        5.83
    apr2022 |         49        3.01        8.83
    aug2020 |         55        3.37       12.21
    aug2021 |         51        3.13       15.34
    aug2022 |         50        3.07       18.40
    dec2020 |         60        3.68       22.09
    dec2021 |         53        3.25       25.34
    feb2020 |         60        3.68       29.02
    feb2021 |         53        3.25       32.27
    feb2022 |         46        2.82       35.09
    jan2021 |         44        2.70       37.79
    jan2022 |         40        2.45       40.25
    jul2020 |         61        3.74       43.99
    jul2021 |         51        3.13       47.12
    jul2022 |         44        2.70       49.82
    jun2020 |         49        3.01       52.82
    jun2021 |         53        3.25       56.07
    jun2022 |         44        2.70       58.77
    mar2020 |         62        3.80       62.58
    mar2021 |         55        3.37       65.95
    mar2022 |         50        3.07       69.02
    may2020 |         54        3.31       72.33
    may2021 |         59        3.62       75.95
    may2022 |         43        2.64       78.59
    nov2020 |         51        3.13       81.72
    nov2021 |         47        2.88       84.60
    oct2020 |         51        3.13       87.73
    oct2021 |         39        2.39       90.12
    sep2020 |         54        3.31       93.44
    sep2021 |         41        2.52       95.95
    sep2022 |         66        4.05      100.00
------------+-----------------------------------
      Total |      1,630      100.00

. 
. 
. export delimited using "./output/2020_matching.csv", replace
(note: file ./output/2020_matching.csv not found)
file ./output/2020_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_matching.log
  log type:  text
 closed on:  26 Oct 2022, 12:09:43
-------------------------------------------------------------------------------
