-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_matching.log
  log type:  text
 opened on:   2 Nov 2022, 15:48:48

. clear

. 
. import delimited ./output/input_2020_matching.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(21 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,519 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,948 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,863 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,802 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,720 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace creatinine_feb2020 = . if !inrange(creatinine_feb2020, 20, 3000)
(14,217 real changes made, 14,217 to missing)

. gen mgdl_creatinine_feb2020 = creatinine_feb2020/88.4
(14,217 missing values generated)

. gen min_creatinine_feb2020=.
(32,148 missing values generated)

. replace min_creatinine_feb2020 = mgdl_creatinine_feb2020/0.7 if male==0
(9,104 real changes made)

. replace min_creatinine_feb2020 = mgdl_creatinine_feb2020/0.9 if male==1
(8,827 real changes made)

. replace min_creatinine_feb2020 = min_creatinine_feb2020^-0.329  if male==0
(9,104 real changes made)

. replace min_creatinine_feb2020 = min_creatinine_feb2020^-0.411  if male==1
(8,827 real changes made)

. replace min_creatinine_feb2020 = 1 if min_creatinine_feb2020<1
(11,334 real changes made)

. gen max_creatinine_feb2020=.
(32,148 missing values generated)

. replace max_creatinine_feb2020 = mgdl_creatinine_feb2020/0.7 if male==0
(9,104 real changes made)

. replace max_creatinine_feb2020 = mgdl_creatinine_feb2020/0.9 if male==1
(8,827 real changes made)

. replace max_creatinine_feb2020 = max_creatinine_feb2020^-1.209
(17,931 real changes made)

. replace max_creatinine_feb2020 = 1 if max_creatinine_feb2020>1
(20,814 real changes made)

. gen egfr_creatinine_feb2020 = min_creatinine_feb2020*max_creatinine_feb2020*1
> 41
(14,217 missing values generated)

. replace egfr_creatinine_feb2020 = egfr_creatinine_feb2020*(0.993^age)
(17,931 real changes made)

. replace egfr_creatinine_feb2020 = egfr_creatinine_feb2020*1.018 if male==0
(9,104 real changes made)

. drop if egfr_creatinine_feb2020 <15
(0 observations deleted)

. drop creatinine_feb2020

. drop mgdl_creatinine_feb2020

. drop min_creatinine_feb2020

. drop max_creatinine_feb2020

. drop egfr_creatinine_feb2020

. 
. * Deceased
. drop if deceased==1
(3,197 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        438        1.51        1.51
         19 |        403        1.39        2.90
         20 |        466        1.61        4.51
         21 |        460        1.59        6.10
         22 |        471        1.63        7.73
         23 |        456        1.58        9.31
         24 |        452        1.56       10.87
         25 |        508        1.75       12.62
         26 |        528        1.82       14.45
         27 |        459        1.59       16.03
         28 |        538        1.86       17.89
         29 |        496        1.71       19.60
         30 |        499        1.72       21.33
         31 |        453        1.56       22.89
         32 |        498        1.72       24.61
         33 |        476        1.64       26.25
         34 |        497        1.72       27.97
         35 |        514        1.78       29.75
         36 |        467        1.61       31.36
         37 |        486        1.68       33.04
         38 |        477        1.65       34.69
         39 |        457        1.58       36.26
         40 |        434        1.50       37.76
         41 |        447        1.54       39.31
         42 |        425        1.47       40.78
         43 |        398        1.37       42.15
         44 |        440        1.52       43.67
         45 |        500        1.73       45.40
         46 |        497        1.72       47.11
         47 |        527        1.82       48.93
         48 |        472        1.63       50.56
         49 |        499        1.72       52.29
         50 |        509        1.76       54.05
         51 |        502        1.73       55.78
         52 |        530        1.83       57.61
         53 |        501        1.73       59.34
         54 |        513        1.77       61.11
         55 |        465        1.61       62.72
         56 |        483        1.67       64.39
         57 |        489        1.69       66.08
         58 |        480        1.66       67.74
         59 |        467        1.61       69.35
         60 |        418        1.44       70.79
         61 |        381        1.32       72.11
         62 |        382        1.32       73.43
         63 |        408        1.41       74.84
         64 |        398        1.37       76.21
         65 |        367        1.27       77.48
         66 |        372        1.28       78.76
         67 |        386        1.33       80.10
         68 |        365        1.26       81.36
         69 |        398        1.37       82.73
         70 |        351        1.21       83.95
         71 |        364        1.26       85.20
         72 |        365        1.26       86.46
         73 |        375        1.30       87.76
         74 |        352        1.22       88.97
         75 |        246        0.85       89.82
         76 |        256        0.88       90.71
         77 |        255        0.88       91.59
         78 |        260        0.90       92.49
         79 |        262        0.90       93.39
         80 |        203        0.70       94.09
         81 |        186        0.64       94.74
         82 |        191        0.66       95.40
         83 |        180        0.62       96.02
         84 |        193        0.67       96.68
         85 |        115        0.40       97.08
         86 |        118        0.41       97.49
         87 |        132        0.46       97.94
         88 |        124        0.43       98.37
         89 |        116        0.40       98.77
         90 |         53        0.18       98.96
         91 |         55        0.19       99.15
         92 |         47        0.16       99.31
         93 |         59        0.20       99.51
         94 |         43        0.15       99.66
         95 |         15        0.05       99.71
         96 |         19        0.07       99.78
         97 |         18        0.06       99.84
         98 |         14        0.05       99.89
         99 |         15        0.05       99.94
        100 |          2        0.01       99.95
        101 |          1        0.00       99.95
        102 |          2        0.01       99.96
        104 |          3        0.01       99.97
        105 |          3        0.01       99.98
        106 |          1        0.00       99.98
        107 |          2        0.01       99.99
        108 |          2        0.01      100.00
        109 |          1        0.00      100.00
------------+-----------------------------------
      Total |     28,951      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,435        4.96        4.96
          1 |      5,458       18.85       23.81
          2 |      5,401       18.66       42.46
          3 |      5,665       19.57       62.03
          4 |      5,574       19.25       81.29
          5 |      5,418       18.71      100.00
------------+-----------------------------------
      Total |     28,951      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,747       50.94       50.94
       Male |     14,204       49.06      100.00
------------+-----------------------------------
      Total |     28,951      100.00

. 
. gen covid_date = date(covid_diagnosis_date, "YMD")
(12,853 missing values generated)

. format covid_date %td

. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)
(12,853 missing values generated)

. tab covid_month

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |        576        3.58        3.58
    apr2021 |        538        3.34        6.92
    apr2022 |        414        2.57        9.49
    aug2020 |        594        3.69       13.18
    aug2021 |        474        2.94       16.13
    aug2022 |        389        2.42       18.54
    dec2020 |        544        3.38       21.92
    dec2021 |        476        2.96       24.88
    feb2020 |        581        3.61       28.49
    feb2021 |        481        2.99       31.48
    feb2022 |        382        2.37       33.85
    jan2021 |        573        3.56       37.41
    jan2022 |        463        2.88       40.28
    jul2020 |        580        3.60       43.89
    jul2021 |        543        3.37       47.26
    jul2022 |        439        2.73       49.99
    jun2020 |        586        3.64       53.63
    jun2021 |        483        3.00       56.63
    jun2022 |        413        2.57       59.19
    mar2020 |        631        3.92       63.11
    mar2021 |        543        3.37       66.49
    mar2022 |        404        2.51       69.00
    may2020 |        554        3.44       72.44
    may2021 |        500        3.11       75.54
    may2022 |        429        2.66       78.21
    nov2020 |        536        3.33       81.54
    nov2021 |        460        2.86       84.40
    oct2020 |        553        3.44       87.83
    oct2021 |        517        3.21       91.04
    sep2020 |        567        3.52       94.56
    sep2021 |        487        3.03       97.59
    sep2022 |        388        2.41      100.00
------------+-----------------------------------
      Total |     16,098      100.00

. 
. 
. gen death_date1 = date(death_date, "YMD")
(26,046 missing values generated)

. format death_date1 %td

. gen death_date_string=string(death_date1, "%td")

. gen death_month=substr( death_date_string ,3,7)
(26,046 missing values generated)

. tab death_month

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         71        2.44        2.44
    apr2021 |         99        3.41        5.85
    apr2022 |         96        3.30        9.16
    aug2020 |        109        3.75       12.91
    aug2021 |         92        3.17       16.08
    aug2022 |         71        2.44       18.52
    dec2020 |         78        2.69       21.20
    dec2021 |         88        3.03       24.23
    feb2020 |         83        2.86       27.09
    feb2021 |        115        3.96       31.05
    feb2022 |         89        3.06       34.11
    jan2021 |         88        3.03       37.14
    jan2022 |         95        3.27       40.41
    jul2020 |        103        3.55       43.96
    jul2021 |         82        2.82       46.78
    jul2022 |         97        3.34       50.12
    jun2020 |         91        3.13       53.25
    jun2021 |         93        3.20       56.45
    jun2022 |        106        3.65       60.10
    mar2020 |         76        2.62       62.72
    mar2021 |         93        3.20       65.92
    mar2022 |        103        3.55       69.47
    may2020 |         93        3.20       72.67
    may2021 |         85        2.93       75.59
    may2022 |         80        2.75       78.35
    nov2020 |         80        2.75       81.10
    nov2021 |         93        3.20       84.30
    oct2020 |         98        3.37       87.68
    oct2021 |         88        3.03       90.71
    sep2020 |        100        3.44       94.15
    sep2021 |         91        3.13       97.28
    sep2022 |         79        2.72      100.00
------------+-----------------------------------
      Total |      2,905      100.00

. 
. 
. export delimited using "./output/2020_matching.csv", replace
(note: file ./output/2020_matching.csv not found)
file ./output/2020_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_matching.log
  log type:  text
 closed on:   2 Nov 2022, 15:48:50
-------------------------------------------------------------------------------
