-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_matching.log
  log type:  text
 opened on:   1 Apr 2023, 00:46:45

. clear

. 
. import delimited ./output/input_2020_matching.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(20 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,723 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before February 2020
. drop if has_follow_up==0
(1,986 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,856 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,768 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,705 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(13,967 real changes made, 13,967 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(13,967 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(31,962 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,293 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,702 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,293 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,702 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,403 real changes made)

. gen max_baseline_creatinine_feb2020=.
(31,962 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,293 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,702 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(17,995 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,559 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(13,967 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(17,995 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,293 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. drop egfr_baseline_creatinine_feb2020

. 
. * Deceased
. drop if deceased==1
(3,237 observations deleted)

. drop deceased

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        398        1.39        1.39
         19 |        386        1.34        2.73
         20 |        431        1.50        4.23
         21 |        462        1.61        5.84
         22 |        461        1.60        7.44
         23 |        436        1.52        8.96
         24 |        423        1.47       10.43
         25 |        531        1.85       12.28
         26 |        551        1.92       14.20
         27 |        470        1.64       15.84
         28 |        461        1.60       17.44
         29 |        471        1.64       19.08
         30 |        447        1.56       20.64
         31 |        487        1.70       22.33
         32 |        482        1.68       24.01
         33 |        443        1.54       25.55
         34 |        493        1.72       27.27
         35 |        495        1.72       28.99
         36 |        466        1.62       30.61
         37 |        512        1.78       32.40
         38 |        490        1.71       34.10
         39 |        494        1.72       35.82
         40 |        475        1.65       37.48
         41 |        431        1.50       38.98
         42 |        411        1.43       40.41
         43 |        448        1.56       41.97
         44 |        476        1.66       43.62
         45 |        480        1.67       45.30
         46 |        443        1.54       46.84
         47 |        476        1.66       48.49
         48 |        486        1.69       50.19
         49 |        486        1.69       51.88
         50 |        517        1.80       53.68
         51 |        523        1.82       55.50
         52 |        470        1.64       57.13
         53 |        509        1.77       58.91
         54 |        544        1.89       60.80
         55 |        464        1.62       62.42
         56 |        453        1.58       63.99
         57 |        449        1.56       65.56
         58 |        468        1.63       67.19
         59 |        500        1.74       68.93
         60 |        405        1.41       70.34
         61 |        401        1.40       71.73
         62 |        409        1.42       73.16
         63 |        414        1.44       74.60
         64 |        404        1.41       76.00
         65 |        377        1.31       77.32
         66 |        363        1.26       78.58
         67 |        364        1.27       79.85
         68 |        400        1.39       81.24
         69 |        353        1.23       82.47
         70 |        376        1.31       83.78
         71 |        383        1.33       85.11
         72 |        379        1.32       86.43
         73 |        393        1.37       87.80
         74 |        397        1.38       89.18
         75 |        245        0.85       90.03
         76 |        235        0.82       90.85
         77 |        260        0.91       91.76
         78 |        266        0.93       92.68
         79 |        253        0.88       93.56
         80 |        203        0.71       94.27
         81 |        183        0.64       94.91
         82 |        196        0.68       95.59
         83 |        196        0.68       96.27
         84 |        185        0.64       96.92
         85 |        112        0.39       97.31
         86 |        103        0.36       97.66
         87 |         99        0.34       98.01
         88 |        107        0.37       98.38
         89 |        116        0.40       98.79
         90 |         48        0.17       98.95
         91 |         56        0.19       99.15
         92 |         48        0.17       99.31
         93 |         61        0.21       99.53
         94 |         55        0.19       99.72
         95 |         13        0.05       99.76
         96 |          8        0.03       99.79
         97 |         24        0.08       99.87
         98 |          6        0.02       99.90
         99 |         10        0.03       99.93
        102 |          4        0.01       99.94
        103 |          3        0.01       99.95
        104 |          4        0.01       99.97
        105 |          2        0.01       99.98
        106 |          2        0.01       99.98
        107 |          1        0.00       99.99
        108 |          3        0.01      100.00
        109 |          1        0.00      100.00
------------+-----------------------------------
      Total |     28,725      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,685       51.12       51.12
       Male |     14,040       48.88      100.00
------------+-----------------------------------
      Total |     28,725      100.00

. 
. export delimited using "./output/2020_matching.csv", replace
(note: file ./output/2020_matching.csv not found)
file ./output/2020_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_matching.log
  log type:  text
 closed on:   1 Apr 2023, 00:46:46
-------------------------------------------------------------------------------
