-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_matching.log
  log type:  text
 opened on:  27 Oct 2022, 12:04:13

. clear

. 
. import delimited ./output/input_2020_matching.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(21 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,637 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,977 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,904 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,781 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,682 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,115 real changes made, 14,115 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,115 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,019 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,089 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,815 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,089 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,815 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,433 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,019 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,089 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,815 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(17,904 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,586 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,115 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(17,904 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,089 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. drop egfr_baseline_creatinine_feb2020

. 
. * Deceased
. drop if deceased==1
(3,149 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        408        1.41        1.41
         19 |        397        1.38        2.79
         20 |        447        1.55        4.34
         21 |        481        1.67        6.00
         22 |        480        1.66        7.67
         23 |        437        1.51        9.18
         24 |        488        1.69       10.87
         25 |        448        1.55       12.42
         26 |        519        1.80       14.22
         27 |        483        1.67       15.89
         28 |        473        1.64       17.53
         29 |        531        1.84       19.37
         30 |        483        1.67       21.04
         31 |        509        1.76       22.81
         32 |        514        1.78       24.59
         33 |        496        1.72       26.30
         34 |        501        1.74       28.04
         35 |        529        1.83       29.87
         36 |        490        1.70       31.57
         37 |        483        1.67       33.24
         38 |        489        1.69       34.94
         39 |        471        1.63       36.57
         40 |        400        1.39       37.95
         41 |        380        1.32       39.27
         42 |        454        1.57       40.84
         43 |        423        1.47       42.31
         44 |        421        1.46       43.77
         45 |        502        1.74       45.50
         46 |        492        1.70       47.21
         47 |        484        1.68       48.88
         48 |        509        1.76       50.65
         49 |        497        1.72       52.37
         50 |        525        1.82       54.19
         51 |        491        1.70       55.89
         52 |        470        1.63       57.52
         53 |        534        1.85       59.37
         54 |        518        1.79       61.16
         55 |        509        1.76       62.92
         56 |        473        1.64       64.56
         57 |        494        1.71       66.27
         58 |        484        1.68       67.95
         59 |        478        1.66       69.61
         60 |        433        1.50       71.10
         61 |        378        1.31       72.41
         62 |        428        1.48       73.90
         63 |        456        1.58       75.48
         64 |        405        1.40       76.88
         65 |        389        1.35       78.23
         66 |        388        1.34       79.57
         67 |        395        1.37       80.94
         68 |        393        1.36       82.30
         69 |        368        1.27       83.57
         70 |        377        1.31       84.88
         71 |        358        1.24       86.12
         72 |        354        1.23       87.35
         73 |        359        1.24       88.59
         74 |        344        1.19       89.78
         75 |        250        0.87       90.65
         76 |        245        0.85       91.50
         77 |        238        0.82       92.32
         78 |        250        0.87       93.19
         79 |        211        0.73       93.92
         80 |        184        0.64       94.55
         81 |        167        0.58       95.13
         82 |        165        0.57       95.70
         83 |        184        0.64       96.34
         84 |        193        0.67       97.01
         85 |        122        0.42       97.43
         86 |        129        0.45       97.88
         87 |        114        0.39       98.28
         88 |        118        0.41       98.68
         89 |         97        0.34       99.02
         90 |         46        0.16       99.18
         91 |         45        0.16       99.33
         92 |         34        0.12       99.45
         93 |         33        0.11       99.57
         94 |         44        0.15       99.72
         95 |         12        0.04       99.76
         96 |         14        0.05       99.81
         97 |         16        0.06       99.86
         98 |         10        0.03       99.90
         99 |         13        0.05       99.94
        101 |          3        0.01       99.95
        102 |          2        0.01       99.96
        103 |          4        0.01       99.98
        105 |          1        0.00       99.98
        106 |          1        0.00       99.98
        107 |          3        0.01       99.99
        108 |          1        0.00      100.00
        109 |          1        0.00      100.00
------------+-----------------------------------
      Total |     28,870      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,465        5.07        5.07
          1 |      5,560       19.26       24.33
          2 |      5,518       19.11       43.45
          3 |      5,383       18.65       62.09
          4 |      5,456       18.90       80.99
          5 |      5,488       19.01      100.00
------------+-----------------------------------
      Total |     28,870      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,654       50.76       50.76
       Male |     14,216       49.24      100.00
------------+-----------------------------------
      Total |     28,870      100.00

. 
. gen covid_date = date(covid_diagnosis_date, "YMD")
(12,794 missing values generated)

. format covid_date %td

. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)
(12,794 missing values generated)

. tab covid_month

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |        579        3.60        3.60
    apr2021 |        502        3.12        6.72
    apr2022 |        417        2.59        9.32
    aug2020 |        607        3.78       13.09
    aug2021 |        509        3.17       16.26
    aug2022 |        446        2.77       19.03
    dec2020 |        541        3.37       22.40
    dec2021 |        438        2.72       25.12
    feb2020 |        585        3.64       28.76
    feb2021 |        483        3.00       31.77
    feb2022 |        396        2.46       34.23
    jan2021 |        539        3.35       37.58
    jan2022 |        456        2.84       40.42
    jul2020 |        614        3.82       44.24
    jul2021 |        472        2.94       47.18
    jul2022 |        424        2.64       49.81
    jun2020 |        575        3.58       53.39
    jun2021 |        469        2.92       56.31
    jun2022 |        400        2.49       58.80
    mar2020 |        615        3.83       62.62
    mar2021 |        559        3.48       66.10
    mar2022 |        430        2.67       68.77
    may2020 |        621        3.86       72.64
    may2021 |        530        3.30       75.93
    may2022 |        440        2.74       78.67
    nov2020 |        503        3.13       81.80
    nov2021 |        467        2.90       84.70
    oct2020 |        538        3.35       88.05
    oct2021 |        478        2.97       91.02
    sep2020 |        550        3.42       94.45
    sep2021 |        480        2.99       97.43
    sep2022 |        413        2.57      100.00
------------+-----------------------------------
      Total |     16,076      100.00

. 
. 
. gen death_date1 = date(death_date, "YMD")
(26,063 missing values generated)

. format death_date1 %td

. gen death_date_string=string(death_date1, "%td")

. gen death_month=substr( death_date_string ,3,7)
(26,063 missing values generated)

. tab death_month

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         94        3.35        3.35
    apr2021 |         91        3.24        6.59
    apr2022 |         82        2.92        9.51
    aug2020 |         66        2.35       11.86
    aug2021 |         86        3.06       14.93
    aug2022 |        112        3.99       18.92
    dec2020 |         99        3.53       22.44
    dec2021 |         81        2.89       25.33
    feb2020 |         83        2.96       28.29
    feb2021 |         81        2.89       31.17
    feb2022 |         81        2.89       34.06
    jan2021 |         74        2.64       36.69
    jan2022 |        109        3.88       40.58
    jul2020 |         89        3.17       43.75
    jul2021 |         92        3.28       47.03
    jul2022 |         98        3.49       50.52
    jun2020 |         83        2.96       53.47
    jun2021 |         86        3.06       56.54
    jun2022 |         95        3.38       59.92
    mar2020 |         82        2.92       62.84
    mar2021 |        101        3.60       66.44
    mar2022 |         71        2.53       68.97
    may2020 |         81        2.89       71.86
    may2021 |         82        2.92       74.78
    may2022 |         81        2.89       77.66
    nov2020 |         84        2.99       80.66
    nov2021 |         93        3.31       83.97
    oct2020 |         89        3.17       87.14
    oct2021 |         96        3.42       90.56
    sep2020 |         93        3.31       93.87
    sep2021 |         77        2.74       96.62
    sep2022 |         95        3.38      100.00
------------+-----------------------------------
      Total |      2,807      100.00

. 
. 
. export delimited using "./output/2020_matching.csv", replace
(note: file ./output/2020_matching.csv not found)
file ./output/2020_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_matching.log
  log type:  text
 closed on:  27 Oct 2022, 12:04:14
-------------------------------------------------------------------------------
