-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/analysis_2017.log
  log type:  text
 opened on:  11 Jan 2023, 18:32:53

. 
. ** Analysis cohort selection
. capture noisily import delimited ./output/input_covid_matching.csv, clear
(53 vars, 50,000 obs)

. di "Potential COVID-19 cases extracted from OpenSAFELY:"
Potential COVID-19 cases extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/input_2017_matching.csv, clear
(16 vars, 50,000 obs)

. di "Potential historical comparators extracted from OpenSAFELY:"
Potential historical comparators extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/covid_matching_2017.csv, clear
(10 vars, 15,745 obs)

. di "Potential COVID-19 cases after application of exclusion criteria:"
Potential COVID-19 cases after application of exclusion criteria:

. safecount
  15,745

. capture noisily import delimited ./output/2017_matching.csv, clear
(7 vars, 28,825 obs)

. di "Potential historical comparators after application of exclusion criteria:
> "
Potential historical comparators after application of exclusion criteria:

. safecount
  28,825

. * Import COVID-19 dataset comprising individuals matched with historical comp
> arators (limited matching variables only)  
. capture noisily import delimited ./output/input_combined_stps_covid_2017.csv,
>  clear
(13 vars, 13,990 obs)

. * Drop age & covid_diagnosis_date
. keep patient_id death_date date_deregistered stp krt_outcome_date male covid_
> date covid_month set_id case match_counts

. tempfile covid_2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `covid_2017_matched', replace
(note: file /tmp/St00011.000001 not found)
file /tmp/St00011.000001 saved

. * Number of matched COVID-19 cases
. count
  13,990

. * Import matched historical comparators (limited matching variables only)
. capture noisily import delimited ./output/input_combined_stps_matches_2017.cs
> v, clear
(10 vars, 22,201 obs)

. * Drop age
. keep patient_id death_date date_deregistered stp krt_outcome_date male set_id
>  case covid_date

. tempfile 2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `2017_matched', replace
(note: file /tmp/St00011.000002 not found)
file /tmp/St00011.000002 saved

. * Number of matched historical comparators
. count
  22,201

. * Merge limited COVID-19 dataset with additional variables
. capture noisily import delimited ./output/input_covid_2017_additional.csv, cl
> ear
(106 vars, 13,990 obs)

. merge 1:1 patient_id using `covid_2017_matched'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            13,990  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile covid_2017_complete

. save `covid_2017_complete', replace
(note: file /tmp/St00011.000003 not found)
file /tmp/St00011.000003 saved

. di "Matched COVID-19 cases:"
Matched COVID-19 cases:

. safecount
  13,990

. * Merge limited historical comparator dataset with additional variables
. capture noisily import delimited ./output/input_2017_additional.csv, clear
(95 vars, 22,201 obs)

. merge 1:1 patient_id using `2017_matched'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            22,201  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile 2017_complete

. save `2017_complete', replace
(note: file /tmp/St00011.000004 not found)
file /tmp/St00011.000004 saved

. di "Matched historical comparators:"
Matched historical comparators:

. safecount
  22,201

. * Append matched COVID-19 cases and historical comparators
. append using `covid_2017_complete', force

. order patient_id set_id match_count case

. gsort set_id -case

. count if case==0
  22,201

. di "Matched COVID-19 cases and historical comparators:"
Matched COVID-19 cases and historical comparators:

. safecount
  36,191

. tab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,201       61.34       61.34
          1 |     13,990       38.66      100.00
------------+-----------------------------------
      Total |     36,191      100.00

. * Save list of matched COVID-19 cases
. preserve

.         keep if case==1
(22,201 observations deleted)

.         keep patient_id

.         tempfile covid_2017_matched_list

.         save `covid_2017_matched_list', replace
(note: file /tmp/St00011.000006 not found)
file /tmp/St00011.000006 saved

. restore

. * Generate list of unmatched COVID-19 cases
. preserve

.         capture noisily import delimited ./output/input_covid_matching.csv, c
> lear
(53 vars, 50,000 obs)

.         * For dummy data, should do nothing in the real data
.         duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

.         tempfile covid_prematching

.         save `covid_prematching', replace
(note: file /tmp/St00011.000008 not found)
file /tmp/St00011.000008 saved

.         use `covid_2017_matched_list', clear

.         merge 1:1 patient_id using `covid_prematching'

    Result                           # of obs.
    -----------------------------------------
    not matched                        36,010
        from master                         0  (_merge==1)
        from using                     36,010  (_merge==2)

    matched                            13,990  (_merge==3)
    -----------------------------------------

.         keep if _merge==2
(13,990 observations deleted)

.         safecount
  36,010

.         save output/covid_unmatched_2017.dta, replace
file output/covid_unmatched_2017.dta saved

.         di "Unmatched COVID-19 cases:"
Unmatched COVID-19 cases:

.         safecount
  36,010

. restore

. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      1,847        5.10        5.10
 1 Most deprived |      7,015       19.38       24.49
               2 |      6,900       19.07       43.55
               3 |      6,798       18.78       62.34
               4 |      6,791       18.76       81.10
5 Least deprived |      6,840       18.90      100.00
-----------------+-----------------------------------
           Total |     36,191      100.00

. drop if imd==0
(1,847 observations deleted)

. safetab imd
0

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |      7,015       20.43       20.43
               2 |      6,900       20.09       40.52
               3 |      6,798       19.79       60.31
               4 |      6,791       19.77       80.08
5 Least deprived |      6,840       19.92      100.00
-----------------+-----------------------------------
           Total |     34,344      100.00

. 
. * STP missing
. drop stp

. tab stp_updated

stp_updated |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     34,344      100.00      100.00
------------+-----------------------------------
      Total |     34,344      100.00

. drop if stp_updated==""
(0 observations deleted)

. bysort stp_updated: gen stp = 1 if _n==1
(34,343 missing values generated)

. replace stp = sum(stp)
(34,343 real changes made)

. drop stp_updated

. label values stp stp

. label var stp "STP"

. safetab stp
0

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     34,344      100.00      100.00
------------+-----------------------------------
      Total |     34,344      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(30,836 missing values generated)

. replace region = 2 if region_string=="East"
(3,450 real changes made)

. replace region = 3 if region_string=="London"
(6,972 real changes made)

. replace region = 4 if region_string=="North East"
(3,418 real changes made)

. replace region = 5 if region_string=="North West"
(3,389 real changes made)

. replace region = 6 if region_string=="South East"
(3,393 real changes made)

. replace region = 7 if region_string=="South West"
(3,468 real changes made)

. replace region = 8 if region_string=="West Midlands"
(3,401 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(3,345 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,508       10.21       10.21
                    East |      3,450       10.05       20.26
                  London |      6,972       20.30       40.56
              North East |      3,418        9.95       50.51
              North West |      3,389        9.87       60.38
              South East |      3,393        9.88       70.26
              South West |      3,468       10.10       80.36
           West Midlands |      3,401        9.90       90.26
Yorkshire and The Humber |      3,345        9.74      100.00
-------------------------+-----------------------------------
                   Total |     34,344      100.00

. drop if region==10
(0 observations deleted)

. safetab region
0

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,508       10.21       10.21
                    East |      3,450       10.05       20.26
                  London |      6,972       20.30       40.56
              North East |      3,418        9.95       50.51
              North West |      3,389        9.87       60.38
              South East |      3,393        9.88       70.26
              South West |      3,468       10.10       80.36
           West Midlands |      3,401        9.90       90.26
Yorkshire and The Humber |      3,345        9.74      100.00
-------------------------+-----------------------------------
                   Total |     34,344      100.00

. 
. * Exclusions due to deregistration and kidney replacement therapy will be che
> cked (should already have been applied from previous steps in workflow)
. gen index_date = date(case_index_date, "YMD")

. format index_date %td

. 
. * Deregistered before index_date
. gen deregistered_date = date(date_deregistered, "YMD")
(33,267 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date
(0 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(31,135 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(0 observations deleted)

. gen index_date_28 = index_date + 28

. format index_date_28 %td

. replace krt_date = index_date_28 if krt_date < index_date_28
(157 real changes made)

. 
. * Death before index_date + 28 days (i.e. only include people who survived 28
>  days after index_date)
. gen death_date1 = date(death_date, "YMD")
(32,407 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28
(90 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased withi
> n 28 days of index date"

. label values deceased deceased

. tab case deceased

           |       deceased
      case | Alive at   Deceased  |     Total
-----------+----------------------+----------
         0 |    21,032         68 |    21,100 
         1 |    13,222         22 |    13,244 
-----------+----------------------+----------
     Total |    34,254         90 |    34,344 

. drop if deceased==1
(90 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators
>  only
. gen index_year = yofd(index_date)

. gen age = index_year - year_of_birth

. gen sex = 1 if male == "Male"
(17,678 missing values generated)

. replace sex = 0 if male == "Female"
(17,678 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 /
> //
>                                                                              
>                    baseline_creatinine_mar2017 ///
>                                                                              
>                    baseline_creatinine_apr2017 ///
>                                                                              
>                    baseline_creatinine_may2017 ///
>                                                                              
>                    baseline_creatinine_jun2017 ///
>                                                                              
>                    baseline_creatinine_jul2017 ///
>                                                                              
>                    baseline_creatinine_aug2017 ///
>                                                                              
>                    baseline_creatinine_sep2017 ///
>                                                                              
>                    baseline_creatinine_oct2017 ///
>                                                                              
>                    baseline_creatinine_nov2017 ///
>                                                                              
>                    baseline_creatinine_dec2017 ///
>                                                                              
>                    baseline_creatinine_jan2018 ///
>                                                                              
>                    baseline_creatinine_feb2018 ///
>                                                                              
>                    baseline_creatinine_mar2018 ///
>                                                                              
>                    baseline_creatinine_apr2018 ///
>                                                                              
>                    baseline_creatinine_may2018 ///
>                                                                              
>                    baseline_creatinine_jun2018 ///
>                                                                              
>                    baseline_creatinine_jul2018 ///
>                                                                              
>                    baseline_creatinine_aug2018 ///
>                                                                              
>                    baseline_creatinine_sep2018 ///
>                                                                              
>                    baseline_creatinine_oct2018 ///
>                                                                              
>                    baseline_creatinine_nov2018 ///
>                                                                              
>                    baseline_creatinine_dec2018 ///
>                                                                              
>                    baseline_creatinine_jan2019 ///
>                                                                              
>                    baseline_creatinine_feb2019 ///
>                                                                              
>                    baseline_creatinine_mar2019 ///
>                                                                              
>                    baseline_creatinine_apr2019 ///
>                                                                              
>                    baseline_creatinine_may2019 ///
>                                                                              
>                    baseline_creatinine_jun2019 ///
>                                                                              
>                    baseline_creatinine_jul2019 ///
>                                                                              
>                    baseline_creatinine_aug2019 ///
>                                                                              
>                    baseline_creatinine_sep2019 ///
>                                                                              
>                    baseline_creatinine_feb2020 ///
>                                                                              
>                    baseline_creatinine_mar2020 ///
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 ///
>                                                                              
>                    baseline_creatinine_oct2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(9,252 real changes made, 9,252 to missing)
(22,474 missing values generated)
(34,254 missing values generated)
(6,086 real changes made)
(5,694 real changes made)
(6,086 real changes made)
(5,694 real changes made)
(7,428 real changes made)
(34,254 missing values generated)
(6,086 real changes made)
(5,694 real changes made)
(11,780 real changes made)
(26,826 real changes made)
(22,474 missing values generated)
(11,780 real changes made)
(6,086 real changes made)
(9,268 real changes made, 9,268 to missing)
(22,490 missing values generated)
(34,254 missing values generated)
(6,051 real changes made)
(5,713 real changes made)
(6,051 real changes made)
(5,713 real changes made)
(7,537 real changes made)
(34,254 missing values generated)
(6,051 real changes made)
(5,713 real changes made)
(11,764 real changes made)
(26,717 real changes made)
(22,490 missing values generated)
(11,764 real changes made)
(6,051 real changes made)
(9,226 real changes made, 9,226 to missing)
(22,448 missing values generated)
(34,254 missing values generated)
(6,054 real changes made)
(5,752 real changes made)
(6,054 real changes made)
(5,752 real changes made)
(7,404 real changes made)
(34,254 missing values generated)
(6,054 real changes made)
(5,752 real changes made)
(11,806 real changes made)
(26,850 real changes made)
(22,448 missing values generated)
(11,806 real changes made)
(6,054 real changes made)
(9,283 real changes made, 9,283 to missing)
(22,505 missing values generated)
(34,254 missing values generated)
(6,046 real changes made)
(5,703 real changes made)
(6,046 real changes made)
(5,703 real changes made)
(7,449 real changes made)
(34,254 missing values generated)
(6,046 real changes made)
(5,703 real changes made)
(11,749 real changes made)
(26,805 real changes made)
(22,505 missing values generated)
(11,749 real changes made)
(6,046 real changes made)
(9,221 real changes made, 9,221 to missing)
(22,443 missing values generated)
(34,254 missing values generated)
(6,126 real changes made)
(5,685 real changes made)
(6,126 real changes made)
(5,685 real changes made)
(7,519 real changes made)
(34,254 missing values generated)
(6,126 real changes made)
(5,685 real changes made)
(11,811 real changes made)
(26,735 real changes made)
(22,443 missing values generated)
(11,811 real changes made)
(6,126 real changes made)
(9,217 real changes made, 9,217 to missing)
(22,439 missing values generated)
(34,254 missing values generated)
(6,100 real changes made)
(5,715 real changes made)
(6,100 real changes made)
(5,715 real changes made)
(7,501 real changes made)
(34,254 missing values generated)
(6,100 real changes made)
(5,715 real changes made)
(11,815 real changes made)
(26,753 real changes made)
(22,439 missing values generated)
(11,815 real changes made)
(6,100 real changes made)
(9,239 real changes made, 9,239 to missing)
(22,461 missing values generated)
(34,254 missing values generated)
(6,068 real changes made)
(5,725 real changes made)
(6,068 real changes made)
(5,725 real changes made)
(7,463 real changes made)
(34,254 missing values generated)
(6,068 real changes made)
(5,725 real changes made)
(11,793 real changes made)
(26,791 real changes made)
(22,461 missing values generated)
(11,793 real changes made)
(6,068 real changes made)
(9,267 real changes made, 9,267 to missing)
(22,489 missing values generated)
(34,254 missing values generated)
(6,091 real changes made)
(5,674 real changes made)
(6,091 real changes made)
(5,674 real changes made)
(7,506 real changes made)
(34,254 missing values generated)
(6,091 real changes made)
(5,674 real changes made)
(11,765 real changes made)
(26,748 real changes made)
(22,489 missing values generated)
(11,765 real changes made)
(6,091 real changes made)
(9,218 real changes made, 9,218 to missing)
(22,440 missing values generated)
(34,254 missing values generated)
(6,101 real changes made)
(5,713 real changes made)
(6,101 real changes made)
(5,713 real changes made)
(7,511 real changes made)
(34,254 missing values generated)
(6,101 real changes made)
(5,713 real changes made)
(11,814 real changes made)
(26,743 real changes made)
(22,440 missing values generated)
(11,814 real changes made)
(6,101 real changes made)
(9,286 real changes made, 9,286 to missing)
(22,508 missing values generated)
(34,254 missing values generated)
(6,053 real changes made)
(5,693 real changes made)
(6,053 real changes made)
(5,693 real changes made)
(7,443 real changes made)
(34,254 missing values generated)
(6,053 real changes made)
(5,693 real changes made)
(11,746 real changes made)
(26,811 real changes made)
(22,508 missing values generated)
(11,746 real changes made)
(6,053 real changes made)
(9,263 real changes made, 9,263 to missing)
(22,485 missing values generated)
(34,254 missing values generated)
(6,021 real changes made)
(5,748 real changes made)
(6,021 real changes made)
(5,748 real changes made)
(7,426 real changes made)
(34,254 missing values generated)
(6,021 real changes made)
(5,748 real changes made)
(11,769 real changes made)
(26,828 real changes made)
(22,485 missing values generated)
(11,769 real changes made)
(6,021 real changes made)
(9,257 real changes made, 9,257 to missing)
(22,479 missing values generated)
(34,254 missing values generated)
(6,060 real changes made)
(5,715 real changes made)
(6,060 real changes made)
(5,715 real changes made)
(7,473 real changes made)
(34,254 missing values generated)
(6,060 real changes made)
(5,715 real changes made)
(11,775 real changes made)
(26,781 real changes made)
(22,479 missing values generated)
(11,775 real changes made)
(6,060 real changes made)
(9,204 real changes made, 9,204 to missing)
(22,426 missing values generated)
(34,254 missing values generated)
(6,109 real changes made)
(5,719 real changes made)
(6,109 real changes made)
(5,719 real changes made)
(7,546 real changes made)
(34,254 missing values generated)
(6,109 real changes made)
(5,719 real changes made)
(11,828 real changes made)
(26,708 real changes made)
(22,426 missing values generated)
(11,828 real changes made)
(6,109 real changes made)
(9,168 real changes made, 9,168 to missing)
(22,390 missing values generated)
(34,254 missing values generated)
(6,092 real changes made)
(5,772 real changes made)
(6,092 real changes made)
(5,772 real changes made)
(7,497 real changes made)
(34,254 missing values generated)
(6,092 real changes made)
(5,772 real changes made)
(11,864 real changes made)
(26,757 real changes made)
(22,390 missing values generated)
(11,864 real changes made)
(6,092 real changes made)
(9,283 real changes made, 9,283 to missing)
(22,505 missing values generated)
(34,254 missing values generated)
(6,040 real changes made)
(5,709 real changes made)
(6,040 real changes made)
(5,709 real changes made)
(7,491 real changes made)
(34,254 missing values generated)
(6,040 real changes made)
(5,709 real changes made)
(11,749 real changes made)
(26,763 real changes made)
(22,505 missing values generated)
(11,749 real changes made)
(6,040 real changes made)
(9,281 real changes made, 9,281 to missing)
(22,503 missing values generated)
(34,254 missing values generated)
(6,049 real changes made)
(5,702 real changes made)
(6,049 real changes made)
(5,702 real changes made)
(7,518 real changes made)
(34,254 missing values generated)
(6,049 real changes made)
(5,702 real changes made)
(11,751 real changes made)
(26,736 real changes made)
(22,503 missing values generated)
(11,751 real changes made)
(6,049 real changes made)
(9,281 real changes made, 9,281 to missing)
(22,503 missing values generated)
(34,254 missing values generated)
(6,085 real changes made)
(5,666 real changes made)
(6,085 real changes made)
(5,666 real changes made)
(7,471 real changes made)
(34,254 missing values generated)
(6,085 real changes made)
(5,666 real changes made)
(11,751 real changes made)
(26,783 real changes made)
(22,503 missing values generated)
(11,751 real changes made)
(6,085 real changes made)
(9,240 real changes made, 9,240 to missing)
(22,462 missing values generated)
(34,254 missing values generated)
(6,039 real changes made)
(5,753 real changes made)
(6,039 real changes made)
(5,753 real changes made)
(7,405 real changes made)
(34,254 missing values generated)
(6,039 real changes made)
(5,753 real changes made)
(11,792 real changes made)
(26,849 real changes made)
(22,462 missing values generated)
(11,792 real changes made)
(6,039 real changes made)
(9,256 real changes made, 9,256 to missing)
(22,478 missing values generated)
(34,254 missing values generated)
(6,108 real changes made)
(5,668 real changes made)
(6,108 real changes made)
(5,668 real changes made)
(7,566 real changes made)
(34,254 missing values generated)
(6,108 real changes made)
(5,668 real changes made)
(11,776 real changes made)
(26,688 real changes made)
(22,478 missing values generated)
(11,776 real changes made)
(6,108 real changes made)
(9,281 real changes made, 9,281 to missing)
(22,503 missing values generated)
(34,254 missing values generated)
(6,104 real changes made)
(5,647 real changes made)
(6,104 real changes made)
(5,647 real changes made)
(7,420 real changes made)
(34,254 missing values generated)
(6,104 real changes made)
(5,647 real changes made)
(11,751 real changes made)
(26,834 real changes made)
(22,503 missing values generated)
(11,751 real changes made)
(6,104 real changes made)
(9,237 real changes made, 9,237 to missing)
(22,459 missing values generated)
(34,254 missing values generated)
(6,027 real changes made)
(5,768 real changes made)
(6,027 real changes made)
(5,768 real changes made)
(7,444 real changes made)
(34,254 missing values generated)
(6,027 real changes made)
(5,768 real changes made)
(11,795 real changes made)
(26,810 real changes made)
(22,459 missing values generated)
(11,795 real changes made)
(6,027 real changes made)
(9,258 real changes made, 9,258 to missing)
(22,480 missing values generated)
(34,254 missing values generated)
(6,086 real changes made)
(5,688 real changes made)
(6,086 real changes made)
(5,688 real changes made)
(7,452 real changes made)
(34,254 missing values generated)
(6,086 real changes made)
(5,688 real changes made)
(11,774 real changes made)
(26,802 real changes made)
(22,480 missing values generated)
(11,774 real changes made)
(6,086 real changes made)
(9,277 real changes made, 9,277 to missing)
(22,499 missing values generated)
(34,254 missing values generated)
(6,081 real changes made)
(5,674 real changes made)
(6,081 real changes made)
(5,674 real changes made)
(7,456 real changes made)
(34,254 missing values generated)
(6,081 real changes made)
(5,674 real changes made)
(11,755 real changes made)
(26,798 real changes made)
(22,499 missing values generated)
(11,755 real changes made)
(6,081 real changes made)
(9,275 real changes made, 9,275 to missing)
(22,497 missing values generated)
(34,254 missing values generated)
(6,032 real changes made)
(5,725 real changes made)
(6,032 real changes made)
(5,725 real changes made)
(7,451 real changes made)
(34,254 missing values generated)
(6,032 real changes made)
(5,725 real changes made)
(11,757 real changes made)
(26,803 real changes made)
(22,497 missing values generated)
(11,757 real changes made)
(6,032 real changes made)
(9,268 real changes made, 9,268 to missing)
(22,490 missing values generated)
(34,254 missing values generated)
(6,047 real changes made)
(5,717 real changes made)
(6,047 real changes made)
(5,717 real changes made)
(7,520 real changes made)
(34,254 missing values generated)
(6,047 real changes made)
(5,717 real changes made)
(11,764 real changes made)
(26,734 real changes made)
(22,490 missing values generated)
(11,764 real changes made)
(6,047 real changes made)
(9,289 real changes made, 9,289 to missing)
(22,511 missing values generated)
(34,254 missing values generated)
(6,074 real changes made)
(5,669 real changes made)
(6,074 real changes made)
(5,669 real changes made)
(7,417 real changes made)
(34,254 missing values generated)
(6,074 real changes made)
(5,669 real changes made)
(11,743 real changes made)
(26,837 real changes made)
(22,511 missing values generated)
(11,743 real changes made)
(6,074 real changes made)
(9,171 real changes made, 9,171 to missing)
(22,393 missing values generated)
(34,254 missing values generated)
(6,125 real changes made)
(5,736 real changes made)
(6,125 real changes made)
(5,736 real changes made)
(7,525 real changes made)
(34,254 missing values generated)
(6,125 real changes made)
(5,736 real changes made)
(11,861 real changes made)
(26,729 real changes made)
(22,393 missing values generated)
(11,861 real changes made)
(6,125 real changes made)
(9,272 real changes made, 9,272 to missing)
(22,494 missing values generated)
(34,254 missing values generated)
(6,010 real changes made)
(5,750 real changes made)
(6,010 real changes made)
(5,750 real changes made)
(7,391 real changes made)
(34,254 missing values generated)
(6,010 real changes made)
(5,750 real changes made)
(11,760 real changes made)
(26,863 real changes made)
(22,494 missing values generated)
(11,760 real changes made)
(6,010 real changes made)
(9,246 real changes made, 9,246 to missing)
(22,468 missing values generated)
(34,254 missing values generated)
(6,107 real changes made)
(5,679 real changes made)
(6,107 real changes made)
(5,679 real changes made)
(7,459 real changes made)
(34,254 missing values generated)
(6,107 real changes made)
(5,679 real changes made)
(11,786 real changes made)
(26,795 real changes made)
(22,468 missing values generated)
(11,786 real changes made)
(6,107 real changes made)
(9,258 real changes made, 9,258 to missing)
(22,480 missing values generated)
(34,254 missing values generated)
(6,068 real changes made)
(5,706 real changes made)
(6,068 real changes made)
(5,706 real changes made)
(7,382 real changes made)
(34,254 missing values generated)
(6,068 real changes made)
(5,706 real changes made)
(11,774 real changes made)
(26,872 real changes made)
(22,480 missing values generated)
(11,774 real changes made)
(6,068 real changes made)
(9,219 real changes made, 9,219 to missing)
(22,441 missing values generated)
(34,254 missing values generated)
(6,083 real changes made)
(5,730 real changes made)
(6,083 real changes made)
(5,730 real changes made)
(7,516 real changes made)
(34,254 missing values generated)
(6,083 real changes made)
(5,730 real changes made)
(11,813 real changes made)
(26,738 real changes made)
(22,441 missing values generated)
(11,813 real changes made)
(6,083 real changes made)
(9,262 real changes made, 9,262 to missing)
(22,484 missing values generated)
(34,254 missing values generated)
(6,067 real changes made)
(5,703 real changes made)
(6,067 real changes made)
(5,703 real changes made)
(7,409 real changes made)
(34,254 missing values generated)
(6,067 real changes made)
(5,703 real changes made)
(11,770 real changes made)
(26,845 real changes made)
(22,484 missing values generated)
(11,770 real changes made)
(6,067 real changes made)
(5,837 real changes made, 5,837 to missing)
(26,869 missing values generated)
(34,254 missing values generated)
(3,844 real changes made)
(3,541 real changes made)
(3,844 real changes made)
(3,541 real changes made)
(4,737 real changes made)
(34,254 missing values generated)
(3,844 real changes made)
(3,541 real changes made)
(7,385 real changes made)
(29,517 real changes made)
(26,869 missing values generated)
(7,385 real changes made)
(3,844 real changes made)
(5,791 real changes made, 5,791 to missing)
(26,823 missing values generated)
(34,254 missing values generated)
(3,834 real changes made)
(3,597 real changes made)
(3,834 real changes made)
(3,597 real changes made)
(4,671 real changes made)
(34,254 missing values generated)
(3,834 real changes made)
(3,597 real changes made)
(7,431 real changes made)
(29,583 real changes made)
(26,823 missing values generated)
(7,431 real changes made)
(3,834 real changes made)
(5,816 real changes made, 5,816 to missing)
(26,848 missing values generated)
(34,254 missing values generated)
(3,849 real changes made)
(3,557 real changes made)
(3,849 real changes made)
(3,557 real changes made)
(4,688 real changes made)
(34,254 missing values generated)
(3,849 real changes made)
(3,557 real changes made)
(7,406 real changes made)
(29,566 real changes made)
(26,848 missing values generated)
(7,406 real changes made)
(3,849 real changes made)
(5,869 real changes made, 5,869 to missing)
(26,901 missing values generated)
(34,254 missing values generated)
(3,855 real changes made)
(3,498 real changes made)
(3,855 real changes made)
(3,498 real changes made)
(4,664 real changes made)
(34,254 missing values generated)
(3,855 real changes made)
(3,498 real changes made)
(7,353 real changes made)
(29,590 real changes made)
(26,901 missing values generated)
(7,353 real changes made)
(3,855 real changes made)
(5,802 real changes made, 5,802 to missing)
(26,834 missing values generated)
(34,254 missing values generated)
(3,830 real changes made)
(3,590 real changes made)
(3,830 real changes made)
(3,590 real changes made)
(4,706 real changes made)
(34,254 missing values generated)
(3,830 real changes made)
(3,590 real changes made)
(7,420 real changes made)
(29,548 real changes made)
(26,834 missing values generated)
(7,420 real changes made)
(3,830 real changes made)
(5,778 real changes made, 5,778 to missing)
(26,810 missing values generated)
(34,254 missing values generated)
(3,857 real changes made)
(3,587 real changes made)
(3,857 real changes made)
(3,587 real changes made)
(4,779 real changes made)
(34,254 missing values generated)
(3,857 real changes made)
(3,587 real changes made)
(7,444 real changes made)
(29,475 real changes made)
(26,810 missing values generated)
(7,444 real changes made)
(3,857 real changes made)
(5,783 real changes made, 5,783 to missing)
(26,815 missing values generated)
(34,254 missing values generated)
(3,834 real changes made)
(3,605 real changes made)
(3,834 real changes made)
(3,605 real changes made)
(4,656 real changes made)
(34,254 missing values generated)
(3,834 real changes made)
(3,605 real changes made)
(7,439 real changes made)
(29,598 real changes made)
(26,815 missing values generated)
(7,439 real changes made)
(3,834 real changes made)
(5,795 real changes made, 5,795 to missing)
(26,827 missing values generated)
(34,254 missing values generated)
(3,811 real changes made)
(3,616 real changes made)
(3,811 real changes made)
(3,616 real changes made)
(4,769 real changes made)
(34,254 missing values generated)
(3,811 real changes made)
(3,616 real changes made)
(7,427 real changes made)
(29,485 real changes made)
(26,827 missing values generated)
(7,427 real changes made)
(3,811 real changes made)
(5,793 real changes made, 5,793 to missing)
(26,825 missing values generated)
(34,254 missing values generated)
(3,852 real changes made)
(3,577 real changes made)
(3,852 real changes made)
(3,577 real changes made)
(4,716 real changes made)
(34,254 missing values generated)
(3,852 real changes made)
(3,577 real changes made)
(7,429 real changes made)
(29,538 real changes made)
(26,825 missing values generated)
(7,429 real changes made)
(3,852 real changes made)
(5,811 real changes made, 5,811 to missing)
(26,843 missing values generated)
(34,254 missing values generated)
(3,787 real changes made)
(3,624 real changes made)
(3,787 real changes made)
(3,624 real changes made)
(4,717 real changes made)
(34,254 missing values generated)
(3,787 real changes made)
(3,624 real changes made)
(7,411 real changes made)
(29,537 real changes made)
(26,843 missing values generated)
(7,411 real changes made)
(3,787 real changes made)
(5,801 real changes made, 5,801 to missing)
(26,833 missing values generated)
(34,254 missing values generated)
(3,857 real changes made)
(3,564 real changes made)
(3,857 real changes made)
(3,564 real changes made)
(4,660 real changes made)
(34,254 missing values generated)
(3,857 real changes made)
(3,564 real changes made)
(7,421 real changes made)
(29,594 real changes made)
(26,833 missing values generated)
(7,421 real changes made)
(3,857 real changes made)
(5,823 real changes made, 5,823 to missing)
(26,855 missing values generated)
(34,254 missing values generated)
(3,832 real changes made)
(3,567 real changes made)
(3,832 real changes made)
(3,567 real changes made)
(4,688 real changes made)
(34,254 missing values generated)
(3,832 real changes made)
(3,567 real changes made)
(7,399 real changes made)
(29,566 real changes made)
(26,855 missing values generated)
(7,399 real changes made)
(3,832 real changes made)
(5,847 real changes made, 5,847 to missing)
(26,879 missing values generated)
(34,254 missing values generated)
(3,821 real changes made)
(3,554 real changes made)
(3,821 real changes made)
(3,554 real changes made)
(4,606 real changes made)
(34,254 missing values generated)
(3,821 real changes made)
(3,554 real changes made)
(7,375 real changes made)
(29,648 real changes made)
(26,879 missing values generated)
(7,375 real changes made)
(3,821 real changes made)
(5,805 real changes made, 5,805 to missing)
(26,837 missing values generated)
(34,254 missing values generated)
(3,805 real changes made)
(3,612 real changes made)
(3,805 real changes made)
(3,612 real changes made)
(4,657 real changes made)
(34,254 missing values generated)
(3,805 real changes made)
(3,612 real changes made)
(7,417 real changes made)
(29,597 real changes made)
(26,837 missing values generated)
(7,417 real changes made)
(3,805 real changes made)
(5,812 real changes made, 5,812 to missing)
(26,844 missing values generated)
(34,254 missing values generated)
(3,883 real changes made)
(3,527 real changes made)
(3,883 real changes made)
(3,527 real changes made)
(4,720 real changes made)
(34,254 missing values generated)
(3,883 real changes made)
(3,527 real changes made)
(7,410 real changes made)
(29,534 real changes made)
(26,844 missing values generated)
(7,410 real changes made)
(3,883 real changes made)
(5,792 real changes made, 5,792 to missing)
(26,824 missing values generated)
(34,254 missing values generated)
(3,823 real changes made)
(3,607 real changes made)
(3,823 real changes made)
(3,607 real changes made)
(4,672 real changes made)
(34,254 missing values generated)
(3,823 real changes made)
(3,607 real changes made)
(7,430 real changes made)
(29,582 real changes made)
(26,824 missing values generated)
(7,430 real changes made)
(3,823 real changes made)
(5,821 real changes made, 5,821 to missing)
(26,853 missing values generated)
(34,254 missing values generated)
(3,856 real changes made)
(3,545 real changes made)
(3,856 real changes made)
(3,545 real changes made)
(4,770 real changes made)
(34,254 missing values generated)
(3,856 real changes made)
(3,545 real changes made)
(7,401 real changes made)
(29,484 real changes made)
(26,853 missing values generated)
(7,401 real changes made)
(3,856 real changes made)
(5,792 real changes made, 5,792 to missing)
(26,824 missing values generated)
(34,254 missing values generated)
(3,843 real changes made)
(3,587 real changes made)
(3,843 real changes made)
(3,587 real changes made)
(4,755 real changes made)
(34,254 missing values generated)
(3,843 real changes made)
(3,587 real changes made)
(7,430 real changes made)
(29,499 real changes made)
(26,824 missing values generated)
(7,430 real changes made)
(3,843 real changes made)
(5,848 real changes made, 5,848 to missing)
(26,880 missing values generated)
(34,254 missing values generated)
(3,746 real changes made)
(3,628 real changes made)
(3,746 real changes made)
(3,628 real changes made)
(4,623 real changes made)
(34,254 missing values generated)
(3,746 real changes made)
(3,628 real changes made)
(7,374 real changes made)
(29,631 real changes made)
(26,880 missing values generated)
(7,374 real changes made)
(3,746 real changes made)
(5,797 real changes made, 5,797 to missing)
(26,829 missing values generated)
(34,254 missing values generated)
(3,878 real changes made)
(3,547 real changes made)
(3,878 real changes made)
(3,547 real changes made)
(4,695 real changes made)
(34,254 missing values generated)
(3,878 real changes made)
(3,547 real changes made)
(7,425 real changes made)
(29,559 real changes made)
(26,829 missing values generated)
(7,425 real changes made)
(3,878 real changes made)
(5,812 real changes made, 5,812 to missing)
(26,844 missing values generated)
(34,254 missing values generated)
(3,855 real changes made)
(3,555 real changes made)
(3,855 real changes made)
(3,555 real changes made)
(4,723 real changes made)
(34,254 missing values generated)
(3,855 real changes made)
(3,555 real changes made)
(7,410 real changes made)
(29,531 real changes made)
(26,844 missing values generated)
(7,410 real changes made)
(3,855 real changes made)
(5,859 real changes made, 5,859 to missing)
(26,891 missing values generated)
(34,254 missing values generated)
(3,859 real changes made)
(3,504 real changes made)
(3,859 real changes made)
(3,504 real changes made)
(4,689 real changes made)
(34,254 missing values generated)
(3,859 real changes made)
(3,504 real changes made)
(7,363 real changes made)
(29,565 real changes made)
(26,891 missing values generated)
(7,363 real changes made)
(3,859 real changes made)
(5,815 real changes made, 5,815 to missing)
(26,847 missing values generated)
(34,254 missing values generated)
(3,834 real changes made)
(3,573 real changes made)
(3,834 real changes made)
(3,573 real changes made)
(4,692 real changes made)
(34,254 missing values generated)
(3,834 real changes made)
(3,573 real changes made)
(7,407 real changes made)
(29,562 real changes made)
(26,847 missing values generated)
(7,407 real changes made)
(3,834 real changes made)
(5,814 real changes made, 5,814 to missing)
(26,846 missing values generated)
(34,254 missing values generated)
(3,824 real changes made)
(3,584 real changes made)
(3,824 real changes made)
(3,584 real changes made)
(4,728 real changes made)
(34,254 missing values generated)
(3,824 real changes made)
(3,584 real changes made)
(7,408 real changes made)
(29,526 real changes made)
(26,846 missing values generated)
(7,408 real changes made)
(3,824 real changes made)
(5,800 real changes made, 5,800 to missing)
(26,832 missing values generated)
(34,254 missing values generated)
(3,813 real changes made)
(3,609 real changes made)
(3,813 real changes made)
(3,609 real changes made)
(4,755 real changes made)
(34,254 missing values generated)
(3,813 real changes made)
(3,609 real changes made)
(7,422 real changes made)
(29,499 real changes made)
(26,832 missing values generated)
(7,422 real changes made)
(3,813 real changes made)
(5,837 real changes made, 5,837 to missing)
(26,869 missing values generated)
(34,254 missing values generated)
(3,860 real changes made)
(3,525 real changes made)
(3,860 real changes made)
(3,525 real changes made)
(4,599 real changes made)
(34,254 missing values generated)
(3,860 real changes made)
(3,525 real changes made)
(7,385 real changes made)
(29,655 real changes made)
(26,869 missing values generated)
(7,385 real changes made)
(3,860 real changes made)
(5,781 real changes made, 5,781 to missing)
(26,813 missing values generated)
(34,254 missing values generated)
(3,865 real changes made)
(3,576 real changes made)
(3,865 real changes made)
(3,576 real changes made)
(4,753 real changes made)
(34,254 missing values generated)
(3,865 real changes made)
(3,576 real changes made)
(7,441 real changes made)
(29,501 real changes made)
(26,813 missing values generated)
(7,441 real changes made)
(3,865 real changes made)
(5,807 real changes made, 5,807 to missing)
(26,839 missing values generated)
(34,254 missing values generated)
(3,795 real changes made)
(3,620 real changes made)
(3,795 real changes made)
(3,620 real changes made)
(4,684 real changes made)
(34,254 missing values generated)
(3,795 real changes made)
(3,620 real changes made)
(7,415 real changes made)
(29,570 real changes made)
(26,839 missing values generated)
(7,415 real changes made)
(3,795 real changes made)
(5,814 real changes made, 5,814 to missing)
(26,846 missing values generated)
(34,254 missing values generated)
(3,828 real changes made)
(3,580 real changes made)
(3,828 real changes made)
(3,580 real changes made)
(4,657 real changes made)
(34,254 missing values generated)
(3,828 real changes made)
(3,580 real changes made)
(7,408 real changes made)
(29,597 real changes made)
(26,846 missing values generated)
(7,408 real changes made)
(3,828 real changes made)
(5,833 real changes made, 5,833 to missing)
(26,865 missing values generated)
(34,254 missing values generated)
(3,874 real changes made)
(3,515 real changes made)
(3,874 real changes made)
(3,515 real changes made)
(4,756 real changes made)
(34,254 missing values generated)
(3,874 real changes made)
(3,515 real changes made)
(7,389 real changes made)
(29,498 real changes made)
(26,865 missing values generated)
(7,389 real changes made)
(3,874 real changes made)
(5,823 real changes made, 5,823 to missing)
(26,855 missing values generated)
(34,254 missing values generated)
(3,800 real changes made)
(3,599 real changes made)
(3,800 real changes made)
(3,599 real changes made)
(4,669 real changes made)
(34,254 missing values generated)
(3,800 real changes made)
(3,599 real changes made)
(7,399 real changes made)
(29,585 real changes made)
(26,855 missing values generated)
(7,399 real changes made)
(3,800 real changes made)
(5,813 real changes made, 5,813 to missing)
(26,845 missing values generated)
(34,254 missing values generated)
(3,843 real changes made)
(3,566 real changes made)
(3,843 real changes made)
(3,566 real changes made)
(4,741 real changes made)
(34,254 missing values generated)
(3,843 real changes made)
(3,566 real changes made)
(7,409 real changes made)
(29,513 real changes made)
(26,845 missing values generated)
(7,409 real changes made)
(3,843 real changes made)
(5,828 real changes made, 5,828 to missing)
(26,860 missing values generated)
(34,254 missing values generated)
(3,748 real changes made)
(3,646 real changes made)
(3,748 real changes made)
(3,646 real changes made)
(4,662 real changes made)
(34,254 missing values generated)
(3,748 real changes made)
(3,646 real changes made)
(7,394 real changes made)
(29,592 real changes made)
(26,860 missing values generated)
(7,394 real changes made)
(3,748 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)

. gen baseline_egfr=.
(34,254 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(753 real changes made)
(872 real changes made)
(838 real changes made)
(762 real changes made)
(667 real changes made)
(661 real changes made)
(602 real changes made)
(540 real changes made)
(547 real changes made)
(484 real changes made)
(539 real changes made)
(416 real changes made)
(354 real changes made)
(423 real changes made)
(306 real changes made)
(326 real changes made)
(288 real changes made)
(244 real changes made)
(286 real changes made)
(206 real changes made)
(184 real changes made)
(195 real changes made)
(185 real changes made)
(153 real changes made)
(134 real changes made)
(129 real changes made)
(111 real changes made)
(132 real changes made)
(132 real changes made)
(68 real changes made)
(119 real changes made)
(60 real changes made)
(259 real changes made)
(321 real changes made)
(295 real changes made)
(292 real changes made)
(268 real changes made)
(263 real changes made)
(275 real changes made)
(239 real changes made)
(267 real changes made)
(253 real changes made)
(269 real changes made)
(242 real changes made)
(187 real changes made)
(246 real changes made)
(208 real changes made)
(242 real changes made)
(215 real changes made)
(211 real changes made)
(244 real changes made)
(206 real changes made)
(204 real changes made)
(188 real changes made)
(174 real changes made)
(210 real changes made)
(167 real changes made)
(198 real changes made)
(163 real changes made)
(201 real changes made)
(194 real changes made)
(151 real changes made)
(198 real changes made)
(147 real changes made)
(148 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab case baseline_esrd

           | baseline_e
           |    srd
      case |   No ESRD |     Total
-----------+-----------+----------
         0 |    21,032 |    21,032 
         1 |    13,222 |    13,222 
-----------+-----------+----------
     Total |    34,254 |    34,254 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. * Drop COVID-19 cases without any matched historical comparators after furthe
> r application of exclusion criteria
. generate match_counts1=.
(34,254 missing values generated)

. order patient_id set_id match_counts match_counts1

. bysort set_id: replace match_counts1=_N-1
(34,254 real changes made)

. replace match_counts1=. if case==0
(21,032 real changes made, 21,032 to missing)

. drop match_counts

. rename match_counts1 match_counts

. count if match_counts==0
  5,251

. drop if match_counts==0
(5,251 observations deleted)

. safetab case
0

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,032       72.52       72.52
          1 |      7,971       27.48      100.00
------------+-----------------------------------
      Total |     29,003      100.00

. tab match_counts

match_count |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,137       14.26       14.26
          2 |      1,793       22.49       36.76
          3 |      5,041       63.24      100.00
------------+-----------------------------------
      Total |      7,971      100.00

. 
. bysort set_id: egen set_case_mean = mean(case) // if mean of exposure var is 
> 0 then only uncase in set, if 1 then only case in set

. gen valid_set = (set_case_mean>0 & set_case_mean<1) // ==1 is valid set conta
> ining both case and uncase

. tab valid_set, miss

  valid_set |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,186        4.09        4.09
          1 |     27,817       95.91      100.00
------------+-----------------------------------
      Total |     29,003      100.00

. tab valid_set case, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |         case
 valid_set |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,186          0 |     1,186 
           |      5.64       0.00 |      4.09 
-----------+----------------------+----------
         1 |    19,846      7,971 |    27,817 
           |     94.36     100.00 |     95.91 
-----------+----------------------+----------
     Total |    21,032      7,971 |    29,003 
           |    100.00     100.00 |    100.00 

. keep if valid_set==1
(1,186 observations deleted)

. drop valid_set set_case_mean

. 
. ** Exposure
. label define case 0 "Historical comparator" ///
>                                   1 "SARS-CoV-2"

. label values case case

. safetab case 
0

                 case |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,846       71.34       71.34
           SARS-CoV-2 |      7,971       28.66      100.00
----------------------+-----------------------------------
                Total |     27,817      100.00

. 
. * COVID-19 severity
. gen covid_severity = case

. replace covid_severity = 2 if covid_hospitalised==1
(811 real changes made)

. replace covid_severity = 3 if covid_critical_care==1
(399 real changes made)

. replace covid_severity = 3 if covid_critical_days==1
(365 real changes made)

. label define covid_severity     0 "Historical comparator"               ///
>                                                         1 "Non-hospitalised C
> OVID" ///
>                                                         2 "Hospitalised COVID
> "          ///
>                                                         3 "Critical care COVI
> D"

. label values covid_severity covid_severity

. label var covid_severity "SARS-CoV-2 severity"

. drop covid_critical_care

. drop covid_critical_days

. safetab covid_severity, m
15

   SARS-CoV-2 severity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
 Historical comparator |     19,846       71.34       71.34
Non-hospitalised COVID |      6,466       23.24       94.59
    Hospitalised COVID |        741        2.66       97.25
   Critical care COVID |        764        2.75      100.00
-----------------------+-----------------------------------
                 Total |     27,817      100.00

. 
. * COVID-19 acute kidney injury
. gen covid_aki = case

. replace covid_aki = 2 if covid_hospitalised==1
(811 real changes made)

. replace covid_aki = 3 if covid_acute_kidney_injury==1
(411 real changes made)

. label define covid_aki  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised COVID"   
>            ///
>                                                 2 "Hospitalised COVID"  ///
>                                                 3 "Hospitalised COVID-AKI"

. label values covid_aki covid_aki

. label var covid_aki "COVID-19 acute kidney injury"

. drop covid_acute_kidney_injury

. safetab covid_aki, m
10

 COVID-19 acute kidney |
                injury |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
 Historical comparator |     19,846       71.34       71.34
Non-hospitalised COVID |      6,797       24.43       95.78
    Hospitalised COVID |        763        2.74       98.52
Hospitalised COVID-AKI |        411        1.48      100.00
-----------------------+-----------------------------------
                 Total |     27,817      100.00

. 
. * COVID-19 kidney replacement therapy
. gen covid_krt_combined = covid_krt_icd_10
(19,846 missing values generated)

. replace covid_krt_combined = covid_krt_opcs_4 if covid_krt_icd_10==0
(361 real changes made)

. gen covid_krt = case

. replace covid_krt = 2 if covid_hospitalised==1
(811 real changes made)

. replace covid_krt = 3 if covid_krt_combined==1
(757 real changes made)

. label define covid_krt  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised SARS-CoV-
> 2"         ///
>                                                 2 "No KRT hospitalised COVID-
> 19"        ///
>                                                 3 "KRT hospitalised COVID-19"

. label values covid_krt covid_krt

. label var covid_krt "COVID-19 kidney replacement therapy"

. drop covid_krt_icd_10

. drop covid_krt_opcs_4

. safetab covid_krt, m
10

 COVID-19 kidney replacement |
                     therapy |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
       Historical comparator |     19,846       71.34       71.34
 Non-hospitalised SARS-CoV-2 |      6,475       23.28       94.62
No KRT hospitalised COVID-19 |        739        2.66       97.28
   KRT hospitalised COVID-19 |        757        2.72      100.00
-----------------------------+-----------------------------------
                       Total |     27,817      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(26,203 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(26,219 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(26,215 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(26,225 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(1,592 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(1,262 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(999 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(826 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Historical comparator"       ///
>                                                 1 "Pre-vaccination"          
>            ///
>                                                 2 "1 vaccine dose"           
>            ///
>                                                 3 "2 vaccine doses"          
>            ///
>                                                 4 "3 vaccine doses"          
>            ///
>                                                 5 "4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "Vaccination status"

. safetab covid_vax, m
10

   Vaccination status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,846       71.34       71.34
      Pre-vaccination |      3,292       11.83       83.18
       1 vaccine dose |        826        2.97       86.15
      2 vaccine doses |        999        3.59       89.74
      3 vaccine doses |      1,262        4.54       94.28
      4 vaccine doses |      1,592        5.72      100.00
----------------------+-----------------------------------
                Total |     27,817      100.00

. 
. * COVID-19 wave
. gen wave = case

. replace wave = 2 if index_month=="sep2020"
(354 real changes made)

. replace wave = 2 if index_month=="oct2020"
(368 real changes made)

. replace wave = 2 if index_month=="nov2020"
(327 real changes made)

. replace wave = 2 if index_month=="dec2020"
(349 real changes made)

. replace wave = 2 if index_month=="jan2021"
(281 real changes made)

. replace wave = 2 if index_month=="feb2021"
(229 real changes made)

. replace wave = 2 if index_month=="mar2021"
(280 real changes made)

. replace wave = 2 if index_month=="apr2021"
(205 real changes made)

. replace wave = 2 if index_month=="may2021"
(230 real changes made)

. replace wave = 2 if index_month=="jun2021"
(217 real changes made)

. replace wave = 3 if index_month=="jul2021"
(183 real changes made)

. replace wave = 3 if index_month=="aug2021"
(205 real changes made)

. replace wave = 3 if index_month=="sep2021"
(154 real changes made)

. replace wave = 3 if index_month=="oct2021"
(136 real changes made)

. replace wave = 3 if index_month=="nov2021"
(149 real changes made)

. replace wave = 4 if index_month=="dec2021"
(130 real changes made)

. replace wave = 4 if index_month=="jan2022"
(120 real changes made)

. replace wave = 4 if index_month=="feb2022"
(104 real changes made)

. replace wave = 4 if index_month=="mar2022"
(106 real changes made)

. replace wave = 4 if index_month=="apr2022"
(90 real changes made)

. replace wave = 4 if index_month=="may2022"
(100 real changes made)

. replace wave = 4 if index_month=="jun2022"
(102 real changes made)

. replace wave = 4 if index_month=="jul2022"
(67 real changes made)

. replace wave = 4 if index_month=="aug2022"
(85 real changes made)

. replace wave = 4 if index_month=="sep2022"
(49 real changes made)

. replace wave = 4 if index_month=="oct2022"
(70 real changes made)

. label define wave       0 "Historical comparator"       ///
>                                         1 "Febuary20-August20"  ///
>                                         2 "September20-June21"  ///
>                                         3 "July21-November21"   ///
>                                         4 "December21-October22"        

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m
5

        COVID-19 wave |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,846       71.34       71.34
   Febuary20-August20 |      3,281       11.79       83.14
   September20-June21 |      2,840       10.21       93.35
    July21-November21 |        827        2.97       96.32
 December21-October22 |      1,023        3.68      100.00
----------------------+-----------------------------------
                Total |     27,817      100.00

. 
. ** Covariates
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        247        0.89        0.89
         19 |        376        1.35        2.24
         20 |        390        1.40        3.64
         21 |        487        1.75        5.39
         22 |        534        1.92        7.31
         23 |        547        1.97        9.28
         24 |        578        2.08       11.36
         25 |        584        2.10       13.46
         26 |        571        2.05       15.51
         27 |        565        2.03       17.54
         28 |        554        1.99       19.53
         29 |        586        2.11       21.64
         30 |        552        1.98       23.62
         31 |        486        1.75       25.37
         32 |        563        2.02       27.39
         33 |        554        1.99       29.38
         34 |        550        1.98       31.36
         35 |        538        1.93       33.30
         36 |        551        1.98       35.28
         37 |        556        2.00       37.28
         38 |        574        2.06       39.34
         39 |        578        2.08       41.42
         40 |        579        2.08       43.50
         41 |        570        2.05       45.55
         42 |        517        1.86       47.41
         43 |        590        2.12       49.53
         44 |        544        1.96       51.48
         45 |        543        1.95       53.43
         46 |        554        1.99       55.43
         47 |        547        1.97       57.39
         48 |        533        1.92       59.31
         49 |        591        2.12       61.43
         50 |        574        2.06       63.50
         51 |        549        1.97       65.47
         52 |        560        2.01       67.48
         53 |        544        1.96       69.44
         54 |        524        1.88       71.32
         55 |        569        2.05       73.37
         56 |        526        1.89       75.26
         57 |        576        2.07       77.33
         58 |        578        2.08       79.41
         59 |        560        2.01       81.42
         60 |        534        1.92       83.34
         61 |        544        1.96       85.30
         62 |        562        2.02       87.32
         63 |        596        2.14       89.46
         64 |        565        2.03       91.49
         65 |        516        1.85       93.35
         66 |        532        1.91       95.26
         67 |        563        2.02       97.28
         68 |        299        1.07       98.36
         69 |        202        0.73       99.08
         70 |        167        0.60       99.68
         71 |         65        0.23       99.92
         72 |         23        0.08      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. safecount
  27,817

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///          
>                            
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(27817 differences between age and agegroup)

. 
. label var age "Age"

. label values age age

. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label var agegroup "Age group"

. label values agegroup agegroup

. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex
0

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,329       51.51       51.51
       Male |     13,488       48.49      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. safecount
  27,817

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(1,093 real changes made)

. replace ethnicity=2 if ethnicity==3
(1,044 real changes made)

. replace ethnicity=3 if ethnicity==4
(1,048 real changes made)

. replace ethnicity=4 if ethnicity==6
(1,093 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///          
>                                    
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                    
>                                            

. label values ethnicity ethnicity

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,655       59.87       59.87
South Asian |      1,044        3.75       63.63
      Black |      1,048        3.77       67.39
      Mixed |      1,093        3.93       71.32
      Other |      1,045        3.76       75.08
          . |      6,932       24.92      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(6,932 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(6,932 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. safetab ethnicity1, m
11

 ethnicity1 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,655       59.87       59.87
South Asian |      1,044        3.75       63.63
      Black |      1,048        3.77       67.39
      Mixed |      1,093        3.93       71.32
      Other |      1,045        3.76       75.08
    Unknown |      6,932       24.92      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,966       10.66       10.66
                Urban minor conurbation |      2,789       10.03       20.69
                    Urban city and town |      2,833       10.18       30.87
Urban city and town in a sparse setting |      2,754        9.90       40.77
                  Rural town and fringe |      2,777        9.98       50.76
Rural town and fringe in a sparse setti |      2,803       10.08       60.83
            Rural village and dispersed |      5,429       19.52       80.35
Rural village and dispersed in a sparse |      5,466       19.65      100.00
----------------------------------------+-----------------------------------
                                  Total |     27,817      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(27,817 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(11,342 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(16,475 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                      rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0      2,777 |    16,475 
     Urban |     2,966      2,789      2,833      2,754          0 |    11,342 
-----------+-------------------------------------------------------+----------
     Total |     2,966      2,789      2,833      2,754      2,777 |    27,817 


Urban/rura |           rural_urban
         l | Rural tow  Rural vil  Rural vil |     Total
-----------+---------------------------------+----------
     Rural |     2,803      5,429      5,466 |    16,475 
     Urban |         0          0          0 |    11,342 
-----------+---------------------------------+----------
     Total |     2,803      5,429      5,466 |    27,817 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Historical comparator |    11,704      8,142 |    19,846 
           SARS-CoV-2 |     4,771      3,200 |     7,971 
----------------------+----------------------+----------
                Total |    16,475     11,342 |    27,817 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,849 real changes made, 2,849 to missing)

. gen     bmi = .
(27,817 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(bmi: 1701 changes made)

. recode  bmi . = 2 if body_mass_index<25
(bmi: 6297 changes made)

. recode  bmi . = 3 if body_mass_index<30
(bmi: 6525 changes made)

. recode  bmi . = 4 if body_mass_index<35
(bmi: 5571 changes made)

. recode  bmi . = 5 if body_mass_index<40
(bmi: 3192 changes made)

. recode  bmi . = 6 if body_mass_index<.
(bmi: 1682 changes made)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>            

. label values bmi bmi

. safetab bmi, m
4

                 bmi |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,701        6.11        6.11
  Normal (18.5-24.9) |      6,297       22.64       28.75
Overweight (25-29.9) |      6,525       23.46       52.21
   Obese I (30-34.9) |      5,571       20.03       72.24
  Obese II (35-39.9) |      3,192       11.47       83.71
     Obese III (40+) |      1,682        6.05       89.76
                   . |      2,849       10.24      100.00
---------------------+-----------------------------------
               Total |     27,817      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(24,482 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(620 real changes made)

. replace smoking = 0 if smoking_status=="N"
(1,114 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m
8

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |      1,114        4.00        4.00
Current/former smoker |      3,955       14.22       18.22
                    . |     22,748       81.78      100.00
----------------------+-----------------------------------
                Total |     27,817      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000
> )
(12351 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(egfr_group: 15466 changes made)

. label define egfr_group 1 "105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "
> 30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m
11

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       105 |      4,956       17.82       17.82
     90-104 |      2,193        7.88       25.70
      75-89 |      2,048        7.36       33.06
      60-74 |      2,459        8.84       41.90
      45-59 |      2,459        8.84       50.74
      30-44 |      1,230        4.42       55.16
      15-29 |        121        0.43       55.60
          . |     12,351       44.40      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 1
> 5-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(12,351 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(ckd_stage: 22861 changes made)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6
>  "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m
10

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |     11,656       41.90       41.90
                      CKD 3A |      2,459        8.84       50.74
                      CKD 3B |      1,230        4.42       55.16
                       CKD 4 |        121        0.43       55.60
No baseline eGFR measurement |     12,351       44.40      100.00
-----------------------------+-----------------------------------
                       Total |     27,817      100.00

. 
. * Comorbidities
. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib
0

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,398       94.90       94.90
          1 |      1,419        5.10      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver
0

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,264       98.01       98.01
          1 |        553        1.99      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. safetab diabetes
0

   diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,254       80.00       80.00
          1 |      5,563       20.00      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer
0

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,543       99.01       99.01
          1 |        274        0.99      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. safetab heart_failure
0

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,732       96.10       96.10
          1 |      1,085        3.90      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. safetab hiv
0

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,250       97.96       97.96
          1 |        567        2.04      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. safetab hypertension
0

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,251       79.99       79.99
          1 |      5,566       20.01      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. safetab non_haem_cancer
0

non_haem_ca |
       ncer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,255       97.98       97.98
          1 |        562        2.02      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. safetab myocardial_infarction
0

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,044       90.03       90.03
          1 |      2,773        9.97      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd
0

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,249       97.96       97.96
          1 |        568        2.04      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid
0

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,424       94.99       94.99
          1 |      1,393        5.01      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. safetab stroke
0

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,276       98.06       98.06
          1 |        541        1.94      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus
0

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,239       97.92       97.92
          1 |        578        2.08      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(1,044 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,522 real changes made)

. replace cardiovascular = 1 if pvd==1
(469 real changes made)

. replace cardiovascular = 1 if stroke==1
(429 real changes made)

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(560 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,337 real changes made)

. replace immunosuppressed = 1 if lupus==1
(536 real changes made)

. safetab cardiovascular
0

cardiovascu |
        lar |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,934       78.85       78.85
          1 |      5,883       21.15      100.00
------------+-----------------------------------
      Total |     27,817      100.00

. safetab immunosuppressed
0

immunosuppr |
      essed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,110       90.27       90.27
          1 |      2,707        9.73      100.00
------------+-----------------------------------
      Total |     27,817      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                              
>    creatinine_mar2017 ///
>                                                                              
>    creatinine_apr2017 ///
>                                                                              
>    creatinine_may2017 ///
>                                                                              
>    creatinine_jun2017 ///
>                                                                              
>    creatinine_jul2017 ///
>                                                                              
>    creatinine_aug2017 ///
>                                                                              
>    creatinine_sep2017 ///
>                                                                              
>    creatinine_oct2017 ///
>                                                                              
>    creatinine_nov2017 ///
>                                                                              
>    creatinine_dec2017 ///
>                                                                              
>    creatinine_jan2018 ///
>                                                                              
>    creatinine_feb2018 ///
>                                                                              
>    creatinine_mar2018 ///
>                                                                              
>    creatinine_apr2018 ///
>                                                                              
>    creatinine_may2018 ///
>                                                                              
>    creatinine_jun2018 ///
>                                                                              
>    creatinine_jul2018 ///
>                                                                              
>    creatinine_aug2018 ///
>                                                                              
>    creatinine_sep2018 ///
>                                                                              
>    creatinine_oct2018 ///
>                                                                              
>    creatinine_nov2018 ///
>                                                                              
>    creatinine_dec2018 ///
>                                                                              
>    creatinine_jan2019 ///
>                                                                              
>    creatinine_feb2019 ///
>                                                                              
>    creatinine_mar2019 ///
>                                                                              
>    creatinine_apr2019 ///
>                                                                              
>    creatinine_may2019 ///
>                                                                              
>    creatinine_jun2019 ///
>                                                                              
>    creatinine_jul2019 ///
>                                                                              
>    creatinine_aug2019 ///
>                                                                              
>    creatinine_sep2019 ///
>                                                                              
>    creatinine_feb2020 ///
>                                                                              
>    creatinine_mar2020 ///
>                                                                              
>    creatinine_apr2020 ///
>                                                                              
>    creatinine_may2020 ///
>                                                                              
>    creatinine_jun2020 ///
>                                                                              
>    creatinine_jul2020 ///
>                                                                              
>    creatinine_aug2020 ///
>                                                                              
>    creatinine_sep2020 ///
>                                                                              
>    creatinine_oct2020 ///
>                                                                              
>    creatinine_nov2020 ///
>                                                                              
>    creatinine_dec2020 ///
>                                                                              
>    creatinine_jan2021 ///
>                                                                              
>    creatinine_feb2021 ///
>                                                                              
>    creatinine_mar2021 ///
>                                                                              
>    creatinine_apr2021 ///
>                                                                              
>    creatinine_may2021 ///
>                                                                              
>    creatinine_jun2021 ///
>                                                                              
>    creatinine_jul2021 ///
>                                                                              
>    creatinine_aug2021 ///
>                                                                              
>    creatinine_sep2021 ///
>                                                                              
>    creatinine_oct2021 ///
>                                                                              
>    creatinine_nov2021 ///
>                                                                              
>    creatinine_dec2021 ///
>                                                                              
>    creatinine_jan2022 ///
>                                                                              
>    creatinine_feb2022 ///
>                                                                              
>    creatinine_mar2022 ///
>                                                                              
>    creatinine_apr2022 ///
>                                                                              
>    creatinine_may2022 ///
>                                                                              
>    creatinine_jun2022 ///
>                                                                              
>    creatinine_jul2022 ///
>                                                                              
>    creatinine_aug2022 ///
>                                                                              
>    creatinine_sep2022 ///
>                                                                              
>    creatinine_oct2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 300
> 0)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex=
> =0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex=
> =1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_m
> onthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex
> ==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(8,698 real changes made, 8,698 to missing)
(16,669 missing values generated)
(27,817 missing values generated)
(5,689 real changes made)
(5,459 real changes made)
(5,689 real changes made)
(5,459 real changes made)
(7,025 real changes made)
(27,817 missing values generated)
(5,689 real changes made)
(5,459 real changes made)
(11,148 real changes made)
(20,792 real changes made)
(16,669 missing values generated)
(11,148 real changes made)
(5,689 real changes made)
(8,721 real changes made, 8,721 to missing)
(16,692 missing values generated)
(27,817 missing values generated)
(5,710 real changes made)
(5,415 real changes made)
(5,710 real changes made)
(5,415 real changes made)
(7,173 real changes made)
(27,817 missing values generated)
(5,710 real changes made)
(5,415 real changes made)
(11,125 real changes made)
(20,644 real changes made)
(16,692 missing values generated)
(11,125 real changes made)
(5,710 real changes made)
(8,728 real changes made, 8,728 to missing)
(16,699 missing values generated)
(27,817 missing values generated)
(5,758 real changes made)
(5,360 real changes made)
(5,758 real changes made)
(5,360 real changes made)
(7,038 real changes made)
(27,817 missing values generated)
(5,758 real changes made)
(5,360 real changes made)
(11,118 real changes made)
(20,779 real changes made)
(16,699 missing values generated)
(11,118 real changes made)
(5,758 real changes made)
(8,771 real changes made, 8,771 to missing)
(16,742 missing values generated)
(27,817 missing values generated)
(5,680 real changes made)
(5,395 real changes made)
(5,680 real changes made)
(5,395 real changes made)
(7,068 real changes made)
(27,817 missing values generated)
(5,680 real changes made)
(5,395 real changes made)
(11,075 real changes made)
(20,749 real changes made)
(16,742 missing values generated)
(11,075 real changes made)
(5,680 real changes made)
(8,739 real changes made, 8,739 to missing)
(16,710 missing values generated)
(27,817 missing values generated)
(5,720 real changes made)
(5,387 real changes made)
(5,720 real changes made)
(5,387 real changes made)
(7,011 real changes made)
(27,817 missing values generated)
(5,720 real changes made)
(5,387 real changes made)
(11,107 real changes made)
(20,806 real changes made)
(16,710 missing values generated)
(11,107 real changes made)
(5,720 real changes made)
(8,685 real changes made, 8,685 to missing)
(16,656 missing values generated)
(27,817 missing values generated)
(5,729 real changes made)
(5,432 real changes made)
(5,729 real changes made)
(5,432 real changes made)
(7,090 real changes made)
(27,817 missing values generated)
(5,729 real changes made)
(5,432 real changes made)
(11,161 real changes made)
(20,727 real changes made)
(16,656 missing values generated)
(11,161 real changes made)
(5,729 real changes made)
(8,777 real changes made, 8,777 to missing)
(16,748 missing values generated)
(27,817 missing values generated)
(5,654 real changes made)
(5,415 real changes made)
(5,654 real changes made)
(5,415 real changes made)
(7,032 real changes made)
(27,817 missing values generated)
(5,654 real changes made)
(5,415 real changes made)
(11,069 real changes made)
(20,785 real changes made)
(16,748 missing values generated)
(11,069 real changes made)
(5,654 real changes made)
(8,731 real changes made, 8,731 to missing)
(16,702 missing values generated)
(27,817 missing values generated)
(5,662 real changes made)
(5,453 real changes made)
(5,662 real changes made)
(5,453 real changes made)
(7,037 real changes made)
(27,817 missing values generated)
(5,662 real changes made)
(5,453 real changes made)
(11,115 real changes made)
(20,780 real changes made)
(16,702 missing values generated)
(11,115 real changes made)
(5,662 real changes made)
(8,717 real changes made, 8,717 to missing)
(16,688 missing values generated)
(27,817 missing values generated)
(5,727 real changes made)
(5,402 real changes made)
(5,727 real changes made)
(5,402 real changes made)
(7,001 real changes made)
(27,817 missing values generated)
(5,727 real changes made)
(5,402 real changes made)
(11,129 real changes made)
(20,816 real changes made)
(16,688 missing values generated)
(11,129 real changes made)
(5,727 real changes made)
(8,735 real changes made, 8,735 to missing)
(16,706 missing values generated)
(27,817 missing values generated)
(5,746 real changes made)
(5,365 real changes made)
(5,746 real changes made)
(5,365 real changes made)
(6,996 real changes made)
(27,817 missing values generated)
(5,746 real changes made)
(5,365 real changes made)
(11,111 real changes made)
(20,821 real changes made)
(16,706 missing values generated)
(11,111 real changes made)
(5,746 real changes made)
(8,783 real changes made, 8,783 to missing)
(16,754 missing values generated)
(27,817 missing values generated)
(5,755 real changes made)
(5,308 real changes made)
(5,755 real changes made)
(5,308 real changes made)
(7,059 real changes made)
(27,817 missing values generated)
(5,755 real changes made)
(5,308 real changes made)
(11,063 real changes made)
(20,758 real changes made)
(16,754 missing values generated)
(11,063 real changes made)
(5,755 real changes made)
(8,828 real changes made, 8,828 to missing)
(16,799 missing values generated)
(27,817 missing values generated)
(5,768 real changes made)
(5,250 real changes made)
(5,768 real changes made)
(5,250 real changes made)
(6,980 real changes made)
(27,817 missing values generated)
(5,768 real changes made)
(5,250 real changes made)
(11,018 real changes made)
(20,837 real changes made)
(16,799 missing values generated)
(11,018 real changes made)
(5,768 real changes made)
(8,728 real changes made, 8,728 to missing)
(16,699 missing values generated)
(27,817 missing values generated)
(5,807 real changes made)
(5,311 real changes made)
(5,807 real changes made)
(5,311 real changes made)
(7,020 real changes made)
(27,817 missing values generated)
(5,807 real changes made)
(5,311 real changes made)
(11,118 real changes made)
(20,797 real changes made)
(16,699 missing values generated)
(11,118 real changes made)
(5,807 real changes made)
(8,701 real changes made, 8,701 to missing)
(16,672 missing values generated)
(27,817 missing values generated)
(5,755 real changes made)
(5,390 real changes made)
(5,755 real changes made)
(5,390 real changes made)
(7,081 real changes made)
(27,817 missing values generated)
(5,755 real changes made)
(5,390 real changes made)
(11,145 real changes made)
(20,736 real changes made)
(16,672 missing values generated)
(11,145 real changes made)
(5,755 real changes made)
(8,675 real changes made, 8,675 to missing)
(16,646 missing values generated)
(27,817 missing values generated)
(5,780 real changes made)
(5,391 real changes made)
(5,780 real changes made)
(5,391 real changes made)
(7,045 real changes made)
(27,817 missing values generated)
(5,780 real changes made)
(5,391 real changes made)
(11,171 real changes made)
(20,772 real changes made)
(16,646 missing values generated)
(11,171 real changes made)
(5,780 real changes made)
(8,682 real changes made, 8,682 to missing)
(16,653 missing values generated)
(27,817 missing values generated)
(5,776 real changes made)
(5,388 real changes made)
(5,776 real changes made)
(5,388 real changes made)
(7,036 real changes made)
(27,817 missing values generated)
(5,776 real changes made)
(5,388 real changes made)
(11,164 real changes made)
(20,781 real changes made)
(16,653 missing values generated)
(11,164 real changes made)
(5,776 real changes made)
(8,757 real changes made, 8,757 to missing)
(16,728 missing values generated)
(27,817 missing values generated)
(5,764 real changes made)
(5,325 real changes made)
(5,764 real changes made)
(5,325 real changes made)
(7,001 real changes made)
(27,817 missing values generated)
(5,764 real changes made)
(5,325 real changes made)
(11,089 real changes made)
(20,816 real changes made)
(16,728 missing values generated)
(11,089 real changes made)
(5,764 real changes made)
(8,721 real changes made, 8,721 to missing)
(16,692 missing values generated)
(27,817 missing values generated)
(5,748 real changes made)
(5,377 real changes made)
(5,748 real changes made)
(5,377 real changes made)
(7,130 real changes made)
(27,817 missing values generated)
(5,748 real changes made)
(5,377 real changes made)
(11,125 real changes made)
(20,687 real changes made)
(16,692 missing values generated)
(11,125 real changes made)
(5,748 real changes made)
(8,745 real changes made, 8,745 to missing)
(16,716 missing values generated)
(27,817 missing values generated)
(5,750 real changes made)
(5,351 real changes made)
(5,750 real changes made)
(5,351 real changes made)
(7,033 real changes made)
(27,817 missing values generated)
(5,750 real changes made)
(5,351 real changes made)
(11,101 real changes made)
(20,784 real changes made)
(16,716 missing values generated)
(11,101 real changes made)
(5,750 real changes made)
(8,745 real changes made, 8,745 to missing)
(16,716 missing values generated)
(27,817 missing values generated)
(5,779 real changes made)
(5,322 real changes made)
(5,779 real changes made)
(5,322 real changes made)
(6,962 real changes made)
(27,817 missing values generated)
(5,779 real changes made)
(5,322 real changes made)
(11,101 real changes made)
(20,855 real changes made)
(16,716 missing values generated)
(11,101 real changes made)
(5,779 real changes made)
(8,702 real changes made, 8,702 to missing)
(16,673 missing values generated)
(27,817 missing values generated)
(5,692 real changes made)
(5,452 real changes made)
(5,692 real changes made)
(5,452 real changes made)
(7,012 real changes made)
(27,817 missing values generated)
(5,692 real changes made)
(5,452 real changes made)
(11,144 real changes made)
(20,805 real changes made)
(16,673 missing values generated)
(11,144 real changes made)
(5,692 real changes made)
(8,670 real changes made, 8,670 to missing)
(16,641 missing values generated)
(27,817 missing values generated)
(5,797 real changes made)
(5,379 real changes made)
(5,797 real changes made)
(5,379 real changes made)
(7,158 real changes made)
(27,817 missing values generated)
(5,797 real changes made)
(5,379 real changes made)
(11,176 real changes made)
(20,659 real changes made)
(16,641 missing values generated)
(11,176 real changes made)
(5,797 real changes made)
(8,751 real changes made, 8,751 to missing)
(16,722 missing values generated)
(27,817 missing values generated)
(5,674 real changes made)
(5,421 real changes made)
(5,674 real changes made)
(5,421 real changes made)
(7,037 real changes made)
(27,817 missing values generated)
(5,674 real changes made)
(5,421 real changes made)
(11,095 real changes made)
(20,780 real changes made)
(16,722 missing values generated)
(11,095 real changes made)
(5,674 real changes made)
(8,763 real changes made, 8,763 to missing)
(16,734 missing values generated)
(27,817 missing values generated)
(5,751 real changes made)
(5,332 real changes made)
(5,751 real changes made)
(5,332 real changes made)
(7,069 real changes made)
(27,817 missing values generated)
(5,751 real changes made)
(5,332 real changes made)
(11,083 real changes made)
(20,748 real changes made)
(16,734 missing values generated)
(11,083 real changes made)
(5,751 real changes made)
(8,711 real changes made, 8,711 to missing)
(16,682 missing values generated)
(27,817 missing values generated)
(5,788 real changes made)
(5,347 real changes made)
(5,788 real changes made)
(5,347 real changes made)
(7,145 real changes made)
(27,817 missing values generated)
(5,788 real changes made)
(5,347 real changes made)
(11,135 real changes made)
(20,672 real changes made)
(16,682 missing values generated)
(11,135 real changes made)
(5,788 real changes made)
(8,746 real changes made, 8,746 to missing)
(16,717 missing values generated)
(27,817 missing values generated)
(5,688 real changes made)
(5,412 real changes made)
(5,688 real changes made)
(5,412 real changes made)
(7,082 real changes made)
(27,817 missing values generated)
(5,688 real changes made)
(5,412 real changes made)
(11,100 real changes made)
(20,735 real changes made)
(16,717 missing values generated)
(11,100 real changes made)
(5,688 real changes made)
(8,681 real changes made, 8,681 to missing)
(16,652 missing values generated)
(27,817 missing values generated)
(5,736 real changes made)
(5,429 real changes made)
(5,736 real changes made)
(5,429 real changes made)
(7,075 real changes made)
(27,817 missing values generated)
(5,736 real changes made)
(5,429 real changes made)
(11,165 real changes made)
(20,742 real changes made)
(16,652 missing values generated)
(11,165 real changes made)
(5,736 real changes made)
(8,641 real changes made, 8,641 to missing)
(16,612 missing values generated)
(27,817 missing values generated)
(5,801 real changes made)
(5,404 real changes made)
(5,801 real changes made)
(5,404 real changes made)
(7,063 real changes made)
(27,817 missing values generated)
(5,801 real changes made)
(5,404 real changes made)
(11,205 real changes made)
(20,754 real changes made)
(16,612 missing values generated)
(11,205 real changes made)
(5,801 real changes made)
(8,722 real changes made, 8,722 to missing)
(16,693 missing values generated)
(27,817 missing values generated)
(5,697 real changes made)
(5,427 real changes made)
(5,697 real changes made)
(5,427 real changes made)
(7,062 real changes made)
(27,817 missing values generated)
(5,697 real changes made)
(5,427 real changes made)
(11,124 real changes made)
(20,755 real changes made)
(16,693 missing values generated)
(11,124 real changes made)
(5,697 real changes made)
(8,694 real changes made, 8,694 to missing)
(16,665 missing values generated)
(27,817 missing values generated)
(5,649 real changes made)
(5,503 real changes made)
(5,649 real changes made)
(5,503 real changes made)
(7,077 real changes made)
(27,817 missing values generated)
(5,649 real changes made)
(5,503 real changes made)
(11,152 real changes made)
(20,740 real changes made)
(16,665 missing values generated)
(11,152 real changes made)
(5,649 real changes made)
(8,773 real changes made, 8,773 to missing)
(16,744 missing values generated)
(27,817 missing values generated)
(5,761 real changes made)
(5,312 real changes made)
(5,761 real changes made)
(5,312 real changes made)
(7,050 real changes made)
(27,817 missing values generated)
(5,761 real changes made)
(5,312 real changes made)
(11,073 real changes made)
(20,767 real changes made)
(16,744 missing values generated)
(11,073 real changes made)
(5,761 real changes made)
(8,698 real changes made, 8,698 to missing)
(16,669 missing values generated)
(27,817 missing values generated)
(5,747 real changes made)
(5,401 real changes made)
(5,747 real changes made)
(5,401 real changes made)
(7,090 real changes made)
(27,817 missing values generated)
(5,747 real changes made)
(5,401 real changes made)
(11,148 real changes made)
(20,727 real changes made)
(16,669 missing values generated)
(11,148 real changes made)
(5,747 real changes made)
(3,494 real changes made, 3,494 to missing)
(23,340 missing values generated)
(27,817 missing values generated)
(2,280 real changes made)
(2,197 real changes made)
(2,280 real changes made)
(2,197 real changes made)
(2,808 real changes made)
(27,817 missing values generated)
(2,280 real changes made)
(2,197 real changes made)
(4,477 real changes made)
(25,009 real changes made)
(23,340 missing values generated)
(4,477 real changes made)
(2,280 real changes made)
(3,508 real changes made, 3,508 to missing)
(23,354 missing values generated)
(27,817 missing values generated)
(2,285 real changes made)
(2,178 real changes made)
(2,285 real changes made)
(2,178 real changes made)
(2,820 real changes made)
(27,817 missing values generated)
(2,285 real changes made)
(2,178 real changes made)
(4,463 real changes made)
(24,997 real changes made)
(23,354 missing values generated)
(4,463 real changes made)
(2,285 real changes made)
(3,498 real changes made, 3,498 to missing)
(23,344 missing values generated)
(27,817 missing values generated)
(2,276 real changes made)
(2,197 real changes made)
(2,276 real changes made)
(2,197 real changes made)
(2,831 real changes made)
(27,817 missing values generated)
(2,276 real changes made)
(2,197 real changes made)
(4,473 real changes made)
(24,986 real changes made)
(23,344 missing values generated)
(4,473 real changes made)
(2,276 real changes made)
(3,456 real changes made, 3,456 to missing)
(23,302 missing values generated)
(27,817 missing values generated)
(2,338 real changes made)
(2,177 real changes made)
(2,338 real changes made)
(2,177 real changes made)
(2,879 real changes made)
(27,817 missing values generated)
(2,338 real changes made)
(2,177 real changes made)
(4,515 real changes made)
(24,938 real changes made)
(23,302 missing values generated)
(4,515 real changes made)
(2,338 real changes made)
(3,496 real changes made, 3,496 to missing)
(23,342 missing values generated)
(27,817 missing values generated)
(2,316 real changes made)
(2,159 real changes made)
(2,316 real changes made)
(2,159 real changes made)
(2,887 real changes made)
(27,817 missing values generated)
(2,316 real changes made)
(2,159 real changes made)
(4,475 real changes made)
(24,930 real changes made)
(23,342 missing values generated)
(4,475 real changes made)
(2,316 real changes made)
(3,487 real changes made, 3,487 to missing)
(23,333 missing values generated)
(27,817 missing values generated)
(2,328 real changes made)
(2,156 real changes made)
(2,328 real changes made)
(2,156 real changes made)
(2,860 real changes made)
(27,817 missing values generated)
(2,328 real changes made)
(2,156 real changes made)
(4,484 real changes made)
(24,957 real changes made)
(23,333 missing values generated)
(4,484 real changes made)
(2,328 real changes made)
(3,540 real changes made, 3,540 to missing)
(23,386 missing values generated)
(27,817 missing values generated)
(2,250 real changes made)
(2,181 real changes made)
(2,250 real changes made)
(2,181 real changes made)
(2,812 real changes made)
(27,817 missing values generated)
(2,250 real changes made)
(2,181 real changes made)
(4,431 real changes made)
(25,005 real changes made)
(23,386 missing values generated)
(4,431 real changes made)
(2,250 real changes made)
(3,491 real changes made, 3,491 to missing)
(23,337 missing values generated)
(27,817 missing values generated)
(2,301 real changes made)
(2,179 real changes made)
(2,301 real changes made)
(2,179 real changes made)
(2,821 real changes made)
(27,817 missing values generated)
(2,301 real changes made)
(2,179 real changes made)
(4,480 real changes made)
(24,996 real changes made)
(23,337 missing values generated)
(4,480 real changes made)
(2,301 real changes made)
(3,522 real changes made, 3,522 to missing)
(23,368 missing values generated)
(27,817 missing values generated)
(2,301 real changes made)
(2,148 real changes made)
(2,301 real changes made)
(2,148 real changes made)
(2,840 real changes made)
(27,817 missing values generated)
(2,301 real changes made)
(2,148 real changes made)
(4,449 real changes made)
(24,977 real changes made)
(23,368 missing values generated)
(4,449 real changes made)
(2,301 real changes made)
(3,500 real changes made, 3,500 to missing)
(23,346 missing values generated)
(27,817 missing values generated)
(2,292 real changes made)
(2,179 real changes made)
(2,292 real changes made)
(2,179 real changes made)
(2,836 real changes made)
(27,817 missing values generated)
(2,292 real changes made)
(2,179 real changes made)
(4,471 real changes made)
(24,981 real changes made)
(23,346 missing values generated)
(4,471 real changes made)
(2,292 real changes made)
(3,524 real changes made, 3,524 to missing)
(23,370 missing values generated)
(27,817 missing values generated)
(2,281 real changes made)
(2,166 real changes made)
(2,281 real changes made)
(2,166 real changes made)
(2,803 real changes made)
(27,817 missing values generated)
(2,281 real changes made)
(2,166 real changes made)
(4,447 real changes made)
(25,014 real changes made)
(23,370 missing values generated)
(4,447 real changes made)
(2,281 real changes made)
(3,510 real changes made, 3,510 to missing)
(23,356 missing values generated)
(27,817 missing values generated)
(2,282 real changes made)
(2,179 real changes made)
(2,282 real changes made)
(2,179 real changes made)
(2,826 real changes made)
(27,817 missing values generated)
(2,282 real changes made)
(2,179 real changes made)
(4,461 real changes made)
(24,991 real changes made)
(23,356 missing values generated)
(4,461 real changes made)
(2,282 real changes made)
(3,518 real changes made, 3,518 to missing)
(23,364 missing values generated)
(27,817 missing values generated)
(2,295 real changes made)
(2,158 real changes made)
(2,295 real changes made)
(2,158 real changes made)
(2,815 real changes made)
(27,817 missing values generated)
(2,295 real changes made)
(2,158 real changes made)
(4,453 real changes made)
(25,002 real changes made)
(23,364 missing values generated)
(4,453 real changes made)
(2,295 real changes made)
(3,552 real changes made, 3,552 to missing)
(23,398 missing values generated)
(27,817 missing values generated)
(2,272 real changes made)
(2,147 real changes made)
(2,272 real changes made)
(2,147 real changes made)
(2,780 real changes made)
(27,817 missing values generated)
(2,272 real changes made)
(2,147 real changes made)
(4,419 real changes made)
(25,037 real changes made)
(23,398 missing values generated)
(4,419 real changes made)
(2,272 real changes made)
(3,491 real changes made, 3,491 to missing)
(23,337 missing values generated)
(27,817 missing values generated)
(2,293 real changes made)
(2,187 real changes made)
(2,293 real changes made)
(2,187 real changes made)
(2,882 real changes made)
(27,817 missing values generated)
(2,293 real changes made)
(2,187 real changes made)
(4,480 real changes made)
(24,935 real changes made)
(23,337 missing values generated)
(4,480 real changes made)
(2,293 real changes made)
(3,559 real changes made, 3,559 to missing)
(23,405 missing values generated)
(27,817 missing values generated)
(2,276 real changes made)
(2,136 real changes made)
(2,276 real changes made)
(2,136 real changes made)
(2,840 real changes made)
(27,817 missing values generated)
(2,276 real changes made)
(2,136 real changes made)
(4,412 real changes made)
(24,977 real changes made)
(23,405 missing values generated)
(4,412 real changes made)
(2,276 real changes made)
(3,549 real changes made, 3,549 to missing)
(23,395 missing values generated)
(27,817 missing values generated)
(2,238 real changes made)
(2,184 real changes made)
(2,238 real changes made)
(2,184 real changes made)
(2,784 real changes made)
(27,817 missing values generated)
(2,238 real changes made)
(2,184 real changes made)
(4,422 real changes made)
(25,033 real changes made)
(23,395 missing values generated)
(4,422 real changes made)
(2,238 real changes made)
(3,513 real changes made, 3,513 to missing)
(23,359 missing values generated)
(27,817 missing values generated)
(2,289 real changes made)
(2,169 real changes made)
(2,289 real changes made)
(2,169 real changes made)
(2,837 real changes made)
(27,817 missing values generated)
(2,289 real changes made)
(2,169 real changes made)
(4,458 real changes made)
(24,980 real changes made)
(23,359 missing values generated)
(4,458 real changes made)
(2,289 real changes made)
(3,535 real changes made, 3,535 to missing)
(23,381 missing values generated)
(27,817 missing values generated)
(2,283 real changes made)
(2,153 real changes made)
(2,283 real changes made)
(2,153 real changes made)
(2,783 real changes made)
(27,817 missing values generated)
(2,283 real changes made)
(2,153 real changes made)
(4,436 real changes made)
(25,034 real changes made)
(23,381 missing values generated)
(4,436 real changes made)
(2,283 real changes made)
(3,502 real changes made, 3,502 to missing)
(23,348 missing values generated)
(27,817 missing values generated)
(2,311 real changes made)
(2,158 real changes made)
(2,311 real changes made)
(2,158 real changes made)
(2,854 real changes made)
(27,817 missing values generated)
(2,311 real changes made)
(2,158 real changes made)
(4,469 real changes made)
(24,963 real changes made)
(23,348 missing values generated)
(4,469 real changes made)
(2,311 real changes made)
(3,505 real changes made, 3,505 to missing)
(23,351 missing values generated)
(27,817 missing values generated)
(2,311 real changes made)
(2,155 real changes made)
(2,311 real changes made)
(2,155 real changes made)
(2,813 real changes made)
(27,817 missing values generated)
(2,311 real changes made)
(2,155 real changes made)
(4,466 real changes made)
(25,004 real changes made)
(23,351 missing values generated)
(4,466 real changes made)
(2,311 real changes made)
(3,477 real changes made, 3,477 to missing)
(23,323 missing values generated)
(27,817 missing values generated)
(2,300 real changes made)
(2,194 real changes made)
(2,300 real changes made)
(2,194 real changes made)
(2,834 real changes made)
(27,817 missing values generated)
(2,300 real changes made)
(2,194 real changes made)
(4,494 real changes made)
(24,983 real changes made)
(23,323 missing values generated)
(4,494 real changes made)
(2,300 real changes made)
(3,549 real changes made, 3,549 to missing)
(23,395 missing values generated)
(27,817 missing values generated)
(2,282 real changes made)
(2,140 real changes made)
(2,282 real changes made)
(2,140 real changes made)
(2,824 real changes made)
(27,817 missing values generated)
(2,282 real changes made)
(2,140 real changes made)
(4,422 real changes made)
(24,993 real changes made)
(23,395 missing values generated)
(4,422 real changes made)
(2,282 real changes made)
(3,504 real changes made, 3,504 to missing)
(23,350 missing values generated)
(27,817 missing values generated)
(2,271 real changes made)
(2,196 real changes made)
(2,271 real changes made)
(2,196 real changes made)
(2,808 real changes made)
(27,817 missing values generated)
(2,271 real changes made)
(2,196 real changes made)
(4,467 real changes made)
(25,009 real changes made)
(23,350 missing values generated)
(4,467 real changes made)
(2,271 real changes made)
(3,506 real changes made, 3,506 to missing)
(23,352 missing values generated)
(27,817 missing values generated)
(2,245 real changes made)
(2,220 real changes made)
(2,245 real changes made)
(2,220 real changes made)
(2,828 real changes made)
(27,817 missing values generated)
(2,245 real changes made)
(2,220 real changes made)
(4,465 real changes made)
(24,989 real changes made)
(23,352 missing values generated)
(4,465 real changes made)
(2,245 real changes made)
(3,590 real changes made, 3,590 to missing)
(23,436 missing values generated)
(27,817 missing values generated)
(2,222 real changes made)
(2,159 real changes made)
(2,222 real changes made)
(2,159 real changes made)
(2,747 real changes made)
(27,817 missing values generated)
(2,222 real changes made)
(2,159 real changes made)
(4,381 real changes made)
(25,070 real changes made)
(23,436 missing values generated)
(4,381 real changes made)
(2,222 real changes made)
(3,566 real changes made, 3,566 to missing)
(23,412 missing values generated)
(27,817 missing values generated)
(2,256 real changes made)
(2,149 real changes made)
(2,256 real changes made)
(2,149 real changes made)
(2,819 real changes made)
(27,817 missing values generated)
(2,256 real changes made)
(2,149 real changes made)
(4,405 real changes made)
(24,998 real changes made)
(23,412 missing values generated)
(4,405 real changes made)
(2,256 real changes made)
(3,472 real changes made, 3,472 to missing)
(23,318 missing values generated)
(27,817 missing values generated)
(2,322 real changes made)
(2,177 real changes made)
(2,322 real changes made)
(2,177 real changes made)
(2,801 real changes made)
(27,817 missing values generated)
(2,322 real changes made)
(2,177 real changes made)
(4,499 real changes made)
(25,016 real changes made)
(23,318 missing values generated)
(4,499 real changes made)
(2,322 real changes made)
(3,519 real changes made, 3,519 to missing)
(23,365 missing values generated)
(27,817 missing values generated)
(2,257 real changes made)
(2,195 real changes made)
(2,257 real changes made)
(2,195 real changes made)
(2,858 real changes made)
(27,817 missing values generated)
(2,257 real changes made)
(2,195 real changes made)
(4,452 real changes made)
(24,959 real changes made)
(23,365 missing values generated)
(4,452 real changes made)
(2,257 real changes made)
(3,540 real changes made, 3,540 to missing)
(23,386 missing values generated)
(27,817 missing values generated)
(2,229 real changes made)
(2,202 real changes made)
(2,229 real changes made)
(2,202 real changes made)
(2,862 real changes made)
(27,817 missing values generated)
(2,229 real changes made)
(2,202 real changes made)
(4,431 real changes made)
(24,955 real changes made)
(23,386 missing values generated)
(4,431 real changes made)
(2,229 real changes made)
(3,495 real changes made, 3,495 to missing)
(23,341 missing values generated)
(27,817 missing values generated)
(2,277 real changes made)
(2,199 real changes made)
(2,277 real changes made)
(2,199 real changes made)
(2,822 real changes made)
(27,817 missing values generated)
(2,277 real changes made)
(2,199 real changes made)
(4,476 real changes made)
(24,995 real changes made)
(23,341 missing values generated)
(4,476 real changes made)
(2,277 real changes made)
(3,513 real changes made, 3,513 to missing)
(23,359 missing values generated)
(27,817 missing values generated)
(2,273 real changes made)
(2,185 real changes made)
(2,273 real changes made)
(2,185 real changes made)
(2,811 real changes made)
(27,817 missing values generated)
(2,273 real changes made)
(2,185 real changes made)
(4,458 real changes made)
(25,006 real changes made)
(23,359 missing values generated)
(4,458 real changes made)
(2,273 real changes made)
(3,532 real changes made, 3,532 to missing)
(23,378 missing values generated)
(27,817 missing values generated)
(2,306 real changes made)
(2,133 real changes made)
(2,306 real changes made)
(2,133 real changes made)
(2,841 real changes made)
(27,817 missing values generated)
(2,306 real changes made)
(2,133 real changes made)
(4,439 real changes made)
(24,976 real changes made)
(23,378 missing values generated)
(4,439 real changes made)
(2,306 real changes made)

. 
. replace index_date = index_date_28
(27,817 real changes made)

. drop index_date_28

. gen egfr15_date=.
(27,817 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatin
> ine_`x'<15 & date("01`x'", "DMY")>=index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen esrd_date = egfr15_date
(27,817 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if esrd_date==.
(2,777 real changes made)

. gen esrd = 0

. replace esrd = 1 if esrd_date!=.
(2,777 real changes made)

. label var esrd "Kidney failure"

. gen esrd_time = (esrd_date - index_date)
(25,040 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(25,040 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(esrd_time_cat: 2773 changes made)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"           
>            ///
>                                                         3 "1 to 28 days"     
>    ///
>                                                         4 "20 to 90 days"    
>    ///
>                                                         5 "91 to 180 days"   
>    ///
>                                                         6 "181 to 365 days"  
>    ///
>                                                         7 "366 to 730 days"  
>    ///
>                                                         8 "731 to 973 days"  
>    ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 covid_severit
> y  ///
>                                                                 covid_aki    
>            {
  2.                                                                 by `exposu
> re',sort: sum esrd_time, de
  3.                                                                 tab esrd_t
> ime_cat `exposure', m col chi
  4.                                                                 }

-------------------------------------------------------------------------------
-> case = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%           42              0       Obs               1,984
25%          160              0       Sum of Wgt.       1,984

50%          351                      Mean           372.5227
                        Largest       Std. Dev.      253.4847
75%          568            964
90%          743            966       Variance       64254.52
95%          825            976       Skewness       .3465365
99%          930            982       Kurtosis       2.153798

-------------------------------------------------------------------------------
-> case = SARS-CoV-2

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            6              0
10%           35              0       Obs                 793
25%          135              0       Sum of Wgt.         793

50%          320                      Mean           352.0202
                        Largest       Std. Dev.      250.7541
75%          546            939
90%          720            942       Variance       62877.61
95%          799            949       Skewness       .3956433
99%          919            952       Kurtosis       2.131796


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Historica  SARS-CoV- |     Total
----------------+----------------------+----------
         0 days |        91         35 |       126 
                |      0.46       0.44 |      0.45 
----------------+----------------------+----------
   1 to 28 days |        72         38 |       110 
                |      0.36       0.48 |      0.40 
----------------+----------------------+----------
  20 to 90 days |       149         74 |       223 
                |      0.75       0.93 |      0.80 
----------------+----------------------+----------
 91 to 180 days |       244         98 |       342 
                |      1.23       1.23 |      1.23 
----------------+----------------------+----------
181 to 365 days |       481        195 |       676 
                |      2.42       2.45 |      2.43 
----------------+----------------------+----------
366 to 730 days |       736        275 |     1,011 
                |      3.71       3.45 |      3.63 
----------------+----------------------+----------
731 to 973 days |       209         78 |       287 
                |      1.05       0.98 |      1.03 
----------------+----------------------+----------
      >973 days |         2          0 |         2 
                |      0.01       0.00 |      0.01 
----------------+----------------------+----------
              . |    17,862      7,178 |    25,040 
                |     90.00      90.05 |     90.02 
----------------+----------------------+----------
          Total |    19,846      7,971 |    27,817 
                |    100.00     100.00 |    100.00 

          Pearson chi2(8) =   6.3206   Pr = 0.611

-------------------------------------------------------------------------------
-> covid_severity = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%           42              0       Obs               1,984
25%          160              0       Sum of Wgt.       1,984

50%          351                      Mean           372.5227
                        Largest       Std. Dev.      253.4847
75%          568            964
90%          743            966       Variance       64254.52
95%          825            976       Skewness       .3465365
99%          930            982       Kurtosis       2.153798

-------------------------------------------------------------------------------
-> covid_severity = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           10              0
10%           40              0       Obs                 623
25%          133              0       Sum of Wgt.         623

50%          311                      Mean            346.183
                        Largest       Std. Dev.       248.511
75%          537            939
90%          720            942       Variance       61757.71
95%          797            949       Skewness       .4597985
99%          923            952       Kurtosis       2.234133

-------------------------------------------------------------------------------
-> covid_severity = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           21              1
10%           30              3       Obs                  78
25%          177             21       Sum of Wgt.          78

50%          440                      Mean           396.4872
                        Largest       Std. Dev.      249.8106
75%          578            807
90%          709            815       Variance       62405.32
95%          807            856       Skewness      -.0804598
99%          900            900       Kurtosis       1.910028

-------------------------------------------------------------------------------
-> covid_severity = Critical care COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            8              0       Obs                  92
25%          125              0       Sum of Wgt.          92

50%        289.5                      Mean           353.8478
                        Largest       Std. Dev.      265.2968
75%        570.5            842
90%          742            844       Variance       70382.42
95%          818            882       Skewness       .3771828
99%          895            895       Kurtosis       1.927168


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |             SARS-CoV-2 severity
  esrd_time_cat | Historica  Non-hospi  Hospitali  Critical  |     Total
----------------+--------------------------------------------+----------
         0 days |        91         25          1          9 |       126 
                |      0.46       0.39       0.13       1.18 |      0.45 
----------------+--------------------------------------------+----------
   1 to 28 days |        72         29          5          4 |       110 
                |      0.36       0.45       0.67       0.52 |      0.40 
----------------+--------------------------------------------+----------
  20 to 90 days |       149         63         10          1 |       223 
                |      0.75       0.97       1.35       0.13 |      0.80 
----------------+--------------------------------------------+----------
 91 to 180 days |       244         79          4         15 |       342 
                |      1.23       1.22       0.54       1.96 |      1.23 
----------------+--------------------------------------------+----------
181 to 365 days |       481        160         13         22 |       676 
                |      2.42       2.47       1.75       2.88 |      2.43 
----------------+--------------------------------------------+----------
366 to 730 days |       736        206         38         31 |     1,011 
                |      3.71       3.19       5.13       4.06 |      3.63 
----------------+--------------------------------------------+----------
731 to 973 days |       209         61          7         10 |       287 
                |      1.05       0.94       0.94       1.31 |      1.03 
----------------+--------------------------------------------+----------
      >973 days |         2          0          0          0 |         2 
                |      0.01       0.00       0.00       0.00 |      0.01 
----------------+--------------------------------------------+----------
              . |    17,862      5,843        663        672 |    25,040 
                |     90.00      90.36      89.47      87.96 |     90.02 
----------------+--------------------------------------------+----------
          Total |    19,846      6,466        741        764 |    27,817 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(24) =  43.6247   Pr = 0.008

-------------------------------------------------------------------------------
-> covid_aki = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%           42              0       Obs               1,984
25%          160              0       Sum of Wgt.       1,984

50%          351                      Mean           372.5227
                        Largest       Std. Dev.      253.4847
75%          568            964
90%          743            966       Variance       64254.52
95%          825            976       Skewness       .3465365
99%          930            982       Kurtosis       2.153798

-------------------------------------------------------------------------------
-> covid_aki = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            3              0
10%           39              0       Obs                 672
25%          139              0       Sum of Wgt.         672

50%          322                      Mean           352.9643
                        Largest       Std. Dev.      250.7962
75%        545.5            939
90%          733            942       Variance       62898.75
95%          801            949       Skewness       .4217767
99%          923            952       Kurtosis       2.187653

-------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           11              0
10%           28              1       Obs                  80
25%          147              3       Sum of Wgt.          80

50%          389                      Mean           373.4125
                        Largest       Std. Dev.       250.696
75%        567.5            807
90%          697            815       Variance       62848.47
95%          776            856       Skewness       .0511123
99%          900            900       Kurtosis       1.889251

-------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID-AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           25             23
10%           29             25       Obs                  41
25%           95             26       Sum of Wgt.          41

50%          214                      Mean           294.8049
                        Largest       Std. Dev.      247.8684
75%          542            717
90%          705            734       Variance       61438.76
95%          734            764       Skewness        .670801
99%          768            768       Kurtosis        1.99127


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |        COVID-19 acute kidney injury
  esrd_time_cat | Historica  Non-hospi  Hospitali  Hospitali |     Total
----------------+--------------------------------------------+----------
         0 days |        91         32          2          1 |       126 
                |      0.46       0.47       0.26       0.24 |      0.45 
----------------+--------------------------------------------+----------
   1 to 28 days |        72         29          6          3 |       110 
                |      0.36       0.43       0.79       0.73 |      0.40 
----------------+--------------------------------------------+----------
  20 to 90 days |       149         60          9          5 |       223 
                |      0.75       0.88       1.18       1.22 |      0.80 
----------------+--------------------------------------------+----------
 91 to 180 days |       244         83          6          9 |       342 
                |      1.23       1.22       0.79       2.19 |      1.23 
----------------+--------------------------------------------+----------
181 to 365 days |       481        170         15         10 |       676 
                |      2.42       2.50       1.97       2.43 |      2.43 
----------------+--------------------------------------------+----------
366 to 730 days |       736        229         36         10 |     1,011 
                |      3.71       3.37       4.72       2.43 |      3.63 
----------------+--------------------------------------------+----------
731 to 973 days |       209         69          6          3 |       287 
                |      1.05       1.02       0.79       0.73 |      1.03 
----------------+--------------------------------------------+----------
      >973 days |         2          0          0          0 |         2 
                |      0.01       0.00       0.00       0.00 |      0.01 
----------------+--------------------------------------------+----------
              . |    17,862      6,125        683        370 |    25,040 
                |     90.00      90.11      89.52      90.02 |     90.02 
----------------+--------------------------------------------+----------
          Total |    19,846      6,797        763        411 |    27,817 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(24) =  21.9139   Pr = 0.584

.         
. * Exit date
. gen exit_date = esrd_date
(25,040 missing values generated)

. format exit_date %td

. gen end_date = date("2022-11-30", "YMD") if case==1
(19,846 missing values generated)

. replace end_date = date("2019-11-30", "YMD") if case==0
(19,846 real changes made)

. format end_date %td

. replace exit_date = min(deregistered_date, death_date, end_date) if esrd_date
> ==.
(25,040 real changes made)

. gen follow_up_time = (exit_date - index_date)

. label var follow_up_time "Follow-up time (Days)"

. gen follow_up_cat = follow_up_time

. recode follow_up_cat    min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0/365=3         ///
>                                                 366/730=4       ///
>                                                 731/1040=5      ///          
>                            
>                                                 1041/max=6
(follow_up_cat: 27803 changes made)

. label define follow_up_cat      1 "<-29 days"           ///
>                                                         2 "-28 to -1 days"   
>    ///
>                                                         3 "0 to 365 days"    
>    ///
>                                                         4 "366 to 730 days" /
> //
>                                                         5 "731 to 1040 days" 
>    ///
>                                                         6 ">1040 days"

. label values follow_up_cat follow_up_cat

. label var follow_up_cat "Follow_up time"

. tab case follow_up_cat

                      |               Follow_up time
                 case | -28 to -1  0 to 365   366 to 73  731 to 10 |     Total
----------------------+--------------------------------------------+----------
Historical comparator |        21      4,326      6,936      8,563 |    19,846 
           SARS-CoV-2 |        10      1,819      2,834      3,308 |     7,971 
----------------------+--------------------------------------------+----------
                Total |        31      6,145      9,770     11,871 |    27,817 

. tab covid_krt follow_up_cat

      COVID-19 kidney |               Follow_up time
  replacement therapy | -28 to -1  0 to 365   366 to 73  731 to 10 |     Total
----------------------+--------------------------------------------+----------
Historical comparator |        21      4,326      6,936      8,563 |    19,846 
Non-hospitalised SARS |        10      1,492      2,280      2,693 |     6,475 
No KRT hospitalised C |         0        170        286        283 |       739 
KRT hospitalised COVI |         0        157        268        332 |       757 
----------------------+--------------------------------------------+----------
                Total |        31      6,145      9,770     11,871 |    27,817 

. drop if follow_up_time<0
(31 observations deleted)

. drop if follow_up_time>1040
(0 observations deleted)

. tab case follow_up_cat

                      |          Follow_up time
                 case | 0 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,326      6,936      8,563 |    19,825 
           SARS-CoV-2 |     1,819      2,834      3,308 |     7,961 
----------------------+---------------------------------+----------
                Total |     6,145      9,770     11,871 |    27,786 

. tab covid_krt follow_up_cat

      COVID-19 kidney |          Follow_up time
  replacement therapy | 0 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,326      6,936      8,563 |    19,825 
Non-hospitalised SARS |     1,492      2,280      2,693 |     6,465 
No KRT hospitalised C |       170        286        283 |       739 
KRT hospitalised COVI |       157        268        332 |       757 
----------------------+---------------------------------+----------
                Total |     6,145      9,770     11,871 |    27,786 

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(27,786 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_h
> alf_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>=in
> dex_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(62 real changes made)
(81 real changes made)
(109 real changes made)
(151 real changes made)
(163 real changes made)
(178 real changes made)
(190 real changes made)
(185 real changes made)
(194 real changes made)
(193 real changes made)
(194 real changes made)
(212 real changes made)
(201 real changes made)
(206 real changes made)
(199 real changes made)
(190 real changes made)
(185 real changes made)
(187 real changes made)
(175 real changes made)
(151 real changes made)
(175 real changes made)
(163 real changes made)
(171 real changes made)
(158 real changes made)
(128 real changes made)
(136 real changes made)
(145 real changes made)
(107 real changes made)
(82 real changes made)
(110 real changes made)
(0 real changes made)
(1 real change made)
(17 real changes made)
(34 real changes made)
(50 real changes made)
(57 real changes made)
(52 real changes made)
(59 real changes made)
(60 real changes made)
(64 real changes made)
(75 real changes made)
(77 real changes made)
(70 real changes made)
(99 real changes made)
(81 real changes made)
(87 real changes made)
(67 real changes made)
(79 real changes made)
(73 real changes made)
(79 real changes made)
(66 real changes made)
(69 real changes made)
(62 real changes made)
(47 real changes made)
(63 real changes made)
(46 real changes made)
(55 real changes made)
(59 real changes made)
(48 real changes made)
(54 real changes made)
(51 real changes made)
(45 real changes made)
(46 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(2,070 real changes made)

. gen egfr_half = 0

. replace egfr_half = 1 if egfr_half_date!=.
(8,743 real changes made)

. label var egfr_half "50% reduction in eGFR"

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(12,336 real changes made, 12,336 to missing)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(19,043 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date) if e
> gfr_half_date==. & index_date_egfr_half!=.
(7,925 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(12,336 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days
> )"

. 
. * AKI (or ESRD)
. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(25,054 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(2,490 real changes made)

. gen aki = 0

. replace aki = 1 if aki_date!=.
(5,222 real changes made)

. label var aki "Acute kidney injury"

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(22,564 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date)  if aki_da
> te==.
(22,564 real changes made)

. gen follow_up_time_aki = (exit_date_aki - index_date)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. 
. * Exit date (death)
. gen exit_date_death = death_date
(26,137 missing values generated)

. gen death = 0

. replace death = 1 if death_date!=.
(1,649 real changes made)

. label var death "Death"

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(26,137 real changes made)

. gen follow_up_time_death = (exit_date_death - index_date)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. 
. save ./output/analysis_2017.dta, replace
(note: file ./output/analysis_2017.dta not found)
file ./output/analysis_2017.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/analysis_2017.log
  log type:  text
 closed on:  11 Jan 2023, 18:34:10
-------------------------------------------------------------------------------
