------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_hospitalised.log
  log type:  text
 opened on:  31 Mar 2023, 18:36:54

. 
. capture noisily import delimited ./output/input_covid_hospitalised.csv, clear
(encoding automatically selected: ISO-8859-9)
(118 vars, 50,000 obs)

. tempfile covid_hospitalised

. save `covid_hospitalised', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_3abc_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_3abc_000001.tmp saved as .dta format

. di "COVID-19 hospitalised:"
COVID-19 hospitalised:

. safecount
  50,000

. 
. capture noisily import delimited ./output/input_pneumonia_hospitalised.csv, clear
(encoding automatically selected: ISO-8859-9)
(114 vars, 50,000 obs)

. tempfile pneumonia_hospitalised

. save `pneumonia_hospitalised', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_3abc_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_3abc_000002.tmp saved as .dta format

. di "Pneumonia hospitalised:"
Pneumonia hospitalised:

. safecount
  50,000

. 
. append using `covid_hospitalised', force

. 
. **ID
. * Need to create unique identifiers as individuals may be in both covid_hospitalised and pneumonia_hospitalised so will have the s
> ame patient_id
. gen unique = _n

. label var unique "Unique ID"

. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      5,020        5.02        5.02
 1 Most deprived |     18,979       18.98       24.00
               2 |     19,106       19.11       43.11
               3 |     18,949       18.95       62.05
               4 |     18,989       18.99       81.04
5 Least deprived |     18,957       18.96      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. drop if imd==0
(5,020 observations deleted)

. safetab imd

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |     18,979       19.98       19.98
               2 |     19,106       20.12       40.10
               3 |     18,949       19.95       60.05
               4 |     18,989       19.99       80.04
5 Least deprived |     18,957       19.96      100.00
-----------------+-----------------------------------
           Total |     94,980      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(94,979 missing values generated)

. replace stp1 = sum(stp1)
(94,979 real changes made)

. drop stp

. rename stp1 stp

. label define stp        1 "1"   ///
>                                         2 "2"   ///
>                                         3 "3"   ///
>                                         4 "4"   ///
>                                         5 "5"   ///
>                                         6 "6"   ///
>                                         7 "7"   ///
>                                         8 "8"   ///
>                                         9 "9"   ///
>                                         10 "10" ///
>                                         11 "11" ///                                     
>                                         12 "12" ///
>                                         13 "13" ///
>                                         14 "14" ///
>                                         15 "15" ///
>                                         16 "16" ///
>                                         17 "17" ///
>                                         18 "18" ///
>                                         19 "19" ///
>                                         20 "20" ///
>                                         21 "21" ///                                     
>                                         22 "22" ///
>                                         23 "23" ///
>                                         24 "24" ///
>                                         25 "25" ///
>                                         26 "26" ///
>                                         27 "27" ///
>                                         28 "28" ///
>                                         29 "29" ///
>                                         30 "30" ///
>                                         31 "31" 

. label values stp stp

. label var stp "STP"

. safetab stp

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     94,980      100.00      100.00
------------+-----------------------------------
      Total |     94,980      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(85,572 missing values generated)

. replace region = 2 if region_string=="East"
(9,416 real changes made)

. replace region = 3 if region_string=="London"
(19,007 real changes made)

. replace region = 4 if region_string=="North East"
(9,504 real changes made)

. replace region = 5 if region_string=="North West"
(9,664 real changes made)

. replace region = 6 if region_string=="South East"
(9,600 real changes made)

. replace region = 7 if region_string=="South West"
(9,637 real changes made)

. replace region = 8 if region_string=="West Midlands"
(9,386 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(9,358 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,408        9.91        9.91
                    East |      9,416        9.91       19.82
                  London |     19,007       20.01       39.83
              North East |      9,504       10.01       49.84
              North West |      9,664       10.17       60.01
              South East |      9,600       10.11       70.12
              South West |      9,637       10.15       80.27
           West Midlands |      9,386        9.88       90.15
Yorkshire and The Humber |      9,358        9.85      100.00
-------------------------+-----------------------------------
                   Total |     94,980      100.00

. drop if region==10
(0 observations deleted)

. safetab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,408        9.91        9.91
                    East |      9,416        9.91       19.82
                  London |     19,007       20.01       39.83
              North East |      9,504       10.01       49.84
              North West |      9,664       10.17       60.01
              South East |      9,600       10.11       70.12
              South West |      9,637       10.15       80.27
           West Midlands |      9,386        9.88       90.15
Yorkshire and The Humber |      9,358        9.85      100.00
-------------------------+-----------------------------------
                   Total |     94,980      100.00

. 
. * Create new index date variable 28 days after case_index_date (i.e. to exclude anyone who does not survive to start follow-up)
. gen index_date = date(patient_index_date, "YMD")
(7,379 missing values generated)

. format index_date %td

. gen index_date_28 = index_date + 28
(7,379 missing values generated)

. format index_date_28 %td

. 
. * Deregistered before index_date + 29 days
. gen deregistered_date = date(date_deregistered, "YMD")
(28,710 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date_28 + 1
(64,200 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(26,457 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(2,242 observations deleted)

. replace krt_date = index_date_28 + 1 if krt_date < index_date_28 + 1
(109 real changes made)

. 
. * Death before index_date + 29 days (i.e. only include people who survived beyond 28 days after admission)
. drop if deceased==1
(309 observations deleted)

. drop deceased

. gen death_date1 = date(death_date, "YMD")
(25,422 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28 + 1
(1,754 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased within 28 days of index date"

. label values deceased deceased

. tab covid deceased

           |       deceased
     covid | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,099      1,021 |    14,120 
-----------+----------------------+----------
     Total |    13,099      1,021 |    14,120 

. tab pneumonia deceased

           |       deceased
 pneumonia | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,376        733 |    14,109 
-----------+----------------------+----------
     Total |    13,376        733 |    14,109 

. drop if deceased==1
(1,754 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators only
. gen sex1 = 1 if sex=="M"
(13,530 missing values generated)

. replace sex1 = 0 if sex=="F"
(13,530 real changes made)

. drop sex

. rename sex1 sex

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 ///
>                                                                                                 baseline_creatinine_mar2017 ///
>                                                                                                 baseline_creatinine_apr2017 ///
>                                                                                                 baseline_creatinine_may2017 ///
>                                                                                                 baseline_creatinine_jun2017 ///
>                                                                                                 baseline_creatinine_jul2017 ///
>                                                                                                 baseline_creatinine_aug2017 ///
>                                                                                                 baseline_creatinine_sep2017 ///
>                                                                                                 baseline_creatinine_oct2017 ///
>                                                                                                 baseline_creatinine_nov2017 ///
>                                                                                                 baseline_creatinine_dec2017 ///
>                                                                                                 baseline_creatinine_jan2018 ///
>                                                                                                 baseline_creatinine_feb2018 ///
>                                                                                                 baseline_creatinine_mar2018 ///
>                                                                                                 baseline_creatinine_apr2018 ///
>                                                                                                 baseline_creatinine_may2018 ///
>                                                                                                 baseline_creatinine_jun2018 ///
>                                                                                                 baseline_creatinine_jul2018 ///
>                                                                                                 baseline_creatinine_aug2018 ///
>                                                                                                 baseline_creatinine_sep2018 ///
>                                                                                                 baseline_creatinine_oct2018 ///
>                                                                                                 baseline_creatinine_nov2018 ///
>                                                                                                 baseline_creatinine_dec2018 ///
>                                                                                                 baseline_creatinine_jan2019 ///
>                                                                                                 baseline_creatinine_feb2019 ///
>                                                                                                 baseline_creatinine_mar2019 ///
>                                                                                                 baseline_creatinine_apr2019 ///
>                                                                                                 baseline_creatinine_may2019 ///
>                                                                                                 baseline_creatinine_jun2019 ///
>                                                                                                 baseline_creatinine_jul2019 ///
>                                                                                                 baseline_creatinine_aug2019 ///
>                                                                                                 baseline_creatinine_sep2019 ///
>                                                                                                 baseline_creatinine_feb2020 ///
>                                                                                                 baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 ///
>                                                                                                 baseline_creatinine_feb2022 ///
>                                                                                                 baseline_creatinine_mar2022 ///
>                                                                                                 baseline_creatinine_apr2022 ///
>                                                                                                 baseline_creatinine_may2022 ///
>                                                                                                 baseline_creatinine_jun2022 ///
>                                                                                                 baseline_creatinine_jul2022 ///
>                                                                                                 baseline_creatinine_aug2022 ///
>                                                                                                 baseline_creatinine_sep2022 ///
>                                                                                                 baseline_creatinine_oct2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(5,868 real changes made, 5,868 to missing)
(18,967 missing values generated)
(26,475 missing values generated)
(3,874 real changes made)
(3,634 real changes made)
(3,874 real changes made)
(3,634 real changes made)
(4,737 real changes made)
(26,475 missing values generated)
(3,874 real changes made)
(3,634 real changes made)
(7,508 real changes made)
(21,738 real changes made)
(18,967 missing values generated)
(7,433 real changes made)
(3,874 real changes made)
(5,804 real changes made, 5,804 to missing)
(18,903 missing values generated)
(26,475 missing values generated)
(3,910 real changes made)
(3,662 real changes made)
(3,910 real changes made)
(3,662 real changes made)
(4,794 real changes made)
(26,475 missing values generated)
(3,910 real changes made)
(3,662 real changes made)
(7,572 real changes made)
(21,681 real changes made)
(18,903 missing values generated)
(7,482 real changes made)
(3,910 real changes made)
(5,967 real changes made, 5,967 to missing)
(19,066 missing values generated)
(26,475 missing values generated)
(3,753 real changes made)
(3,656 real changes made)
(3,753 real changes made)
(3,656 real changes made)
(4,715 real changes made)
(26,475 missing values generated)
(3,753 real changes made)
(3,656 real changes made)
(7,409 real changes made)
(21,760 real changes made)
(19,066 missing values generated)
(7,328 real changes made)
(3,753 real changes made)
(5,901 real changes made, 5,901 to missing)
(19,000 missing values generated)
(26,475 missing values generated)
(3,824 real changes made)
(3,651 real changes made)
(3,824 real changes made)
(3,651 real changes made)
(4,739 real changes made)
(26,475 missing values generated)
(3,824 real changes made)
(3,651 real changes made)
(7,475 real changes made)
(21,736 real changes made)
(19,000 missing values generated)
(7,391 real changes made)
(3,824 real changes made)
(5,853 real changes made, 5,853 to missing)
(18,952 missing values generated)
(26,475 missing values generated)
(3,892 real changes made)
(3,631 real changes made)
(3,892 real changes made)
(3,631 real changes made)
(4,757 real changes made)
(26,475 missing values generated)
(3,892 real changes made)
(3,631 real changes made)
(7,523 real changes made)
(21,718 real changes made)
(18,952 missing values generated)
(7,428 real changes made)
(3,892 real changes made)
(5,913 real changes made, 5,913 to missing)
(19,012 missing values generated)
(26,475 missing values generated)
(3,818 real changes made)
(3,645 real changes made)
(3,818 real changes made)
(3,645 real changes made)
(4,763 real changes made)
(26,475 missing values generated)
(3,818 real changes made)
(3,645 real changes made)
(7,463 real changes made)
(21,712 real changes made)
(19,012 missing values generated)
(7,386 real changes made)
(3,818 real changes made)
(5,860 real changes made, 5,860 to missing)
(18,959 missing values generated)
(26,475 missing values generated)
(3,824 real changes made)
(3,692 real changes made)
(3,824 real changes made)
(3,692 real changes made)
(4,689 real changes made)
(26,475 missing values generated)
(3,824 real changes made)
(3,692 real changes made)
(7,516 real changes made)
(21,786 real changes made)
(18,959 missing values generated)
(7,430 real changes made)
(3,824 real changes made)
(5,930 real changes made, 5,930 to missing)
(19,029 missing values generated)
(26,475 missing values generated)
(3,777 real changes made)
(3,669 real changes made)
(3,777 real changes made)
(3,669 real changes made)
(4,720 real changes made)
(26,475 missing values generated)
(3,777 real changes made)
(3,669 real changes made)
(7,446 real changes made)
(21,755 real changes made)
(19,029 missing values generated)
(7,364 real changes made)
(3,777 real changes made)
(5,901 real changes made, 5,901 to missing)
(19,000 missing values generated)
(26,475 missing values generated)
(3,792 real changes made)
(3,683 real changes made)
(3,792 real changes made)
(3,683 real changes made)
(4,789 real changes made)
(26,475 missing values generated)
(3,792 real changes made)
(3,683 real changes made)
(7,475 real changes made)
(21,686 real changes made)
(19,000 missing values generated)
(7,385 real changes made)
(3,792 real changes made)
(5,856 real changes made, 5,856 to missing)
(18,955 missing values generated)
(26,475 missing values generated)
(3,776 real changes made)
(3,744 real changes made)
(3,776 real changes made)
(3,744 real changes made)
(4,797 real changes made)
(26,475 missing values generated)
(3,776 real changes made)
(3,744 real changes made)
(7,520 real changes made)
(21,678 real changes made)
(18,955 missing values generated)
(7,428 real changes made)
(3,776 real changes made)
(5,924 real changes made, 5,924 to missing)
(19,023 missing values generated)
(26,475 missing values generated)
(3,753 real changes made)
(3,699 real changes made)
(3,753 real changes made)
(3,699 real changes made)
(4,696 real changes made)
(26,475 missing values generated)
(3,753 real changes made)
(3,699 real changes made)
(7,452 real changes made)
(21,779 real changes made)
(19,023 missing values generated)
(7,377 real changes made)
(3,753 real changes made)
(5,909 real changes made, 5,909 to missing)
(19,008 missing values generated)
(26,475 missing values generated)
(3,871 real changes made)
(3,596 real changes made)
(3,871 real changes made)
(3,596 real changes made)
(4,691 real changes made)
(26,475 missing values generated)
(3,871 real changes made)
(3,596 real changes made)
(7,467 real changes made)
(21,784 real changes made)
(19,008 missing values generated)
(7,379 real changes made)
(3,871 real changes made)
(5,871 real changes made, 5,871 to missing)
(18,970 missing values generated)
(26,475 missing values generated)
(3,889 real changes made)
(3,616 real changes made)
(3,889 real changes made)
(3,616 real changes made)
(4,639 real changes made)
(26,475 missing values generated)
(3,889 real changes made)
(3,616 real changes made)
(7,505 real changes made)
(21,836 real changes made)
(18,970 missing values generated)
(7,431 real changes made)
(3,889 real changes made)
(5,929 real changes made, 5,929 to missing)
(19,028 missing values generated)
(26,475 missing values generated)
(3,797 real changes made)
(3,650 real changes made)
(3,797 real changes made)
(3,650 real changes made)
(4,694 real changes made)
(26,475 missing values generated)
(3,797 real changes made)
(3,650 real changes made)
(7,447 real changes made)
(21,781 real changes made)
(19,028 missing values generated)
(7,359 real changes made)
(3,797 real changes made)
(5,972 real changes made, 5,972 to missing)
(19,071 missing values generated)
(26,475 missing values generated)
(3,820 real changes made)
(3,584 real changes made)
(3,820 real changes made)
(3,584 real changes made)
(4,776 real changes made)
(26,475 missing values generated)
(3,820 real changes made)
(3,584 real changes made)
(7,404 real changes made)
(21,699 real changes made)
(19,071 missing values generated)
(7,323 real changes made)
(3,820 real changes made)
(5,885 real changes made, 5,885 to missing)
(18,984 missing values generated)
(26,475 missing values generated)
(3,820 real changes made)
(3,671 real changes made)
(3,820 real changes made)
(3,671 real changes made)
(4,740 real changes made)
(26,475 missing values generated)
(3,820 real changes made)
(3,671 real changes made)
(7,491 real changes made)
(21,735 real changes made)
(18,984 missing values generated)
(7,401 real changes made)
(3,820 real changes made)
(5,911 real changes made, 5,911 to missing)
(19,010 missing values generated)
(26,475 missing values generated)
(3,793 real changes made)
(3,672 real changes made)
(3,793 real changes made)
(3,672 real changes made)
(4,764 real changes made)
(26,475 missing values generated)
(3,793 real changes made)
(3,672 real changes made)
(7,465 real changes made)
(21,711 real changes made)
(19,010 missing values generated)
(7,383 real changes made)
(3,793 real changes made)
(5,882 real changes made, 5,882 to missing)
(18,981 missing values generated)
(26,475 missing values generated)
(3,862 real changes made)
(3,632 real changes made)
(3,862 real changes made)
(3,632 real changes made)
(4,783 real changes made)
(26,475 missing values generated)
(3,862 real changes made)
(3,632 real changes made)
(7,494 real changes made)
(21,692 real changes made)
(18,981 missing values generated)
(7,410 real changes made)
(3,862 real changes made)
(5,847 real changes made, 5,847 to missing)
(18,946 missing values generated)
(26,475 missing values generated)
(3,861 real changes made)
(3,668 real changes made)
(3,861 real changes made)
(3,668 real changes made)
(4,743 real changes made)
(26,475 missing values generated)
(3,861 real changes made)
(3,668 real changes made)
(7,529 real changes made)
(21,732 real changes made)
(18,946 missing values generated)
(7,431 real changes made)
(3,861 real changes made)
(5,903 real changes made, 5,903 to missing)
(19,002 missing values generated)
(26,475 missing values generated)
(3,844 real changes made)
(3,629 real changes made)
(3,844 real changes made)
(3,629 real changes made)
(4,701 real changes made)
(26,475 missing values generated)
(3,844 real changes made)
(3,629 real changes made)
(7,473 real changes made)
(21,774 real changes made)
(19,002 missing values generated)
(7,389 real changes made)
(3,844 real changes made)
(5,901 real changes made, 5,901 to missing)
(19,000 missing values generated)
(26,475 missing values generated)
(3,836 real changes made)
(3,639 real changes made)
(3,836 real changes made)
(3,639 real changes made)
(4,787 real changes made)
(26,475 missing values generated)
(3,836 real changes made)
(3,639 real changes made)
(7,475 real changes made)
(21,688 real changes made)
(19,000 missing values generated)
(7,388 real changes made)
(3,836 real changes made)
(6,003 real changes made, 6,003 to missing)
(19,102 missing values generated)
(26,475 missing values generated)
(3,792 real changes made)
(3,581 real changes made)
(3,792 real changes made)
(3,581 real changes made)
(4,651 real changes made)
(26,475 missing values generated)
(3,792 real changes made)
(3,581 real changes made)
(7,373 real changes made)
(21,824 real changes made)
(19,102 missing values generated)
(7,286 real changes made)
(3,792 real changes made)
(5,908 real changes made, 5,908 to missing)
(19,007 missing values generated)
(26,475 missing values generated)
(3,826 real changes made)
(3,642 real changes made)
(3,826 real changes made)
(3,642 real changes made)
(4,764 real changes made)
(26,475 missing values generated)
(3,826 real changes made)
(3,642 real changes made)
(7,468 real changes made)
(21,711 real changes made)
(19,007 missing values generated)
(7,378 real changes made)
(3,826 real changes made)
(5,938 real changes made, 5,938 to missing)
(19,037 missing values generated)
(26,475 missing values generated)
(3,756 real changes made)
(3,682 real changes made)
(3,756 real changes made)
(3,682 real changes made)
(4,716 real changes made)
(26,475 missing values generated)
(3,756 real changes made)
(3,682 real changes made)
(7,438 real changes made)
(21,759 real changes made)
(19,037 missing values generated)
(7,356 real changes made)
(3,756 real changes made)
(5,817 real changes made, 5,817 to missing)
(18,916 missing values generated)
(26,475 missing values generated)
(3,836 real changes made)
(3,723 real changes made)
(3,836 real changes made)
(3,723 real changes made)
(4,739 real changes made)
(26,475 missing values generated)
(3,836 real changes made)
(3,723 real changes made)
(7,559 real changes made)
(21,736 real changes made)
(18,916 missing values generated)
(7,490 real changes made)
(3,836 real changes made)
(5,939 real changes made, 5,939 to missing)
(19,038 missing values generated)
(26,475 missing values generated)
(3,827 real changes made)
(3,610 real changes made)
(3,827 real changes made)
(3,610 real changes made)
(4,689 real changes made)
(26,475 missing values generated)
(3,827 real changes made)
(3,610 real changes made)
(7,437 real changes made)
(21,786 real changes made)
(19,038 missing values generated)
(7,361 real changes made)
(3,827 real changes made)
(5,964 real changes made, 5,964 to missing)
(19,063 missing values generated)
(26,475 missing values generated)
(3,782 real changes made)
(3,630 real changes made)
(3,782 real changes made)
(3,630 real changes made)
(4,678 real changes made)
(26,475 missing values generated)
(3,782 real changes made)
(3,630 real changes made)
(7,412 real changes made)
(21,797 real changes made)
(19,063 missing values generated)
(7,324 real changes made)
(3,782 real changes made)
(5,945 real changes made, 5,945 to missing)
(19,044 missing values generated)
(26,475 missing values generated)
(3,845 real changes made)
(3,586 real changes made)
(3,845 real changes made)
(3,586 real changes made)
(4,671 real changes made)
(26,475 missing values generated)
(3,845 real changes made)
(3,586 real changes made)
(7,431 real changes made)
(21,804 real changes made)
(19,044 missing values generated)
(7,346 real changes made)
(3,845 real changes made)
(5,886 real changes made, 5,886 to missing)
(18,985 missing values generated)
(26,475 missing values generated)
(3,864 real changes made)
(3,626 real changes made)
(3,864 real changes made)
(3,626 real changes made)
(4,662 real changes made)
(26,475 missing values generated)
(3,864 real changes made)
(3,626 real changes made)
(7,490 real changes made)
(21,813 real changes made)
(18,985 missing values generated)
(7,410 real changes made)
(3,864 real changes made)
(5,911 real changes made, 5,911 to missing)
(19,010 missing values generated)
(26,475 missing values generated)
(3,840 real changes made)
(3,625 real changes made)
(3,840 real changes made)
(3,625 real changes made)
(4,710 real changes made)
(26,475 missing values generated)
(3,840 real changes made)
(3,625 real changes made)
(7,465 real changes made)
(21,765 real changes made)
(19,010 missing values generated)
(7,382 real changes made)
(3,840 real changes made)
(5,969 real changes made, 5,969 to missing)
(19,068 missing values generated)
(26,475 missing values generated)
(3,793 real changes made)
(3,614 real changes made)
(3,793 real changes made)
(3,614 real changes made)
(4,750 real changes made)
(26,475 missing values generated)
(3,793 real changes made)
(3,614 real changes made)
(7,407 real changes made)
(21,725 real changes made)
(19,068 missing values generated)
(7,336 real changes made)
(3,793 real changes made)
(5,916 real changes made, 5,916 to missing)
(19,015 missing values generated)
(26,475 missing values generated)
(3,835 real changes made)
(3,625 real changes made)
(3,835 real changes made)
(3,625 real changes made)
(4,684 real changes made)
(26,475 missing values generated)
(3,835 real changes made)
(3,625 real changes made)
(7,460 real changes made)
(21,791 real changes made)
(19,015 missing values generated)
(7,372 real changes made)
(3,835 real changes made)
(5,801 real changes made, 5,801 to missing)
(19,177 missing values generated)
(26,475 missing values generated)
(3,760 real changes made)
(3,538 real changes made)
(3,760 real changes made)
(3,538 real changes made)
(4,666 real changes made)
(26,475 missing values generated)
(3,760 real changes made)
(3,538 real changes made)
(7,298 real changes made)
(21,809 real changes made)
(19,177 missing values generated)
(7,215 real changes made)
(3,760 real changes made)
(5,661 real changes made, 5,661 to missing)
(19,037 missing values generated)
(26,475 missing values generated)
(3,765 real changes made)
(3,673 real changes made)
(3,765 real changes made)
(3,673 real changes made)
(4,746 real changes made)
(26,475 missing values generated)
(3,765 real changes made)
(3,673 real changes made)
(7,438 real changes made)
(21,729 real changes made)
(19,037 missing values generated)
(7,355 real changes made)
(3,765 real changes made)
(5,762 real changes made, 5,762 to missing)
(19,138 missing values generated)
(26,475 missing values generated)
(3,719 real changes made)
(3,618 real changes made)
(3,719 real changes made)
(3,618 real changes made)
(4,644 real changes made)
(26,475 missing values generated)
(3,719 real changes made)
(3,618 real changes made)
(7,337 real changes made)
(21,831 real changes made)
(19,138 missing values generated)
(7,251 real changes made)
(3,719 real changes made)
(5,797 real changes made, 5,797 to missing)
(19,173 missing values generated)
(26,475 missing values generated)
(3,712 real changes made)
(3,590 real changes made)
(3,712 real changes made)
(3,590 real changes made)
(4,673 real changes made)
(26,475 missing values generated)
(3,712 real changes made)
(3,590 real changes made)
(7,302 real changes made)
(21,802 real changes made)
(19,173 missing values generated)
(7,224 real changes made)
(3,712 real changes made)
(5,791 real changes made, 5,791 to missing)
(19,167 missing values generated)
(26,475 missing values generated)
(3,744 real changes made)
(3,564 real changes made)
(3,744 real changes made)
(3,564 real changes made)
(4,623 real changes made)
(26,475 missing values generated)
(3,744 real changes made)
(3,564 real changes made)
(7,308 real changes made)
(21,852 real changes made)
(19,167 missing values generated)
(7,233 real changes made)
(3,744 real changes made)
(5,724 real changes made, 5,724 to missing)
(19,100 missing values generated)
(26,475 missing values generated)
(3,782 real changes made)
(3,593 real changes made)
(3,782 real changes made)
(3,593 real changes made)
(4,632 real changes made)
(26,475 missing values generated)
(3,782 real changes made)
(3,593 real changes made)
(7,375 real changes made)
(21,843 real changes made)
(19,100 missing values generated)
(7,294 real changes made)
(3,782 real changes made)
(5,706 real changes made, 5,706 to missing)
(19,082 missing values generated)
(26,475 missing values generated)
(3,766 real changes made)
(3,627 real changes made)
(3,766 real changes made)
(3,627 real changes made)
(4,725 real changes made)
(26,475 missing values generated)
(3,766 real changes made)
(3,627 real changes made)
(7,393 real changes made)
(21,750 real changes made)
(19,082 missing values generated)
(7,307 real changes made)
(3,766 real changes made)
(5,779 real changes made, 5,779 to missing)
(19,155 missing values generated)
(26,475 missing values generated)
(3,695 real changes made)
(3,625 real changes made)
(3,695 real changes made)
(3,625 real changes made)
(4,648 real changes made)
(26,475 missing values generated)
(3,695 real changes made)
(3,625 real changes made)
(7,320 real changes made)
(21,827 real changes made)
(19,155 missing values generated)
(7,242 real changes made)
(3,695 real changes made)
(5,795 real changes made, 5,795 to missing)
(19,171 missing values generated)
(26,475 missing values generated)
(3,754 real changes made)
(3,550 real changes made)
(3,754 real changes made)
(3,550 real changes made)
(4,614 real changes made)
(26,475 missing values generated)
(3,754 real changes made)
(3,550 real changes made)
(7,304 real changes made)
(21,861 real changes made)
(19,171 missing values generated)
(7,222 real changes made)
(3,754 real changes made)
(5,738 real changes made, 5,738 to missing)
(19,114 missing values generated)
(26,475 missing values generated)
(3,735 real changes made)
(3,626 real changes made)
(3,735 real changes made)
(3,626 real changes made)
(4,747 real changes made)
(26,475 missing values generated)
(3,735 real changes made)
(3,626 real changes made)
(7,361 real changes made)
(21,728 real changes made)
(19,114 missing values generated)
(7,283 real changes made)
(3,735 real changes made)
(5,755 real changes made, 5,755 to missing)
(19,131 missing values generated)
(26,475 missing values generated)
(3,766 real changes made)
(3,578 real changes made)
(3,766 real changes made)
(3,578 real changes made)
(4,634 real changes made)
(26,475 missing values generated)
(3,766 real changes made)
(3,578 real changes made)
(7,344 real changes made)
(21,841 real changes made)
(19,131 missing values generated)
(7,268 real changes made)
(3,766 real changes made)
(5,757 real changes made, 5,757 to missing)
(19,133 missing values generated)
(26,475 missing values generated)
(3,765 real changes made)
(3,577 real changes made)
(3,765 real changes made)
(3,577 real changes made)
(4,651 real changes made)
(26,475 missing values generated)
(3,765 real changes made)
(3,577 real changes made)
(7,342 real changes made)
(21,824 real changes made)
(19,133 missing values generated)
(7,259 real changes made)
(3,765 real changes made)
(5,700 real changes made, 5,700 to missing)
(19,076 missing values generated)
(26,475 missing values generated)
(3,753 real changes made)
(3,646 real changes made)
(3,753 real changes made)
(3,646 real changes made)
(4,664 real changes made)
(26,475 missing values generated)
(3,753 real changes made)
(3,646 real changes made)
(7,399 real changes made)
(21,811 real changes made)
(19,076 missing values generated)
(7,326 real changes made)
(3,753 real changes made)
(5,718 real changes made, 5,718 to missing)
(19,094 missing values generated)
(26,475 missing values generated)
(3,692 real changes made)
(3,689 real changes made)
(3,692 real changes made)
(3,689 real changes made)
(4,596 real changes made)
(26,475 missing values generated)
(3,692 real changes made)
(3,689 real changes made)
(7,381 real changes made)
(21,879 real changes made)
(19,094 missing values generated)
(7,293 real changes made)
(3,692 real changes made)
(5,677 real changes made, 5,677 to missing)
(19,053 missing values generated)
(26,475 missing values generated)
(3,727 real changes made)
(3,695 real changes made)
(3,727 real changes made)
(3,695 real changes made)
(4,659 real changes made)
(26,475 missing values generated)
(3,727 real changes made)
(3,695 real changes made)
(7,422 real changes made)
(21,816 real changes made)
(19,053 missing values generated)
(7,334 real changes made)
(3,727 real changes made)
(5,758 real changes made, 5,758 to missing)
(19,134 missing values generated)
(26,475 missing values generated)
(3,737 real changes made)
(3,604 real changes made)
(3,737 real changes made)
(3,604 real changes made)
(4,616 real changes made)
(26,475 missing values generated)
(3,737 real changes made)
(3,604 real changes made)
(7,341 real changes made)
(21,859 real changes made)
(19,134 missing values generated)
(7,256 real changes made)
(3,737 real changes made)
(5,782 real changes made, 5,782 to missing)
(19,158 missing values generated)
(26,475 missing values generated)
(3,734 real changes made)
(3,583 real changes made)
(3,734 real changes made)
(3,583 real changes made)
(4,529 real changes made)
(26,475 missing values generated)
(3,734 real changes made)
(3,583 real changes made)
(7,317 real changes made)
(21,946 real changes made)
(19,158 missing values generated)
(7,233 real changes made)
(3,734 real changes made)
(5,818 real changes made, 5,818 to missing)
(19,194 missing values generated)
(26,475 missing values generated)
(3,691 real changes made)
(3,590 real changes made)
(3,691 real changes made)
(3,590 real changes made)
(4,615 real changes made)
(26,475 missing values generated)
(3,691 real changes made)
(3,590 real changes made)
(7,281 real changes made)
(21,860 real changes made)
(19,194 missing values generated)
(7,194 real changes made)
(3,691 real changes made)
(5,757 real changes made, 5,757 to missing)
(19,133 missing values generated)
(26,475 missing values generated)
(3,719 real changes made)
(3,623 real changes made)
(3,719 real changes made)
(3,623 real changes made)
(4,692 real changes made)
(26,475 missing values generated)
(3,719 real changes made)
(3,623 real changes made)
(7,342 real changes made)
(21,783 real changes made)
(19,133 missing values generated)
(7,261 real changes made)
(3,719 real changes made)
(5,766 real changes made, 5,766 to missing)
(19,142 missing values generated)
(26,475 missing values generated)
(3,746 real changes made)
(3,587 real changes made)
(3,746 real changes made)
(3,587 real changes made)
(4,630 real changes made)
(26,475 missing values generated)
(3,746 real changes made)
(3,587 real changes made)
(7,333 real changes made)
(21,845 real changes made)
(19,142 missing values generated)
(7,261 real changes made)
(3,746 real changes made)
(5,752 real changes made, 5,752 to missing)
(19,128 missing values generated)
(26,475 missing values generated)
(3,779 real changes made)
(3,568 real changes made)
(3,779 real changes made)
(3,568 real changes made)
(4,587 real changes made)
(26,475 missing values generated)
(3,779 real changes made)
(3,568 real changes made)
(7,347 real changes made)
(21,888 real changes made)
(19,128 missing values generated)
(7,276 real changes made)
(3,779 real changes made)
(5,821 real changes made, 5,821 to missing)
(19,197 missing values generated)
(26,475 missing values generated)
(3,693 real changes made)
(3,585 real changes made)
(3,693 real changes made)
(3,585 real changes made)
(4,602 real changes made)
(26,475 missing values generated)
(3,693 real changes made)
(3,585 real changes made)
(7,278 real changes made)
(21,873 real changes made)
(19,197 missing values generated)
(7,191 real changes made)
(3,693 real changes made)
(5,713 real changes made, 5,713 to missing)
(19,089 missing values generated)
(26,475 missing values generated)
(3,808 real changes made)
(3,578 real changes made)
(3,808 real changes made)
(3,578 real changes made)
(4,696 real changes made)
(26,475 missing values generated)
(3,808 real changes made)
(3,578 real changes made)
(7,386 real changes made)
(21,779 real changes made)
(19,089 missing values generated)
(7,309 real changes made)
(3,808 real changes made)
(5,811 real changes made, 5,811 to missing)
(19,187 missing values generated)
(26,475 missing values generated)
(3,703 real changes made)
(3,585 real changes made)
(3,703 real changes made)
(3,585 real changes made)
(4,615 real changes made)
(26,475 missing values generated)
(3,703 real changes made)
(3,585 real changes made)
(7,288 real changes made)
(21,860 real changes made)
(19,187 missing values generated)
(7,209 real changes made)
(3,703 real changes made)
(5,767 real changes made, 5,767 to missing)
(19,143 missing values generated)
(26,475 missing values generated)
(3,762 real changes made)
(3,570 real changes made)
(3,762 real changes made)
(3,570 real changes made)
(4,688 real changes made)
(26,475 missing values generated)
(3,762 real changes made)
(3,570 real changes made)
(7,332 real changes made)
(21,787 real changes made)
(19,143 missing values generated)
(7,262 real changes made)
(3,762 real changes made)
(5,770 real changes made, 5,770 to missing)
(19,146 missing values generated)
(26,475 missing values generated)
(3,727 real changes made)
(3,602 real changes made)
(3,727 real changes made)
(3,602 real changes made)
(4,683 real changes made)
(26,475 missing values generated)
(3,727 real changes made)
(3,602 real changes made)
(7,329 real changes made)
(21,792 real changes made)
(19,146 missing values generated)
(7,251 real changes made)
(3,727 real changes made)
(5,765 real changes made, 5,765 to missing)
(19,141 missing values generated)
(26,475 missing values generated)
(3,759 real changes made)
(3,575 real changes made)
(3,759 real changes made)
(3,575 real changes made)
(4,684 real changes made)
(26,475 missing values generated)
(3,759 real changes made)
(3,575 real changes made)
(7,334 real changes made)
(21,791 real changes made)
(19,141 missing values generated)
(7,255 real changes made)
(3,759 real changes made)
(5,736 real changes made, 5,736 to missing)
(19,112 missing values generated)
(26,475 missing values generated)
(3,744 real changes made)
(3,619 real changes made)
(3,744 real changes made)
(3,619 real changes made)
(4,689 real changes made)
(26,475 missing values generated)
(3,744 real changes made)
(3,619 real changes made)
(7,363 real changes made)
(21,786 real changes made)
(19,112 missing values generated)
(7,285 real changes made)
(3,744 real changes made)
(5,774 real changes made, 5,774 to missing)
(19,150 missing values generated)
(26,475 missing values generated)
(3,803 real changes made)
(3,522 real changes made)
(3,803 real changes made)
(3,522 real changes made)
(4,638 real changes made)
(26,475 missing values generated)
(3,803 real changes made)
(3,522 real changes made)
(7,325 real changes made)
(21,837 real changes made)
(19,150 missing values generated)
(7,248 real changes made)
(3,803 real changes made)
(5,661 real changes made, 5,661 to missing)
(19,037 missing values generated)
(26,475 missing values generated)
(3,784 real changes made)
(3,654 real changes made)
(3,784 real changes made)
(3,654 real changes made)
(4,733 real changes made)
(26,475 missing values generated)
(3,784 real changes made)
(3,654 real changes made)
(7,438 real changes made)
(21,742 real changes made)
(19,037 missing values generated)
(7,355 real changes made)
(3,784 real changes made)
(5,732 real changes made, 5,732 to missing)
(19,108 missing values generated)
(26,475 missing values generated)
(3,759 real changes made)
(3,608 real changes made)
(3,759 real changes made)
(3,608 real changes made)
(4,645 real changes made)
(26,475 missing values generated)
(3,759 real changes made)
(3,608 real changes made)
(7,367 real changes made)
(21,830 real changes made)
(19,108 missing values generated)
(7,279 real changes made)
(3,759 real changes made)
(5,813 real changes made, 5,813 to missing)
(19,189 missing values generated)
(26,475 missing values generated)
(3,660 real changes made)
(3,626 real changes made)
(3,660 real changes made)
(3,626 real changes made)
(4,660 real changes made)
(26,475 missing values generated)
(3,660 real changes made)
(3,626 real changes made)
(7,286 real changes made)
(21,815 real changes made)
(19,189 missing values generated)
(7,200 real changes made)
(3,660 real changes made)
(5,662 real changes made, 5,662 to missing)
(19,038 missing values generated)
(26,475 missing values generated)
(3,771 real changes made)
(3,666 real changes made)
(3,771 real changes made)
(3,666 real changes made)
(4,714 real changes made)
(26,475 missing values generated)
(3,771 real changes made)
(3,666 real changes made)
(7,437 real changes made)
(21,761 real changes made)
(19,038 missing values generated)
(7,354 real changes made)
(3,771 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)
(1,731 missing values generated)

. gen baseline_egfr=.
(26,475 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 
> apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 jul2019 au
> g2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2
> 021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug202
> 2 sep2022 oct2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(231 real changes made)
(266 real changes made)
(247 real changes made)
(312 real changes made)
(266 real changes made)
(271 real changes made)
(283 real changes made)
(278 real changes made)
(259 real changes made)
(214 real changes made)
(229 real changes made)
(216 real changes made)
(204 real changes made)
(241 real changes made)
(235 real changes made)
(199 real changes made)
(224 real changes made)
(220 real changes made)
(219 real changes made)
(219 real changes made)
(229 real changes made)
(192 real changes made)
(200 real changes made)
(189 real changes made)
(198 real changes made)
(201 real changes made)
(178 real changes made)
(216 real changes made)
(182 real changes made)
(214 real changes made)
(170 real changes made)
(173 real changes made)
(203 real changes made)
(258 real changes made)
(227 real changes made)
(217 real changes made)
(229 real changes made)
(179 real changes made)
(220 real changes made)
(194 real changes made)
(195 real changes made)
(188 real changes made)
(204 real changes made)
(189 real changes made)
(219 real changes made)
(201 real changes made)
(198 real changes made)
(215 real changes made)
(193 real changes made)
(197 real changes made)
(205 real changes made)
(165 real changes made)
(192 real changes made)
(168 real changes made)
(180 real changes made)
(214 real changes made)
(157 real changes made)
(174 real changes made)
(189 real changes made)
(180 real changes made)
(165 real changes made)
(196 real changes made)
(194 real changes made)
(191 real changes made)
(191 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(1 real change made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab covid baseline_esrd

           |     baseline_esrd
     covid |   No ESRD       ESRD |     Total
-----------+----------------------+----------
         1 |    13,098          1 |    13,099 
-----------+----------------------+----------
     Total |    13,098          1 |    13,099 

. tab pneumonia baseline_esrd

           | baseline_e
           |    srd
 pneumonia |   No ESRD |     Total
-----------+-----------+----------
         1 |    13,376 |    13,376 
-----------+-----------+----------
     Total |    13,376 |    13,376 

. drop if baseline_esrd==1
(1 observation deleted)

. drop baseline_esrd

. 
. ** Exposure
. gen case = covid
(13,376 missing values generated)

. replace case = 0 if covid==.
(13,376 real changes made)

. label define case 0 "Pneumonia (pre-pandemic)" ///
>                                   1 "COVID-19"

. label values case case

. tab case covid

                      |   covid
                 case |         1 |     Total
----------------------+-----------+----------
             COVID-19 |    13,098 |    13,098 
----------------------+-----------+----------
                Total |    13,098 |    13,098 

. tab case pneumonia

                      | pneumonia
                 case |         1 |     Total
----------------------+-----------+----------
Pneumonia (pre-pandem |    13,376 |    13,376 
----------------------+-----------+----------
                Total |    13,376 |    13,376 

. drop covid

. drop pneumonia

. safetab case 

                    case |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,376       50.53       50.53
                COVID-19 |     13,098       49.47      100.00
-------------------------+-----------------------------------
                   Total |     26,474      100.00

. 
. * Critical care during index admission
. replace critical_care = 1 if critical_days==1
(1,272 real changes made)

. drop critical_days

. label define critical_care      0 "Ward-based"          ///
>                                                         1 "Critical care"

. label values critical_care critical_care

. label var critical_care "Critical care"

. safetab critical_care, m

Critical care |      Freq.     Percent        Cum.
--------------+-----------------------------------
   Ward-based |     23,892       90.25       90.25
Critical care |      2,582        9.75      100.00
--------------+-----------------------------------
        Total |     26,474      100.00

. gen case_critical_care = critical_care

. replace case_critical_care = 2 if case==1
(13,098 real changes made)

. replace case_critical_care = 3 if case==1 &critical_care==1
(1,318 real changes made)

. label define case_critical_care 0 "Ward-based pneumonia (pre-pandemic)"         ///
>                                                                 1 "Critical care pneumonia (pre-pandemic)"      ///
>                                                                 2 "Ward-based COVID-19"                                         //
> /
>                                                                 3 "Critical care COVID-19"

. label values case_critical_care case_critical_care

. safetab case_critical_care, m

                    case_critical_care |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
   Ward-based pneumonia (pre-pandemic) |     12,112       45.75       45.75
Critical care pneumonia (pre-pandemic) |      1,264        4.77       50.53
                   Ward-based COVID-19 |     11,780       44.50       95.02
                Critical care COVID-19 |      1,318        4.98      100.00
---------------------------------------+-----------------------------------
                                 Total |     26,474      100.00

. 
. * Acute kidney injury during index admission
. rename acute_kidney_injury adm_aki

. label define adm_aki    0 "No AKI"      ///
>                                                 1 "AKI"

. label values adm_aki adm_aki

. label var adm_aki "Acute kidney injury"

. safetab adm_aki, m

      Acute |
     kidney |
     injury |      Freq.     Percent        Cum.
------------+-----------------------------------
     No AKI |     15,764       59.55       59.55
        AKI |     10,710       40.45      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. gen case_adm_aki = adm_aki

. replace case_adm_aki = 2 if case==1
(13,098 real changes made)

. replace case_adm_aki = 3 if case==1 &adm_aki==1
(5,295 real changes made)

. label define case_adm_aki       0 "No AKI pneumonia (pre-pandemic)"     ///
>                                                                                 1 "AKI pneumonia (pre-pandemic)"        ///
>                                                                                 2 "No AKI COVID-19"                             //
> /
>                                                                                 3 "AKI COVID-19"

. label values case_adm_aki case_adm_aki

. safetab case_adm_aki, m

                   case_adm_aki |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
No AKI pneumonia (pre-pandemic) |      7,961       30.07       30.07
   AKI pneumonia (pre-pandemic) |      5,415       20.45       50.53
                No AKI COVID-19 |      7,803       29.47       80.00
                   AKI COVID-19 |      5,295       20.00      100.00
--------------------------------+-----------------------------------
                          Total |     26,474      100.00

. 
. * Kidney replacement therapy during index admission
. gen krt = adm_aki

. replace krt = 2 if krt_icd_10==1
(257 real changes made)

. drop krt_icd_10

. replace krt = 2 if krt_opcs_4==1
(259 real changes made)

. drop krt_opcs_4

. label define krt        0 "No AKI"                              ///
>                                         1 "AKI without KRT"             ///
>                                         2 "AKI requiring KRT"

. label values krt krt

. label var krt "Kidney replacement therapy"

. safetab krt, m

           Kidney |
      replacement |
          therapy |      Freq.     Percent        Cum.
------------------+-----------------------------------
           No AKI |     15,461       58.40       58.40
  AKI without KRT |     10,497       39.65       98.05
AKI requiring KRT |        516        1.95      100.00
------------------+-----------------------------------
            Total |     26,474      100.00

. gen case_krt = krt

. replace case_krt = 3 if case==1
(13,098 real changes made)

. replace case_krt = 4 if case==1 &krt==1
(5,178 real changes made)

. replace case_krt = 5 if case==1 &krt==2
(269 real changes made)

. label define case_krt   0 "No AKI pneumonia (pre-pandemic)"                     ///
>                                                 1 "AKI without KRT pneumonia (pre-pandemic)"    ///
>                                                 2 "AKI requiring KRT pneumonia (pre-pandemic)"  ///
>                                                 3 "No AKI COVID-19"                                                             //
> /
>                                                 4 "AKI without KRT COVID-19"                                    ///
>                                                 5 "AKI requiring KRT COVID-19"

. label values case_krt case_krt

. safetab case_krt, m

                               case_krt |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
        No AKI pneumonia (pre-pandemic) |      7,810       29.50       29.50
AKI without KRT pneumonia (pre-pandemic |      5,319       20.09       49.59
AKI requiring KRT pneumonia (pre-pandem |        247        0.93       50.53
                        No AKI COVID-19 |      7,651       28.90       79.43
               AKI without KRT COVID-19 |      5,178       19.56       98.98
             AKI requiring KRT COVID-19 |        269        1.02      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,474      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(17,214 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(17,302 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(17,341 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(17,336 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(9,138 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(2,772 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(834 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(242 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Pneumonia (pre-pandemic)"    ///
>                                                 1 "COVID pre-vaccination"                       ///
>                                                 2 "COVID 1 vaccine dose"                        ///
>                                                 3 "COVID 2 vaccine doses"                       ///
>                                                 4 "COVID 3 vaccine doses"                       ///
>                                                 5 "COVID 4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "COVID-19 vaccination status"

. safetab covid_vax, m

    COVID-19 vaccination |
                  status |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,376       50.53       50.53
   COVID pre-vaccination |        112        0.42       50.95
    COVID 1 vaccine dose |        242        0.91       51.86
   COVID 2 vaccine doses |        834        3.15       55.01
   COVID 3 vaccine doses |      2,772       10.47       65.48
   COVID 4 vaccine doses |      9,138       34.52      100.00
-------------------------+-----------------------------------
                   Total |     26,474      100.00

. 
. * COVID-19 wave
. gen wave = case

. replace wave = 2 if index_month=="sep2020"
(375 real changes made)

. replace wave = 2 if index_month=="oct2020"
(378 real changes made)

. replace wave = 2 if index_month=="nov2020"
(334 real changes made)

. replace wave = 2 if index_month=="dec2020"
(376 real changes made)

. replace wave = 2 if index_month=="jan2021"
(374 real changes made)

. replace wave = 2 if index_month=="feb2021"
(367 real changes made)

. replace wave = 2 if index_month=="mar2021"
(353 real changes made)

. replace wave = 2 if index_month=="apr2021"
(379 real changes made)

. replace wave = 2 if index_month=="may2021"
(376 real changes made)

. replace wave = 2 if index_month=="jun2021"
(368 real changes made)

. replace wave = 3 if index_month=="jul2021"
(365 real changes made)

. replace wave = 3 if index_month=="aug2021"
(357 real changes made)

. replace wave = 3 if index_month=="sep2021"
(297 real changes made)

. replace wave = 3 if index_month=="oct2021"
(353 real changes made)

. replace wave = 3 if index_month=="nov2021"
(322 real changes made)

. replace wave = 4 if index_month=="dec2021"
(332 real changes made)

. replace wave = 4 if index_month=="jan2022"
(359 real changes made)

. replace wave = 4 if index_month=="feb2022"
(283 real changes made)

. replace wave = 4 if index_month=="mar2022"
(313 real changes made)

. replace wave = 4 if index_month=="apr2022"
(340 real changes made)

. replace wave = 4 if index_month=="may2022"
(310 real changes made)

. replace wave = 4 if index_month=="jun2022"
(291 real changes made)

. replace wave = 4 if index_month=="jul2022"
(328 real changes made)

. replace wave = 4 if index_month=="aug2022"
(340 real changes made)

. replace wave = 4 if index_month=="sep2022"
(346 real changes made)

. replace wave = 4 if index_month=="oct2022"
(314 real changes made)

. label define wave       0 "Pneumonia (pre-pandemic)"    ///
>                                         1 "COVID Feb20-Aug20"   ///
>                                         2 "COVID Sep20-Jun21"   ///
>                                         3 "COVID Jul21-Nov21"   ///
>                                         4 "COVID Dec21-Oct22"   

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m

           COVID-19 wave |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,376       50.53       50.53
       COVID Feb20-Aug20 |      4,168       15.74       66.27
       COVID Sep20-Jun21 |      3,680       13.90       80.17
       COVID Jul21-Nov21 |      1,694        6.40       86.57
       COVID Dec21-Oct22 |      3,556       13.43      100.00
-------------------------+-----------------------------------
                   Total |     26,474      100.00

. 
. * Month
. gen month_string=substr(index_date_string ,3,3)
(1,731 missing values generated)

. gen month = 1 if month_string=="jan"
(24,990 missing values generated)

. replace month = 2 if month_string=="feb"
(2,152 real changes made)

. replace month = 3 if month_string=="mar"
(2,364 real changes made)

. replace month = 4 if month_string=="apr"
(2,376 real changes made)

. replace month = 5 if month_string=="may"
(2,345 real changes made)

. replace month = 6 if month_string=="jun"
(2,245 real changes made)

. replace month = 7 if month_string=="jul"
(2,285 real changes made)

. replace month = 8 if month_string=="aug"
(2,251 real changes made)

. replace month = 9 if month_string=="sep"
(2,150 real changes made)

. replace month = 10 if month_string=="oct"
(2,207 real changes made)

. replace month = 11 if month_string=="nov"
(1,392 real changes made)

. replace month = 12 if month_string=="dec"
(1,492 real changes made)

. drop month_string

. label define month      1 "January"             ///
>                                         2 "February"    ///
>                                         3 "March"               ///
>                                         4 "April"               ///
>                                         5 "May"                 ///
>                                         6 "June"                ///
>                                         7 "July"                ///
>                                         8 "August"              ///
>                                         9 "September"   ///
>                                         10 "October"    ///
>                                         11 "November"   ///
>                                         12 "December"

. label values month month

. safetab month case, m

           |         case
     month | Pneumonia   COVID-19 |     Total
-----------+----------------------+----------
   January |       751        733 |     1,484 
  February |     1,139      1,013 |     2,152 
     March |     1,258      1,106 |     2,364 
     April |     1,257      1,119 |     2,376 
       May |     1,267      1,078 |     2,345 
      June |     1,175      1,070 |     2,245 
      July |     1,249      1,036 |     2,285 
    August |     1,156      1,095 |     2,251 
 September |     1,132      1,018 |     2,150 
   October |     1,162      1,045 |     2,207 
  November |       736        656 |     1,392 
  December |       784        708 |     1,492 
         . |       310      1,421 |     1,731 
-----------+----------------------+----------
     Total |    13,376     13,098 |    26,474 

. 
. ** Covariates
. * Check of GP consultations by groups
. sum gp_count, detail

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -4
 5%            0             -4
10%            0             -4       Obs              26,474
25%            0             -4       Sum of wgt.      26,474

50%            3                      Mean           3.281106
                        Largest       Std. dev.      3.526095
75%            6             16
90%            8             16       Variance       12.43335
95%           10             16       Skewness        .638474
99%           12             17       Kurtosis       2.270093

. bysort case: sum gp_count, detail

------------------------------------------------------------------------------------------------------------------------------------
-> case = Pneumonia (pre-pandemic)

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -4
 5%            0             -4
10%            0             -4       Obs              13,376
25%            0             -4       Sum of wgt.      13,376

50%            3                      Mean           3.265775
                        Largest       Std. dev.      3.507324
75%            6             15
90%            8             16       Variance       12.30132
95%           10             16       Skewness       .6338741
99%           12             17       Kurtosis       2.257696

------------------------------------------------------------------------------------------------------------------------------------
-> case = COVID-19

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -4
 5%            0             -4
10%            0             -4       Obs              13,098
25%            0             -4       Sum of wgt.      13,098

50%            3                      Mean           3.296763
                        Largest       Std. dev.      3.545228
75%            6             15
90%            8             15       Variance       12.56864
95%           10             15       Skewness       .6427224
99%           12             16       Kurtosis       2.281134


. 
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        293        1.11        1.11
          1 |        263        0.99        2.10
          2 |        293        1.11        3.21
          3 |        324        1.22        4.43
          4 |        338        1.28        5.71
          5 |        340        1.28        6.99
          6 |        319        1.20        8.20
          7 |        335        1.27        9.46
          8 |        345        1.30       10.77
          9 |        341        1.29       12.05
         10 |        307        1.16       13.21
         11 |        295        1.11       14.33
         12 |        350        1.32       15.65
         13 |        298        1.13       16.77
         14 |        305        1.15       17.93
         15 |        264        1.00       18.92
         16 |        290        1.10       20.02
         17 |        297        1.12       21.14
         18 |        295        1.11       22.26
         19 |        265        1.00       23.26
         20 |        319        1.20       24.46
         21 |        367        1.39       25.85
         22 |        347        1.31       27.16
         23 |        349        1.32       28.48
         24 |        318        1.20       29.68
         25 |        385        1.45       31.13
         26 |        357        1.35       32.48
         27 |        355        1.34       33.82
         28 |        358        1.35       35.17
         29 |        399        1.51       36.68
         30 |        364        1.37       38.06
         31 |        380        1.44       39.49
         32 |        315        1.19       40.68
         33 |        333        1.26       41.94
         34 |        347        1.31       43.25
         35 |        361        1.36       44.61
         36 |        368        1.39       46.00
         37 |        324        1.22       47.23
         38 |        326        1.23       48.46
         39 |        338        1.28       49.74
         40 |        305        1.15       50.89
         41 |        309        1.17       52.05
         42 |        365        1.38       53.43
         43 |        323        1.22       54.65
         44 |        342        1.29       55.95
         45 |        369        1.39       57.34
         46 |        354        1.34       58.68
         47 |        340        1.28       59.96
         48 |        347        1.31       61.27
         49 |        387        1.46       62.73
         50 |        345        1.30       64.04
         51 |        367        1.39       65.42
         52 |        385        1.45       66.88
         53 |        407        1.54       68.41
         54 |        369        1.39       69.81
         55 |        351        1.33       71.13
         56 |        368        1.39       72.52
         57 |        391        1.48       74.00
         58 |        350        1.32       75.32
         59 |        358        1.35       76.68
         60 |        275        1.04       77.71
         61 |        258        0.97       78.69
         62 |        278        1.05       79.74
         63 |        280        1.06       80.80
         64 |        284        1.07       81.87
         65 |        246        0.93       82.80
         66 |        260        0.98       83.78
         67 |        272        1.03       84.81
         68 |        275        1.04       85.85
         69 |        255        0.96       86.81
         70 |        241        0.91       87.72
         71 |        242        0.91       88.63
         72 |        252        0.95       89.59
         73 |        262        0.99       90.58
         74 |        276        1.04       91.62
         75 |        168        0.63       92.25
         76 |        175        0.66       92.91
         77 |        158        0.60       93.51
         78 |        171        0.65       94.16
         79 |        201        0.76       94.92
         80 |        146        0.55       95.47
         81 |        136        0.51       95.98
         82 |        131        0.49       96.48
         83 |        136        0.51       96.99
         84 |        132        0.50       97.49
         85 |         82        0.31       97.80
         86 |         85        0.32       98.12
         87 |         96        0.36       98.48
         88 |         75        0.28       98.76
         89 |         84        0.32       99.08
         90 |         26        0.10       99.18
         91 |         31        0.12       99.30
         92 |         38        0.14       99.44
         93 |         37        0.14       99.58
         94 |         43        0.16       99.74
         95 |          8        0.03       99.77
         96 |         11        0.04       99.81
         97 |         13        0.05       99.86
         98 |         11        0.04       99.91
         99 |         11        0.04       99.95
        101 |          4        0.02       99.96
        102 |          2        0.01       99.97
        103 |          1        0.00       99.97
        104 |          1        0.00       99.98
        105 |          1        0.00       99.98
        106 |          2        0.01       99.99
        108 |          1        0.00       99.99
        109 |          2        0.01      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. safecount
  26,474

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///                                     
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(26,211 differences between age and agegroup)

. 
. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label values agegroup agegroup

. label var agegroup "Age group"

. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     13,529       51.10       51.10
       Male |     12,945       48.90      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. safecount
  26,474

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(988 real changes made)

. replace ethnicity=2 if ethnicity==3
(1,018 real changes made)

. replace ethnicity=3 if ethnicity==4
(1,023 real changes made)

. replace ethnicity=4 if ethnicity==6
(988 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///                                             
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                                                               

. label values ethnicity ethnicity

. safetab ethnicity, m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     15,804       59.70       59.70
South Asian |      1,018        3.85       63.54
      Black |      1,023        3.86       67.41
      Mixed |        988        3.73       71.14
      Other |        978        3.69       74.83
          . |      6,663       25.17      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(6,663 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(6,663 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                       
>       
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. safetab ethnicity1, m

 ethnicity1 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     15,804       59.70       59.70
South Asian |      1,018        3.85       63.54
      Black |      1,023        3.86       67.41
      Mixed |        988        3.73       71.14
      Other |        978        3.69       74.83
    Unknown |      6,663       25.17      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        //
> /
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      //
> /
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,627        9.92        9.92
                Urban minor conurbation |      2,646        9.99       19.92
                    Urban city and town |      2,556        9.65       29.57
Urban city and town in a sparse setting |      2,667       10.07       39.65
                  Rural town and fringe |      2,607        9.85       49.49
Rural town and fringe in a sparse setti |      2,709       10.23       59.73
            Rural village and dispersed |      5,377       20.31       80.04
Rural village and dispersed in a sparse |      5,285       19.96      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,474      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(26,474 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(10,496 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(15,978 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                                       rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow  Rural tow  Rural vil  Rural vil |     Total
-----------+----------------------------------------------------------------------------------------+----------
     Rural |         0          0          0          0      2,607      2,709      5,377      5,285 |    15,978 
     Urban |     2,627      2,646      2,556      2,667          0          0          0          0 |    10,496 
-----------+----------------------------------------------------------------------------------------+----------
     Total |     2,627      2,646      2,556      2,667      2,607      2,709      5,377      5,285 |    26,474 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Pneumonia (pre-pandem |     8,091      5,285 |    13,376 
             COVID-19 |     7,887      5,211 |    13,098 
----------------------+----------------------+----------
                Total |    15,978     10,496 |    26,474 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,684 real changes made, 2,684 to missing)

. gen     bmi = .
(26,474 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(1,636 changes made to bmi)

. recode  bmi . = 2 if body_mass_index<25
(6,000 changes made to bmi)

. recode  bmi . = 3 if body_mass_index<30
(6,136 changes made to bmi)

. recode  bmi . = 4 if body_mass_index<35
(5,273 changes made to bmi)

. recode  bmi . = 5 if body_mass_index<40
(3,149 changes made to bmi)

. recode  bmi . = 6 if body_mass_index<.
(1,596 changes made to bmi)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                             

. label values bmi bmi

. safetab bmi, m

                 bmi |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,636        6.18        6.18
  Normal (18.5-24.9) |      6,000       22.66       28.84
Overweight (25-29.9) |      6,136       23.18       52.02
   Obese I (30-34.9) |      5,273       19.92       71.94
  Obese II (35-39.9) |      3,149       11.89       83.83
     Obese III (40+) |      1,596        6.03       89.86
                   . |      2,684       10.14      100.00
---------------------+-----------------------------------
               Total |     26,474      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(15,418 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(1,852 real changes made)

. replace smoking = 0 if smoking_status=="N"
(3,705 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |      3,705       13.99       13.99
Current/former smoker |     12,908       48.76       62.75
                    . |      9,861       37.25      100.00
----------------------+-----------------------------------
                Total |     26,474      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000)
(12,813 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(13,661 changes made to egfr_group)

. label define egfr_group 1 "105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       105 |      4,649       17.56       17.56
     90-104 |      1,831        6.92       24.48
      75-89 |      1,928        7.28       31.76
      60-74 |      2,093        7.91       39.67
      45-59 |      1,980        7.48       47.14
      30-44 |      1,069        4.04       51.18
      15-29 |        111        0.42       51.60
          . |     12,813       48.40      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 15-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(12,813 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(21,825 changes made to ckd_stage)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6 "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |     10,501       39.67       39.67
                      CKD 3A |      1,980        7.48       47.14
                      CKD 3B |      1,069        4.04       51.18
                       CKD 4 |        111        0.42       51.60
No baseline eGFR measurement |     12,813       48.40      100.00
-----------------------------+-----------------------------------
                       Total |     26,474      100.00

. 
. * Comorbidities
. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,170       95.07       95.07
          1 |      1,304        4.93      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,950       98.02       98.02
          1 |        524        1.98      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. label var diabetes "Diabetes"

. safetab diabetes

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,282       80.39       80.39
          1 |      5,192       19.61      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,208       99.00       99.00
          1 |        266        1.00      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. safetab heart_failure

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,420       96.02       96.02
          1 |      1,054        3.98      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. safetab hiv

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,964       98.07       98.07
          1 |        510        1.93      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. label var hypertension "Hypertension"

. safetab hypertension

Hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,175       79.98       79.98
          1 |      5,299       20.02      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. label var non_haem_cancer "Cancer (non-haematological)"

. safetab non_haem_cancer

     Cancer |
(non-haemat |
  ological) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,922       97.91       97.91
          1 |        552        2.09      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. safetab myocardial_infarction

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,803       89.91       89.91
          1 |      2,671       10.09      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,974       98.11       98.11
          1 |        500        1.89      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,165       95.06       95.06
          1 |      1,309        4.94      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. safetab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,949       98.02       98.02
          1 |        525        1.98      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,955       98.04       98.04
          1 |        519        1.96      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(1,001 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,451 real changes made)

. replace cardiovascular = 1 if pvd==1
(421 real changes made)

. replace cardiovascular = 1 if stroke==1
(422 real changes made)

. label var cardiovascular "Cardiovascular diseases"

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(502 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,271 real changes made)

. replace immunosuppressed = 1 if lupus==1
(479 real changes made)

. label var immunosuppressed "Immunosuppressive diseases"

. safetab cardiovascular

Cardiovascu |
        lar |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,875       78.85       78.85
          1 |      5,599       21.15      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. safetab immunosuppressed

Immunosuppr |
     essive |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,956       90.49       90.49
          1 |      2,518        9.51      100.00
------------+-----------------------------------
      Total |     26,474      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                                 creatinine_mar2017 ///
>                                                                                 creatinine_apr2017 ///
>                                                                                 creatinine_may2017 ///
>                                                                                 creatinine_jun2017 ///
>                                                                                 creatinine_jul2017 ///
>                                                                                 creatinine_aug2017 ///
>                                                                                 creatinine_sep2017 ///
>                                                                                 creatinine_oct2017 ///
>                                                                                 creatinine_nov2017 ///
>                                                                                 creatinine_dec2017 ///
>                                                                                 creatinine_jan2018 ///
>                                                                                 creatinine_feb2018 ///
>                                                                                 creatinine_mar2018 ///
>                                                                                 creatinine_apr2018 ///
>                                                                                 creatinine_may2018 ///
>                                                                                 creatinine_jun2018 ///
>                                                                                 creatinine_jul2018 ///
>                                                                                 creatinine_aug2018 ///
>                                                                                 creatinine_sep2018 ///
>                                                                                 creatinine_oct2018 ///
>                                                                                 creatinine_nov2018 ///
>                                                                                 creatinine_dec2018 ///
>                                                                                 creatinine_jan2019 ///
>                                                                                 creatinine_feb2019 ///
>                                                                                 creatinine_mar2019 ///
>                                                                                 creatinine_apr2019 ///
>                                                                                 creatinine_may2019 ///
>                                                                                 creatinine_jun2019 ///
>                                                                                 creatinine_jul2019 ///
>                                                                                 creatinine_aug2019 ///
>                                                                                 creatinine_sep2019 ///
>                                                                                 creatinine_feb2020 ///
>                                                                                 creatinine_mar2020 ///
>                                                                                 creatinine_apr2020 ///
>                                                                                 creatinine_may2020 ///
>                                                                                 creatinine_jun2020 ///
>                                                                                 creatinine_jul2020 ///
>                                                                                 creatinine_aug2020 ///
>                                                                                 creatinine_sep2020 ///
>                                                                                 creatinine_oct2020 ///
>                                                                                 creatinine_nov2020 ///
>                                                                                 creatinine_dec2020 ///
>                                                                                 creatinine_jan2021 ///
>                                                                                 creatinine_feb2021 ///
>                                                                                 creatinine_mar2021 ///
>                                                                                 creatinine_apr2021 ///
>                                                                                 creatinine_may2021 ///
>                                                                                 creatinine_jun2021 ///
>                                                                                 creatinine_jul2021 ///
>                                                                                 creatinine_aug2021 ///
>                                                                                 creatinine_sep2021 ///
>                                                                                 creatinine_oct2021 ///
>                                                                                 creatinine_nov2021 ///
>                                                                                 creatinine_dec2021 ///
>                                                                                 creatinine_jan2022 ///
>                                                                                 creatinine_feb2022 ///
>                                                                                 creatinine_mar2022 ///
>                                                                                 creatinine_apr2022 ///
>                                                                                 creatinine_may2022 ///
>                                                                                 creatinine_jun2022 ///
>                                                                                 creatinine_jul2022 ///
>                                                                                 creatinine_aug2022 ///
>                                                                                 creatinine_sep2022 ///
>                                                                                 creatinine_oct2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 3000)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex==0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex==1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_monthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(5,919 real changes made, 5,919 to missing)
(19,017 missing values generated)
(26,474 missing values generated)
(3,778 real changes made)
(3,679 real changes made)
(3,778 real changes made)
(3,679 real changes made)
(4,715 real changes made)
(26,474 missing values generated)
(3,778 real changes made)
(3,679 real changes made)
(7,457 real changes made)
(21,759 real changes made)
(19,017 missing values generated)
(7,371 real changes made)
(3,778 real changes made)
(5,931 real changes made, 5,931 to missing)
(19,029 missing values generated)
(26,474 missing values generated)
(3,851 real changes made)
(3,594 real changes made)
(3,851 real changes made)
(3,594 real changes made)
(4,717 real changes made)
(26,474 missing values generated)
(3,851 real changes made)
(3,594 real changes made)
(7,445 real changes made)
(21,757 real changes made)
(19,029 missing values generated)
(7,361 real changes made)
(3,851 real changes made)
(5,758 real changes made, 5,758 to missing)
(18,856 missing values generated)
(26,474 missing values generated)
(3,882 real changes made)
(3,736 real changes made)
(3,882 real changes made)
(3,736 real changes made)
(4,813 real changes made)
(26,474 missing values generated)
(3,882 real changes made)
(3,736 real changes made)
(7,618 real changes made)
(21,661 real changes made)
(18,856 missing values generated)
(7,533 real changes made)
(3,882 real changes made)
(5,789 real changes made, 5,789 to missing)
(18,887 missing values generated)
(26,474 missing values generated)
(3,839 real changes made)
(3,748 real changes made)
(3,839 real changes made)
(3,748 real changes made)
(4,864 real changes made)
(26,474 missing values generated)
(3,839 real changes made)
(3,748 real changes made)
(7,587 real changes made)
(21,610 real changes made)
(18,887 missing values generated)
(7,509 real changes made)
(3,839 real changes made)
(5,957 real changes made, 5,957 to missing)
(19,055 missing values generated)
(26,474 missing values generated)
(3,754 real changes made)
(3,665 real changes made)
(3,754 real changes made)
(3,665 real changes made)
(4,584 real changes made)
(26,474 missing values generated)
(3,754 real changes made)
(3,665 real changes made)
(7,419 real changes made)
(21,890 real changes made)
(19,055 missing values generated)
(7,332 real changes made)
(3,754 real changes made)
(5,872 real changes made, 5,872 to missing)
(18,970 missing values generated)
(26,474 missing values generated)
(3,845 real changes made)
(3,659 real changes made)
(3,845 real changes made)
(3,659 real changes made)
(4,740 real changes made)
(26,474 missing values generated)
(3,845 real changes made)
(3,659 real changes made)
(7,504 real changes made)
(21,734 real changes made)
(18,970 missing values generated)
(7,421 real changes made)
(3,845 real changes made)
(5,804 real changes made, 5,804 to missing)
(18,902 missing values generated)
(26,474 missing values generated)
(3,855 real changes made)
(3,717 real changes made)
(3,855 real changes made)
(3,717 real changes made)
(4,770 real changes made)
(26,474 missing values generated)
(3,855 real changes made)
(3,717 real changes made)
(7,572 real changes made)
(21,704 real changes made)
(18,902 missing values generated)
(7,487 real changes made)
(3,855 real changes made)
(5,937 real changes made, 5,937 to missing)
(19,035 missing values generated)
(26,474 missing values generated)
(3,808 real changes made)
(3,631 real changes made)
(3,808 real changes made)
(3,631 real changes made)
(4,682 real changes made)
(26,474 missing values generated)
(3,808 real changes made)
(3,631 real changes made)
(7,439 real changes made)
(21,792 real changes made)
(19,035 missing values generated)
(7,344 real changes made)
(3,808 real changes made)
(5,952 real changes made, 5,952 to missing)
(19,050 missing values generated)
(26,474 missing values generated)
(3,801 real changes made)
(3,623 real changes made)
(3,801 real changes made)
(3,623 real changes made)
(4,675 real changes made)
(26,474 missing values generated)
(3,801 real changes made)
(3,623 real changes made)
(7,424 real changes made)
(21,799 real changes made)
(19,050 missing values generated)
(7,342 real changes made)
(3,801 real changes made)
(5,961 real changes made, 5,961 to missing)
(19,059 missing values generated)
(26,474 missing values generated)
(3,810 real changes made)
(3,605 real changes made)
(3,810 real changes made)
(3,605 real changes made)
(4,646 real changes made)
(26,474 missing values generated)
(3,810 real changes made)
(3,605 real changes made)
(7,415 real changes made)
(21,828 real changes made)
(19,059 missing values generated)
(7,333 real changes made)
(3,810 real changes made)
(5,841 real changes made, 5,841 to missing)
(18,939 missing values generated)
(26,474 missing values generated)
(3,859 real changes made)
(3,676 real changes made)
(3,859 real changes made)
(3,676 real changes made)
(4,862 real changes made)
(26,474 missing values generated)
(3,859 real changes made)
(3,676 real changes made)
(7,535 real changes made)
(21,612 real changes made)
(18,939 missing values generated)
(7,454 real changes made)
(3,859 real changes made)
(5,846 real changes made, 5,846 to missing)
(18,944 missing values generated)
(26,474 missing values generated)
(3,850 real changes made)
(3,680 real changes made)
(3,850 real changes made)
(3,680 real changes made)
(4,737 real changes made)
(26,474 missing values generated)
(3,850 real changes made)
(3,680 real changes made)
(7,530 real changes made)
(21,737 real changes made)
(18,944 missing values generated)
(7,447 real changes made)
(3,850 real changes made)
(5,835 real changes made, 5,835 to missing)
(18,933 missing values generated)
(26,474 missing values generated)
(3,845 real changes made)
(3,696 real changes made)
(3,845 real changes made)
(3,696 real changes made)
(4,771 real changes made)
(26,474 missing values generated)
(3,845 real changes made)
(3,696 real changes made)
(7,541 real changes made)
(21,703 real changes made)
(18,933 missing values generated)
(7,458 real changes made)
(3,845 real changes made)
(5,884 real changes made, 5,884 to missing)
(18,982 missing values generated)
(26,474 missing values generated)
(3,804 real changes made)
(3,688 real changes made)
(3,804 real changes made)
(3,688 real changes made)
(4,746 real changes made)
(26,474 missing values generated)
(3,804 real changes made)
(3,688 real changes made)
(7,492 real changes made)
(21,728 real changes made)
(18,982 missing values generated)
(7,410 real changes made)
(3,804 real changes made)
(5,910 real changes made, 5,910 to missing)
(19,008 missing values generated)
(26,474 missing values generated)
(3,822 real changes made)
(3,644 real changes made)
(3,822 real changes made)
(3,644 real changes made)
(4,705 real changes made)
(26,474 missing values generated)
(3,822 real changes made)
(3,644 real changes made)
(7,466 real changes made)
(21,769 real changes made)
(19,008 missing values generated)
(7,386 real changes made)
(3,822 real changes made)
(5,852 real changes made, 5,852 to missing)
(18,950 missing values generated)
(26,474 missing values generated)
(3,860 real changes made)
(3,664 real changes made)
(3,860 real changes made)
(3,664 real changes made)
(4,825 real changes made)
(26,474 missing values generated)
(3,860 real changes made)
(3,664 real changes made)
(7,524 real changes made)
(21,649 real changes made)
(18,950 missing values generated)
(7,434 real changes made)
(3,860 real changes made)
(5,897 real changes made, 5,897 to missing)
(18,995 missing values generated)
(26,474 missing values generated)
(3,808 real changes made)
(3,671 real changes made)
(3,808 real changes made)
(3,671 real changes made)
(4,736 real changes made)
(26,474 missing values generated)
(3,808 real changes made)
(3,671 real changes made)
(7,479 real changes made)
(21,738 real changes made)
(18,995 missing values generated)
(7,397 real changes made)
(3,808 real changes made)
(5,823 real changes made, 5,823 to missing)
(18,921 missing values generated)
(26,474 missing values generated)
(3,810 real changes made)
(3,743 real changes made)
(3,810 real changes made)
(3,743 real changes made)
(4,801 real changes made)
(26,474 missing values generated)
(3,810 real changes made)
(3,743 real changes made)
(7,553 real changes made)
(21,673 real changes made)
(18,921 missing values generated)
(7,472 real changes made)
(3,810 real changes made)
(5,861 real changes made, 5,861 to missing)
(18,959 missing values generated)
(26,474 missing values generated)
(3,854 real changes made)
(3,661 real changes made)
(3,854 real changes made)
(3,661 real changes made)
(4,719 real changes made)
(26,474 missing values generated)
(3,854 real changes made)
(3,661 real changes made)
(7,515 real changes made)
(21,755 real changes made)
(18,959 missing values generated)
(7,431 real changes made)
(3,854 real changes made)
(5,894 real changes made, 5,894 to missing)
(18,992 missing values generated)
(26,474 missing values generated)
(3,796 real changes made)
(3,686 real changes made)
(3,796 real changes made)
(3,686 real changes made)
(4,743 real changes made)
(26,474 missing values generated)
(3,796 real changes made)
(3,686 real changes made)
(7,482 real changes made)
(21,731 real changes made)
(18,992 missing values generated)
(7,393 real changes made)
(3,796 real changes made)
(5,907 real changes made, 5,907 to missing)
(19,005 missing values generated)
(26,474 missing values generated)
(3,821 real changes made)
(3,648 real changes made)
(3,821 real changes made)
(3,648 real changes made)
(4,745 real changes made)
(26,474 missing values generated)
(3,821 real changes made)
(3,648 real changes made)
(7,469 real changes made)
(21,729 real changes made)
(19,005 missing values generated)
(7,386 real changes made)
(3,821 real changes made)
(5,847 real changes made, 5,847 to missing)
(18,945 missing values generated)
(26,474 missing values generated)
(3,876 real changes made)
(3,653 real changes made)
(3,876 real changes made)
(3,653 real changes made)
(4,729 real changes made)
(26,474 missing values generated)
(3,876 real changes made)
(3,653 real changes made)
(7,529 real changes made)
(21,745 real changes made)
(18,945 missing values generated)
(7,446 real changes made)
(3,876 real changes made)
(5,909 real changes made, 5,909 to missing)
(19,007 missing values generated)
(26,474 missing values generated)
(3,837 real changes made)
(3,630 real changes made)
(3,837 real changes made)
(3,630 real changes made)
(4,843 real changes made)
(26,474 missing values generated)
(3,837 real changes made)
(3,630 real changes made)
(7,467 real changes made)
(21,631 real changes made)
(19,007 missing values generated)
(7,378 real changes made)
(3,837 real changes made)
(5,892 real changes made, 5,892 to missing)
(18,990 missing values generated)
(26,474 missing values generated)
(3,830 real changes made)
(3,654 real changes made)
(3,830 real changes made)
(3,654 real changes made)
(4,740 real changes made)
(26,474 missing values generated)
(3,830 real changes made)
(3,654 real changes made)
(7,484 real changes made)
(21,734 real changes made)
(18,990 missing values generated)
(7,406 real changes made)
(3,830 real changes made)
(5,989 real changes made, 5,989 to missing)
(19,087 missing values generated)
(26,474 missing values generated)
(3,797 real changes made)
(3,590 real changes made)
(3,797 real changes made)
(3,590 real changes made)
(4,618 real changes made)
(26,474 missing values generated)
(3,797 real changes made)
(3,590 real changes made)
(7,387 real changes made)
(21,856 real changes made)
(19,087 missing values generated)
(7,302 real changes made)
(3,797 real changes made)
(5,860 real changes made, 5,860 to missing)
(18,958 missing values generated)
(26,474 missing values generated)
(3,834 real changes made)
(3,682 real changes made)
(3,834 real changes made)
(3,682 real changes made)
(4,689 real changes made)
(26,474 missing values generated)
(3,834 real changes made)
(3,682 real changes made)
(7,516 real changes made)
(21,785 real changes made)
(18,958 missing values generated)
(7,435 real changes made)
(3,834 real changes made)
(5,945 real changes made, 5,945 to missing)
(19,043 missing values generated)
(26,474 missing values generated)
(3,785 real changes made)
(3,646 real changes made)
(3,785 real changes made)
(3,646 real changes made)
(4,705 real changes made)
(26,474 missing values generated)
(3,785 real changes made)
(3,646 real changes made)
(7,431 real changes made)
(21,769 real changes made)
(19,043 missing values generated)
(7,342 real changes made)
(3,785 real changes made)
(5,836 real changes made, 5,836 to missing)
(18,934 missing values generated)
(26,474 missing values generated)
(3,857 real changes made)
(3,683 real changes made)
(3,857 real changes made)
(3,683 real changes made)
(4,793 real changes made)
(26,474 missing values generated)
(3,857 real changes made)
(3,683 real changes made)
(7,540 real changes made)
(21,681 real changes made)
(18,934 missing values generated)
(7,445 real changes made)
(3,857 real changes made)
(5,866 real changes made, 5,866 to missing)
(18,964 missing values generated)
(26,474 missing values generated)
(3,832 real changes made)
(3,678 real changes made)
(3,832 real changes made)
(3,678 real changes made)
(4,741 real changes made)
(26,474 missing values generated)
(3,832 real changes made)
(3,678 real changes made)
(7,510 real changes made)
(21,733 real changes made)
(18,964 missing values generated)
(7,430 real changes made)
(3,832 real changes made)
(5,855 real changes made, 5,855 to missing)
(18,953 missing values generated)
(26,474 missing values generated)
(3,819 real changes made)
(3,702 real changes made)
(3,819 real changes made)
(3,702 real changes made)
(4,799 real changes made)
(26,474 missing values generated)
(3,819 real changes made)
(3,702 real changes made)
(7,521 real changes made)
(21,675 real changes made)
(18,953 missing values generated)
(7,440 real changes made)
(3,819 real changes made)
(5,885 real changes made, 5,885 to missing)
(18,983 missing values generated)
(26,474 missing values generated)
(3,790 real changes made)
(3,701 real changes made)
(3,790 real changes made)
(3,701 real changes made)
(4,746 real changes made)
(26,474 missing values generated)
(3,790 real changes made)
(3,701 real changes made)
(7,491 real changes made)
(21,728 real changes made)
(18,983 missing values generated)
(7,408 real changes made)
(3,790 real changes made)
(5,869 real changes made, 5,869 to missing)
(18,967 missing values generated)
(26,474 missing values generated)
(3,840 real changes made)
(3,667 real changes made)
(3,840 real changes made)
(3,667 real changes made)
(4,763 real changes made)
(26,474 missing values generated)
(3,840 real changes made)
(3,667 real changes made)
(7,507 real changes made)
(21,711 real changes made)
(18,967 missing values generated)
(7,420 real changes made)
(3,840 real changes made)
(5,741 real changes made, 5,741 to missing)
(19,117 missing values generated)
(26,474 missing values generated)
(3,793 real changes made)
(3,564 real changes made)
(3,793 real changes made)
(3,564 real changes made)
(4,631 real changes made)
(26,474 missing values generated)
(3,793 real changes made)
(3,564 real changes made)
(7,357 real changes made)
(21,843 real changes made)
(19,117 missing values generated)
(7,284 real changes made)
(3,793 real changes made)
(5,788 real changes made, 5,788 to missing)
(19,164 missing values generated)
(26,474 missing values generated)
(3,709 real changes made)
(3,601 real changes made)
(3,709 real changes made)
(3,601 real changes made)
(4,669 real changes made)
(26,474 missing values generated)
(3,709 real changes made)
(3,601 real changes made)
(7,310 real changes made)
(21,805 real changes made)
(19,164 missing values generated)
(7,234 real changes made)
(3,709 real changes made)
(5,734 real changes made, 5,734 to missing)
(19,110 missing values generated)
(26,474 missing values generated)
(3,739 real changes made)
(3,625 real changes made)
(3,739 real changes made)
(3,625 real changes made)
(4,684 real changes made)
(26,474 missing values generated)
(3,739 real changes made)
(3,625 real changes made)
(7,364 real changes made)
(21,790 real changes made)
(19,110 missing values generated)
(7,282 real changes made)
(3,739 real changes made)
(5,737 real changes made, 5,737 to missing)
(19,113 missing values generated)
(26,474 missing values generated)
(3,706 real changes made)
(3,655 real changes made)
(3,706 real changes made)
(3,655 real changes made)
(4,676 real changes made)
(26,474 missing values generated)
(3,706 real changes made)
(3,655 real changes made)
(7,361 real changes made)
(21,798 real changes made)
(19,113 missing values generated)
(7,272 real changes made)
(3,706 real changes made)
(5,854 real changes made, 5,854 to missing)
(19,230 missing values generated)
(26,474 missing values generated)
(3,685 real changes made)
(3,559 real changes made)
(3,685 real changes made)
(3,559 real changes made)
(4,647 real changes made)
(26,474 missing values generated)
(3,685 real changes made)
(3,559 real changes made)
(7,244 real changes made)
(21,827 real changes made)
(19,230 missing values generated)
(7,164 real changes made)
(3,685 real changes made)
(5,749 real changes made, 5,749 to missing)
(19,125 missing values generated)
(26,474 missing values generated)
(3,775 real changes made)
(3,574 real changes made)
(3,775 real changes made)
(3,574 real changes made)
(4,689 real changes made)
(26,474 missing values generated)
(3,775 real changes made)
(3,574 real changes made)
(7,349 real changes made)
(21,785 real changes made)
(19,125 missing values generated)
(7,263 real changes made)
(3,775 real changes made)
(5,786 real changes made, 5,786 to missing)
(19,162 missing values generated)
(26,474 missing values generated)
(3,709 real changes made)
(3,603 real changes made)
(3,709 real changes made)
(3,603 real changes made)
(4,630 real changes made)
(26,474 missing values generated)
(3,709 real changes made)
(3,603 real changes made)
(7,312 real changes made)
(21,844 real changes made)
(19,162 missing values generated)
(7,225 real changes made)
(3,709 real changes made)
(5,936 real changes made, 5,936 to missing)
(19,312 missing values generated)
(26,474 missing values generated)
(3,658 real changes made)
(3,504 real changes made)
(3,658 real changes made)
(3,504 real changes made)
(4,549 real changes made)
(26,474 missing values generated)
(3,658 real changes made)
(3,504 real changes made)
(7,162 real changes made)
(21,925 real changes made)
(19,312 missing values generated)
(7,079 real changes made)
(3,658 real changes made)
(5,759 real changes made, 5,759 to missing)
(19,135 missing values generated)
(26,474 missing values generated)
(3,771 real changes made)
(3,568 real changes made)
(3,771 real changes made)
(3,568 real changes made)
(4,659 real changes made)
(26,474 missing values generated)
(3,771 real changes made)
(3,568 real changes made)
(7,339 real changes made)
(21,815 real changes made)
(19,135 missing values generated)
(7,259 real changes made)
(3,771 real changes made)
(5,791 real changes made, 5,791 to missing)
(19,167 missing values generated)
(26,474 missing values generated)
(3,672 real changes made)
(3,635 real changes made)
(3,672 real changes made)
(3,635 real changes made)
(4,616 real changes made)
(26,474 missing values generated)
(3,672 real changes made)
(3,635 real changes made)
(7,307 real changes made)
(21,858 real changes made)
(19,167 missing values generated)
(7,222 real changes made)
(3,672 real changes made)
(5,809 real changes made, 5,809 to missing)
(19,185 missing values generated)
(26,474 missing values generated)
(3,667 real changes made)
(3,622 real changes made)
(3,667 real changes made)
(3,622 real changes made)
(4,661 real changes made)
(26,474 missing values generated)
(3,667 real changes made)
(3,622 real changes made)
(7,289 real changes made)
(21,813 real changes made)
(19,185 missing values generated)
(7,214 real changes made)
(3,667 real changes made)
(5,774 real changes made, 5,774 to missing)
(19,150 missing values generated)
(26,474 missing values generated)
(3,692 real changes made)
(3,632 real changes made)
(3,692 real changes made)
(3,632 real changes made)
(4,509 real changes made)
(26,474 missing values generated)
(3,692 real changes made)
(3,632 real changes made)
(7,324 real changes made)
(21,965 real changes made)
(19,150 missing values generated)
(7,243 real changes made)
(3,692 real changes made)
(5,644 real changes made, 5,644 to missing)
(19,020 missing values generated)
(26,474 missing values generated)
(3,729 real changes made)
(3,725 real changes made)
(3,729 real changes made)
(3,725 real changes made)
(4,698 real changes made)
(26,474 missing values generated)
(3,729 real changes made)
(3,725 real changes made)
(7,454 real changes made)
(21,776 real changes made)
(19,020 missing values generated)
(7,375 real changes made)
(3,729 real changes made)
(5,884 real changes made, 5,884 to missing)
(19,260 missing values generated)
(26,474 missing values generated)
(3,695 real changes made)
(3,519 real changes made)
(3,695 real changes made)
(3,519 real changes made)
(4,523 real changes made)
(26,474 missing values generated)
(3,695 real changes made)
(3,519 real changes made)
(7,214 real changes made)
(21,951 real changes made)
(19,260 missing values generated)
(7,144 real changes made)
(3,695 real changes made)
(5,720 real changes made, 5,720 to missing)
(19,096 missing values generated)
(26,474 missing values generated)
(3,751 real changes made)
(3,627 real changes made)
(3,751 real changes made)
(3,627 real changes made)
(4,743 real changes made)
(26,474 missing values generated)
(3,751 real changes made)
(3,627 real changes made)
(7,378 real changes made)
(21,731 real changes made)
(19,096 missing values generated)
(7,303 real changes made)
(3,751 real changes made)
(5,773 real changes made, 5,773 to missing)
(19,149 missing values generated)
(26,474 missing values generated)
(3,727 real changes made)
(3,598 real changes made)
(3,727 real changes made)
(3,598 real changes made)
(4,716 real changes made)
(26,474 missing values generated)
(3,727 real changes made)
(3,598 real changes made)
(7,325 real changes made)
(21,758 real changes made)
(19,149 missing values generated)
(7,244 real changes made)
(3,727 real changes made)
(5,804 real changes made, 5,804 to missing)
(19,180 missing values generated)
(26,474 missing values generated)
(3,685 real changes made)
(3,609 real changes made)
(3,685 real changes made)
(3,609 real changes made)
(4,706 real changes made)
(26,474 missing values generated)
(3,685 real changes made)
(3,609 real changes made)
(7,294 real changes made)
(21,768 real changes made)
(19,180 missing values generated)
(7,217 real changes made)
(3,685 real changes made)
(5,810 real changes made, 5,810 to missing)
(19,186 missing values generated)
(26,474 missing values generated)
(3,670 real changes made)
(3,618 real changes made)
(3,670 real changes made)
(3,618 real changes made)
(4,632 real changes made)
(26,474 missing values generated)
(3,670 real changes made)
(3,618 real changes made)
(7,288 real changes made)
(21,842 real changes made)
(19,186 missing values generated)
(7,213 real changes made)
(3,670 real changes made)
(5,800 real changes made, 5,800 to missing)
(19,176 missing values generated)
(26,474 missing values generated)
(3,756 real changes made)
(3,542 real changes made)
(3,756 real changes made)
(3,542 real changes made)
(4,605 real changes made)
(26,474 missing values generated)
(3,756 real changes made)
(3,542 real changes made)
(7,298 real changes made)
(21,869 real changes made)
(19,176 missing values generated)
(7,223 real changes made)
(3,756 real changes made)
(5,822 real changes made, 5,822 to missing)
(19,198 missing values generated)
(26,474 missing values generated)
(3,665 real changes made)
(3,611 real changes made)
(3,665 real changes made)
(3,611 real changes made)
(4,602 real changes made)
(26,474 missing values generated)
(3,665 real changes made)
(3,611 real changes made)
(7,276 real changes made)
(21,872 real changes made)
(19,198 missing values generated)
(7,198 real changes made)
(3,665 real changes made)
(5,731 real changes made, 5,731 to missing)
(19,107 missing values generated)
(26,474 missing values generated)
(3,765 real changes made)
(3,602 real changes made)
(3,765 real changes made)
(3,602 real changes made)
(4,729 real changes made)
(26,474 missing values generated)
(3,765 real changes made)
(3,602 real changes made)
(7,367 real changes made)
(21,745 real changes made)
(19,107 missing values generated)
(7,285 real changes made)
(3,765 real changes made)
(5,790 real changes made, 5,790 to missing)
(19,166 missing values generated)
(26,474 missing values generated)
(3,730 real changes made)
(3,578 real changes made)
(3,730 real changes made)
(3,578 real changes made)
(4,630 real changes made)
(26,474 missing values generated)
(3,730 real changes made)
(3,578 real changes made)
(7,308 real changes made)
(21,844 real changes made)
(19,166 missing values generated)
(7,227 real changes made)
(3,730 real changes made)
(5,824 real changes made, 5,824 to missing)
(19,200 missing values generated)
(26,474 missing values generated)
(3,679 real changes made)
(3,595 real changes made)
(3,679 real changes made)
(3,595 real changes made)
(4,590 real changes made)
(26,474 missing values generated)
(3,679 real changes made)
(3,595 real changes made)
(7,274 real changes made)
(21,884 real changes made)
(19,200 missing values generated)
(7,184 real changes made)
(3,679 real changes made)
(5,811 real changes made, 5,811 to missing)
(19,187 missing values generated)
(26,474 missing values generated)
(3,718 real changes made)
(3,569 real changes made)
(3,718 real changes made)
(3,569 real changes made)
(4,641 real changes made)
(26,474 missing values generated)
(3,718 real changes made)
(3,569 real changes made)
(7,287 real changes made)
(21,833 real changes made)
(19,187 missing values generated)
(7,211 real changes made)
(3,718 real changes made)
(5,750 real changes made, 5,750 to missing)
(19,126 missing values generated)
(26,474 missing values generated)
(3,799 real changes made)
(3,549 real changes made)
(3,799 real changes made)
(3,549 real changes made)
(4,697 real changes made)
(26,474 missing values generated)
(3,799 real changes made)
(3,549 real changes made)
(7,348 real changes made)
(21,777 real changes made)
(19,126 missing values generated)
(7,261 real changes made)
(3,799 real changes made)
(5,832 real changes made, 5,832 to missing)
(19,208 missing values generated)
(26,474 missing values generated)
(3,714 real changes made)
(3,552 real changes made)
(3,714 real changes made)
(3,552 real changes made)
(4,594 real changes made)
(26,474 missing values generated)
(3,714 real changes made)
(3,552 real changes made)
(7,266 real changes made)
(21,880 real changes made)
(19,208 missing values generated)
(7,189 real changes made)
(3,714 real changes made)
(5,742 real changes made, 5,742 to missing)
(19,118 missing values generated)
(26,474 missing values generated)
(3,717 real changes made)
(3,639 real changes made)
(3,717 real changes made)
(3,639 real changes made)
(4,621 real changes made)
(26,474 missing values generated)
(3,717 real changes made)
(3,639 real changes made)
(7,356 real changes made)
(21,853 real changes made)
(19,118 missing values generated)
(7,280 real changes made)
(3,717 real changes made)
(5,809 real changes made, 5,809 to missing)
(19,185 missing values generated)
(26,474 missing values generated)
(3,733 real changes made)
(3,556 real changes made)
(3,733 real changes made)
(3,556 real changes made)
(4,621 real changes made)
(26,474 missing values generated)
(3,733 real changes made)
(3,556 real changes made)
(7,289 real changes made)
(21,853 real changes made)
(19,185 missing values generated)
(7,202 real changes made)
(3,733 real changes made)
(5,751 real changes made, 5,751 to missing)
(19,127 missing values generated)
(26,474 missing values generated)
(3,745 real changes made)
(3,602 real changes made)
(3,745 real changes made)
(3,602 real changes made)
(4,640 real changes made)
(26,474 missing values generated)
(3,745 real changes made)
(3,602 real changes made)
(7,347 real changes made)
(21,834 real changes made)
(19,127 missing values generated)
(7,263 real changes made)
(3,745 real changes made)
(5,721 real changes made, 5,721 to missing)
(19,097 missing values generated)
(26,474 missing values generated)
(3,743 real changes made)
(3,634 real changes made)
(3,743 real changes made)
(3,634 real changes made)
(4,681 real changes made)
(26,474 missing values generated)
(3,743 real changes made)
(3,634 real changes made)
(7,377 real changes made)
(21,793 real changes made)
(19,097 missing values generated)
(7,301 real changes made)
(3,743 real changes made)
(5,810 real changes made, 5,810 to missing)
(19,186 missing values generated)
(26,474 missing values generated)
(3,787 real changes made)
(3,501 real changes made)
(3,787 real changes made)
(3,501 real changes made)
(4,610 real changes made)
(26,474 missing values generated)
(3,787 real changes made)
(3,501 real changes made)
(7,288 real changes made)
(21,864 real changes made)
(19,186 missing values generated)
(7,206 real changes made)
(3,787 real changes made)
(5,815 real changes made, 5,815 to missing)
(19,191 missing values generated)
(26,474 missing values generated)
(3,663 real changes made)
(3,620 real changes made)
(3,663 real changes made)
(3,620 real changes made)
(4,636 real changes made)
(26,474 missing values generated)
(3,663 real changes made)
(3,620 real changes made)
(7,283 real changes made)
(21,838 real changes made)
(19,191 missing values generated)
(7,212 real changes made)
(3,663 real changes made)
(5,725 real changes made, 5,725 to missing)
(19,101 missing values generated)
(26,474 missing values generated)
(3,728 real changes made)
(3,645 real changes made)
(3,728 real changes made)
(3,645 real changes made)
(4,655 real changes made)
(26,474 missing values generated)
(3,728 real changes made)
(3,645 real changes made)
(7,373 real changes made)
(21,819 real changes made)
(19,101 missing values generated)
(7,297 real changes made)
(3,728 real changes made)

. 
. replace index_date = index_date_28
(24,743 real changes made)

. drop index_date_28

. gen egfr15_date=.
(26,474 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatinine_`x'<15 & date("01`x'", "DMY")>index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen index_date_esrd = index_date
(1,731 missing values generated)

. gen esrd_date = egfr15_date
(26,474 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if krt_date < egfr15_date
(1,971 real changes made)

. replace esrd_date = krt_date if esrd_date==.
(0 real changes made)

. gen esrd = 0

. replace esrd = 1 if esrd_date!=.
(1,971 real changes made)

. label var esrd "Kidney failure"

. gen esrd_time = (esrd_date - index_date_esrd)
(24,503 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(24,503 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(1,969 changes made to esrd_time_cat)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"                      ///
>                                                         3 "1 to 28 days"        ///
>                                                         4 "20 to 90 days"       ///
>                                                         5 "91 to 180 days"      ///
>                                                         6 "181 to 365 days"     ///
>                                                         7 "366 to 730 days"     ///
>                                                         8 "731 to 973 days"     ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 critical_care   ///
>                                                                 krt             {
  2.                                                                 by `exposure',sort: sum esrd_time, de
  3.                                                                 tab esrd_time_cat `exposure', m col chi
  4.                                                                 }

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Pneumonia (pre-pandemic)

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%           32              1       Obs               1,035
25%          117              1       Sum of wgt.       1,035

50%          292                      Mean           328.2734
                        Largest       Std. dev.      245.3091
75%          501            963
90%          692            966       Variance       60176.56
95%          791            970       Skewness       .5545775
99%          912            972       Kurtosis        2.40248

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           30              1       Obs                 936
25%          105              1       Sum of wgt.         936

50%          268                      Mean           309.3526
                        Largest       Std. dev.      240.9167
75%        469.5            930
90%          686            932       Variance       58040.87
95%          767            932       Skewness       .6478778
99%          892            936       Kurtosis       2.463492


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Pneumonia   COVID-19 |     Total
----------------+----------------------+----------
   1 to 28 days |        94         92 |       186 
                |      0.70       0.70 |      0.70 
----------------+----------------------+----------
  20 to 90 days |       115        118 |       233 
                |      0.86       0.90 |      0.88 
----------------+----------------------+----------
 91 to 180 days |       154        144 |       298 
                |      1.15       1.10 |      1.13 
----------------+----------------------+----------
181 to 365 days |       263        253 |       516 
                |      1.97       1.93 |      1.95 
----------------+----------------------+----------
366 to 730 days |       329        266 |       595 
                |      2.46       2.03 |      2.25 
----------------+----------------------+----------
731 to 973 days |        80         63 |       143 
                |      0.60       0.48 |      0.54 
----------------+----------------------+----------
              . |    12,341     12,162 |    24,503 
                |     92.26      92.85 |     92.55 
----------------+----------------------+----------
          Total |    13,376     13,098 |    26,474 
                |    100.00     100.00 |    100.00 

          Pearson chi2(6) =   7.6703   Pr = 0.263

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> critical_care = Ward-based

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           31              1       Obs               1,776
25%          113              1       Sum of wgt.       1,776

50%          282                      Mean           321.3519
                        Largest       Std. dev.      244.3239
75%          497            949
90%          692            966       Variance       59694.15
95%          787            970       Skewness       .5894906
99%          906            972       Kurtosis       2.398133

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> critical_care = Critical care

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           30              1       Obs                 195
25%          102              1       Sum of wgt.         195

50%          261                      Mean           300.4923
                        Largest       Std. dev.      234.1155
75%          454            878
90%          631            881       Variance       54810.07
95%          768            957       Skewness       .6745014
99%          957            963       Kurtosis       2.730358


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |     Critical care
  esrd_time_cat | Ward-base  Critical  |     Total
----------------+----------------------+----------
   1 to 28 days |       167         19 |       186 
                |      0.70       0.74 |      0.70 
----------------+----------------------+----------
  20 to 90 days |       210         23 |       233 
                |      0.88       0.89 |      0.88 
----------------+----------------------+----------
 91 to 180 days |       264         34 |       298 
                |      1.10       1.32 |      1.13 
----------------+----------------------+----------
181 to 365 days |       473         43 |       516 
                |      1.98       1.67 |      1.95 
----------------+----------------------+----------
366 to 730 days |       529         66 |       595 
                |      2.21       2.56 |      2.25 
----------------+----------------------+----------
731 to 973 days |       133         10 |       143 
                |      0.56       0.39 |      0.54 
----------------+----------------------+----------
              . |    22,116      2,387 |    24,503 
                |     92.57      92.45 |     92.55 
----------------+----------------------+----------
          Total |    23,892      2,582 |    26,474 
                |    100.00     100.00 |    100.00 

          Pearson chi2(6) =   4.6133   Pr = 0.594

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = No AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           30              1       Obs               1,150
25%          106              1       Sum of wgt.       1,150

50%          280                      Mean             312.64
                        Largest       Std. dev.      240.2038
75%          475            937
90%        667.5            957       Variance       57697.87
95%          769            970       Skewness       .6229292
99%          911            972       Kurtosis       2.504392

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = AKI without KRT

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            4              1
10%           32              1       Obs                 784
25%        126.5              1       Sum of wgt.         784

50%          286                      Mean           329.8163
                        Largest       Std. dev.      248.1276
75%        509.5            938
90%          711            949       Variance       61567.29
95%          796            963       Skewness       .5658394
99%          898            966       Kurtosis       2.332945

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = AKI requiring KRT

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           21              4       Obs                  37
25%          120             21       Sum of wgt.          37

50%          218                      Mean           302.8378
                        Largest       Std. dev.      236.6992
75%          503            631
90%          631            654       Variance       56026.53
95%          782            782       Skewness       .4367218
99%          791            791       Kurtosis       2.010637


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |    Kidney replacement therapy
  esrd_time_cat |    No AKI  AKI witho  AKI requi |     Total
----------------+---------------------------------+----------
   1 to 28 days |       110         71          5 |       186 
                |      0.71       0.68       0.97 |      0.70 
----------------+---------------------------------+----------
  20 to 90 days |       139         91          3 |       233 
                |      0.90       0.87       0.58 |      0.88 
----------------+---------------------------------+----------
 91 to 180 days |       187        106          5 |       298 
                |      1.21       1.01       0.97 |      1.13 
----------------+---------------------------------+----------
181 to 365 days |       291        215         10 |       516 
                |      1.88       2.05       1.94 |      1.95 
----------------+---------------------------------+----------
366 to 730 days |       345        238         12 |       595 
                |      2.23       2.27       2.33 |      2.25 
----------------+---------------------------------+----------
731 to 973 days |        78         63          2 |       143 
                |      0.50       0.60       0.39 |      0.54 
----------------+---------------------------------+----------
              . |    14,311      9,713        479 |    24,503 
                |     92.56      92.53      92.83 |     92.55 
----------------+---------------------------------+----------
          Total |    15,461     10,497        516 |    26,474 
                |    100.00     100.00     100.00 |    100.00 

         Pearson chi2(12) =   5.8036   Pr = 0.926

.         
. * Exit date
. gen exit_date_esrd = esrd_date
(24,503 missing values generated)

. format exit_date_esrd %td

. gen end_date = date("2022-11-30", "YMD") if case==1
(13,376 missing values generated)

. replace end_date = date("2019-11-30", "YMD") if case==0
(13,376 real changes made)

. format end_date %td

. replace exit_date_esrd = min(deregistered_date, death_date, end_date) if esrd_date==.
(24,503 real changes made)

. gen esrd_denominator = 1

. gen follow_up_time_esrd = (exit_date_esrd - index_date_esrd)
(1,731 missing values generated)

. label var follow_up_time_esrd "Follow-up time (ESRD) (Days)"

. gen follow_up_cat_esrd = follow_up_time_esrd
(1,731 missing values generated)

. recode follow_up_cat_esrd       min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0=3                     ///
>                                                 1/365=4         ///
>                                                 366/730=5       ///
>                                                 731/1040=6      ///                                     
>                                                 1041/max=7
(24,705 changes made to follow_up_cat_esrd)

. label define follow_up_cat_esrd         1 "<-29 days"   ///
>                                                         2 "-28 to -1 days"              ///
>                                                         3 "0 days"                              ///
>                                                         4 "1 to 365 days"               ///
>                                                         5 "366 to 730 days"     ///
>                                                         6 "731 to 1040 days"    ///
>                                                         7 ">1040 days"

. label values follow_up_cat_esrd follow_up_cat_esrd

. label var follow_up_cat_esrd "Follow_up time"

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Pneumonia (pre-pandem |     5,322      4,589      3,155 |    13,066 
             COVID-19 |     4,868      4,112      2,697 |    11,677 
----------------------+---------------------------------+----------
                Total |    10,190      8,701      5,852 |    24,743 

. drop if follow_up_time_esrd<1
(0 observations deleted)

. drop if follow_up_time_esrd>1040
(1,731 observations deleted)

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Pneumonia (pre-pandem |     5,322      4,589      3,155 |    13,066 
             COVID-19 |     4,868      4,112      2,697 |    11,677 
----------------------+---------------------------------+----------
                Total |    10,190      8,701      5,852 |    24,743 

. * Time zero variable to account for differences in length of follow-up
. gen time_zero_esrd = date("2000-01-01", "YMD")

. gen time_end_esrd = time_zero_esrd + follow_up_time_esrd

. gen time_esrd = time_zero_esrd + esrd_time
(22,772 missing values generated)

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(24,743 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_half_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>index_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(21 real changes made)
(31 real changes made)
(29 real changes made)
(56 real changes made)
(57 real changes made)
(59 real changes made)
(59 real changes made)
(90 real changes made)
(93 real changes made)
(91 real changes made)
(83 real changes made)
(92 real changes made)
(85 real changes made)
(121 real changes made)
(111 real changes made)
(95 real changes made)
(97 real changes made)
(111 real changes made)
(101 real changes made)
(103 real changes made)
(110 real changes made)
(106 real changes made)
(103 real changes made)
(103 real changes made)
(100 real changes made)
(109 real changes made)
(116 real changes made)
(116 real changes made)
(123 real changes made)
(115 real changes made)
(0 real changes made)
(0 real changes made)
(11 real changes made)
(22 real changes made)
(38 real changes made)
(39 real changes made)
(60 real changes made)
(54 real changes made)
(53 real changes made)
(56 real changes made)
(73 real changes made)
(70 real changes made)
(74 real changes made)
(84 real changes made)
(77 real changes made)
(95 real changes made)
(91 real changes made)
(92 real changes made)
(77 real changes made)
(89 real changes made)
(96 real changes made)
(83 real changes made)
(81 real changes made)
(90 real changes made)
(94 real changes made)
(99 real changes made)
(103 real changes made)
(87 real changes made)
(106 real changes made)
(95 real changes made)
(91 real changes made)
(83 real changes made)
(91 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(1,500 real changes made)

. gen egfr_half = 0

. replace egfr_half = 1 if egfr_half_date!=.
(6,540 real changes made)

. label var egfr_half "50% reduction in eGFR"

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(11,082 real changes made, 11,082 to missing)

. gen egfr_half_time = (egfr_half_date - index_date_egfr_half)
(19,088 missing values generated)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(18,203 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date) if egfr_half_date==. & index_date_egfr_half!=.
(8,006 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(11,082 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days)"

. gen egfr_half_denominator = 0

. replace egfr_half_denominator = 1 if index_date_egfr_half!=.
(13,661 real changes made)

. gen time_zero_egfr_half = date("2000-01-01", "YMD")

. gen time_end_egfr_half = time_zero_egfr_half + follow_up_time_egfr_half
(11,082 missing values generated)

. gen time_egfr_half = time_zero_egfr_half + egfr_half_time
(19,088 missing values generated)

. 
. * AKI (or ESRD)
. gen index_date_aki = index_date

. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(22,195 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(1,783 real changes made)

. gen aki = 0

. replace aki = 1 if aki_date!=.
(4,331 real changes made)

. label var aki "Acute kidney injury"

. gen aki_time = (aki_date - index_date_aki)
(20,412 missing values generated)

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(20,412 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date)  if aki_date==.
(20,412 real changes made)

. gen aki_denominator = 1

. gen follow_up_time_aki = (exit_date_aki - index_date_aki)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. gen time_zero_aki = date("2000-01-01", "YMD")

. gen time_end_aki = time_zero_aki + follow_up_time_aki

. gen time_aki = time_zero_aki + aki_time
(20,412 missing values generated)

. 
. * Exit date (death)
. gen index_date_death = index_date

. gen exit_date_death = death_date
(23,691 missing values generated)

. gen death = 0

. replace death = 1 if death_date!=.
(1,052 real changes made)

. label var death "Death"

. gen death_time = (death_date - index_date_death)
(23,691 missing values generated)

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(23,691 real changes made)

. gen death_denominator = 1

. gen follow_up_time_death = (exit_date_death - index_date_death)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. gen time_zero_death = date("2000-01-01", "YMD")

. gen time_end_death = time_zero_death + follow_up_time_death

. gen time_death = time_zero_death + death_time
(23,691 missing values generated)

. 
. save ./output/analysis_hospitalised.dta, replace
file ./output/analysis_hospitalised.dta saved

. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_hospitalised.log
  log type:  text
 closed on:  31 Mar 2023, 18:37:17
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
