-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/analysis_hospitalised.log
  log type:  text
 opened on:  28 Dec 2022, 13:37:26

. 
. capture noisily import delimited ./output/input_covid_hospitalised.csv, clear
(117 vars, 50,000 obs)

. tempfile covid_hospitalised

. save `covid_hospitalised', replace
(note: file /tmp/St00011.000001 not found)
file /tmp/St00011.000001 saved

. di "COVID-19 hospitalised:"
COVID-19 hospitalised:

. safecount
  50,000

. 
. capture noisily import delimited ./output/input_pneumonia_hospitalised.csv, c
> lear
(113 vars, 50,000 obs)

. tempfile pneumonia_hospitalised

. save `pneumonia_hospitalised', replace
(note: file /tmp/St00011.000002 not found)
file /tmp/St00011.000002 saved

. di "Pneumonia hospitalised:"
Pneumonia hospitalised:

. safecount
  50,000

. 
. append using `covid_hospitalised', force

. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      4,882        4.88        4.88
 1 Most deprived |     19,078       19.08       23.96
               2 |     19,054       19.05       43.01
               3 |     18,835       18.84       61.85
               4 |     19,101       19.10       80.95
5 Least deprived |     19,050       19.05      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. drop if imd==0
(4,882 observations deleted)

. safetab imd

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |     19,078       20.06       20.06
               2 |     19,054       20.03       40.09
               3 |     18,835       19.80       59.89
               4 |     19,101       20.08       79.97
5 Least deprived |     19,050       20.03      100.00
-----------------+-----------------------------------
           Total |     95,118      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(95,117 missing values generated)

. replace stp1 = sum(stp1)
(95,117 real changes made)

. drop stp

. rename stp1 stp

. label values stp stp

. label var stp "STP"

. safetab stp

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     95,118      100.00      100.00
------------+-----------------------------------
      Total |     95,118      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(85,580 missing values generated)

. replace region = 2 if region_string=="East"
(9,576 real changes made)

. replace region = 3 if region_string=="London"
(19,112 real changes made)

. replace region = 4 if region_string=="North East"
(9,585 real changes made)

. replace region = 5 if region_string=="North West"
(9,483 real changes made)

. replace region = 6 if region_string=="South East"
(9,407 real changes made)

. replace region = 7 if region_string=="South West"
(9,503 real changes made)

. replace region = 8 if region_string=="West Midlands"
(9,439 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(9,475 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,538       10.03       10.03
                    East |      9,576       10.07       20.10
                  London |     19,112       20.09       40.19
              North East |      9,585       10.08       50.26
              North West |      9,483        9.97       60.23
              South East |      9,407        9.89       70.12
              South West |      9,503        9.99       80.12
           West Midlands |      9,439        9.92       90.04
Yorkshire and The Humber |      9,475        9.96      100.00
-------------------------+-----------------------------------
                   Total |     95,118      100.00

. drop if region==10
(0 observations deleted)

. safetab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,538       10.03       10.03
                    East |      9,576       10.07       20.10
                  London |     19,112       20.09       40.19
              North East |      9,585       10.08       50.26
              North West |      9,483        9.97       60.23
              South East |      9,407        9.89       70.12
              South West |      9,503        9.99       80.12
           West Midlands |      9,439        9.92       90.04
Yorkshire and The Humber |      9,475        9.96      100.00
-------------------------+-----------------------------------
                   Total |     95,118      100.00

. 
. * Exclusions due to deregistration and kidney replacement therapy will be che
> cked (should already have been applied from previous steps in workflow)
. gen index_date = date(patient_index_date, "YMD")
(4,011 missing values generated)

. format index_date %td

. 
. * Deregistered before index_date
. gen deregistered_date = date(date_deregistered, "YMD")
(28,617 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date
(64,162 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(26,577 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(2,182 observations deleted)

. gen index_date_28 = index_date + 28
(1,058 missing values generated)

. format index_date_28 %td

. replace krt_date = index_date_28 if krt_date < index_date_28
(118 real changes made)

. 
. * Death before index_date + 28 days (i.e. only include people who survived 28
>  days after index_date)
. drop if deceased==1
(285 observations deleted)

. drop deceased

. gen death_date1 = date(death_date, "YMD")
(25,572 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28
(1,810 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased withi
> n 28 days of index date"

. label values deceased deceased

. tab covid deceased

           |       deceased
     covid | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,147      1,071 |    14,218 
-----------+----------------------+----------
     Total |    13,147      1,071 |    14,218 

. tab pneumonia deceased

           |       deceased
 pneumonia | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,532        739 |    14,271 
-----------+----------------------+----------
     Total |    13,532        739 |    14,271 

. drop if deceased==1
(1,810 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators
>  only
. gen sex1 = 1 if sex=="M"
(13,503 missing values generated)

. replace sex1 = 0 if sex=="F"
(13,503 real changes made)

. drop sex

. rename sex1 sex

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 /
> //
>                                                                              
>                    baseline_creatinine_mar2017 ///
>                                                                              
>                    baseline_creatinine_apr2017 ///
>                                                                              
>                    baseline_creatinine_may2017 ///
>                                                                              
>                    baseline_creatinine_jun2017 ///
>                                                                              
>                    baseline_creatinine_jul2017 ///
>                                                                              
>                    baseline_creatinine_aug2017 ///
>                                                                              
>                    baseline_creatinine_sep2017 ///
>                                                                              
>                    baseline_creatinine_oct2017 ///
>                                                                              
>                    baseline_creatinine_nov2017 ///
>                                                                              
>                    baseline_creatinine_dec2017 ///
>                                                                              
>                    baseline_creatinine_jan2018 ///
>                                                                              
>                    baseline_creatinine_feb2018 ///
>                                                                              
>                    baseline_creatinine_mar2018 ///
>                                                                              
>                    baseline_creatinine_apr2018 ///
>                                                                              
>                    baseline_creatinine_may2018 ///
>                                                                              
>                    baseline_creatinine_jun2018 ///
>                                                                              
>                    baseline_creatinine_jul2018 ///
>                                                                              
>                    baseline_creatinine_aug2018 ///
>                                                                              
>                    baseline_creatinine_sep2018 ///
>                                                                              
>                    baseline_creatinine_oct2018 ///
>                                                                              
>                    baseline_creatinine_nov2018 ///
>                                                                              
>                    baseline_creatinine_dec2018 ///
>                                                                              
>                    baseline_creatinine_jan2019 ///
>                                                                              
>                    baseline_creatinine_feb2019 ///
>                                                                              
>                    baseline_creatinine_mar2019 ///
>                                                                              
>                    baseline_creatinine_apr2019 ///
>                                                                              
>                    baseline_creatinine_may2019 ///
>                                                                              
>                    baseline_creatinine_jun2019 ///
>                                                                              
>                    baseline_creatinine_jul2019 ///
>                                                                              
>                    baseline_creatinine_aug2019 ///
>                                                                              
>                    baseline_creatinine_sep2019 ///
>                                                                              
>                    baseline_creatinine_feb2020 ///
>                                                                              
>                    baseline_creatinine_mar2020 ///
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 ///
>                                                                              
>                    baseline_creatinine_oct2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(5,940 real changes made, 5,940 to missing)
(19,087 missing values generated)
(26,679 missing values generated)
(3,798 real changes made)
(3,794 real changes made)
(3,798 real changes made)
(3,794 real changes made)
(4,784 real changes made)
(26,679 missing values generated)
(3,798 real changes made)
(3,794 real changes made)
(7,592 real changes made)
(21,895 real changes made)
(19,087 missing values generated)
(7,495 real changes made)
(3,798 real changes made)
(5,944 real changes made, 5,944 to missing)
(19,091 missing values generated)
(26,679 missing values generated)
(3,848 real changes made)
(3,740 real changes made)
(3,848 real changes made)
(3,740 real changes made)
(4,816 real changes made)
(26,679 missing values generated)
(3,848 real changes made)
(3,740 real changes made)
(7,588 real changes made)
(21,863 real changes made)
(19,091 missing values generated)
(7,486 real changes made)
(3,848 real changes made)
(5,965 real changes made, 5,965 to missing)
(19,112 missing values generated)
(26,679 missing values generated)
(3,819 real changes made)
(3,748 real changes made)
(3,819 real changes made)
(3,748 real changes made)
(4,767 real changes made)
(26,679 missing values generated)
(3,819 real changes made)
(3,748 real changes made)
(7,567 real changes made)
(21,912 real changes made)
(19,112 missing values generated)
(7,458 real changes made)
(3,819 real changes made)
(5,951 real changes made, 5,951 to missing)
(19,098 missing values generated)
(26,679 missing values generated)
(3,788 real changes made)
(3,793 real changes made)
(3,788 real changes made)
(3,793 real changes made)
(4,735 real changes made)
(26,679 missing values generated)
(3,788 real changes made)
(3,793 real changes made)
(7,581 real changes made)
(21,944 real changes made)
(19,098 missing values generated)
(7,466 real changes made)
(3,788 real changes made)
(5,955 real changes made, 5,955 to missing)
(19,102 missing values generated)
(26,679 missing values generated)
(3,802 real changes made)
(3,775 real changes made)
(3,802 real changes made)
(3,775 real changes made)
(4,853 real changes made)
(26,679 missing values generated)
(3,802 real changes made)
(3,775 real changes made)
(7,577 real changes made)
(21,826 real changes made)
(19,102 missing values generated)
(7,473 real changes made)
(3,802 real changes made)
(5,927 real changes made, 5,927 to missing)
(19,074 missing values generated)
(26,679 missing values generated)
(3,800 real changes made)
(3,805 real changes made)
(3,800 real changes made)
(3,805 real changes made)
(4,802 real changes made)
(26,679 missing values generated)
(3,800 real changes made)
(3,805 real changes made)
(7,605 real changes made)
(21,877 real changes made)
(19,074 missing values generated)
(7,495 real changes made)
(3,800 real changes made)
(5,948 real changes made, 5,948 to missing)
(19,095 missing values generated)
(26,679 missing values generated)
(3,837 real changes made)
(3,747 real changes made)
(3,837 real changes made)
(3,747 real changes made)
(4,800 real changes made)
(26,679 missing values generated)
(3,837 real changes made)
(3,747 real changes made)
(7,584 real changes made)
(21,879 real changes made)
(19,095 missing values generated)
(7,481 real changes made)
(3,837 real changes made)
(5,932 real changes made, 5,932 to missing)
(19,079 missing values generated)
(26,679 missing values generated)
(3,815 real changes made)
(3,785 real changes made)
(3,815 real changes made)
(3,785 real changes made)
(4,708 real changes made)
(26,679 missing values generated)
(3,815 real changes made)
(3,785 real changes made)
(7,600 real changes made)
(21,971 real changes made)
(19,079 missing values generated)
(7,501 real changes made)
(3,815 real changes made)
(5,980 real changes made, 5,980 to missing)
(19,127 missing values generated)
(26,679 missing values generated)
(3,798 real changes made)
(3,754 real changes made)
(3,798 real changes made)
(3,754 real changes made)
(4,767 real changes made)
(26,679 missing values generated)
(3,798 real changes made)
(3,754 real changes made)
(7,552 real changes made)
(21,912 real changes made)
(19,127 missing values generated)
(7,443 real changes made)
(3,798 real changes made)
(6,022 real changes made, 6,022 to missing)
(19,169 missing values generated)
(26,679 missing values generated)
(3,829 real changes made)
(3,681 real changes made)
(3,829 real changes made)
(3,681 real changes made)
(4,788 real changes made)
(26,679 missing values generated)
(3,829 real changes made)
(3,681 real changes made)
(7,510 real changes made)
(21,891 real changes made)
(19,169 missing values generated)
(7,414 real changes made)
(3,829 real changes made)
(5,954 real changes made, 5,954 to missing)
(19,101 missing values generated)
(26,679 missing values generated)
(3,810 real changes made)
(3,768 real changes made)
(3,810 real changes made)
(3,768 real changes made)
(4,845 real changes made)
(26,679 missing values generated)
(3,810 real changes made)
(3,768 real changes made)
(7,578 real changes made)
(21,834 real changes made)
(19,101 missing values generated)
(7,485 real changes made)
(3,810 real changes made)
(5,857 real changes made, 5,857 to missing)
(19,004 missing values generated)
(26,679 missing values generated)
(3,911 real changes made)
(3,764 real changes made)
(3,911 real changes made)
(3,764 real changes made)
(4,899 real changes made)
(26,679 missing values generated)
(3,911 real changes made)
(3,764 real changes made)
(7,675 real changes made)
(21,780 real changes made)
(19,004 missing values generated)
(7,573 real changes made)
(3,911 real changes made)
(5,916 real changes made, 5,916 to missing)
(19,063 missing values generated)
(26,679 missing values generated)
(3,822 real changes made)
(3,794 real changes made)
(3,822 real changes made)
(3,794 real changes made)
(4,851 real changes made)
(26,679 missing values generated)
(3,822 real changes made)
(3,794 real changes made)
(7,616 real changes made)
(21,828 real changes made)
(19,063 missing values generated)
(7,507 real changes made)
(3,822 real changes made)
(6,040 real changes made, 6,040 to missing)
(19,187 missing values generated)
(26,679 missing values generated)
(3,827 real changes made)
(3,665 real changes made)
(3,827 real changes made)
(3,665 real changes made)
(4,703 real changes made)
(26,679 missing values generated)
(3,827 real changes made)
(3,665 real changes made)
(7,492 real changes made)
(21,976 real changes made)
(19,187 missing values generated)
(7,388 real changes made)
(3,827 real changes made)
(5,964 real changes made, 5,964 to missing)
(19,111 missing values generated)
(26,679 missing values generated)
(3,743 real changes made)
(3,825 real changes made)
(3,743 real changes made)
(3,825 real changes made)
(4,815 real changes made)
(26,679 missing values generated)
(3,743 real changes made)
(3,825 real changes made)
(7,568 real changes made)
(21,864 real changes made)
(19,111 missing values generated)
(7,461 real changes made)
(3,743 real changes made)
(6,075 real changes made, 6,075 to missing)
(19,222 missing values generated)
(26,679 missing values generated)
(3,747 real changes made)
(3,710 real changes made)
(3,747 real changes made)
(3,710 real changes made)
(4,738 real changes made)
(26,679 missing values generated)
(3,747 real changes made)
(3,710 real changes made)
(7,457 real changes made)
(21,941 real changes made)
(19,222 missing values generated)
(7,355 real changes made)
(3,747 real changes made)
(5,910 real changes made, 5,910 to missing)
(19,057 missing values generated)
(26,679 missing values generated)
(3,830 real changes made)
(3,792 real changes made)
(3,830 real changes made)
(3,792 real changes made)
(4,852 real changes made)
(26,679 missing values generated)
(3,830 real changes made)
(3,792 real changes made)
(7,622 real changes made)
(21,827 real changes made)
(19,057 missing values generated)
(7,507 real changes made)
(3,830 real changes made)
(5,891 real changes made, 5,891 to missing)
(19,038 missing values generated)
(26,679 missing values generated)
(3,872 real changes made)
(3,769 real changes made)
(3,872 real changes made)
(3,769 real changes made)
(4,808 real changes made)
(26,679 missing values generated)
(3,872 real changes made)
(3,769 real changes made)
(7,641 real changes made)
(21,871 real changes made)
(19,038 missing values generated)
(7,542 real changes made)
(3,872 real changes made)
(5,944 real changes made, 5,944 to missing)
(19,091 missing values generated)
(26,679 missing values generated)
(3,841 real changes made)
(3,747 real changes made)
(3,841 real changes made)
(3,747 real changes made)
(4,860 real changes made)
(26,679 missing values generated)
(3,841 real changes made)
(3,747 real changes made)
(7,588 real changes made)
(21,819 real changes made)
(19,091 missing values generated)
(7,482 real changes made)
(3,841 real changes made)
(5,938 real changes made, 5,938 to missing)
(19,085 missing values generated)
(26,679 missing values generated)
(3,858 real changes made)
(3,736 real changes made)
(3,858 real changes made)
(3,736 real changes made)
(4,844 real changes made)
(26,679 missing values generated)
(3,858 real changes made)
(3,736 real changes made)
(7,594 real changes made)
(21,835 real changes made)
(19,085 missing values generated)
(7,477 real changes made)
(3,858 real changes made)
(5,928 real changes made, 5,928 to missing)
(19,075 missing values generated)
(26,679 missing values generated)
(3,880 real changes made)
(3,724 real changes made)
(3,880 real changes made)
(3,724 real changes made)
(4,866 real changes made)
(26,679 missing values generated)
(3,880 real changes made)
(3,724 real changes made)
(7,604 real changes made)
(21,813 real changes made)
(19,075 missing values generated)
(7,490 real changes made)
(3,880 real changes made)
(6,006 real changes made, 6,006 to missing)
(19,153 missing values generated)
(26,679 missing values generated)
(3,806 real changes made)
(3,720 real changes made)
(3,806 real changes made)
(3,720 real changes made)
(4,816 real changes made)
(26,679 missing values generated)
(3,806 real changes made)
(3,720 real changes made)
(7,526 real changes made)
(21,863 real changes made)
(19,153 missing values generated)
(7,406 real changes made)
(3,806 real changes made)
(5,991 real changes made, 5,991 to missing)
(19,138 missing values generated)
(26,679 missing values generated)
(3,847 real changes made)
(3,694 real changes made)
(3,847 real changes made)
(3,694 real changes made)
(4,750 real changes made)
(26,679 missing values generated)
(3,847 real changes made)
(3,694 real changes made)
(7,541 real changes made)
(21,929 real changes made)
(19,138 missing values generated)
(7,431 real changes made)
(3,847 real changes made)
(5,984 real changes made, 5,984 to missing)
(19,131 missing values generated)
(26,679 missing values generated)
(3,802 real changes made)
(3,746 real changes made)
(3,802 real changes made)
(3,746 real changes made)
(4,736 real changes made)
(26,679 missing values generated)
(3,802 real changes made)
(3,746 real changes made)
(7,548 real changes made)
(21,943 real changes made)
(19,131 missing values generated)
(7,445 real changes made)
(3,802 real changes made)
(5,916 real changes made, 5,916 to missing)
(19,063 missing values generated)
(26,679 missing values generated)
(3,847 real changes made)
(3,769 real changes made)
(3,847 real changes made)
(3,769 real changes made)
(4,767 real changes made)
(26,679 missing values generated)
(3,847 real changes made)
(3,769 real changes made)
(7,616 real changes made)
(21,912 real changes made)
(19,063 missing values generated)
(7,506 real changes made)
(3,847 real changes made)
(5,934 real changes made, 5,934 to missing)
(19,081 missing values generated)
(26,679 missing values generated)
(3,857 real changes made)
(3,741 real changes made)
(3,857 real changes made)
(3,741 real changes made)
(4,788 real changes made)
(26,679 missing values generated)
(3,857 real changes made)
(3,741 real changes made)
(7,598 real changes made)
(21,891 real changes made)
(19,081 missing values generated)
(7,490 real changes made)
(3,857 real changes made)
(5,904 real changes made, 5,904 to missing)
(19,051 missing values generated)
(26,679 missing values generated)
(3,846 real changes made)
(3,782 real changes made)
(3,846 real changes made)
(3,782 real changes made)
(4,806 real changes made)
(26,679 missing values generated)
(3,846 real changes made)
(3,782 real changes made)
(7,628 real changes made)
(21,873 real changes made)
(19,051 missing values generated)
(7,516 real changes made)
(3,846 real changes made)
(6,105 real changes made, 6,105 to missing)
(19,252 missing values generated)
(26,679 missing values generated)
(3,733 real changes made)
(3,694 real changes made)
(3,733 real changes made)
(3,694 real changes made)
(4,663 real changes made)
(26,679 missing values generated)
(3,733 real changes made)
(3,694 real changes made)
(7,427 real changes made)
(22,016 real changes made)
(19,252 missing values generated)
(7,322 real changes made)
(3,733 real changes made)
(5,956 real changes made, 5,956 to missing)
(19,103 missing values generated)
(26,679 missing values generated)
(3,783 real changes made)
(3,793 real changes made)
(3,783 real changes made)
(3,793 real changes made)
(4,826 real changes made)
(26,679 missing values generated)
(3,783 real changes made)
(3,793 real changes made)
(7,576 real changes made)
(21,853 real changes made)
(19,103 missing values generated)
(7,475 real changes made)
(3,783 real changes made)
(5,970 real changes made, 5,970 to missing)
(19,117 missing values generated)
(26,679 missing values generated)
(3,790 real changes made)
(3,772 real changes made)
(3,790 real changes made)
(3,772 real changes made)
(4,811 real changes made)
(26,679 missing values generated)
(3,790 real changes made)
(3,772 real changes made)
(7,562 real changes made)
(21,868 real changes made)
(19,117 missing values generated)
(7,460 real changes made)
(3,790 real changes made)
(5,934 real changes made, 5,934 to missing)
(19,081 missing values generated)
(26,679 missing values generated)
(3,822 real changes made)
(3,776 real changes made)
(3,822 real changes made)
(3,776 real changes made)
(4,786 real changes made)
(26,679 missing values generated)
(3,822 real changes made)
(3,776 real changes made)
(7,598 real changes made)
(21,893 real changes made)
(19,081 missing values generated)
(7,486 real changes made)
(3,822 real changes made)
(5,898 real changes made, 5,898 to missing)
(19,045 missing values generated)
(26,679 missing values generated)
(3,831 real changes made)
(3,803 real changes made)
(3,831 real changes made)
(3,803 real changes made)
(4,806 real changes made)
(26,679 missing values generated)
(3,831 real changes made)
(3,803 real changes made)
(7,634 real changes made)
(21,873 real changes made)
(19,045 missing values generated)
(7,525 real changes made)
(3,831 real changes made)
(5,756 real changes made, 5,756 to missing)
(19,288 missing values generated)
(26,679 missing values generated)
(3,730 real changes made)
(3,661 real changes made)
(3,730 real changes made)
(3,660 real changes made)
(4,694 real changes made)
(26,679 missing values generated)
(3,730 real changes made)
(3,661 real changes made)
(7,390 real changes made)
(21,984 real changes made)
(19,288 missing values generated)
(7,323 real changes made)
(3,730 real changes made)
(5,726 real changes made, 5,726 to missing)
(19,258 missing values generated)
(26,679 missing values generated)
(3,774 real changes made)
(3,647 real changes made)
(3,774 real changes made)
(3,647 real changes made)
(4,770 real changes made)
(26,679 missing values generated)
(3,774 real changes made)
(3,647 real changes made)
(7,421 real changes made)
(21,909 real changes made)
(19,258 missing values generated)
(7,344 real changes made)
(3,774 real changes made)
(5,760 real changes made, 5,760 to missing)
(19,292 missing values generated)
(26,679 missing values generated)
(3,707 real changes made)
(3,680 real changes made)
(3,707 real changes made)
(3,680 real changes made)
(4,603 real changes made)
(26,679 missing values generated)
(3,707 real changes made)
(3,680 real changes made)
(7,387 real changes made)
(22,076 real changes made)
(19,292 missing values generated)
(7,303 real changes made)
(3,707 real changes made)
(5,774 real changes made, 5,774 to missing)
(19,306 missing values generated)
(26,679 missing values generated)
(3,735 real changes made)
(3,638 real changes made)
(3,735 real changes made)
(3,638 real changes made)
(4,684 real changes made)
(26,679 missing values generated)
(3,735 real changes made)
(3,638 real changes made)
(7,373 real changes made)
(21,995 real changes made)
(19,306 missing values generated)
(7,289 real changes made)
(3,735 real changes made)
(5,808 real changes made, 5,808 to missing)
(19,340 missing values generated)
(26,679 missing values generated)
(3,697 real changes made)
(3,642 real changes made)
(3,697 real changes made)
(3,642 real changes made)
(4,699 real changes made)
(26,679 missing values generated)
(3,697 real changes made)
(3,642 real changes made)
(7,339 real changes made)
(21,980 real changes made)
(19,340 missing values generated)
(7,250 real changes made)
(3,697 real changes made)
(5,799 real changes made, 5,799 to missing)
(19,331 missing values generated)
(26,679 missing values generated)
(3,767 real changes made)
(3,581 real changes made)
(3,767 real changes made)
(3,581 real changes made)
(4,651 real changes made)
(26,679 missing values generated)
(3,767 real changes made)
(3,581 real changes made)
(7,348 real changes made)
(22,028 real changes made)
(19,331 missing values generated)
(7,262 real changes made)
(3,767 real changes made)
(5,834 real changes made, 5,834 to missing)
(19,366 missing values generated)
(26,679 missing values generated)
(3,772 real changes made)
(3,541 real changes made)
(3,772 real changes made)
(3,541 real changes made)
(4,697 real changes made)
(26,679 missing values generated)
(3,772 real changes made)
(3,541 real changes made)
(7,313 real changes made)
(21,982 real changes made)
(19,366 missing values generated)
(7,239 real changes made)
(3,772 real changes made)
(5,790 real changes made, 5,790 to missing)
(19,322 missing values generated)
(26,679 missing values generated)
(3,714 real changes made)
(3,643 real changes made)
(3,714 real changes made)
(3,643 real changes made)
(4,663 real changes made)
(26,679 missing values generated)
(3,714 real changes made)
(3,643 real changes made)
(7,357 real changes made)
(22,016 real changes made)
(19,322 missing values generated)
(7,281 real changes made)
(3,714 real changes made)
(5,764 real changes made, 5,764 to missing)
(19,296 missing values generated)
(26,679 missing values generated)
(3,764 real changes made)
(3,619 real changes made)
(3,764 real changes made)
(3,619 real changes made)
(4,693 real changes made)
(26,679 missing values generated)
(3,764 real changes made)
(3,619 real changes made)
(7,383 real changes made)
(21,986 real changes made)
(19,296 missing values generated)
(7,293 real changes made)
(3,764 real changes made)
(5,789 real changes made, 5,789 to missing)
(19,321 missing values generated)
(26,679 missing values generated)
(3,729 real changes made)
(3,629 real changes made)
(3,729 real changes made)
(3,629 real changes made)
(4,678 real changes made)
(26,679 missing values generated)
(3,729 real changes made)
(3,629 real changes made)
(7,358 real changes made)
(22,001 real changes made)
(19,321 missing values generated)
(7,285 real changes made)
(3,729 real changes made)
(5,750 real changes made, 5,750 to missing)
(19,282 missing values generated)
(26,679 missing values generated)
(3,721 real changes made)
(3,676 real changes made)
(3,721 real changes made)
(3,676 real changes made)
(4,608 real changes made)
(26,679 missing values generated)
(3,721 real changes made)
(3,676 real changes made)
(7,397 real changes made)
(22,071 real changes made)
(19,282 missing values generated)
(7,313 real changes made)
(3,721 real changes made)
(5,750 real changes made, 5,750 to missing)
(19,282 missing values generated)
(26,679 missing values generated)
(3,767 real changes made)
(3,630 real changes made)
(3,767 real changes made)
(3,630 real changes made)
(4,697 real changes made)
(26,679 missing values generated)
(3,767 real changes made)
(3,630 real changes made)
(7,397 real changes made)
(21,982 real changes made)
(19,282 missing values generated)
(7,314 real changes made)
(3,767 real changes made)
(5,905 real changes made, 5,905 to missing)
(19,437 missing values generated)
(26,679 missing values generated)
(3,706 real changes made)
(3,536 real changes made)
(3,706 real changes made)
(3,536 real changes made)
(4,611 real changes made)
(26,679 missing values generated)
(3,706 real changes made)
(3,536 real changes made)
(7,242 real changes made)
(22,068 real changes made)
(19,437 missing values generated)
(7,171 real changes made)
(3,706 real changes made)
(5,733 real changes made, 5,733 to missing)
(19,265 missing values generated)
(26,679 missing values generated)
(3,800 real changes made)
(3,614 real changes made)
(3,800 real changes made)
(3,614 real changes made)
(4,721 real changes made)
(26,679 missing values generated)
(3,800 real changes made)
(3,614 real changes made)
(7,414 real changes made)
(21,958 real changes made)
(19,265 missing values generated)
(7,331 real changes made)
(3,800 real changes made)
(5,791 real changes made, 5,791 to missing)
(19,323 missing values generated)
(26,679 missing values generated)
(3,772 real changes made)
(3,584 real changes made)
(3,772 real changes made)
(3,584 real changes made)
(4,715 real changes made)
(26,679 missing values generated)
(3,772 real changes made)
(3,584 real changes made)
(7,356 real changes made)
(21,964 real changes made)
(19,323 missing values generated)
(7,268 real changes made)
(3,772 real changes made)
(5,737 real changes made, 5,737 to missing)
(19,269 missing values generated)
(26,679 missing values generated)
(3,746 real changes made)
(3,664 real changes made)
(3,746 real changes made)
(3,664 real changes made)
(4,646 real changes made)
(26,679 missing values generated)
(3,746 real changes made)
(3,664 real changes made)
(7,410 real changes made)
(22,033 real changes made)
(19,269 missing values generated)
(7,332 real changes made)
(3,746 real changes made)
(5,839 real changes made, 5,839 to missing)
(19,371 missing values generated)
(26,679 missing values generated)
(3,742 real changes made)
(3,566 real changes made)
(3,742 real changes made)
(3,566 real changes made)
(4,633 real changes made)
(26,679 missing values generated)
(3,742 real changes made)
(3,566 real changes made)
(7,308 real changes made)
(22,046 real changes made)
(19,371 missing values generated)
(7,222 real changes made)
(3,742 real changes made)
(5,711 real changes made, 5,711 to missing)
(19,243 missing values generated)
(26,679 missing values generated)
(3,813 real changes made)
(3,623 real changes made)
(3,813 real changes made)
(3,623 real changes made)
(4,815 real changes made)
(26,679 missing values generated)
(3,813 real changes made)
(3,623 real changes made)
(7,436 real changes made)
(21,864 real changes made)
(19,243 missing values generated)
(7,351 real changes made)
(3,813 real changes made)
(5,913 real changes made, 5,913 to missing)
(19,445 missing values generated)
(26,679 missing values generated)
(3,657 real changes made)
(3,577 real changes made)
(3,657 real changes made)
(3,577 real changes made)
(4,650 real changes made)
(26,679 missing values generated)
(3,657 real changes made)
(3,577 real changes made)
(7,234 real changes made)
(22,029 real changes made)
(19,445 missing values generated)
(7,156 real changes made)
(3,657 real changes made)
(5,742 real changes made, 5,742 to missing)
(19,274 missing values generated)
(26,679 missing values generated)
(3,800 real changes made)
(3,605 real changes made)
(3,800 real changes made)
(3,605 real changes made)
(4,674 real changes made)
(26,679 missing values generated)
(3,800 real changes made)
(3,605 real changes made)
(7,405 real changes made)
(22,005 real changes made)
(19,274 missing values generated)
(7,326 real changes made)
(3,800 real changes made)
(5,718 real changes made, 5,718 to missing)
(19,250 missing values generated)
(26,679 missing values generated)
(3,763 real changes made)
(3,666 real changes made)
(3,763 real changes made)
(3,666 real changes made)
(4,675 real changes made)
(26,679 missing values generated)
(3,763 real changes made)
(3,666 real changes made)
(7,429 real changes made)
(22,004 real changes made)
(19,250 missing values generated)
(7,351 real changes made)
(3,763 real changes made)
(5,741 real changes made, 5,741 to missing)
(19,273 missing values generated)
(26,679 missing values generated)
(3,801 real changes made)
(3,605 real changes made)
(3,801 real changes made)
(3,605 real changes made)
(4,638 real changes made)
(26,679 missing values generated)
(3,801 real changes made)
(3,605 real changes made)
(7,406 real changes made)
(22,041 real changes made)
(19,273 missing values generated)
(7,324 real changes made)
(3,801 real changes made)
(5,776 real changes made, 5,776 to missing)
(19,308 missing values generated)
(26,679 missing values generated)
(3,777 real changes made)
(3,594 real changes made)
(3,777 real changes made)
(3,594 real changes made)
(4,663 real changes made)
(26,679 missing values generated)
(3,777 real changes made)
(3,594 real changes made)
(7,371 real changes made)
(22,016 real changes made)
(19,308 missing values generated)
(7,277 real changes made)
(3,777 real changes made)
(5,846 real changes made, 5,846 to missing)
(19,378 missing values generated)
(26,679 missing values generated)
(3,710 real changes made)
(3,591 real changes made)
(3,710 real changes made)
(3,591 real changes made)
(4,589 real changes made)
(26,679 missing values generated)
(3,710 real changes made)
(3,591 real changes made)
(7,301 real changes made)
(22,090 real changes made)
(19,378 missing values generated)
(7,229 real changes made)
(3,710 real changes made)
(5,826 real changes made, 5,826 to missing)
(19,358 missing values generated)
(26,679 missing values generated)
(3,690 real changes made)
(3,631 real changes made)
(3,690 real changes made)
(3,631 real changes made)
(4,669 real changes made)
(26,679 missing values generated)
(3,690 real changes made)
(3,631 real changes made)
(7,321 real changes made)
(22,010 real changes made)
(19,358 missing values generated)
(7,232 real changes made)
(3,690 real changes made)
(5,884 real changes made, 5,884 to missing)
(19,416 missing values generated)
(26,679 missing values generated)
(3,650 real changes made)
(3,613 real changes made)
(3,650 real changes made)
(3,613 real changes made)
(4,566 real changes made)
(26,679 missing values generated)
(3,650 real changes made)
(3,613 real changes made)
(7,263 real changes made)
(22,113 real changes made)
(19,416 missing values generated)
(7,183 real changes made)
(3,650 real changes made)
(5,752 real changes made, 5,752 to missing)
(19,284 missing values generated)
(26,679 missing values generated)
(3,773 real changes made)
(3,622 real changes made)
(3,773 real changes made)
(3,622 real changes made)
(4,739 real changes made)
(26,679 missing values generated)
(3,773 real changes made)
(3,622 real changes made)
(7,395 real changes made)
(21,940 real changes made)
(19,284 missing values generated)
(7,313 real changes made)
(3,773 real changes made)
(5,774 real changes made, 5,774 to missing)
(19,306 missing values generated)
(26,679 missing values generated)
(3,741 real changes made)
(3,632 real changes made)
(3,741 real changes made)
(3,632 real changes made)
(4,629 real changes made)
(26,679 missing values generated)
(3,741 real changes made)
(3,632 real changes made)
(7,373 real changes made)
(22,050 real changes made)
(19,306 missing values generated)
(7,294 real changes made)
(3,741 real changes made)
(5,739 real changes made, 5,739 to missing)
(19,271 missing values generated)
(26,679 missing values generated)
(3,729 real changes made)
(3,679 real changes made)
(3,729 real changes made)
(3,679 real changes made)
(4,707 real changes made)
(26,679 missing values generated)
(3,729 real changes made)
(3,679 real changes made)
(7,408 real changes made)
(21,972 real changes made)
(19,271 missing values generated)
(7,331 real changes made)
(3,729 real changes made)
(5,763 real changes made, 5,763 to missing)
(19,295 missing values generated)
(26,679 missing values generated)
(3,759 real changes made)
(3,625 real changes made)
(3,759 real changes made)
(3,625 real changes made)
(4,695 real changes made)
(26,679 missing values generated)
(3,759 real changes made)
(3,625 real changes made)
(7,384 real changes made)
(21,984 real changes made)
(19,295 missing values generated)
(7,303 real changes made)
(3,759 real changes made)
(5,764 real changes made, 5,764 to missing)
(19,296 missing values generated)
(26,679 missing values generated)
(3,763 real changes made)
(3,620 real changes made)
(3,763 real changes made)
(3,620 real changes made)
(4,682 real changes made)
(26,679 missing values generated)
(3,763 real changes made)
(3,620 real changes made)
(7,383 real changes made)
(21,997 real changes made)
(19,296 missing values generated)
(7,305 real changes made)
(3,763 real changes made)
(5,862 real changes made, 5,862 to missing)
(19,394 missing values generated)
(26,679 missing values generated)
(3,759 real changes made)
(3,526 real changes made)
(3,759 real changes made)
(3,526 real changes made)
(4,597 real changes made)
(26,679 missing values generated)
(3,759 real changes made)
(3,526 real changes made)
(7,285 real changes made)
(22,082 real changes made)
(19,394 missing values generated)
(7,187 real changes made)
(3,759 real changes made)
(5,892 real changes made, 5,892 to missing)
(19,424 missing values generated)
(26,679 missing values generated)
(3,695 real changes made)
(3,560 real changes made)
(3,695 real changes made)
(3,560 real changes made)
(4,636 real changes made)
(26,679 missing values generated)
(3,695 real changes made)
(3,560 real changes made)
(7,255 real changes made)
(22,043 real changes made)
(19,424 missing values generated)
(7,166 real changes made)
(3,695 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)
(941 missing values generated)

. gen baseline_egfr=.
(26,679 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(245 real changes made)
(257 real changes made)
(255 real changes made)
(252 real changes made)
(263 real changes made)
(301 real changes made)
(250 real changes made)
(239 real changes made)
(257 real changes made)
(230 real changes made)
(257 real changes made)
(240 real changes made)
(237 real changes made)
(245 real changes made)
(231 real changes made)
(224 real changes made)
(218 real changes made)
(222 real changes made)
(219 real changes made)
(226 real changes made)
(206 real changes made)
(210 real changes made)
(188 real changes made)
(201 real changes made)
(191 real changes made)
(185 real changes made)
(186 real changes made)
(185 real changes made)
(171 real changes made)
(197 real changes made)
(207 real changes made)
(176 real changes made)
(223 real changes made)
(245 real changes made)
(246 real changes made)
(245 real changes made)
(251 real changes made)
(265 real changes made)
(241 real changes made)
(208 real changes made)
(257 real changes made)
(253 real changes made)
(258 real changes made)
(239 real changes made)
(204 real changes made)
(203 real changes made)
(184 real changes made)
(221 real changes made)
(188 real changes made)
(213 real changes made)
(203 real changes made)
(211 real changes made)
(177 real changes made)
(160 real changes made)
(201 real changes made)
(165 real changes made)
(172 real changes made)
(199 real changes made)
(177 real changes made)
(177 real changes made)
(202 real changes made)
(214 real changes made)
(192 real changes made)
(160 real changes made)
(174 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab covid baseline_esrd

           | baseline_e
           |    srd
     covid |   No ESRD |     Total
-----------+-----------+----------
         1 |    13,147 |    13,147 
-----------+-----------+----------
     Total |    13,147 |    13,147 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. ** Exposure
. gen case = covid
(13,532 missing values generated)

. replace case = 0 if covid==.
(13,532 real changes made)

. label define case 0 "Pneumonia (pre-pandemic)" ///
>                                   1 "COVID-19"

. label values case case

. tab case covid

                      |   covid
                 case |         1 |     Total
----------------------+-----------+----------
             COVID-19 |    13,147 |    13,147 
----------------------+-----------+----------
                Total |    13,147 |    13,147 

. tab case pneumonia

                      | pneumonia
                 case |         1 |     Total
----------------------+-----------+----------
Pneumonia (pre-pandem |    13,532 |    13,532 
----------------------+-----------+----------
                Total |    13,532 |    13,532 

. drop covid

. drop pneumonia

. safetab case 

                    case |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,532       50.72       50.72
                COVID-19 |     13,147       49.28      100.00
-------------------------+-----------------------------------
                   Total |     26,679      100.00

. 
. * Critical care during index admission
. replace critical_care = 1 if critical_days==1
(1,257 real changes made)

. drop critical_days

. label define critical_care      0 "Ward-based"          ///
>                                                         1 "Critical care"

. label values critical_care critical_care

. label var critical_care "Critical care"

. safetab critical_care, m

Critical care |      Freq.     Percent        Cum.
--------------+-----------------------------------
   Ward-based |     24,041       90.11       90.11
Critical care |      2,638        9.89      100.00
--------------+-----------------------------------
        Total |     26,679      100.00

. gen case_critical_care = critical_care

. replace case_critical_care = 2 if case==1
(13,147 real changes made)

. replace case_critical_care = 3 if case==1 &critical_care==1
(1,295 real changes made)

. label define case_critical_care 0 "Ward-based pneumonia (pre-pandemic)"      
>    ///
>                                                                 1 "Critical c
> are pneumonia (pre-pandemic)"      ///
>                                                                 2 "Ward-based
>  COVID-19"                                         ///
>                                                                 3 "Critical c
> are COVID-19"

. label values case_critical_care case_critical_care

. 
. * Acute kidney injury during index admission
. label define acute_kidney_injury        0 "No AKI"      ///
>                                                                         1 "AK
> I"

. label values acute_kidney_injury acute_kidney_injury

. label var acute_kidney_injury "Acute kidney injury"

. safetab acute_kidney_injury, m

      Acute |
     kidney |
     injury |      Freq.     Percent        Cum.
------------+-----------------------------------
     No AKI |     16,118       60.41       60.41
        AKI |     10,561       39.59      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. gen case_acute_kidney_injury = acute_kidney_injury

. replace case_acute_kidney_injury = 2 if case==1
(13,147 real changes made)

. replace case_acute_kidney_injury = 3 if case==1 &acute_kidney_injury==1
(5,197 real changes made)

. label define case_acute_kidney_injury   0 "No AKI pneumonia (pre-pandemic)"  
>    ///
>                                                                              
>    1 "AKI pneumonia (pre-pandemic)"        ///
>                                                                              
>    2 "No AKI COVID-19"                             ///
>                                                                              
>    3 "AKI COVID-19"

. label values case_acute_kidney_injury case_acute_kidney_injury

. 
. * Kidney replacement therapy during index admission
. gen krt = acute_kidney_injury

. replace krt = 2 if krt_icd_10==1
(257 real changes made)

. drop krt_icd_10

. replace krt = 2 if krt_opcs_4==1
(263 real changes made)

. drop krt_opcs_4

. label define krt        0 "No AKI"                              ///
>                                         1 "AKI without KRT"             ///
>                                         2 "AKI requiring KRT"

. label values krt krt

. label var krt "Kidney replacement therapy"

. safetab krt, m

           Kidney |
      replacement |
          therapy |      Freq.     Percent        Cum.
------------------+-----------------------------------
           No AKI |     15,800       59.22       59.22
  AKI without KRT |     10,359       38.83       98.05
AKI requiring KRT |        520        1.95      100.00
------------------+-----------------------------------
            Total |     26,679      100.00

. gen case_krt = krt

. replace case_krt = 3 if case==1
(13,147 real changes made)

. replace case_krt = 4 if case==1 &krt==1
(5,110 real changes made)

. replace case_krt = 5 if case==1 &krt==2
(249 real changes made)

. label define case_krt   0 "No AKI pneumonia (pre-pandemic)"                  
>    ///
>                                                 1 "AKI without KRT pneumonia 
> (pre-pandemic)"    ///
>                                                 2 "AKI requiring KRT pneumoni
> a (pre-pandemic)"  ///
>                                                 3 "No AKI COVID-19"          
>                                                    ///
>                                                 4 "AKI without KRT COVID-19" 
>                                    ///
>                                                 5 "AKI requiring KRT COVID-19
> "

. label values case_krt case_krt

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(17,486 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(17,517 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(17,494 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(17,437 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(9,242 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(2,736 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(791 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(257 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Pneumonia (pre-pandemic)"    ///
>                                                 1 "Pre-vaccination"          
>            ///
>                                                 2 "1 vaccine dose"           
>            ///
>                                                 3 "2 vaccine doses"          
>            ///
>                                                 4 "3 vaccine doses"          
>            ///
>                                                 5 "4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "Vaccination status"

. safetab covid_vax, m

      Vaccination status |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,532       50.72       50.72
         Pre-vaccination |        121        0.45       51.18
          1 vaccine dose |        257        0.96       52.14
         2 vaccine doses |        791        2.96       55.10
         3 vaccine doses |      2,736       10.26       65.36
         4 vaccine doses |      9,242       34.64      100.00
-------------------------+-----------------------------------
                   Total |     26,679      100.00

. 
. * COVID-19 wave
. gen wave = case

. replace wave = 2 if index_month=="sep2020"
(407 real changes made)

. replace wave = 2 if index_month=="oct2020"
(443 real changes made)

. replace wave = 2 if index_month=="nov2020"
(425 real changes made)

. replace wave = 2 if index_month=="dec2020"
(432 real changes made)

. replace wave = 2 if index_month=="jan2021"
(406 real changes made)

. replace wave = 2 if index_month=="feb2021"
(389 real changes made)

. replace wave = 2 if index_month=="mar2021"
(348 real changes made)

. replace wave = 2 if index_month=="apr2021"
(364 real changes made)

. replace wave = 2 if index_month=="may2021"
(399 real changes made)

. replace wave = 2 if index_month=="jun2021"
(333 real changes made)

. replace wave = 3 if index_month=="jul2021"
(385 real changes made)

. replace wave = 3 if index_month=="aug2021"
(400 real changes made)

. replace wave = 3 if index_month=="sep2021"
(354 real changes made)

. replace wave = 3 if index_month=="oct2021"
(338 real changes made)

. replace wave = 3 if index_month=="nov2021"
(329 real changes made)

. replace wave = 4 if index_month=="dec2021"
(360 real changes made)

. replace wave = 4 if index_month=="jan2022"
(337 real changes made)

. replace wave = 4 if index_month=="feb2022"
(303 real changes made)

. replace wave = 4 if index_month=="mar2022"
(353 real changes made)

. replace wave = 4 if index_month=="apr2022"
(313 real changes made)

. replace wave = 4 if index_month=="may2022"
(322 real changes made)

. replace wave = 4 if index_month=="jun2022"
(350 real changes made)

. replace wave = 4 if index_month=="jul2022"
(350 real changes made)

. replace wave = 4 if index_month=="aug2022"
(356 real changes made)

. replace wave = 4 if index_month=="sep2022"
(299 real changes made)

. replace wave = 4 if index_month=="oct2022"
(311 real changes made)

. label define wave       0 "Pneumonia (pre-pandemic)"    ///
>                                         1 "Feb20-Aug20" ///
>                                         2 "Sep20-Jun21" ///
>                                         3 "Jul21-Nov21" ///
>                                         4 "Dec21-Oct22" 

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m

           COVID-19 wave |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,532       50.72       50.72
             Feb20-Aug20 |      3,741       14.02       64.74
             Sep20-Jun21 |      3,946       14.79       79.53
             Jul21-Nov21 |      1,806        6.77       86.30
             Dec21-Oct22 |      3,654       13.70      100.00
-------------------------+-----------------------------------
                   Total |     26,679      100.00

. 
. * Month
. gen month_string=substr(index_date_string ,3,3)
(941 missing values generated)

. gen month = 1 if month_string=="jan"
(25,166 missing values generated)

. replace month = 2 if month_string=="feb"
(2,251 real changes made)

. replace month = 3 if month_string=="mar"
(2,439 real changes made)

. replace month = 4 if month_string=="apr"
(2,370 real changes made)

. replace month = 5 if month_string=="may"
(2,361 real changes made)

. replace month = 6 if month_string=="jun"
(2,325 real changes made)

. replace month = 7 if month_string=="jul"
(2,461 real changes made)

. replace month = 8 if month_string=="aug"
(2,439 real changes made)

. replace month = 9 if month_string=="sep"
(2,198 real changes made)

. replace month = 10 if month_string=="oct"
(2,251 real changes made)

. replace month = 11 if month_string=="nov"
(1,555 real changes made)

. replace month = 12 if month_string=="dec"
(1,575 real changes made)

. drop month_string

. 
. ** Covariates
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        336        1.26        1.26
          1 |        307        1.15        2.41
          2 |        340        1.27        3.68
          3 |        320        1.20        4.88
          4 |        304        1.14        6.02
          5 |        308        1.15        7.18
          6 |        330        1.24        8.41
          7 |        325        1.22        9.63
          8 |        306        1.15       10.78
          9 |        302        1.13       11.91
         10 |        301        1.13       13.04
         11 |        313        1.17       14.21
         12 |        307        1.15       15.36
         13 |        338        1.27       16.63
         14 |        335        1.26       17.89
         15 |        291        1.09       18.98
         16 |        320        1.20       20.18
         17 |        299        1.12       21.30
         18 |        298        1.12       22.41
         19 |        309        1.16       23.57
         20 |        346        1.30       24.87
         21 |        299        1.12       25.99
         22 |        389        1.46       27.45
         23 |        314        1.18       28.63
         24 |        328        1.23       29.85
         25 |        391        1.47       31.32
         26 |        342        1.28       32.60
         27 |        386        1.45       34.05
         28 |        371        1.39       35.44
         29 |        366        1.37       36.81
         30 |        344        1.29       38.10
         31 |        359        1.35       39.45
         32 |        365        1.37       40.81
         33 |        343        1.29       42.10
         34 |        343        1.29       43.39
         35 |        362        1.36       44.74
         36 |        346        1.30       46.04
         37 |        318        1.19       47.23
         38 |        365        1.37       48.60
         39 |        353        1.32       49.92
         40 |        310        1.16       51.09
         41 |        315        1.18       52.27
         42 |        353        1.32       53.59
         43 |        319        1.20       54.78
         44 |        304        1.14       55.92
         45 |        346        1.30       57.22
         46 |        345        1.29       58.51
         47 |        356        1.33       59.85
         48 |        389        1.46       61.31
         49 |        386        1.45       62.75
         50 |        404        1.51       64.27
         51 |        370        1.39       65.65
         52 |        361        1.35       67.01
         53 |        389        1.46       68.47
         54 |        378        1.42       69.88
         55 |        346        1.30       71.18
         56 |        360        1.35       72.53
         57 |        331        1.24       73.77
         58 |        363        1.36       75.13
         59 |        313        1.17       76.30
         60 |        299        1.12       77.42
         61 |        268        1.00       78.43
         62 |        303        1.14       79.56
         63 |        307        1.15       80.72
         64 |        321        1.20       81.92
         65 |        277        1.04       82.96
         66 |        270        1.01       83.97
         67 |        257        0.96       84.93
         68 |        226        0.85       85.78
         69 |        265        0.99       86.77
         70 |        257        0.96       87.74
         71 |        264        0.99       88.73
         72 |        277        1.04       89.76
         73 |        266        1.00       90.76
         74 |        265        0.99       91.75
         75 |        197        0.74       92.49
         76 |        188        0.70       93.20
         77 |        186        0.70       93.89
         78 |        200        0.75       94.64
         79 |        176        0.66       95.30
         80 |        116        0.43       95.74
         81 |        139        0.52       96.26
         82 |        110        0.41       96.67
         83 |        119        0.45       97.12
         84 |        127        0.48       97.59
         85 |         84        0.31       97.91
         86 |         84        0.31       98.22
         87 |         75        0.28       98.50
         88 |         84        0.31       98.82
         89 |         68        0.25       99.07
         90 |         31        0.12       99.19
         91 |         33        0.12       99.31
         92 |         35        0.13       99.45
         93 |         44        0.16       99.61
         94 |         40        0.15       99.76
         95 |          8        0.03       99.79
         96 |         18        0.07       99.86
         97 |          7        0.03       99.88
         98 |         10        0.04       99.92
         99 |         11        0.04       99.96
        103 |          3        0.01       99.97
        105 |          1        0.00       99.98
        106 |          1        0.00       99.98
        107 |          2        0.01       99.99
        108 |          1        0.00       99.99
        109 |          2        0.01      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. safecount
  26,679

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///          
>                            
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(26372 differences between age and agegroup)

. 
. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label values agegroup agegroup

. label var agegroup "Age group"

. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     13,503       50.61       50.61
       Male |     13,176       49.39      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. safecount
  26,679

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(993 real changes made)

. replace ethnicity=2 if ethnicity==3
(999 real changes made)

. replace ethnicity=3 if ethnicity==4
(1,010 real changes made)

. replace ethnicity=4 if ethnicity==6
(993 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///          
>                                    
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                    
>                                            

. label values ethnicity ethnicity

. safetab ethnicity, m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     15,953       59.80       59.80
South Asian |        999        3.74       63.54
      Black |      1,010        3.79       67.33
      Mixed |        993        3.72       71.05
      Other |        965        3.62       74.67
          . |      6,759       25.33      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(6,759 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(6,759 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. safetab ethnicity1, m

 ethnicity1 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     15,953       59.80       59.80
South Asian |        999        3.74       63.54
      Black |      1,010        3.79       67.33
      Mixed |        993        3.72       71.05
      Other |        965        3.62       74.67
    Unknown |      6,759       25.33      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,567        9.62        9.62
                Urban minor conurbation |      2,701       10.12       19.75
                    Urban city and town |      2,703       10.13       29.88
Urban city and town in a sparse setting |      2,758       10.34       40.22
                  Rural town and fringe |      2,555        9.58       49.79
Rural town and fringe in a sparse setti |      2,685       10.06       59.86
            Rural village and dispersed |      5,412       20.29       80.14
Rural village and dispersed in a sparse |      5,298       19.86      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,679      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(26,679 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(10,729 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(15,950 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                      rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0      2,555 |    15,950 
     Urban |     2,567      2,701      2,703      2,758          0 |    10,729 
-----------+-------------------------------------------------------+----------
     Total |     2,567      2,701      2,703      2,758      2,555 |    26,679 


Urban/rura |           rural_urban
         l | Rural tow  Rural vil  Rural vil |     Total
-----------+---------------------------------+----------
     Rural |     2,685      5,412      5,298 |    15,950 
     Urban |         0          0          0 |    10,729 
-----------+---------------------------------+----------
     Total |     2,685      5,412      5,298 |    26,679 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Pneumonia (pre-pandem |     8,093      5,439 |    13,532 
             COVID-19 |     7,857      5,290 |    13,147 
----------------------+----------------------+----------
                Total |    15,950     10,729 |    26,679 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,657 real changes made, 2,657 to missing)

. gen     bmi = .
(26,679 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(bmi: 1698 changes made)

. recode  bmi . = 2 if body_mass_index<25
(bmi: 5980 changes made)

. recode  bmi . = 3 if body_mass_index<30
(bmi: 6346 changes made)

. recode  bmi . = 4 if body_mass_index<35
(bmi: 5368 changes made)

. recode  bmi . = 5 if body_mass_index<40
(bmi: 3010 changes made)

. recode  bmi . = 6 if body_mass_index<.
(bmi: 1620 changes made)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>            

. label values bmi bmi

. safetab bmi, m

                 bmi |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,698        6.36        6.36
  Normal (18.5-24.9) |      5,980       22.41       28.78
Overweight (25-29.9) |      6,346       23.79       52.57
   Obese I (30-34.9) |      5,368       20.12       72.69
  Obese II (35-39.9) |      3,010       11.28       83.97
     Obese III (40+) |      1,620        6.07       90.04
                   . |      2,657        9.96      100.00
---------------------+-----------------------------------
               Total |     26,679      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(15,396 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(1,882 real changes made)

. replace smoking = 0 if smoking_status=="N"
(3,682 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |      3,682       13.80       13.80
Current/former smoker |     13,165       49.35       63.15
                    . |      9,832       36.85      100.00
----------------------+-----------------------------------
                Total |     26,679      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000
> )
(12580 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(egfr_group: 14099 changes made)

. label define egfr_group 1 "≥105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "
> 30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       ≥105 |      4,688       17.57       17.57
     90-104 |      1,895        7.10       24.67
      75-89 |      2,061        7.73       32.40
      60-74 |      2,159        8.09       40.49
      45-59 |      2,035        7.63       48.12
      30-44 |      1,115        4.18       52.30
      15-29 |        146        0.55       52.85
          . |     12,580       47.15      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 1
> 5-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(12,580 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(ckd_stage: 21991 changes made)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6
>  "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |     10,803       40.49       40.49
                      CKD 3A |      2,035        7.63       48.12
                      CKD 3B |      1,115        4.18       52.30
                       CKD 4 |        146        0.55       52.85
No baseline eGFR measurement |     12,580       47.15      100.00
-----------------------------+-----------------------------------
                       Total |     26,679      100.00

. 
. * Comorbidities
. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,318       94.90       94.90
          1 |      1,361        5.10      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,149       98.01       98.01
          1 |        530        1.99      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. safetab diabetes

   diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,347       80.01       80.01
          1 |      5,332       19.99      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,420       99.03       99.03
          1 |        259        0.97      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. safetab heart_failure

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,614       96.01       96.01
          1 |      1,065        3.99      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. safetab hiv

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,162       98.06       98.06
          1 |        517        1.94      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. safetab hypertension

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,272       79.73       79.73
          1 |      5,407       20.27      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. safetab non_haem_cancer

non_haem_ca |
       ncer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,140       97.98       97.98
          1 |        539        2.02      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. safetab myocardial_infarction

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,009       89.99       89.99
          1 |      2,670       10.01      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,157       98.04       98.04
          1 |        522        1.96      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,318       94.90       94.90
          1 |      1,361        5.10      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. safetab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,138       97.97       97.97
          1 |        541        2.03      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,120       97.90       97.90
          1 |        559        2.10      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(1,010 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,436 real changes made)

. replace cardiovascular = 1 if pvd==1
(421 real changes made)

. replace cardiovascular = 1 if stroke==1
(432 real changes made)

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(510 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,323 real changes made)

. replace immunosuppressed = 1 if lupus==1
(515 real changes made)

. safetab cardiovascular

cardiovascu |
        lar |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,019       78.78       78.78
          1 |      5,660       21.22      100.00
------------+-----------------------------------
      Total |     26,679      100.00

. safetab immunosuppressed

immunosuppr |
      essed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,072       90.23       90.23
          1 |      2,607        9.77      100.00
------------+-----------------------------------
      Total |     26,679      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                              
>    creatinine_mar2017 ///
>                                                                              
>    creatinine_apr2017 ///
>                                                                              
>    creatinine_may2017 ///
>                                                                              
>    creatinine_jun2017 ///
>                                                                              
>    creatinine_jul2017 ///
>                                                                              
>    creatinine_aug2017 ///
>                                                                              
>    creatinine_sep2017 ///
>                                                                              
>    creatinine_oct2017 ///
>                                                                              
>    creatinine_nov2017 ///
>                                                                              
>    creatinine_dec2017 ///
>                                                                              
>    creatinine_jan2018 ///
>                                                                              
>    creatinine_feb2018 ///
>                                                                              
>    creatinine_mar2018 ///
>                                                                              
>    creatinine_apr2018 ///
>                                                                              
>    creatinine_may2018 ///
>                                                                              
>    creatinine_jun2018 ///
>                                                                              
>    creatinine_jul2018 ///
>                                                                              
>    creatinine_aug2018 ///
>                                                                              
>    creatinine_sep2018 ///
>                                                                              
>    creatinine_oct2018 ///
>                                                                              
>    creatinine_nov2018 ///
>                                                                              
>    creatinine_dec2018 ///
>                                                                              
>    creatinine_jan2019 ///
>                                                                              
>    creatinine_feb2019 ///
>                                                                              
>    creatinine_mar2019 ///
>                                                                              
>    creatinine_apr2019 ///
>                                                                              
>    creatinine_may2019 ///
>                                                                              
>    creatinine_jun2019 ///
>                                                                              
>    creatinine_jul2019 ///
>                                                                              
>    creatinine_aug2019 ///
>                                                                              
>    creatinine_sep2019 ///
>                                                                              
>    creatinine_feb2020 ///
>                                                                              
>    creatinine_mar2020 ///
>                                                                              
>    creatinine_apr2020 ///
>                                                                              
>    creatinine_may2020 ///
>                                                                              
>    creatinine_jun2020 ///
>                                                                              
>    creatinine_jul2020 ///
>                                                                              
>    creatinine_aug2020 ///
>                                                                              
>    creatinine_sep2020 ///
>                                                                              
>    creatinine_oct2020 ///
>                                                                              
>    creatinine_nov2020 ///
>                                                                              
>    creatinine_dec2020 ///
>                                                                              
>    creatinine_jan2021 ///
>                                                                              
>    creatinine_feb2021 ///
>                                                                              
>    creatinine_mar2021 ///
>                                                                              
>    creatinine_apr2021 ///
>                                                                              
>    creatinine_may2021 ///
>                                                                              
>    creatinine_jun2021 ///
>                                                                              
>    creatinine_jul2021 ///
>                                                                              
>    creatinine_aug2021 ///
>                                                                              
>    creatinine_sep2021 ///
>                                                                              
>    creatinine_oct2021 ///
>                                                                              
>    creatinine_nov2021 ///
>                                                                              
>    creatinine_dec2021 ///
>                                                                              
>    creatinine_jan2022 ///
>                                                                              
>    creatinine_feb2022 ///
>                                                                              
>    creatinine_mar2022 ///
>                                                                              
>    creatinine_apr2022 ///
>                                                                              
>    creatinine_may2022 ///
>                                                                              
>    creatinine_jun2022 ///
>                                                                              
>    creatinine_jul2022 ///
>                                                                              
>    creatinine_aug2022 ///
>                                                                              
>    creatinine_sep2022 ///
>                                                                              
>    creatinine_oct2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 300
> 0)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex=
> =0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex=
> =1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_m
> onthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex
> ==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(5,955 real changes made, 5,955 to missing)
(19,102 missing values generated)
(26,679 missing values generated)
(3,856 real changes made)
(3,721 real changes made)
(3,856 real changes made)
(3,721 real changes made)
(4,849 real changes made)
(26,679 missing values generated)
(3,856 real changes made)
(3,721 real changes made)
(7,577 real changes made)
(21,830 real changes made)
(19,102 missing values generated)
(7,473 real changes made)
(3,856 real changes made)
(5,943 real changes made, 5,943 to missing)
(19,090 missing values generated)
(26,679 missing values generated)
(3,803 real changes made)
(3,786 real changes made)
(3,803 real changes made)
(3,786 real changes made)
(4,853 real changes made)
(26,679 missing values generated)
(3,803 real changes made)
(3,786 real changes made)
(7,589 real changes made)
(21,826 real changes made)
(19,090 missing values generated)
(7,492 real changes made)
(3,803 real changes made)
(5,942 real changes made, 5,942 to missing)
(19,089 missing values generated)
(26,679 missing values generated)
(3,809 real changes made)
(3,781 real changes made)
(3,809 real changes made)
(3,781 real changes made)
(4,857 real changes made)
(26,679 missing values generated)
(3,809 real changes made)
(3,781 real changes made)
(7,590 real changes made)
(21,822 real changes made)
(19,089 missing values generated)
(7,480 real changes made)
(3,809 real changes made)
(5,994 real changes made, 5,994 to missing)
(19,141 missing values generated)
(26,679 missing values generated)
(3,733 real changes made)
(3,805 real changes made)
(3,733 real changes made)
(3,805 real changes made)
(4,716 real changes made)
(26,679 missing values generated)
(3,733 real changes made)
(3,805 real changes made)
(7,538 real changes made)
(21,963 real changes made)
(19,141 missing values generated)
(7,439 real changes made)
(3,733 real changes made)
(5,991 real changes made, 5,991 to missing)
(19,138 missing values generated)
(26,679 missing values generated)
(3,726 real changes made)
(3,815 real changes made)
(3,726 real changes made)
(3,815 real changes made)
(4,712 real changes made)
(26,679 missing values generated)
(3,726 real changes made)
(3,815 real changes made)
(7,541 real changes made)
(21,967 real changes made)
(19,138 missing values generated)
(7,443 real changes made)
(3,726 real changes made)
(5,961 real changes made, 5,961 to missing)
(19,108 missing values generated)
(26,679 missing values generated)
(3,881 real changes made)
(3,690 real changes made)
(3,881 real changes made)
(3,690 real changes made)
(4,766 real changes made)
(26,679 missing values generated)
(3,881 real changes made)
(3,690 real changes made)
(7,571 real changes made)
(21,913 real changes made)
(19,108 missing values generated)
(7,467 real changes made)
(3,881 real changes made)
(5,896 real changes made, 5,896 to missing)
(19,043 missing values generated)
(26,679 missing values generated)
(3,764 real changes made)
(3,872 real changes made)
(3,764 real changes made)
(3,872 real changes made)
(4,818 real changes made)
(26,679 missing values generated)
(3,764 real changes made)
(3,872 real changes made)
(7,636 real changes made)
(21,861 real changes made)
(19,043 missing values generated)
(7,526 real changes made)
(3,764 real changes made)
(5,966 real changes made, 5,966 to missing)
(19,113 missing values generated)
(26,679 missing values generated)
(3,791 real changes made)
(3,775 real changes made)
(3,791 real changes made)
(3,775 real changes made)
(4,783 real changes made)
(26,679 missing values generated)
(3,791 real changes made)
(3,775 real changes made)
(7,566 real changes made)
(21,896 real changes made)
(19,113 missing values generated)
(7,451 real changes made)
(3,791 real changes made)
(5,962 real changes made, 5,962 to missing)
(19,109 missing values generated)
(26,679 missing values generated)
(3,831 real changes made)
(3,739 real changes made)
(3,831 real changes made)
(3,739 real changes made)
(4,745 real changes made)
(26,679 missing values generated)
(3,831 real changes made)
(3,739 real changes made)
(7,570 real changes made)
(21,934 real changes made)
(19,109 missing values generated)
(7,467 real changes made)
(3,831 real changes made)
(5,968 real changes made, 5,968 to missing)
(19,115 missing values generated)
(26,679 missing values generated)
(3,740 real changes made)
(3,824 real changes made)
(3,740 real changes made)
(3,824 real changes made)
(4,810 real changes made)
(26,679 missing values generated)
(3,740 real changes made)
(3,824 real changes made)
(7,564 real changes made)
(21,869 real changes made)
(19,115 missing values generated)
(7,458 real changes made)
(3,740 real changes made)
(5,866 real changes made, 5,866 to missing)
(19,013 missing values generated)
(26,679 missing values generated)
(3,871 real changes made)
(3,795 real changes made)
(3,871 real changes made)
(3,795 real changes made)
(4,817 real changes made)
(26,679 missing values generated)
(3,871 real changes made)
(3,795 real changes made)
(7,666 real changes made)
(21,862 real changes made)
(19,013 missing values generated)
(7,567 real changes made)
(3,871 real changes made)
(5,964 real changes made, 5,964 to missing)
(19,111 missing values generated)
(26,679 missing values generated)
(3,847 real changes made)
(3,721 real changes made)
(3,847 real changes made)
(3,721 real changes made)
(4,817 real changes made)
(26,679 missing values generated)
(3,847 real changes made)
(3,721 real changes made)
(7,568 real changes made)
(21,862 real changes made)
(19,111 missing values generated)
(7,461 real changes made)
(3,847 real changes made)
(5,977 real changes made, 5,977 to missing)
(19,124 missing values generated)
(26,679 missing values generated)
(3,805 real changes made)
(3,750 real changes made)
(3,805 real changes made)
(3,750 real changes made)
(4,818 real changes made)
(26,679 missing values generated)
(3,805 real changes made)
(3,750 real changes made)
(7,555 real changes made)
(21,861 real changes made)
(19,124 missing values generated)
(7,455 real changes made)
(3,805 real changes made)
(6,014 real changes made, 6,014 to missing)
(19,161 missing values generated)
(26,679 missing values generated)
(3,803 real changes made)
(3,715 real changes made)
(3,803 real changes made)
(3,715 real changes made)
(4,814 real changes made)
(26,679 missing values generated)
(3,803 real changes made)
(3,715 real changes made)
(7,518 real changes made)
(21,865 real changes made)
(19,161 missing values generated)
(7,397 real changes made)
(3,803 real changes made)
(5,897 real changes made, 5,897 to missing)
(19,044 missing values generated)
(26,679 missing values generated)
(3,842 real changes made)
(3,793 real changes made)
(3,842 real changes made)
(3,793 real changes made)
(4,775 real changes made)
(26,679 missing values generated)
(3,842 real changes made)
(3,793 real changes made)
(7,635 real changes made)
(21,904 real changes made)
(19,044 missing values generated)
(7,521 real changes made)
(3,842 real changes made)
(5,882 real changes made, 5,882 to missing)
(19,029 missing values generated)
(26,679 missing values generated)
(3,802 real changes made)
(3,848 real changes made)
(3,802 real changes made)
(3,848 real changes made)
(4,828 real changes made)
(26,679 missing values generated)
(3,802 real changes made)
(3,848 real changes made)
(7,650 real changes made)
(21,851 real changes made)
(19,029 missing values generated)
(7,542 real changes made)
(3,802 real changes made)
(6,016 real changes made, 6,016 to missing)
(19,163 missing values generated)
(26,679 missing values generated)
(3,787 real changes made)
(3,729 real changes made)
(3,787 real changes made)
(3,729 real changes made)
(4,732 real changes made)
(26,679 missing values generated)
(3,787 real changes made)
(3,729 real changes made)
(7,516 real changes made)
(21,947 real changes made)
(19,163 missing values generated)
(7,420 real changes made)
(3,787 real changes made)
(5,953 real changes made, 5,953 to missing)
(19,100 missing values generated)
(26,679 missing values generated)
(3,837 real changes made)
(3,742 real changes made)
(3,837 real changes made)
(3,742 real changes made)
(4,808 real changes made)
(26,679 missing values generated)
(3,837 real changes made)
(3,742 real changes made)
(7,579 real changes made)
(21,871 real changes made)
(19,100 missing values generated)
(7,475 real changes made)
(3,837 real changes made)
(6,001 real changes made, 6,001 to missing)
(19,148 missing values generated)
(26,679 missing values generated)
(3,773 real changes made)
(3,758 real changes made)
(3,773 real changes made)
(3,758 real changes made)
(4,753 real changes made)
(26,679 missing values generated)
(3,773 real changes made)
(3,758 real changes made)
(7,531 real changes made)
(21,926 real changes made)
(19,148 missing values generated)
(7,421 real changes made)
(3,773 real changes made)
(5,917 real changes made, 5,917 to missing)
(19,064 missing values generated)
(26,679 missing values generated)
(3,793 real changes made)
(3,822 real changes made)
(3,793 real changes made)
(3,822 real changes made)
(4,840 real changes made)
(26,679 missing values generated)
(3,793 real changes made)
(3,822 real changes made)
(7,615 real changes made)
(21,839 real changes made)
(19,064 missing values generated)
(7,506 real changes made)
(3,793 real changes made)
(5,989 real changes made, 5,989 to missing)
(19,136 missing values generated)
(26,679 missing values generated)
(3,809 real changes made)
(3,734 real changes made)
(3,809 real changes made)
(3,734 real changes made)
(4,732 real changes made)
(26,679 missing values generated)
(3,809 real changes made)
(3,734 real changes made)
(7,543 real changes made)
(21,947 real changes made)
(19,136 missing values generated)
(7,434 real changes made)
(3,809 real changes made)
(5,927 real changes made, 5,927 to missing)
(19,074 missing values generated)
(26,679 missing values generated)
(3,860 real changes made)
(3,745 real changes made)
(3,860 real changes made)
(3,745 real changes made)
(4,745 real changes made)
(26,679 missing values generated)
(3,860 real changes made)
(3,745 real changes made)
(7,605 real changes made)
(21,934 real changes made)
(19,074 missing values generated)
(7,498 real changes made)
(3,860 real changes made)
(5,981 real changes made, 5,981 to missing)
(19,128 missing values generated)
(26,679 missing values generated)
(3,835 real changes made)
(3,716 real changes made)
(3,835 real changes made)
(3,716 real changes made)
(4,806 real changes made)
(26,679 missing values generated)
(3,835 real changes made)
(3,716 real changes made)
(7,551 real changes made)
(21,873 real changes made)
(19,128 missing values generated)
(7,441 real changes made)
(3,835 real changes made)
(5,943 real changes made, 5,943 to missing)
(19,090 missing values generated)
(26,679 missing values generated)
(3,831 real changes made)
(3,758 real changes made)
(3,831 real changes made)
(3,758 real changes made)
(4,836 real changes made)
(26,679 missing values generated)
(3,831 real changes made)
(3,758 real changes made)
(7,589 real changes made)
(21,843 real changes made)
(19,090 missing values generated)
(7,490 real changes made)
(3,831 real changes made)
(5,897 real changes made, 5,897 to missing)
(19,044 missing values generated)
(26,679 missing values generated)
(3,847 real changes made)
(3,788 real changes made)
(3,847 real changes made)
(3,788 real changes made)
(4,832 real changes made)
(26,679 missing values generated)
(3,847 real changes made)
(3,788 real changes made)
(7,635 real changes made)
(21,847 real changes made)
(19,044 missing values generated)
(7,523 real changes made)
(3,847 real changes made)
(6,004 real changes made, 6,004 to missing)
(19,151 missing values generated)
(26,679 missing values generated)
(3,810 real changes made)
(3,718 real changes made)
(3,810 real changes made)
(3,718 real changes made)
(4,723 real changes made)
(26,679 missing values generated)
(3,810 real changes made)
(3,718 real changes made)
(7,528 real changes made)
(21,956 real changes made)
(19,151 missing values generated)
(7,422 real changes made)
(3,810 real changes made)
(5,899 real changes made, 5,899 to missing)
(19,046 missing values generated)
(26,679 missing values generated)
(3,853 real changes made)
(3,780 real changes made)
(3,853 real changes made)
(3,780 real changes made)
(4,800 real changes made)
(26,679 missing values generated)
(3,853 real changes made)
(3,780 real changes made)
(7,633 real changes made)
(21,879 real changes made)
(19,046 missing values generated)
(7,518 real changes made)
(3,853 real changes made)
(5,958 real changes made, 5,958 to missing)
(19,105 missing values generated)
(26,679 missing values generated)
(3,853 real changes made)
(3,721 real changes made)
(3,853 real changes made)
(3,721 real changes made)
(4,811 real changes made)
(26,679 missing values generated)
(3,853 real changes made)
(3,721 real changes made)
(7,574 real changes made)
(21,868 real changes made)
(19,105 missing values generated)
(7,454 real changes made)
(3,853 real changes made)
(6,045 real changes made, 6,045 to missing)
(19,192 missing values generated)
(26,679 missing values generated)
(3,831 real changes made)
(3,656 real changes made)
(3,831 real changes made)
(3,656 real changes made)
(4,729 real changes made)
(26,679 missing values generated)
(3,831 real changes made)
(3,656 real changes made)
(7,487 real changes made)
(21,950 real changes made)
(19,192 missing values generated)
(7,392 real changes made)
(3,831 real changes made)
(5,877 real changes made, 5,877 to missing)
(19,024 missing values generated)
(26,679 missing values generated)
(3,833 real changes made)
(3,822 real changes made)
(3,833 real changes made)
(3,822 real changes made)
(4,888 real changes made)
(26,679 missing values generated)
(3,833 real changes made)
(3,822 real changes made)
(7,655 real changes made)
(21,791 real changes made)
(19,024 missing values generated)
(7,556 real changes made)
(3,833 real changes made)
(5,921 real changes made, 5,921 to missing)
(19,068 missing values generated)
(26,679 missing values generated)
(3,825 real changes made)
(3,786 real changes made)
(3,825 real changes made)
(3,786 real changes made)
(4,797 real changes made)
(26,679 missing values generated)
(3,825 real changes made)
(3,786 real changes made)
(7,611 real changes made)
(21,882 real changes made)
(19,068 missing values generated)
(7,509 real changes made)
(3,825 real changes made)
(5,923 real changes made, 5,923 to missing)
(19,070 missing values generated)
(26,679 missing values generated)
(3,792 real changes made)
(3,817 real changes made)
(3,792 real changes made)
(3,817 real changes made)
(4,807 real changes made)
(26,679 missing values generated)
(3,792 real changes made)
(3,817 real changes made)
(7,609 real changes made)
(21,872 real changes made)
(19,070 missing values generated)
(7,505 real changes made)
(3,792 real changes made)
(5,806 real changes made, 5,806 to missing)
(19,338 missing values generated)
(26,679 missing values generated)
(3,693 real changes made)
(3,648 real changes made)
(3,693 real changes made)
(3,648 real changes made)
(4,708 real changes made)
(26,679 missing values generated)
(3,693 real changes made)
(3,648 real changes made)
(7,341 real changes made)
(21,971 real changes made)
(19,338 missing values generated)
(7,244 real changes made)
(3,693 real changes made)
(5,772 real changes made, 5,772 to missing)
(19,304 missing values generated)
(26,679 missing values generated)
(3,750 real changes made)
(3,625 real changes made)
(3,750 real changes made)
(3,625 real changes made)
(4,705 real changes made)
(26,679 missing values generated)
(3,750 real changes made)
(3,625 real changes made)
(7,375 real changes made)
(21,974 real changes made)
(19,304 missing values generated)
(7,301 real changes made)
(3,750 real changes made)
(5,795 real changes made, 5,795 to missing)
(19,327 missing values generated)
(26,679 missing values generated)
(3,746 real changes made)
(3,606 real changes made)
(3,746 real changes made)
(3,606 real changes made)
(4,648 real changes made)
(26,679 missing values generated)
(3,746 real changes made)
(3,606 real changes made)
(7,352 real changes made)
(22,031 real changes made)
(19,327 missing values generated)
(7,262 real changes made)
(3,746 real changes made)
(5,757 real changes made, 5,757 to missing)
(19,289 missing values generated)
(26,679 missing values generated)
(3,779 real changes made)
(3,611 real changes made)
(3,779 real changes made)
(3,611 real changes made)
(4,703 real changes made)
(26,679 missing values generated)
(3,779 real changes made)
(3,611 real changes made)
(7,390 real changes made)
(21,976 real changes made)
(19,289 missing values generated)
(7,305 real changes made)
(3,779 real changes made)
(5,816 real changes made, 5,816 to missing)
(19,348 missing values generated)
(26,679 missing values generated)
(3,717 real changes made)
(3,614 real changes made)
(3,717 real changes made)
(3,614 real changes made)
(4,602 real changes made)
(26,679 missing values generated)
(3,717 real changes made)
(3,614 real changes made)
(7,331 real changes made)
(22,077 real changes made)
(19,348 missing values generated)
(7,246 real changes made)
(3,717 real changes made)
(5,789 real changes made, 5,789 to missing)
(19,321 missing values generated)
(26,679 missing values generated)
(3,711 real changes made)
(3,647 real changes made)
(3,711 real changes made)
(3,647 real changes made)
(4,661 real changes made)
(26,679 missing values generated)
(3,711 real changes made)
(3,647 real changes made)
(7,358 real changes made)
(22,018 real changes made)
(19,321 missing values generated)
(7,280 real changes made)
(3,711 real changes made)
(5,772 real changes made, 5,772 to missing)
(19,304 missing values generated)
(26,679 missing values generated)
(3,789 real changes made)
(3,586 real changes made)
(3,789 real changes made)
(3,586 real changes made)
(4,680 real changes made)
(26,679 missing values generated)
(3,789 real changes made)
(3,586 real changes made)
(7,375 real changes made)
(21,999 real changes made)
(19,304 missing values generated)
(7,297 real changes made)
(3,789 real changes made)
(5,865 real changes made, 5,865 to missing)
(19,397 missing values generated)
(26,679 missing values generated)
(3,709 real changes made)
(3,573 real changes made)
(3,709 real changes made)
(3,573 real changes made)
(4,620 real changes made)
(26,679 missing values generated)
(3,709 real changes made)
(3,573 real changes made)
(7,282 real changes made)
(22,059 real changes made)
(19,397 missing values generated)
(7,211 real changes made)
(3,709 real changes made)
(5,770 real changes made, 5,770 to missing)
(19,302 missing values generated)
(26,679 missing values generated)
(3,722 real changes made)
(3,655 real changes made)
(3,722 real changes made)
(3,655 real changes made)
(4,703 real changes made)
(26,679 missing values generated)
(3,722 real changes made)
(3,655 real changes made)
(7,377 real changes made)
(21,976 real changes made)
(19,302 missing values generated)
(7,301 real changes made)
(3,722 real changes made)
(5,743 real changes made, 5,743 to missing)
(19,275 missing values generated)
(26,679 missing values generated)
(3,763 real changes made)
(3,641 real changes made)
(3,763 real changes made)
(3,641 real changes made)
(4,652 real changes made)
(26,679 missing values generated)
(3,763 real changes made)
(3,641 real changes made)
(7,404 real changes made)
(22,027 real changes made)
(19,275 missing values generated)
(7,316 real changes made)
(3,763 real changes made)
(5,791 real changes made, 5,791 to missing)
(19,323 missing values generated)
(26,679 missing values generated)
(3,700 real changes made)
(3,656 real changes made)
(3,700 real changes made)
(3,656 real changes made)
(4,666 real changes made)
(26,679 missing values generated)
(3,700 real changes made)
(3,656 real changes made)
(7,356 real changes made)
(22,013 real changes made)
(19,323 missing values generated)
(7,267 real changes made)
(3,700 real changes made)
(5,760 real changes made, 5,760 to missing)
(19,292 missing values generated)
(26,679 missing values generated)
(3,735 real changes made)
(3,652 real changes made)
(3,735 real changes made)
(3,652 real changes made)
(4,621 real changes made)
(26,679 missing values generated)
(3,735 real changes made)
(3,652 real changes made)
(7,387 real changes made)
(22,058 real changes made)
(19,292 missing values generated)
(7,302 real changes made)
(3,735 real changes made)
(5,755 real changes made, 5,755 to missing)
(19,287 missing values generated)
(26,679 missing values generated)
(3,737 real changes made)
(3,655 real changes made)
(3,737 real changes made)
(3,655 real changes made)
(4,647 real changes made)
(26,679 missing values generated)
(3,737 real changes made)
(3,655 real changes made)
(7,392 real changes made)
(22,032 real changes made)
(19,287 missing values generated)
(7,303 real changes made)
(3,737 real changes made)
(5,769 real changes made, 5,769 to missing)
(19,301 missing values generated)
(26,679 missing values generated)
(3,760 real changes made)
(3,618 real changes made)
(3,760 real changes made)
(3,618 real changes made)
(4,638 real changes made)
(26,679 missing values generated)
(3,760 real changes made)
(3,618 real changes made)
(7,378 real changes made)
(22,041 real changes made)
(19,301 missing values generated)
(7,287 real changes made)
(3,760 real changes made)
(5,880 real changes made, 5,880 to missing)
(19,412 missing values generated)
(26,679 missing values generated)
(3,702 real changes made)
(3,565 real changes made)
(3,702 real changes made)
(3,565 real changes made)
(4,579 real changes made)
(26,679 missing values generated)
(3,702 real changes made)
(3,565 real changes made)
(7,267 real changes made)
(22,100 real changes made)
(19,412 missing values generated)
(7,196 real changes made)
(3,702 real changes made)
(5,813 real changes made, 5,813 to missing)
(19,345 missing values generated)
(26,679 missing values generated)
(3,712 real changes made)
(3,622 real changes made)
(3,712 real changes made)
(3,622 real changes made)
(4,613 real changes made)
(26,679 missing values generated)
(3,712 real changes made)
(3,622 real changes made)
(7,334 real changes made)
(22,066 real changes made)
(19,345 missing values generated)
(7,259 real changes made)
(3,712 real changes made)
(5,756 real changes made, 5,756 to missing)
(19,288 missing values generated)
(26,679 missing values generated)
(3,747 real changes made)
(3,644 real changes made)
(3,747 real changes made)
(3,644 real changes made)
(4,644 real changes made)
(26,679 missing values generated)
(3,747 real changes made)
(3,644 real changes made)
(7,391 real changes made)
(22,035 real changes made)
(19,288 missing values generated)
(7,302 real changes made)
(3,747 real changes made)
(5,819 real changes made, 5,819 to missing)
(19,351 missing values generated)
(26,679 missing values generated)
(3,729 real changes made)
(3,599 real changes made)
(3,729 real changes made)
(3,599 real changes made)
(4,654 real changes made)
(26,679 missing values generated)
(3,729 real changes made)
(3,599 real changes made)
(7,328 real changes made)
(22,025 real changes made)
(19,351 missing values generated)
(7,244 real changes made)
(3,729 real changes made)
(5,768 real changes made, 5,768 to missing)
(19,300 missing values generated)
(26,679 missing values generated)
(3,777 real changes made)
(3,602 real changes made)
(3,777 real changes made)
(3,602 real changes made)
(4,664 real changes made)
(26,679 missing values generated)
(3,777 real changes made)
(3,602 real changes made)
(7,379 real changes made)
(22,015 real changes made)
(19,300 missing values generated)
(7,294 real changes made)
(3,777 real changes made)
(5,783 real changes made, 5,783 to missing)
(19,315 missing values generated)
(26,679 missing values generated)
(3,740 real changes made)
(3,624 real changes made)
(3,740 real changes made)
(3,624 real changes made)
(4,689 real changes made)
(26,679 missing values generated)
(3,740 real changes made)
(3,624 real changes made)
(7,364 real changes made)
(21,990 real changes made)
(19,315 missing values generated)
(7,280 real changes made)
(3,740 real changes made)
(5,765 real changes made, 5,765 to missing)
(19,297 missing values generated)
(26,679 missing values generated)
(3,786 real changes made)
(3,596 real changes made)
(3,786 real changes made)
(3,596 real changes made)
(4,685 real changes made)
(26,679 missing values generated)
(3,786 real changes made)
(3,596 real changes made)
(7,382 real changes made)
(21,994 real changes made)
(19,297 missing values generated)
(7,303 real changes made)
(3,786 real changes made)
(5,740 real changes made, 5,740 to missing)
(19,272 missing values generated)
(26,679 missing values generated)
(3,768 real changes made)
(3,639 real changes made)
(3,768 real changes made)
(3,639 real changes made)
(4,719 real changes made)
(26,679 missing values generated)
(3,768 real changes made)
(3,639 real changes made)
(7,407 real changes made)
(21,960 real changes made)
(19,272 missing values generated)
(7,312 real changes made)
(3,768 real changes made)
(5,849 real changes made, 5,849 to missing)
(19,381 missing values generated)
(26,679 missing values generated)
(3,674 real changes made)
(3,624 real changes made)
(3,674 real changes made)
(3,624 real changes made)
(4,577 real changes made)
(26,679 missing values generated)
(3,674 real changes made)
(3,624 real changes made)
(7,298 real changes made)
(22,102 real changes made)
(19,381 missing values generated)
(7,223 real changes made)
(3,674 real changes made)
(5,824 real changes made, 5,824 to missing)
(19,356 missing values generated)
(26,679 missing values generated)
(3,703 real changes made)
(3,620 real changes made)
(3,703 real changes made)
(3,620 real changes made)
(4,638 real changes made)
(26,679 missing values generated)
(3,703 real changes made)
(3,620 real changes made)
(7,323 real changes made)
(22,041 real changes made)
(19,356 missing values generated)
(7,236 real changes made)
(3,703 real changes made)
(5,779 real changes made, 5,779 to missing)
(19,311 missing values generated)
(26,679 missing values generated)
(3,769 real changes made)
(3,599 real changes made)
(3,769 real changes made)
(3,599 real changes made)
(4,626 real changes made)
(26,679 missing values generated)
(3,769 real changes made)
(3,599 real changes made)
(7,368 real changes made)
(22,053 real changes made)
(19,311 missing values generated)
(7,287 real changes made)
(3,769 real changes made)
(5,803 real changes made, 5,803 to missing)
(19,335 missing values generated)
(26,679 missing values generated)
(3,763 real changes made)
(3,581 real changes made)
(3,763 real changes made)
(3,581 real changes made)
(4,739 real changes made)
(26,679 missing values generated)
(3,763 real changes made)
(3,581 real changes made)
(7,344 real changes made)
(21,940 real changes made)
(19,335 missing values generated)
(7,260 real changes made)
(3,763 real changes made)
(5,838 real changes made, 5,838 to missing)
(19,370 missing values generated)
(26,679 missing values generated)
(3,716 real changes made)
(3,593 real changes made)
(3,716 real changes made)
(3,593 real changes made)
(4,577 real changes made)
(26,679 missing values generated)
(3,716 real changes made)
(3,593 real changes made)
(7,309 real changes made)
(22,102 real changes made)
(19,370 missing values generated)
(7,231 real changes made)
(3,716 real changes made)
(5,788 real changes made, 5,788 to missing)
(19,320 missing values generated)
(26,679 missing values generated)
(3,795 real changes made)
(3,564 real changes made)
(3,795 real changes made)
(3,564 real changes made)
(4,708 real changes made)
(26,679 missing values generated)
(3,795 real changes made)
(3,564 real changes made)
(7,359 real changes made)
(21,971 real changes made)
(19,320 missing values generated)
(7,290 real changes made)
(3,795 real changes made)
(5,744 real changes made, 5,744 to missing)
(19,276 missing values generated)
(26,679 missing values generated)
(3,727 real changes made)
(3,676 real changes made)
(3,727 real changes made)
(3,676 real changes made)
(4,631 real changes made)
(26,679 missing values generated)
(3,727 real changes made)
(3,676 real changes made)
(7,403 real changes made)
(22,048 real changes made)
(19,276 missing values generated)
(7,325 real changes made)
(3,727 real changes made)
(5,802 real changes made, 5,802 to missing)
(19,334 missing values generated)
(26,679 missing values generated)
(3,729 real changes made)
(3,616 real changes made)
(3,729 real changes made)
(3,616 real changes made)
(4,663 real changes made)
(26,679 missing values generated)
(3,729 real changes made)
(3,616 real changes made)
(7,345 real changes made)
(22,016 real changes made)
(19,334 missing values generated)
(7,268 real changes made)
(3,729 real changes made)
(5,737 real changes made, 5,737 to missing)
(19,269 missing values generated)
(26,679 missing values generated)
(3,768 real changes made)
(3,642 real changes made)
(3,768 real changes made)
(3,642 real changes made)
(4,753 real changes made)
(26,679 missing values generated)
(3,768 real changes made)
(3,642 real changes made)
(7,410 real changes made)
(21,926 real changes made)
(19,269 missing values generated)
(7,336 real changes made)
(3,768 real changes made)
(5,756 real changes made, 5,756 to missing)
(19,288 missing values generated)
(26,679 missing values generated)
(3,713 real changes made)
(3,678 real changes made)
(3,713 real changes made)
(3,678 real changes made)
(4,656 real changes made)
(26,679 missing values generated)
(3,713 real changes made)
(3,678 real changes made)
(7,391 real changes made)
(22,023 real changes made)
(19,288 missing values generated)
(7,313 real changes made)
(3,713 real changes made)
(5,794 real changes made, 5,794 to missing)
(19,326 missing values generated)
(26,679 missing values generated)
(3,754 real changes made)
(3,599 real changes made)
(3,754 real changes made)
(3,599 real changes made)
(4,660 real changes made)
(26,679 missing values generated)
(3,754 real changes made)
(3,599 real changes made)
(7,353 real changes made)
(22,019 real changes made)
(19,326 missing values generated)
(7,267 real changes made)
(3,754 real changes made)

. 
. replace index_date = index_date_28
(25,738 real changes made)

. drop index_date_28

. gen egfr15_date=.
(26,679 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatin
> ine_`x'<15 & date("01`x'", "DMY")>=index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen esrd_date = egfr15_date
(26,678 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if esrd_date==.
(2,087 real changes made)

. gen esrd_time = (esrd_date - index_date)
(24,591 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(24,591 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(esrd_time_cat: 2083 changes made)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"           
>            ///
>                                                         3 "1 to 28 days"     
>    ///
>                                                         4 "20 to 90 days"    
>    ///
>                                                         5 "91 to 180 days"   
>    ///
>                                                         6 "181 to 365 days"  
>    ///
>                                                         7 "366 to 730 days"  
>    ///
>                                                         8 "731 to 973 days"  
>    ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 critical_care
>    ///
>                                                                 krt          
>    {
  2.                                                                 by `exposu
> re',sort: sum esrd_time, de
  3.                                                                 tab esrd_t
> ime_cat `exposure', m col chi
  4.                                                                 }

-------------------------------------------------------------------------------
-> case = Pneumonia (pre-pandemic)

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            3              0
10%           31              0       Obs               1,067
25%          118              0       Sum of Wgt.       1,067

50%          271                      Mean           317.8519
                        Largest       Std. Dev.      239.2398
75%          484            933
90%          678            941       Variance       57235.66
95%          776            960       Skewness       .5887616
99%          885            980       Kurtosis       2.431846

-------------------------------------------------------------------------------
-> case = COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           20              0       Obs               1,021
25%          109              0       Sum of Wgt.       1,021

50%          273                      Mean           311.8678
                        Largest       Std. Dev.      238.6591
75%          482            930
90%          661            942       Variance       56958.14
95%          756            945       Skewness       .5335633
99%          867            960       Kurtosis       2.330196


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Pneumonia   COVID-19 |     Total
----------------+----------------------+----------
         0 days |        50         65 |       115 
                |      0.37       0.49 |      0.43 
----------------+----------------------+----------
   1 to 28 days |        52         57 |       109 
                |      0.38       0.43 |      0.41 
----------------+----------------------+----------
  20 to 90 days |       122        104 |       226 
                |      0.90       0.79 |      0.85 
----------------+----------------------+----------
 91 to 180 days |       156        149 |       305 
                |      1.15       1.13 |      1.14 
----------------+----------------------+----------
181 to 365 days |       281        256 |       537 
                |      2.08       1.95 |      2.01 
----------------+----------------------+----------
366 to 730 days |       333        328 |       661 
                |      2.46       2.49 |      2.48 
----------------+----------------------+----------
731 to 973 days |        72         62 |       134 
                |      0.53       0.47 |      0.50 
----------------+----------------------+----------
      >973 days |         1          0 |         1 
                |      0.01       0.00 |      0.00 
----------------+----------------------+----------
              . |    12,465     12,126 |    24,591 
                |     92.11      92.23 |     92.17 
----------------+----------------------+----------
          Total |    13,532     13,147 |    26,679 
                |    100.00     100.00 |    100.00 

          Pearson chi2(8) =   5.8468   Pr = 0.664

-------------------------------------------------------------------------------
-> critical_care = Ward-based

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           23              0       Obs               1,876
25%          112              0       Sum of Wgt.       1,876

50%          271                      Mean           313.1178
                        Largest       Std. Dev.      236.7329
75%          483            945
90%          662            960       Variance       56042.48
95%          754            960       Skewness        .542915
99%          869            980       Kurtosis        2.36144

-------------------------------------------------------------------------------
-> critical_care = Critical care

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           11              0
10%           27              0       Obs                 212
25%        116.5              0       Sum of Wgt.         212

50%        273.5                      Mean           330.9245
                        Largest       Std. Dev.      257.4867
75%          482            885
90%          768            930       Variance       66299.39
95%          840            931       Skewness       .6631079
99%          930            932       Kurtosis        2.41237


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |     Critical care
  esrd_time_cat | Ward-base  Critical  |     Total
----------------+----------------------+----------
         0 days |       108          7 |       115 
                |      0.45       0.27 |      0.43 
----------------+----------------------+----------
   1 to 28 days |        92         17 |       109 
                |      0.38       0.64 |      0.41 
----------------+----------------------+----------
  20 to 90 days |       207         19 |       226 
                |      0.86       0.72 |      0.85 
----------------+----------------------+----------
 91 to 180 days |       273         32 |       305 
                |      1.14       1.21 |      1.14 
----------------+----------------------+----------
181 to 365 days |       480         57 |       537 
                |      2.00       2.16 |      2.01 
----------------+----------------------+----------
366 to 730 days |       604         57 |       661 
                |      2.51       2.16 |      2.48 
----------------+----------------------+----------
731 to 973 days |       111         23 |       134 
                |      0.46       0.87 |      0.50 
----------------+----------------------+----------
      >973 days |         1          0 |         1 
                |      0.00       0.00 |      0.00 
----------------+----------------------+----------
              . |    22,165      2,426 |    24,591 
                |     92.20      91.96 |     92.17 
----------------+----------------------+----------
          Total |    24,041      2,638 |    26,679 
                |    100.00     100.00 |    100.00 

          Pearson chi2(8) =  16.1225   Pr = 0.041

-------------------------------------------------------------------------------
-> krt = No AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           26              0       Obs               1,217
25%          112              0       Sum of Wgt.       1,217

50%          264                      Mean           312.4224
                        Largest       Std. Dev.      237.7935
75%          481            932
90%          661            941       Variance       56545.74
95%          756            960       Skewness        .575661
99%          870            960       Kurtosis       2.395772

-------------------------------------------------------------------------------
-> krt = AKI without KRT

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           22              0       Obs                 821
25%          114              0       Sum of Wgt.         821

50%          291                      Mean           320.6772
                        Largest       Std. Dev.      241.0764
75%          491            933
90%          679            942       Variance       58117.82
95%          774            945       Skewness       .5177992
99%          880            980       Kurtosis       2.323849

-------------------------------------------------------------------------------
-> krt = AKI requiring KRT

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            2              0
10%           13              2       Obs                  50
25%          115              6       Sum of Wgt.          50

50%          221                      Mean             281.42
                        Largest       Std. Dev.      231.3254
75%          381            662
90%          606            823       Variance       53511.43
95%          823            843       Skewness       .9870434
99%          928            928       Kurtosis       3.458141


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |    Kidney replacement therapy
  esrd_time_cat |    No AKI  AKI witho  AKI requi |     Total
----------------+---------------------------------+----------
         0 days |        66         47          2 |       115 
                |      0.42       0.45       0.38 |      0.43 
----------------+---------------------------------+----------
   1 to 28 days |        62         42          5 |       109 
                |      0.39       0.41       0.96 |      0.41 
----------------+---------------------------------+----------
  20 to 90 days |       133         90          3 |       226 
                |      0.84       0.87       0.58 |      0.85 
----------------+---------------------------------+----------
 91 to 180 days |       180        116          9 |       305 
                |      1.14       1.12       1.73 |      1.14 
----------------+---------------------------------+----------
181 to 365 days |       316        203         18 |       537 
                |      2.00       1.96       3.46 |      2.01 
----------------+---------------------------------+----------
366 to 730 days |       385        266         10 |       661 
                |      2.44       2.57       1.92 |      2.48 
----------------+---------------------------------+----------
731 to 973 days |        75         56          3 |       134 
                |      0.47       0.54       0.58 |      0.50 
----------------+---------------------------------+----------
      >973 days |         0          1          0 |         1 
                |      0.00       0.01       0.00 |      0.00 
----------------+---------------------------------+----------
              . |    14,583      9,538        470 |    24,591 
                |     92.30      92.07      90.38 |     92.17 
----------------+---------------------------------+----------
          Total |    15,800     10,359        520 |    26,679 
                |    100.00     100.00     100.00 |    100.00 

         Pearson chi2(16) =  15.4091   Pr = 0.495

.         
. * Exit date
. gen exit_date = esrd_date
(24,591 missing values generated)

. format exit_date %td

. gen end_date = date("2022-11-30", "YMD") if case==1
(13,532 missing values generated)

. replace end_date = date("2019-11-30", "YMD") if case==0
(13,532 real changes made)

. format end_date %td

. replace exit_date = min(deregistered_date, death_date, end_date) if esrd_date
> ==.
(24,591 real changes made)

. gen follow_up_time = (exit_date - index_date)
(941 missing values generated)

. label var follow_up_time "Follow-up time (Days)"

. gen follow_up_cat = follow_up_time
(941 missing values generated)

. recode follow_up_cat    min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0/365=3         ///
>                                                 366/730=4       ///
>                                                 731/973=5       ///          
>                            
>                                                 974/max=6
(follow_up_cat: 25704 changes made)

. label define follow_up_cat      1 "<-29 days"           ///
>                                                         2 "-28 to -1 days"   
>    ///
>                                                         3 "0 to 365 days"    
>    ///
>                                                         4 "366 to 730 days" /
> //
>                                                         5 "731 to 973 days"  
>    ///
>                                                         6 ">973 days"

. label values follow_up_cat follow_up_cat

. label var follow_up_cat "Follow_up time"

. tab case follow_up_cat

                      |               Follow_up time
                 case | -28 to -1  0 to 365   366 to 73  731 to 97 |     Total
----------------------+--------------------------------------------+----------
Pneumonia (pre-pandem |        51      5,380      4,653      2,799 |    13,188 
             COVID-19 |        40      5,018      4,419      2,768 |    12,550 
----------------------+--------------------------------------------+----------
                Total |        91     10,398      9,072      5,567 |    25,738 


                      | Follow_up
                      |    time
                 case | >973 days |     Total
----------------------+-----------+----------
Pneumonia (pre-pandem |       305 |    13,188 
             COVID-19 |       305 |    12,550 
----------------------+-----------+----------
                Total |       610 |    25,738 

. drop if follow_up_time<0
(91 observations deleted)

. drop if follow_up_time>972
(1,575 observations deleted)

. tab case follow_up_cat

                      |          Follow_up time
                 case | 0 to 365   366 to 73  731 to 97 |     Total
----------------------+---------------------------------+----------
Pneumonia (pre-pandem |     5,380      4,653      2,786 |    12,819 
             COVID-19 |     5,018      4,419      2,757 |    12,194 
----------------------+---------------------------------+----------
                Total |    10,398      9,072      5,543 |    25,013 

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(25,013 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_h
> alf_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>=in
> dex_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(8 real changes made)
(19 real changes made)
(34 real changes made)
(42 real changes made)
(51 real changes made)
(60 real changes made)
(61 real changes made)
(73 real changes made)
(68 real changes made)
(73 real changes made)
(75 real changes made)
(97 real changes made)
(90 real changes made)
(102 real changes made)
(90 real changes made)
(102 real changes made)
(73 real changes made)
(99 real changes made)
(111 real changes made)
(77 real changes made)
(105 real changes made)
(131 real changes made)
(123 real changes made)
(97 real changes made)
(92 real changes made)
(112 real changes made)
(99 real changes made)
(98 real changes made)
(85 real changes made)
(109 real changes made)
(0 real changes made)
(0 real changes made)
(6 real changes made)
(26 real changes made)
(36 real changes made)
(43 real changes made)
(47 real changes made)
(49 real changes made)
(77 real changes made)
(61 real changes made)
(76 real changes made)
(80 real changes made)
(83 real changes made)
(95 real changes made)
(96 real changes made)
(104 real changes made)
(85 real changes made)
(84 real changes made)
(111 real changes made)
(101 real changes made)
(101 real changes made)
(108 real changes made)
(97 real changes made)
(92 real changes made)
(84 real changes made)
(93 real changes made)
(82 real changes made)
(111 real changes made)
(84 real changes made)
(88 real changes made)
(97 real changes made)
(112 real changes made)
(96 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(1,584 real changes made)

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(11,332 real changes made, 11,332 to missing)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(18,468 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date) if e
> gfr_half_date==. & index_date_egfr_half!=.
(8,098 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(11,332 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days
> )"

. 
. * AKI (or ESRD)
. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(22,473 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(1,865 real changes made)

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(20,608 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date)  if aki_da
> te==.
(20,608 real changes made)

. gen follow_up_time_aki = (exit_date_aki - index_date)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. 
. * Exit date (death)
. gen exit_date_death = death_date
(23,909 missing values generated)

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(23,909 real changes made)

. gen follow_up_time_death = (exit_date_death - index_date)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. 
. save ./output/analysis_hospitalised.dta, replace
(note: file ./output/analysis_hospitalised.dta not found)
file ./output/analysis_hospitalised.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/analysis_hospitalised.log
  log type:  text
 closed on:  28 Dec 2022, 13:37:48
-------------------------------------------------------------------------------
