-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/analysis_2017.log
  log type:  text
 opened on:  20 Apr 2024, 23:25:00

. 
. ** Analysis cohort selection
. capture noisily import delimited ./output/input_covid_matching.csv, clear
(55 vars, 50,000 obs)

. di "Potential COVID-19 cases extracted from OpenSAFELY:"
Potential COVID-19 cases extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/input_2017_matching.csv, clear
(16 vars, 50,000 obs)

. di "Potential historical comparators extracted from OpenSAFELY:"
Potential historical comparators extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/covid_matching_2017.csv, clear
(10 vars, 15,259 obs)

. di "Potential COVID-19 cases after application of exclusion criteria:"
Potential COVID-19 cases after application of exclusion criteria:

. safecount
  15,259

. capture noisily import delimited ./output/2017_matching.csv, clear
(7 vars, 28,792 obs)

. di "Potential historical comparators after application of exclusion criteria:
> "
Potential historical comparators after application of exclusion criteria:

. safecount
  28,792

. * Import COVID-19 dataset comprising individuals matched with historical comp
> arators (limited matching variables only)  
. capture noisily import delimited ./output/input_combined_stps_covid_2017.csv,
>  clear
(13 vars, 12,972 obs)

. * Drop age & covid_diagnosis_date
. keep patient_id death_date date_deregistered stp krt_outcome_date male covid_
> date covid_month set_id case match_counts

. tempfile covid_2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `covid_2017_matched', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. * Number of matched COVID-19 cases
. count
  12,972

. * Import matched historical comparators (limited matching variables only)
. capture noisily import delimited ./output/input_combined_stps_matches_2017.cs
> v, clear
(10 vars, 21,534 obs)

. * Drop age
. keep patient_id death_date date_deregistered stp krt_outcome_date male set_id
>  case covid_date

. tempfile 2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `2017_matched', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. * Number of matched historical comparators
. count
  21,534

. * Merge limited COVID-19 dataset with additional variables
. capture noisily import delimited ./output/input_covid_2017_additional.csv, cl
> ear
(117 vars, 12,972 obs)

. merge 1:1 patient_id using `covid_2017_matched'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            12,972  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile covid_2017_complete

. save `covid_2017_complete', replace
(note: file /tmp/St00015.000003 not found)
file /tmp/St00015.000003 saved

. di "Matched COVID-19 cases:"
Matched COVID-19 cases:

. safecount
  12,972

. * Merge limited historical comparator dataset with additional variables
. capture noisily import delimited ./output/input_2017_additional.csv, clear
(106 vars, 21,534 obs)

. merge 1:1 patient_id using `2017_matched'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            21,534  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile 2017_complete

. save `2017_complete', replace
(note: file /tmp/St00015.000004 not found)
file /tmp/St00015.000004 saved

. di "Matched historical comparators:"
Matched historical comparators:

. safecount
  21,534

. * Append matched COVID-19 cases and historical comparators
. append using `covid_2017_complete', force

. order patient_id set_id match_count case

. gsort set_id -case

. count if case==0
  21,534

. di "Matched COVID-19 cases and historical comparators:"
Matched COVID-19 cases and historical comparators:

. safecount
  34,506

. tab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,534       62.41       62.41
          1 |     12,972       37.59      100.00
------------+-----------------------------------
      Total |     34,506      100.00

. * Save list of matched COVID-19 cases
. preserve

.         keep if case==1
(21,534 observations deleted)

.         keep patient_id

.         tempfile covid_2017_matched_list

.         save `covid_2017_matched_list', replace
(note: file /tmp/St00015.000006 not found)
file /tmp/St00015.000006 saved

. restore

. * Generate list of unmatched COVID-19 cases
. preserve

.         capture noisily import delimited ./output/input_covid_matching.csv, c
> lear
(55 vars, 50,000 obs)

.         * For dummy data, should do nothing in the real data
.         duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

.         tempfile covid_prematching

.         save `covid_prematching', replace
(note: file /tmp/St00015.000008 not found)
file /tmp/St00015.000008 saved

.         use `covid_2017_matched_list', clear

.         merge 1:1 patient_id using `covid_prematching'

    Result                           # of obs.
    -----------------------------------------
    not matched                        60,220
        from master                    11,596  (_merge==1)
        from using                     48,624  (_merge==2)

    matched                             1,376  (_merge==3)
    -----------------------------------------

.         keep if _merge==2
(12,972 observations deleted)

.         safecount
  48,624

.         save output/covid_unmatched_2017.dta, replace
file output/covid_unmatched_2017.dta saved

.         di "Unmatched COVID-19 cases:"
Unmatched COVID-19 cases:

.         safecount
  48,624

. restore

. 
. **ID
. * Need to create unique identifiers as individuals may be in both covid_2017_
> matched and 2017_matched so will have the same patient_id
. gen unique = _n

. label var unique "Unique ID"

. 
. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label var imd "Index of multiple deprivation (IMD)"

. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      1,756        5.09        5.09
 1 Most deprived |      6,692       19.39       24.48
               2 |      6,605       19.14       43.62
               3 |      6,511       18.87       62.49
               4 |      6,557       19.00       81.50
5 Least deprived |      6,385       18.50      100.00
-----------------+-----------------------------------
           Total |     34,506      100.00

. drop if imd==0
(1,756 observations deleted)

. safetab imd
0

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |      6,692       20.43       20.43
               2 |      6,605       20.17       40.60
               3 |      6,511       19.88       60.48
               4 |      6,557       20.02       80.50
5 Least deprived |      6,385       19.50      100.00
-----------------+-----------------------------------
           Total |     32,750      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(32,719 missing values generated)

. replace stp1 = sum(stp1)
(32,749 real changes made)

. drop stp

. rename stp1 stp

. label define stp        1 "1"   ///
>                                         2 "2"   ///
>                                         3 "3"   ///
>                                         4 "4"   ///
>                                         5 "5"   ///
>                                         6 "6"   ///
>                                         7 "7"   ///
>                                         8 "8"   ///
>                                         9 "9"   ///
>                                         10 "10" ///
>                                         11 "11" ///                          
>            
>                                         12 "12" ///
>                                         13 "13" ///
>                                         14 "14" ///
>                                         15 "15" ///
>                                         16 "16" ///
>                                         17 "17" ///
>                                         18 "18" ///
>                                         19 "19" ///
>                                         20 "20" ///
>                                         21 "21" ///                          
>            
>                                         22 "22" ///
>                                         23 "23" ///
>                                         24 "24" ///
>                                         25 "25" ///
>                                         26 "26" ///
>                                         27 "27" ///
>                                         28 "28" ///
>                                         29 "29" ///
>                                         30 "30" ///
>                                         31 "31" 

. label values stp stp

. label var stp "STP"

. safetab stp
0

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,167        3.56        3.56
          2 |      1,073        3.28        6.84
          3 |      1,062        3.24       10.08
          4 |      1,056        3.22       13.31
          5 |      1,071        3.27       16.58
          6 |      1,066        3.25       19.83
          7 |      1,049        3.20       23.04
          8 |      1,039        3.17       26.21
          9 |      1,027        3.14       29.34
         10 |      1,031        3.15       32.49
         11 |      1,083        3.31       35.80
         12 |      1,045        3.19       38.99
         13 |      1,063        3.25       42.24
         14 |      1,032        3.15       45.39
         15 |      1,030        3.15       48.53
         16 |      1,043        3.18       51.72
         17 |      1,052        3.21       54.93
         18 |      1,079        3.29       58.22
         19 |      1,088        3.32       61.55
         20 |      1,103        3.37       64.91
         21 |      1,009        3.08       67.99
         22 |      1,042        3.18       71.18
         23 |      1,063        3.25       74.42
         24 |      1,082        3.30       77.73
         25 |      1,059        3.23       80.96
         26 |      1,029        3.14       84.10
         27 |      1,046        3.19       87.29
         28 |      1,039        3.17       90.47
         29 |      1,033        3.15       93.62
         30 |      1,044        3.19       96.81
         31 |      1,045        3.19      100.00
------------+-----------------------------------
      Total |     32,750      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(29,503 missing values generated)

. replace region = 2 if region_string=="East"
(3,227 real changes made)

. replace region = 3 if region_string=="London"
(6,556 real changes made)

. replace region = 4 if region_string=="North East"
(3,275 real changes made)

. replace region = 5 if region_string=="North West"
(3,356 real changes made)

. replace region = 6 if region_string=="South East"
(3,237 real changes made)

. replace region = 7 if region_string=="South West"
(3,279 real changes made)

. replace region = 8 if region_string=="West Midlands"
(3,245 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(3,328 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,247        9.91        9.91
                    East |      3,227        9.85       19.77
                  London |      6,556       20.02       39.79
              North East |      3,275       10.00       49.79
              North West |      3,356       10.25       60.03
              South East |      3,237        9.88       69.92
              South West |      3,279       10.01       79.93
           West Midlands |      3,245        9.91       89.84
Yorkshire and The Humber |      3,328       10.16      100.00
-------------------------+-----------------------------------
                   Total |     32,750      100.00

. drop if region==10
(0 observations deleted)

. safetab region
0

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,247        9.91        9.91
                    East |      3,227        9.85       19.77
                  London |      6,556       20.02       39.79
              North East |      3,275       10.00       49.79
              North West |      3,356       10.25       60.03
              South East |      3,237        9.88       69.92
              South West |      3,279       10.01       79.93
           West Midlands |      3,245        9.91       89.84
Yorkshire and The Humber |      3,328       10.16      100.00
-------------------------+-----------------------------------
                   Total |     32,750      100.00

. 
. * Create new index date variable 28 days after case_index_date (i.e. to exclu
> de anyone who does not survive to start follow-up)
. gen index_date = date(case_index_date, "YMD")

. format index_date %td

. gen index_date_28 = index_date + 28

. format index_date_28 %td

. 
. * Deregistered before index_date + 29 days
. gen deregistered_date = date(date_deregistered, "YMD")
(31,766 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date_28 + 1
(49 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(29,745 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(0 observations deleted)

. replace krt_date = index_date_28 + 1 if krt_date < index_date_28 + 1
(137 real changes made)

. 
. * Death before index_date + 29 days (i.e. only include people who survived 29
>  days after index_date)
. gen death_date1 = date(death_date, "YMD")
(30,875 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28 + 1
(78 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased withi
> n 28 days of index date"

. label values deceased deceased

. tab case deceased

           |       deceased
      case | Alive at   Deceased  |     Total
-----------+----------------------+----------
         0 |    20,340         57 |    20,397 
         1 |    12,283         21 |    12,304 
-----------+----------------------+----------
     Total |    32,623         78 |    32,701 

. drop if deceased==1
(78 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators
>  only
. gen index_year = yofd(index_date)

. gen age = index_year - year_of_birth

. gen sex = 1 if male == "Male"
(16,798 missing values generated)

. label var sex "Sex"

. replace sex = 0 if male == "Female"
(16,798 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 /
> //
>                                                                              
>                    baseline_creatinine_mar2017 ///
>                                                                              
>                    baseline_creatinine_apr2017 ///
>                                                                              
>                    baseline_creatinine_may2017 ///
>                                                                              
>                    baseline_creatinine_jun2017 ///
>                                                                              
>                    baseline_creatinine_jul2017 ///
>                                                                              
>                    baseline_creatinine_aug2017 ///
>                                                                              
>                    baseline_creatinine_sep2017 ///
>                                                                              
>                    baseline_creatinine_oct2017 ///
>                                                                              
>                    baseline_creatinine_nov2017 ///
>                                                                              
>                    baseline_creatinine_dec2017 ///
>                                                                              
>                    baseline_creatinine_jan2018 ///
>                                                                              
>                    baseline_creatinine_feb2018 ///
>                                                                              
>                    baseline_creatinine_mar2018 ///
>                                                                              
>                    baseline_creatinine_apr2018 ///
>                                                                              
>                    baseline_creatinine_may2018 ///
>                                                                              
>                    baseline_creatinine_jun2018 ///
>                                                                              
>                    baseline_creatinine_jul2018 ///
>                                                                              
>                    baseline_creatinine_aug2018 ///
>                                                                              
>                    baseline_creatinine_sep2018 ///
>                                                                              
>                    baseline_creatinine_oct2018 ///
>                                                                              
>                    baseline_creatinine_nov2018 ///
>                                                                              
>                    baseline_creatinine_dec2018 ///
>                                                                              
>                    baseline_creatinine_jan2019 ///
>                                                                              
>                    baseline_creatinine_feb2019 ///
>                                                                              
>                    baseline_creatinine_mar2019 ///
>                                                                              
>                    baseline_creatinine_apr2019 ///
>                                                                              
>                    baseline_creatinine_may2019 ///
>                                                                              
>                    baseline_creatinine_jun2019 ///
>                                                                              
>                    baseline_creatinine_jul2019 ///
>                                                                              
>                    baseline_creatinine_aug2019 ///
>                                                                              
>                    baseline_creatinine_sep2019 ///
>                                                                              
>                    baseline_creatinine_feb2020 ///
>                                                                              
>                    baseline_creatinine_mar2020 ///
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 ///
>                                                                              
>                    baseline_creatinine_oct2022 ///
>                                                                              
>                    baseline_creatinine_nov2022 ///
>                                                                              
>                    baseline_creatinine_dec2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(8,935 real changes made, 8,935 to missing)
(21,218 missing values generated)
(32,623 missing values generated)
(5,869 real changes made)
(5,536 real changes made)
(5,869 real changes made)
(5,536 real changes made)
(7,259 real changes made)
(32,623 missing values generated)
(5,869 real changes made)
(5,536 real changes made)
(11,405 real changes made)
(25,364 real changes made)
(21,218 missing values generated)
(11,405 real changes made)
(5,869 real changes made)
(8,953 real changes made, 8,953 to missing)
(21,236 missing values generated)
(32,623 missing values generated)
(5,837 real changes made)
(5,550 real changes made)
(5,837 real changes made)
(5,550 real changes made)
(7,267 real changes made)
(32,623 missing values generated)
(5,837 real changes made)
(5,550 real changes made)
(11,387 real changes made)
(25,356 real changes made)
(21,236 missing values generated)
(11,387 real changes made)
(5,837 real changes made)
(8,962 real changes made, 8,962 to missing)
(21,245 missing values generated)
(32,623 missing values generated)
(5,819 real changes made)
(5,559 real changes made)
(5,819 real changes made)
(5,559 real changes made)
(7,176 real changes made)
(32,623 missing values generated)
(5,819 real changes made)
(5,559 real changes made)
(11,378 real changes made)
(25,447 real changes made)
(21,245 missing values generated)
(11,378 real changes made)
(5,819 real changes made)
(8,993 real changes made, 8,993 to missing)
(21,276 missing values generated)
(32,623 missing values generated)
(5,801 real changes made)
(5,546 real changes made)
(5,801 real changes made)
(5,546 real changes made)
(7,219 real changes made)
(32,623 missing values generated)
(5,801 real changes made)
(5,546 real changes made)
(11,347 real changes made)
(25,404 real changes made)
(21,276 missing values generated)
(11,347 real changes made)
(5,801 real changes made)
(8,929 real changes made, 8,929 to missing)
(21,212 missing values generated)
(32,623 missing values generated)
(5,854 real changes made)
(5,557 real changes made)
(5,854 real changes made)
(5,557 real changes made)
(7,271 real changes made)
(32,623 missing values generated)
(5,854 real changes made)
(5,557 real changes made)
(11,411 real changes made)
(25,352 real changes made)
(21,212 missing values generated)
(11,411 real changes made)
(5,854 real changes made)
(8,973 real changes made, 8,973 to missing)
(21,256 missing values generated)
(32,623 missing values generated)
(5,891 real changes made)
(5,476 real changes made)
(5,891 real changes made)
(5,476 real changes made)
(7,250 real changes made)
(32,623 missing values generated)
(5,891 real changes made)
(5,476 real changes made)
(11,367 real changes made)
(25,373 real changes made)
(21,256 missing values generated)
(11,367 real changes made)
(5,891 real changes made)
(8,953 real changes made, 8,953 to missing)
(21,236 missing values generated)
(32,623 missing values generated)
(5,907 real changes made)
(5,480 real changes made)
(5,907 real changes made)
(5,480 real changes made)
(7,230 real changes made)
(32,623 missing values generated)
(5,907 real changes made)
(5,480 real changes made)
(11,387 real changes made)
(25,393 real changes made)
(21,236 missing values generated)
(11,387 real changes made)
(5,907 real changes made)
(8,941 real changes made, 8,941 to missing)
(21,224 missing values generated)
(32,623 missing values generated)
(5,861 real changes made)
(5,538 real changes made)
(5,861 real changes made)
(5,538 real changes made)
(7,187 real changes made)
(32,623 missing values generated)
(5,861 real changes made)
(5,538 real changes made)
(11,399 real changes made)
(25,436 real changes made)
(21,224 missing values generated)
(11,399 real changes made)
(5,861 real changes made)
(8,966 real changes made, 8,966 to missing)
(21,249 missing values generated)
(32,623 missing values generated)
(5,864 real changes made)
(5,510 real changes made)
(5,864 real changes made)
(5,510 real changes made)
(7,295 real changes made)
(32,623 missing values generated)
(5,864 real changes made)
(5,510 real changes made)
(11,374 real changes made)
(25,328 real changes made)
(21,249 missing values generated)
(11,374 real changes made)
(5,864 real changes made)
(8,973 real changes made, 8,973 to missing)
(21,256 missing values generated)
(32,623 missing values generated)
(5,886 real changes made)
(5,481 real changes made)
(5,886 real changes made)
(5,481 real changes made)
(7,153 real changes made)
(32,623 missing values generated)
(5,886 real changes made)
(5,481 real changes made)
(11,367 real changes made)
(25,470 real changes made)
(21,256 missing values generated)
(11,367 real changes made)
(5,886 real changes made)
(8,974 real changes made, 8,974 to missing)
(21,257 missing values generated)
(32,623 missing values generated)
(5,876 real changes made)
(5,490 real changes made)
(5,876 real changes made)
(5,490 real changes made)
(7,208 real changes made)
(32,623 missing values generated)
(5,876 real changes made)
(5,490 real changes made)
(11,366 real changes made)
(25,415 real changes made)
(21,257 missing values generated)
(11,366 real changes made)
(5,876 real changes made)
(8,941 real changes made, 8,941 to missing)
(21,224 missing values generated)
(32,623 missing values generated)
(5,875 real changes made)
(5,524 real changes made)
(5,875 real changes made)
(5,524 real changes made)
(7,269 real changes made)
(32,623 missing values generated)
(5,875 real changes made)
(5,524 real changes made)
(11,399 real changes made)
(25,354 real changes made)
(21,224 missing values generated)
(11,399 real changes made)
(5,875 real changes made)
(8,947 real changes made, 8,947 to missing)
(21,230 missing values generated)
(32,623 missing values generated)
(5,878 real changes made)
(5,515 real changes made)
(5,878 real changes made)
(5,515 real changes made)
(7,203 real changes made)
(32,623 missing values generated)
(5,878 real changes made)
(5,515 real changes made)
(11,393 real changes made)
(25,420 real changes made)
(21,230 missing values generated)
(11,393 real changes made)
(5,878 real changes made)
(8,956 real changes made, 8,956 to missing)
(21,239 missing values generated)
(32,623 missing values generated)
(5,885 real changes made)
(5,499 real changes made)
(5,885 real changes made)
(5,499 real changes made)
(7,343 real changes made)
(32,623 missing values generated)
(5,885 real changes made)
(5,499 real changes made)
(11,384 real changes made)
(25,280 real changes made)
(21,239 missing values generated)
(11,384 real changes made)
(5,885 real changes made)
(8,932 real changes made, 8,932 to missing)
(21,215 missing values generated)
(32,623 missing values generated)
(5,883 real changes made)
(5,525 real changes made)
(5,883 real changes made)
(5,525 real changes made)
(7,137 real changes made)
(32,623 missing values generated)
(5,883 real changes made)
(5,525 real changes made)
(11,408 real changes made)
(25,486 real changes made)
(21,215 missing values generated)
(11,408 real changes made)
(5,883 real changes made)
(8,959 real changes made, 8,959 to missing)
(21,242 missing values generated)
(32,623 missing values generated)
(5,889 real changes made)
(5,492 real changes made)
(5,889 real changes made)
(5,492 real changes made)
(7,383 real changes made)
(32,623 missing values generated)
(5,889 real changes made)
(5,492 real changes made)
(11,381 real changes made)
(25,240 real changes made)
(21,242 missing values generated)
(11,381 real changes made)
(5,889 real changes made)
(8,976 real changes made, 8,976 to missing)
(21,259 missing values generated)
(32,623 missing values generated)
(5,875 real changes made)
(5,489 real changes made)
(5,875 real changes made)
(5,489 real changes made)
(7,162 real changes made)
(32,623 missing values generated)
(5,875 real changes made)
(5,489 real changes made)
(11,364 real changes made)
(25,461 real changes made)
(21,259 missing values generated)
(11,364 real changes made)
(5,875 real changes made)
(8,966 real changes made, 8,966 to missing)
(21,249 missing values generated)
(32,623 missing values generated)
(5,855 real changes made)
(5,519 real changes made)
(5,855 real changes made)
(5,519 real changes made)
(7,254 real changes made)
(32,623 missing values generated)
(5,855 real changes made)
(5,519 real changes made)
(11,374 real changes made)
(25,369 real changes made)
(21,249 missing values generated)
(11,374 real changes made)
(5,855 real changes made)
(8,915 real changes made, 8,915 to missing)
(21,198 missing values generated)
(32,623 missing values generated)
(5,888 real changes made)
(5,537 real changes made)
(5,888 real changes made)
(5,537 real changes made)
(7,188 real changes made)
(32,623 missing values generated)
(5,888 real changes made)
(5,537 real changes made)
(11,425 real changes made)
(25,435 real changes made)
(21,198 missing values generated)
(11,425 real changes made)
(5,888 real changes made)
(9,017 real changes made, 9,017 to missing)
(21,300 missing values generated)
(32,623 missing values generated)
(5,761 real changes made)
(5,562 real changes made)
(5,761 real changes made)
(5,562 real changes made)
(7,152 real changes made)
(32,623 missing values generated)
(5,761 real changes made)
(5,562 real changes made)
(11,323 real changes made)
(25,471 real changes made)
(21,300 missing values generated)
(11,323 real changes made)
(5,761 real changes made)
(8,948 real changes made, 8,948 to missing)
(21,231 missing values generated)
(32,623 missing values generated)
(5,914 real changes made)
(5,478 real changes made)
(5,914 real changes made)
(5,478 real changes made)
(7,201 real changes made)
(32,623 missing values generated)
(5,914 real changes made)
(5,478 real changes made)
(11,392 real changes made)
(25,422 real changes made)
(21,231 missing values generated)
(11,392 real changes made)
(5,914 real changes made)
(8,946 real changes made, 8,946 to missing)
(21,229 missing values generated)
(32,623 missing values generated)
(5,937 real changes made)
(5,457 real changes made)
(5,937 real changes made)
(5,457 real changes made)
(7,256 real changes made)
(32,623 missing values generated)
(5,937 real changes made)
(5,457 real changes made)
(11,394 real changes made)
(25,367 real changes made)
(21,229 missing values generated)
(11,394 real changes made)
(5,937 real changes made)
(8,890 real changes made, 8,890 to missing)
(21,173 missing values generated)
(32,623 missing values generated)
(5,916 real changes made)
(5,534 real changes made)
(5,916 real changes made)
(5,534 real changes made)
(7,269 real changes made)
(32,623 missing values generated)
(5,916 real changes made)
(5,534 real changes made)
(11,450 real changes made)
(25,354 real changes made)
(21,173 missing values generated)
(11,450 real changes made)
(5,916 real changes made)
(8,972 real changes made, 8,972 to missing)
(21,255 missing values generated)
(32,623 missing values generated)
(5,882 real changes made)
(5,486 real changes made)
(5,882 real changes made)
(5,486 real changes made)
(7,247 real changes made)
(32,623 missing values generated)
(5,882 real changes made)
(5,486 real changes made)
(11,368 real changes made)
(25,376 real changes made)
(21,255 missing values generated)
(11,368 real changes made)
(5,882 real changes made)
(8,957 real changes made, 8,957 to missing)
(21,240 missing values generated)
(32,623 missing values generated)
(5,916 real changes made)
(5,467 real changes made)
(5,916 real changes made)
(5,467 real changes made)
(7,227 real changes made)
(32,623 missing values generated)
(5,916 real changes made)
(5,467 real changes made)
(11,383 real changes made)
(25,396 real changes made)
(21,240 missing values generated)
(11,383 real changes made)
(5,916 real changes made)
(8,954 real changes made, 8,954 to missing)
(21,237 missing values generated)
(32,623 missing values generated)
(5,831 real changes made)
(5,555 real changes made)
(5,831 real changes made)
(5,555 real changes made)
(7,158 real changes made)
(32,623 missing values generated)
(5,831 real changes made)
(5,555 real changes made)
(11,386 real changes made)
(25,465 real changes made)
(21,237 missing values generated)
(11,386 real changes made)
(5,831 real changes made)
(8,950 real changes made, 8,950 to missing)
(21,233 missing values generated)
(32,623 missing values generated)
(5,978 real changes made)
(5,412 real changes made)
(5,978 real changes made)
(5,412 real changes made)
(7,200 real changes made)
(32,623 missing values generated)
(5,978 real changes made)
(5,412 real changes made)
(11,390 real changes made)
(25,423 real changes made)
(21,233 missing values generated)
(11,390 real changes made)
(5,978 real changes made)
(8,949 real changes made, 8,949 to missing)
(21,232 missing values generated)
(32,623 missing values generated)
(5,893 real changes made)
(5,498 real changes made)
(5,893 real changes made)
(5,498 real changes made)
(7,254 real changes made)
(32,623 missing values generated)
(5,893 real changes made)
(5,498 real changes made)
(11,391 real changes made)
(25,369 real changes made)
(21,232 missing values generated)
(11,391 real changes made)
(5,893 real changes made)
(8,911 real changes made, 8,911 to missing)
(21,194 missing values generated)
(32,623 missing values generated)
(5,955 real changes made)
(5,474 real changes made)
(5,955 real changes made)
(5,474 real changes made)
(7,284 real changes made)
(32,623 missing values generated)
(5,955 real changes made)
(5,474 real changes made)
(11,429 real changes made)
(25,339 real changes made)
(21,194 missing values generated)
(11,429 real changes made)
(5,955 real changes made)
(8,941 real changes made, 8,941 to missing)
(21,224 missing values generated)
(32,623 missing values generated)
(5,878 real changes made)
(5,521 real changes made)
(5,878 real changes made)
(5,521 real changes made)
(7,234 real changes made)
(32,623 missing values generated)
(5,878 real changes made)
(5,521 real changes made)
(11,399 real changes made)
(25,389 real changes made)
(21,224 missing values generated)
(11,399 real changes made)
(5,878 real changes made)
(8,919 real changes made, 8,919 to missing)
(21,202 missing values generated)
(32,623 missing values generated)
(5,864 real changes made)
(5,557 real changes made)
(5,864 real changes made)
(5,557 real changes made)
(7,317 real changes made)
(32,623 missing values generated)
(5,864 real changes made)
(5,557 real changes made)
(11,421 real changes made)
(25,306 real changes made)
(21,202 missing values generated)
(11,421 real changes made)
(5,864 real changes made)
(8,946 real changes made, 8,946 to missing)
(21,229 missing values generated)
(32,623 missing values generated)
(5,844 real changes made)
(5,550 real changes made)
(5,844 real changes made)
(5,550 real changes made)
(7,261 real changes made)
(32,623 missing values generated)
(5,844 real changes made)
(5,550 real changes made)
(11,394 real changes made)
(25,362 real changes made)
(21,229 missing values generated)
(11,394 real changes made)
(5,844 real changes made)
(5,414 real changes made, 5,414 to missing)
(25,754 missing values generated)
(32,623 missing values generated)
(3,568 real changes made)
(3,301 real changes made)
(3,568 real changes made)
(3,301 real changes made)
(4,387 real changes made)
(32,623 missing values generated)
(3,568 real changes made)
(3,301 real changes made)
(6,869 real changes made)
(28,236 real changes made)
(25,754 missing values generated)
(6,869 real changes made)
(3,568 real changes made)
(5,388 real changes made, 5,388 to missing)
(25,728 missing values generated)
(32,623 missing values generated)
(3,524 real changes made)
(3,371 real changes made)
(3,524 real changes made)
(3,371 real changes made)
(4,360 real changes made)
(32,623 missing values generated)
(3,524 real changes made)
(3,371 real changes made)
(6,895 real changes made)
(28,263 real changes made)
(25,728 missing values generated)
(6,895 real changes made)
(3,524 real changes made)
(5,402 real changes made, 5,402 to missing)
(25,742 missing values generated)
(32,623 missing values generated)
(3,545 real changes made)
(3,336 real changes made)
(3,545 real changes made)
(3,336 real changes made)
(4,317 real changes made)
(32,623 missing values generated)
(3,545 real changes made)
(3,336 real changes made)
(6,881 real changes made)
(28,306 real changes made)
(25,742 missing values generated)
(6,881 real changes made)
(3,545 real changes made)
(5,398 real changes made, 5,398 to missing)
(25,738 missing values generated)
(32,623 missing values generated)
(3,573 real changes made)
(3,312 real changes made)
(3,573 real changes made)
(3,312 real changes made)
(4,407 real changes made)
(32,623 missing values generated)
(3,573 real changes made)
(3,312 real changes made)
(6,885 real changes made)
(28,216 real changes made)
(25,738 missing values generated)
(6,885 real changes made)
(3,573 real changes made)
(5,394 real changes made, 5,394 to missing)
(25,734 missing values generated)
(32,623 missing values generated)
(3,544 real changes made)
(3,345 real changes made)
(3,544 real changes made)
(3,345 real changes made)
(4,353 real changes made)
(32,623 missing values generated)
(3,544 real changes made)
(3,345 real changes made)
(6,889 real changes made)
(28,270 real changes made)
(25,734 missing values generated)
(6,889 real changes made)
(3,544 real changes made)
(5,405 real changes made, 5,405 to missing)
(25,745 missing values generated)
(32,623 missing values generated)
(3,541 real changes made)
(3,337 real changes made)
(3,541 real changes made)
(3,337 real changes made)
(4,285 real changes made)
(32,623 missing values generated)
(3,541 real changes made)
(3,337 real changes made)
(6,878 real changes made)
(28,338 real changes made)
(25,745 missing values generated)
(6,878 real changes made)
(3,541 real changes made)
(5,449 real changes made, 5,449 to missing)
(25,789 missing values generated)
(32,623 missing values generated)
(3,542 real changes made)
(3,292 real changes made)
(3,542 real changes made)
(3,292 real changes made)
(4,362 real changes made)
(32,623 missing values generated)
(3,542 real changes made)
(3,292 real changes made)
(6,834 real changes made)
(28,261 real changes made)
(25,789 missing values generated)
(6,834 real changes made)
(3,542 real changes made)
(5,410 real changes made, 5,410 to missing)
(25,750 missing values generated)
(32,623 missing values generated)
(3,585 real changes made)
(3,288 real changes made)
(3,585 real changes made)
(3,288 real changes made)
(4,377 real changes made)
(32,623 missing values generated)
(3,585 real changes made)
(3,288 real changes made)
(6,873 real changes made)
(28,246 real changes made)
(25,750 missing values generated)
(6,873 real changes made)
(3,585 real changes made)
(5,409 real changes made, 5,409 to missing)
(25,749 missing values generated)
(32,623 missing values generated)
(3,520 real changes made)
(3,354 real changes made)
(3,520 real changes made)
(3,354 real changes made)
(4,419 real changes made)
(32,623 missing values generated)
(3,520 real changes made)
(3,354 real changes made)
(6,874 real changes made)
(28,204 real changes made)
(25,749 missing values generated)
(6,874 real changes made)
(3,520 real changes made)
(5,421 real changes made, 5,421 to missing)
(25,761 missing values generated)
(32,623 missing values generated)
(3,468 real changes made)
(3,394 real changes made)
(3,468 real changes made)
(3,394 real changes made)
(4,311 real changes made)
(32,623 missing values generated)
(3,468 real changes made)
(3,394 real changes made)
(6,862 real changes made)
(28,312 real changes made)
(25,761 missing values generated)
(6,862 real changes made)
(3,468 real changes made)
(5,403 real changes made, 5,403 to missing)
(25,743 missing values generated)
(32,623 missing values generated)
(3,509 real changes made)
(3,371 real changes made)
(3,509 real changes made)
(3,371 real changes made)
(4,371 real changes made)
(32,623 missing values generated)
(3,509 real changes made)
(3,371 real changes made)
(6,880 real changes made)
(28,252 real changes made)
(25,743 missing values generated)
(6,880 real changes made)
(3,509 real changes made)
(5,382 real changes made, 5,382 to missing)
(25,722 missing values generated)
(32,623 missing values generated)
(3,543 real changes made)
(3,358 real changes made)
(3,543 real changes made)
(3,358 real changes made)
(4,367 real changes made)
(32,623 missing values generated)
(3,543 real changes made)
(3,358 real changes made)
(6,901 real changes made)
(28,256 real changes made)
(25,722 missing values generated)
(6,901 real changes made)
(3,543 real changes made)
(5,441 real changes made, 5,441 to missing)
(25,781 missing values generated)
(32,623 missing values generated)
(3,508 real changes made)
(3,334 real changes made)
(3,508 real changes made)
(3,334 real changes made)
(4,402 real changes made)
(32,623 missing values generated)
(3,508 real changes made)
(3,334 real changes made)
(6,842 real changes made)
(28,221 real changes made)
(25,781 missing values generated)
(6,842 real changes made)
(3,508 real changes made)
(5,415 real changes made, 5,415 to missing)
(25,755 missing values generated)
(32,623 missing values generated)
(3,515 real changes made)
(3,353 real changes made)
(3,515 real changes made)
(3,353 real changes made)
(4,402 real changes made)
(32,623 missing values generated)
(3,515 real changes made)
(3,353 real changes made)
(6,868 real changes made)
(28,221 real changes made)
(25,755 missing values generated)
(6,868 real changes made)
(3,515 real changes made)
(5,402 real changes made, 5,402 to missing)
(25,742 missing values generated)
(32,623 missing values generated)
(3,526 real changes made)
(3,355 real changes made)
(3,526 real changes made)
(3,355 real changes made)
(4,406 real changes made)
(32,623 missing values generated)
(3,526 real changes made)
(3,355 real changes made)
(6,881 real changes made)
(28,217 real changes made)
(25,742 missing values generated)
(6,881 real changes made)
(3,526 real changes made)
(5,422 real changes made, 5,422 to missing)
(25,762 missing values generated)
(32,623 missing values generated)
(3,568 real changes made)
(3,293 real changes made)
(3,568 real changes made)
(3,293 real changes made)
(4,472 real changes made)
(32,623 missing values generated)
(3,568 real changes made)
(3,293 real changes made)
(6,861 real changes made)
(28,151 real changes made)
(25,762 missing values generated)
(6,861 real changes made)
(3,568 real changes made)
(5,442 real changes made, 5,442 to missing)
(25,782 missing values generated)
(32,623 missing values generated)
(3,524 real changes made)
(3,317 real changes made)
(3,524 real changes made)
(3,317 real changes made)
(4,348 real changes made)
(32,623 missing values generated)
(3,524 real changes made)
(3,317 real changes made)
(6,841 real changes made)
(28,275 real changes made)
(25,782 missing values generated)
(6,841 real changes made)
(3,524 real changes made)
(5,445 real changes made, 5,445 to missing)
(25,785 missing values generated)
(32,623 missing values generated)
(3,500 real changes made)
(3,338 real changes made)
(3,500 real changes made)
(3,338 real changes made)
(4,309 real changes made)
(32,623 missing values generated)
(3,500 real changes made)
(3,338 real changes made)
(6,838 real changes made)
(28,314 real changes made)
(25,785 missing values generated)
(6,838 real changes made)
(3,500 real changes made)
(5,379 real changes made, 5,379 to missing)
(25,719 missing values generated)
(32,623 missing values generated)
(3,539 real changes made)
(3,365 real changes made)
(3,539 real changes made)
(3,365 real changes made)
(4,363 real changes made)
(32,623 missing values generated)
(3,539 real changes made)
(3,365 real changes made)
(6,904 real changes made)
(28,260 real changes made)
(25,719 missing values generated)
(6,904 real changes made)
(3,539 real changes made)
(5,415 real changes made, 5,415 to missing)
(25,755 missing values generated)
(32,623 missing values generated)
(3,515 real changes made)
(3,353 real changes made)
(3,515 real changes made)
(3,353 real changes made)
(4,377 real changes made)
(32,623 missing values generated)
(3,515 real changes made)
(3,353 real changes made)
(6,868 real changes made)
(28,246 real changes made)
(25,755 missing values generated)
(6,868 real changes made)
(3,515 real changes made)
(5,413 real changes made, 5,413 to missing)
(25,753 missing values generated)
(32,623 missing values generated)
(3,524 real changes made)
(3,346 real changes made)
(3,524 real changes made)
(3,346 real changes made)
(4,281 real changes made)
(32,623 missing values generated)
(3,524 real changes made)
(3,346 real changes made)
(6,870 real changes made)
(28,342 real changes made)
(25,753 missing values generated)
(6,870 real changes made)
(3,524 real changes made)
(5,397 real changes made, 5,397 to missing)
(25,737 missing values generated)
(32,623 missing values generated)
(3,511 real changes made)
(3,375 real changes made)
(3,511 real changes made)
(3,375 real changes made)
(4,363 real changes made)
(32,623 missing values generated)
(3,511 real changes made)
(3,375 real changes made)
(6,886 real changes made)
(28,260 real changes made)
(25,737 missing values generated)
(6,886 real changes made)
(3,511 real changes made)
(5,419 real changes made, 5,419 to missing)
(25,759 missing values generated)
(32,623 missing values generated)
(3,517 real changes made)
(3,347 real changes made)
(3,517 real changes made)
(3,347 real changes made)
(4,312 real changes made)
(32,623 missing values generated)
(3,517 real changes made)
(3,347 real changes made)
(6,864 real changes made)
(28,311 real changes made)
(25,759 missing values generated)
(6,864 real changes made)
(3,517 real changes made)
(5,392 real changes made, 5,392 to missing)
(25,732 missing values generated)
(32,623 missing values generated)
(3,548 real changes made)
(3,343 real changes made)
(3,548 real changes made)
(3,343 real changes made)
(4,467 real changes made)
(32,623 missing values generated)
(3,548 real changes made)
(3,343 real changes made)
(6,891 real changes made)
(28,156 real changes made)
(25,732 missing values generated)
(6,891 real changes made)
(3,548 real changes made)
(5,416 real changes made, 5,416 to missing)
(25,756 missing values generated)
(32,623 missing values generated)
(3,529 real changes made)
(3,338 real changes made)
(3,529 real changes made)
(3,338 real changes made)
(4,354 real changes made)
(32,623 missing values generated)
(3,529 real changes made)
(3,338 real changes made)
(6,867 real changes made)
(28,269 real changes made)
(25,756 missing values generated)
(6,867 real changes made)
(3,529 real changes made)
(5,383 real changes made, 5,383 to missing)
(25,723 missing values generated)
(32,623 missing values generated)
(3,550 real changes made)
(3,350 real changes made)
(3,550 real changes made)
(3,350 real changes made)
(4,334 real changes made)
(32,623 missing values generated)
(3,550 real changes made)
(3,350 real changes made)
(6,900 real changes made)
(28,289 real changes made)
(25,723 missing values generated)
(6,900 real changes made)
(3,550 real changes made)
(5,384 real changes made, 5,384 to missing)
(25,724 missing values generated)
(32,623 missing values generated)
(3,511 real changes made)
(3,388 real changes made)
(3,511 real changes made)
(3,388 real changes made)
(4,377 real changes made)
(32,623 missing values generated)
(3,511 real changes made)
(3,388 real changes made)
(6,899 real changes made)
(28,246 real changes made)
(25,724 missing values generated)
(6,899 real changes made)
(3,511 real changes made)
(5,422 real changes made, 5,422 to missing)
(25,762 missing values generated)
(32,623 missing values generated)
(3,536 real changes made)
(3,325 real changes made)
(3,536 real changes made)
(3,325 real changes made)
(4,362 real changes made)
(32,623 missing values generated)
(3,536 real changes made)
(3,325 real changes made)
(6,861 real changes made)
(28,261 real changes made)
(25,762 missing values generated)
(6,861 real changes made)
(3,536 real changes made)
(5,463 real changes made, 5,463 to missing)
(25,803 missing values generated)
(32,623 missing values generated)
(3,551 real changes made)
(3,269 real changes made)
(3,551 real changes made)
(3,269 real changes made)
(4,352 real changes made)
(32,623 missing values generated)
(3,551 real changes made)
(3,269 real changes made)
(6,820 real changes made)
(28,271 real changes made)
(25,803 missing values generated)
(6,820 real changes made)
(3,551 real changes made)
(5,424 real changes made, 5,424 to missing)
(25,764 missing values generated)
(32,623 missing values generated)
(3,492 real changes made)
(3,367 real changes made)
(3,492 real changes made)
(3,367 real changes made)
(4,330 real changes made)
(32,623 missing values generated)
(3,492 real changes made)
(3,367 real changes made)
(6,859 real changes made)
(28,293 real changes made)
(25,764 missing values generated)
(6,859 real changes made)
(3,492 real changes made)
(5,423 real changes made, 5,423 to missing)
(25,763 missing values generated)
(32,623 missing values generated)
(3,514 real changes made)
(3,346 real changes made)
(3,514 real changes made)
(3,346 real changes made)
(4,362 real changes made)
(32,623 missing values generated)
(3,514 real changes made)
(3,346 real changes made)
(6,860 real changes made)
(28,261 real changes made)
(25,763 missing values generated)
(6,860 real changes made)
(3,514 real changes made)
(5,387 real changes made, 5,387 to missing)
(25,727 missing values generated)
(32,623 missing values generated)
(3,569 real changes made)
(3,327 real changes made)
(3,569 real changes made)
(3,327 real changes made)
(4,388 real changes made)
(32,623 missing values generated)
(3,569 real changes made)
(3,327 real changes made)
(6,896 real changes made)
(28,235 real changes made)
(25,727 missing values generated)
(6,896 real changes made)
(3,569 real changes made)
(5,441 real changes made, 5,441 to missing)
(25,781 missing values generated)
(32,623 missing values generated)
(3,518 real changes made)
(3,324 real changes made)
(3,518 real changes made)
(3,324 real changes made)
(4,258 real changes made)
(32,623 missing values generated)
(3,518 real changes made)
(3,324 real changes made)
(6,842 real changes made)
(28,365 real changes made)
(25,781 missing values generated)
(6,842 real changes made)
(3,518 real changes made)
(5,383 real changes made, 5,383 to missing)
(25,723 missing values generated)
(32,623 missing values generated)
(3,574 real changes made)
(3,326 real changes made)
(3,574 real changes made)
(3,326 real changes made)
(4,418 real changes made)
(32,623 missing values generated)
(3,574 real changes made)
(3,326 real changes made)
(6,900 real changes made)
(28,205 real changes made)
(25,723 missing values generated)
(6,900 real changes made)
(3,574 real changes made)
(5,412 real changes made, 5,412 to missing)
(25,752 missing values generated)
(32,623 missing values generated)
(3,564 real changes made)
(3,307 real changes made)
(3,564 real changes made)
(3,307 real changes made)
(4,370 real changes made)
(32,623 missing values generated)
(3,564 real changes made)
(3,307 real changes made)
(6,871 real changes made)
(28,253 real changes made)
(25,752 missing values generated)
(6,871 real changes made)
(3,564 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)

. gen baseline_egfr=.
(32,623 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022 n
> ov2022 dec2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(667 real changes made)
(684 real changes made)
(690 real changes made)
(620 real changes made)
(592 real changes made)
(541 real changes made)
(571 real changes made)
(580 real changes made)
(459 real changes made)
(434 real changes made)
(424 real changes made)
(415 real changes made)
(359 real changes made)
(399 real changes made)
(321 real changes made)
(325 real changes made)
(266 real changes made)
(287 real changes made)
(274 real changes made)
(253 real changes made)
(251 real changes made)
(197 real changes made)
(210 real changes made)
(181 real changes made)
(144 real changes made)
(136 real changes made)
(155 real changes made)
(141 real changes made)
(115 real changes made)
(121 real changes made)
(128 real changes made)
(118 real changes made)
(226 real changes made)
(257 real changes made)
(261 real changes made)
(234 real changes made)
(258 real changes made)
(244 real changes made)
(238 real changes made)
(226 real changes made)
(227 real changes made)
(195 real changes made)
(241 real changes made)
(216 real changes made)
(195 real changes made)
(244 real changes made)
(199 real changes made)
(197 real changes made)
(179 real changes made)
(203 real changes made)
(201 real changes made)
(195 real changes made)
(164 real changes made)
(179 real changes made)
(200 real changes made)
(182 real changes made)
(124 real changes made)
(172 real changes made)
(153 real changes made)
(165 real changes made)
(138 real changes made)
(150 real changes made)
(168 real changes made)
(127 real changes made)
(138 real changes made)
(131 real changes made)
(130 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab case baseline_esrd

           | baseline_e
           |    srd
      case |   No ESRD |     Total
-----------+-----------+----------
         0 |    20,340 |    20,340 
         1 |    12,283 |    12,283 
-----------+-----------+----------
     Total |    32,623 |    32,623 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. * Drop COVID-19 cases without any matched historical comparators after furthe
> r application of exclusion criteria
. generate match_counts1=.
(32,623 missing values generated)

. order patient_id set_id match_counts match_counts1

. bysort set_id: replace match_counts1=_N-1
(32623 real changes made)

. replace match_counts1=. if case==0
(20,340 real changes made, 20,340 to missing)

. drop match_counts

. rename match_counts1 match_counts

. count if match_counts==0
  4,593

. drop if match_counts==0
(4,593 observations deleted)

. safetab case
0

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,340       72.57       72.57
          1 |      7,690       27.43      100.00
------------+-----------------------------------
      Total |     28,030      100.00

. tab match_counts

match_count |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,039       13.51       13.51
          2 |      1,775       23.08       36.59
          3 |      4,876       63.41      100.00
------------+-----------------------------------
      Total |      7,690      100.00

. 
. bysort set_id: egen set_case_mean = mean(case) // if mean of exposure var is 
> 0 then only uncase in set, if 1 then only case in set

. gen valid_set = (set_case_mean>0 & set_case_mean<1) // ==1 is valid set conta
> ining both case and uncase

. tab valid_set, miss

  valid_set |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,123        4.01        4.01
          1 |     26,907       95.99      100.00
------------+-----------------------------------
      Total |     28,030      100.00

. tab valid_set case, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |         case
 valid_set |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,123          0 |     1,123 
           |      5.52       0.00 |      4.01 
-----------+----------------------+----------
         1 |    19,217      7,690 |    26,907 
           |     94.48     100.00 |     95.99 
-----------+----------------------+----------
     Total |    20,340      7,690 |    28,030 
           |    100.00     100.00 |    100.00 

. keep if valid_set==1
(1,123 observations deleted)

. drop valid_set set_case_mean

. 
. ** Exposure
. label define case 0 "Historical comparator" ///
>                                   1 "SARS-CoV-2"

. label values case case

. safetab case 
0

                 case |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,217       71.42       71.42
           SARS-CoV-2 |      7,690       28.58      100.00
----------------------+-----------------------------------
                Total |     26,907      100.00

. 
. * COVID-19 severity
. gen covid_severity = case

. replace covid_severity = 2 if covid_hospitalised==1
(784 real changes made)

. replace covid_severity = 3 if covid_critical_care==1
(392 real changes made)

. replace covid_severity = 3 if covid_critical_days==1
(375 real changes made)

. label define covid_severity     0 "Historical comparator"               ///
>                                                         1 "Non-hospitalised C
> OVID" ///
>                                                         2 "Hospitalised COVID
> "          ///
>                                                         3 "Critical care COVI
> D"

. label values covid_severity covid_severity

. label var covid_severity "SARS-CoV-2 severity"

. drop covid_critical_care

. drop covid_critical_days

. safetab covid_severity, m
15

   SARS-CoV-2 severity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
 Historical comparator |     19,217       71.42       71.42
Non-hospitalised COVID |      6,223       23.13       94.55
    Hospitalised COVID |        700        2.60       97.15
   Critical care COVID |        767        2.85      100.00
-----------------------+-----------------------------------
                 Total |     26,907      100.00

. 
. * COVID-19 acute kidney injury
. gen covid_aki = case

. replace covid_aki = 2 if covid_hospitalised==1
(784 real changes made)

. replace covid_aki = 3 if covid_acute_kidney_injury==1
(386 real changes made)

. label define covid_aki  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised COVID"   
>            ///
>                                                 2 "Hospitalised COVID"  ///
>                                                 3 "Hospitalised COVID-AKI"

. label values covid_aki covid_aki

. label var covid_aki "COVID-19 acute kidney injury"

. drop covid_acute_kidney_injury

. safetab covid_aki, m
10

 COVID-19 acute kidney |
                injury |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
 Historical comparator |     19,217       71.42       71.42
Non-hospitalised COVID |      6,564       24.40       95.82
    Hospitalised COVID |        740        2.75       98.57
Hospitalised COVID-AKI |        386        1.43      100.00
-----------------------+-----------------------------------
                 Total |     26,907      100.00

. 
. * COVID-19 kidney replacement therapy
. gen covid_krt_combined = covid_krt_icd_10
(19,217 missing values generated)

. replace covid_krt_combined = covid_krt_opcs_4 if covid_krt_icd_10==0
(351 real changes made)

. gen covid_krt = case

. replace covid_krt = 2 if covid_hospitalised==1
(784 real changes made)

. replace covid_krt = 3 if covid_krt_combined==1
(744 real changes made)

. label define covid_krt  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised SARS-CoV-
> 2"         ///
>                                                 2 "No KRT hospitalised COVID-
> 19"        ///
>                                                 3 "KRT hospitalised COVID-19"

. label values covid_krt covid_krt

. label var covid_krt "COVID-19 kidney replacement therapy"

. drop covid_krt_icd_10

. drop covid_krt_opcs_4

. safetab covid_krt, m
10

 COVID-19 kidney replacement |
                     therapy |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
       Historical comparator |     19,217       71.42       71.42
 Non-hospitalised SARS-CoV-2 |      6,243       23.20       94.62
No KRT hospitalised COVID-19 |        703        2.61       97.23
   KRT hospitalised COVID-19 |        744        2.77      100.00
-----------------------------+-----------------------------------
                       Total |     26,907      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(25,398 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(25,366 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(25,377 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(25,377 missing values generated)

. format covidvax4date %td

. *First vaccination in the UK was on 08/12/2020
. *di date("20201208", "YMD") -> 22257
. foreach var of varlist covidvax1date covidvax2date covidvax3date covidvax4dat
> e {
  2. replace `var' = . if `var'<22257
  3. replace `var' = . if `var' >= (index_date - 7)
  4. }
(0 real changes made)
(1,234 real changes made, 1,234 to missing)
(0 real changes made)
(1,266 real changes made, 1,266 to missing)
(0 real changes made)
(1,278 real changes made, 1,278 to missing)
(0 real changes made)
(1,320 real changes made, 1,320 to missing)

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(210 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(227 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(205 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(187 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Historical comparator"       ///
>                                                 1 "Pre-vaccination"          
>            ///
>                                                 2 "1 vaccine dose"           
>            ///
>                                                 3 "2 vaccine doses"          
>            ///
>                                                 4 "3 vaccine doses"          
>            ///
>                                                 5 "4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "Vaccination status"

. safetab covid_vax, m
10

   Vaccination status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,217       71.42       71.42
      Pre-vaccination |      6,861       25.50       96.92
       1 vaccine dose |        187        0.69       97.61
      2 vaccine doses |        205        0.76       98.38
      3 vaccine doses |        227        0.84       99.22
      4 vaccine doses |        210        0.78      100.00
----------------------+-----------------------------------
                Total |     26,907      100.00

. 
. * COVID-19 wave
. gen wave = case

. replace wave = 2 if index_month=="sep2020"
(369 real changes made)

. replace wave = 2 if index_month=="oct2020"
(310 real changes made)

. replace wave = 2 if index_month=="nov2020"
(279 real changes made)

. replace wave = 2 if index_month=="dec2020"
(302 real changes made)

. replace wave = 2 if index_month=="jan2021"
(285 real changes made)

. replace wave = 2 if index_month=="feb2021"
(233 real changes made)

. replace wave = 2 if index_month=="mar2021"
(273 real changes made)

. replace wave = 2 if index_month=="apr2021"
(228 real changes made)

. replace wave = 2 if index_month=="may2021"
(220 real changes made)

. replace wave = 2 if index_month=="jun2021"
(195 real changes made)

. replace wave = 3 if index_month=="jul2021"
(204 real changes made)

. replace wave = 3 if index_month=="aug2021"
(191 real changes made)

. replace wave = 3 if index_month=="sep2021"
(183 real changes made)

. replace wave = 3 if index_month=="oct2021"
(170 real changes made)

. replace wave = 3 if index_month=="nov2021"
(139 real changes made)

. replace wave = 4 if index_month=="dec2021"
(149 real changes made)

. replace wave = 4 if index_month=="jan2022"
(132 real changes made)

. replace wave = 4 if index_month=="feb2022"
(99 real changes made)

. replace wave = 4 if index_month=="mar2022"
(103 real changes made)

. replace wave = 4 if index_month=="apr2022"
(99 real changes made)

. replace wave = 4 if index_month=="may2022"
(109 real changes made)

. replace wave = 4 if index_month=="jun2022"
(89 real changes made)

. replace wave = 4 if index_month=="jul2022"
(87 real changes made)

. replace wave = 4 if index_month=="aug2022"
(93 real changes made)

. replace wave = 4 if index_month=="sep2022"
(84 real changes made)

. replace wave = 4 if index_month=="oct2022"
(75 real changes made)

. replace wave = 4 if index_month=="nov2022"
(71 real changes made)

. replace wave = 4 if index_month=="dec2022"
(78 real changes made)

. label define wave       0 "Historical comparator"       ///
>                                         1 "Febuary20-August20"  ///
>                                         2 "September20-June21"  ///
>                                         3 "July21-November21"   ///
>                                         4 "December21-December22"       

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m
5

        COVID-19 wave |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,217       71.42       71.42
   Febuary20-August20 |      2,841       10.56       81.98
   September20-June21 |      2,694       10.01       91.99
    July21-November21 |        887        3.30       95.29
December21-December22 |      1,268        4.71      100.00
----------------------+-----------------------------------
                Total |     26,907      100.00

. 
. ** Covariates
. * Check of GP consultations over past year by groups
. sum gp_count, detail

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -4
 5%            0             -4
10%            0             -4       Obs              26,907
25%            0             -3       Sum of Wgt.      26,907

50%            3                      Mean           3.325826
                        Largest       Std. Dev.      3.542557
75%            6             16
90%            8             16       Variance       12.54971
95%           10             16       Skewness       .6337769
99%           12             19       Kurtosis       2.283788

. bysort case: sum gp_count, detail

-------------------------------------------------------------------------------
-> case = Historical comparator

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -3
 5%            0             -3
10%            0             -3       Obs              19,217
25%            0             -3       Sum of Wgt.      19,217

50%            3                      Mean           3.316126
                        Largest       Std. Dev.       3.54242
75%            6             16
90%            8             16       Variance       12.54874
95%           10             16       Skewness       .6400105
99%           12             19       Kurtosis       2.298449

-------------------------------------------------------------------------------
-> case = SARS-CoV-2

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -4
 5%            0             -4
10%            0             -4       Obs               7,690
25%            0             -3       Sum of Wgt.       7,690

50%            3                      Mean           3.350065
                        Largest       Std. Dev.      3.543014
75%            6             15
90%            8             15       Variance       12.55295
95%           10             15       Skewness       .6182624
99%           12             15       Kurtosis       2.247663


. egen gp_consults = cut(gp_count), at(0, 1, 3, 10, 1500)
(148 missing values generated)

. recode gp_consults 3=2 10=3
(gp_consults: 13646 changes made)

. label define gp_consults 0 "0" 1 "1-2" 2 "3-9" 3 ">9"

. label values gp_consults gp_consults

. label var gp_consults "GP interactions"

. tab case gp_consults

                      |               GP interactions
                 case |         0        1-2        3-9         >9 |     Total
----------------------+--------------------------------------------+----------
Historical comparator |     8,110      1,268      8,676      1,051 |    19,105 
           SARS-CoV-2 |     3,181        554      3,501        418 |     7,654 
----------------------+--------------------------------------------+----------
                Total |    11,291      1,822     12,177      1,469 |    26,759 

. 
. * Check of hospital admissions in preceding 5 years
. sum hosp_count, detail

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs              26,907
25%            0             -2       Sum of Wgt.      26,907

50%            0                      Mean           .3914223
                        Largest       Std. Dev.       .717556
75%            1              4
90%            1              4       Variance       .5148867
95%            2              4       Skewness       1.513869
99%            3              4       Kurtosis        5.20807

. bysort case: sum hosp_count, detail

-------------------------------------------------------------------------------
-> case = Historical comparator

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs              19,217
25%            0             -2       Sum of Wgt.      19,217

50%            0                      Mean           .3874694
                        Largest       Std. Dev.      .7157712
75%            1              4
90%            1              4       Variance       .5123284
95%            2              4       Skewness       1.501496
99%            3              4       Kurtosis       5.180152

-------------------------------------------------------------------------------
-> case = SARS-CoV-2

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs               7,690
25%            0             -1       Sum of Wgt.       7,690

50%            0                      Mean           .4013004
                        Largest       Std. Dev.       .721949
75%            1              4
90%            1              4       Variance       .5212104
95%            2              4       Skewness       1.543779
99%            3              4       Kurtosis       5.271155


. egen admissions = cut(hosp_count), at(0, 1, 2, 1000)
(362 missing values generated)

. label define admissions 0 "0" 1 "1" 2 ">1"

. label values admissions admissions

. label var admissions "Hospital admissions"

. tab case admissions

                      |       Hospital admissions
                 case |         0          1         >1 |     Total
----------------------+---------------------------------+----------
Historical comparator |    13,291      3,846      1,813 |    18,950 
           SARS-CoV-2 |     5,255      1,625        715 |     7,595 
----------------------+---------------------------------+----------
                Total |    18,546      5,471      2,528 |    26,545 

. 
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        221        0.82        0.82
         19 |        330        1.23        2.05
         20 |        381        1.42        3.46
         21 |        473        1.76        5.22
         22 |        497        1.85        7.07
         23 |        555        2.06        9.13
         24 |        539        2.00       11.13
         25 |        529        1.97       13.10
         26 |        507        1.88       14.98
         27 |        513        1.91       16.89
         28 |        580        2.16       19.05
         29 |        535        1.99       21.04
         30 |        497        1.85       22.88
         31 |        545        2.03       24.91
         32 |        530        1.97       26.88
         33 |        545        2.03       28.90
         34 |        560        2.08       30.98
         35 |        536        1.99       32.98
         36 |        526        1.95       34.93
         37 |        563        2.09       37.02
         38 |        507        1.88       38.91
         39 |        555        2.06       40.97
         40 |        514        1.91       42.88
         41 |        546        2.03       44.91
         42 |        517        1.92       46.83
         43 |        546        2.03       48.86
         44 |        557        2.07       50.93
         45 |        542        2.01       52.95
         46 |        529        1.97       54.91
         47 |        525        1.95       56.86
         48 |        574        2.13       59.00
         49 |        543        2.02       61.01
         50 |        560        2.08       63.10
         51 |        524        1.95       65.04
         52 |        544        2.02       67.06
         53 |        530        1.97       69.03
         54 |        537        2.00       71.03
         55 |        552        2.05       73.08
         56 |        487        1.81       74.89
         57 |        534        1.98       76.88
         58 |        519        1.93       78.80
         59 |        551        2.05       80.85
         60 |        538        2.00       82.85
         61 |        533        1.98       84.83
         62 |        546        2.03       86.86
         63 |        571        2.12       88.98
         64 |        566        2.10       91.09
         65 |        585        2.17       93.26
         66 |        527        1.96       95.22
         67 |        568        2.11       97.33
         68 |        304        1.13       98.46
         69 |        184        0.68       99.15
         70 |        150        0.56       99.70
         71 |         59        0.22       99.92
         72 |         21        0.08      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. safecount
  26,907

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///          
>                            
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(26907 differences between age and agegroup)

. 
. label var age "Age"

. label values age age

. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label var agegroup "Age group"

. label values agegroup agegroup

. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex
0

        Sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     13,811       51.33       51.33
       Male |     13,096       48.67      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. safecount
  26,907

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(943 real changes made)

. replace ethnicity=2 if ethnicity==3
(1,032 real changes made)

. replace ethnicity=3 if ethnicity==4
(1,054 real changes made)

. replace ethnicity=4 if ethnicity==6
(943 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///          
>                                    
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                    
>                                            

. label values ethnicity ethnicity

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,130       59.95       59.95
South Asian |      1,032        3.84       63.78
      Black |      1,054        3.92       67.70
      Mixed |        943        3.50       71.20
      Other |      1,021        3.79       75.00
          . |      6,727       25.00      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(6,727 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(6,727 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. label var ethnicity1 "Ethnicity"

. safetab ethnicity1, m
11

  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,130       59.95       59.95
South Asian |      1,032        3.84       63.78
      Black |      1,054        3.92       67.70
      Mixed |        943        3.50       71.20
      Other |      1,021        3.79       75.00
    Unknown |      6,727       25.00      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,703       10.05       10.05
                Urban minor conurbation |      2,707       10.06       20.11
                    Urban city and town |      2,652        9.86       29.96
Urban city and town in a sparse setting |      2,671        9.93       39.89
                  Rural town and fringe |      2,652        9.86       49.75
Rural town and fringe in a sparse setti |      2,722       10.12       59.86
            Rural village and dispersed |      5,376       19.98       79.84
Rural village and dispersed in a sparse |      5,424       20.16      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,907      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(26,907 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(10,733 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(16,174 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                      rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0      2,652 |    16,174 
     Urban |     2,703      2,707      2,652      2,671          0 |    10,733 
-----------+-------------------------------------------------------+----------
     Total |     2,703      2,707      2,652      2,671      2,652 |    26,907 


Urban/rura |           rural_urban
         l | Rural tow  Rural vil  Rural vil |     Total
-----------+---------------------------------+----------
     Rural |     2,722      5,376      5,424 |    16,174 
     Urban |         0          0          0 |    10,733 
-----------+---------------------------------+----------
     Total |     2,722      5,376      5,424 |    26,907 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Historical comparator |    11,527      7,690 |    19,217 
           SARS-CoV-2 |     4,647      3,043 |     7,690 
----------------------+----------------------+----------
                Total |    16,174     10,733 |    26,907 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,792 real changes made, 2,792 to missing)

. gen     bmi = .
(26,907 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(bmi: 1631 changes made)

. recode  bmi . = 2 if body_mass_index<25
(bmi: 6020 changes made)

. recode  bmi . = 3 if body_mass_index<30
(bmi: 6321 changes made)

. recode  bmi . = 4 if body_mass_index<35
(bmi: 5325 changes made)

. recode  bmi . = 5 if body_mass_index<40
(bmi: 3206 changes made)

. recode  bmi . = 6 if body_mass_index<.
(bmi: 1612 changes made)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>            

. label values bmi bmi

. label var bmi "Body mass index (BMI)"

. safetab bmi, m
4

     Body mass index |
               (BMI) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,631        6.06        6.06
  Normal (18.5-24.9) |      6,020       22.37       28.43
Overweight (25-29.9) |      6,321       23.49       51.93
   Obese I (30-34.9) |      5,325       19.79       71.72
  Obese II (35-39.9) |      3,206       11.92       83.63
     Obese III (40+) |      1,612        5.99       89.62
                   . |      2,792       10.38      100.00
---------------------+-----------------------------------
               Total |     26,907      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(23,693 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(574 real changes made)

. replace smoking = 0 if smoking_status=="N"
(1,095 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m
8

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |      1,095        4.07        4.07
Current/former smoker |      3,788       14.08       18.15
                    . |     22,024       81.85      100.00
----------------------+-----------------------------------
                Total |     26,907      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000
> )
(12193 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(egfr_group: 14714 changes made)

. label define egfr_group 1 "≥105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "
> 30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m
11

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       ≥105 |      4,812       17.88       17.88
     90-104 |      2,034        7.56       25.44
      75-89 |      1,928        7.17       32.61
      60-74 |      2,321        8.63       41.23
      45-59 |      2,280        8.47       49.71
      30-44 |      1,228        4.56       54.27
      15-29 |        111        0.41       54.68
          . |     12,193       45.32      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 1
> 5-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(12,193 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(ckd_stage: 22095 changes made)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6
>  "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m
10

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |     11,095       41.23       41.23
                      CKD 3A |      2,280        8.47       49.71
                      CKD 3B |      1,228        4.56       54.27
                       CKD 4 |        111        0.41       54.68
No baseline eGFR measurement |     12,193       45.32      100.00
-----------------------------+-----------------------------------
                       Total |     26,907      100.00

. 
. * Comorbidities
. rename acute_kidney_injury_baseline aki_baseline

. safetab aki_baseline
0

aki_baselin |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,559       94.99       94.99
          1 |      1,348        5.01      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib
0

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,553       94.97       94.97
          1 |      1,354        5.03      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver
0

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,387       98.07       98.07
          1 |        520        1.93      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. label var diabetes "Diabetes"

. safetab diabetes
0

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,532       80.02       80.02
          1 |      5,375       19.98      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer
0

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,639       99.00       99.00
          1 |        268        1.00      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. safetab heart_failure
0

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,849       96.07       96.07
          1 |      1,058        3.93      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. safetab hiv
0

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,387       98.07       98.07
          1 |        520        1.93      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. label var hypertension "Hypertension"

. safetab hypertension
0

Hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,572       80.17       80.17
          1 |      5,335       19.83      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. label var non_haem_cancer "Cancer (non-haematological)"

. safetab non_haem_cancer
0

     Cancer |
(non-haemat |
  ological) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,370       98.00       98.00
          1 |        537        2.00      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. safetab myocardial_infarction
0

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,215       90.00       90.00
          1 |      2,692       10.00      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd
0

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,373       98.02       98.02
          1 |        534        1.98      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid
0

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,538       94.91       94.91
          1 |      1,369        5.09      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. safetab stroke
0

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,377       98.03       98.03
          1 |        530        1.97      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus
0

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,375       98.02       98.02
          1 |        532        1.98      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(995 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,470 real changes made)

. replace cardiovascular = 1 if pvd==1
(432 real changes made)

. replace cardiovascular = 1 if stroke==1
(428 real changes made)

. label var cardiovascular "Cardiovascular diseases"

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(514 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,325 real changes made)

. replace immunosuppressed = 1 if lupus==1
(488 real changes made)

. label var immunosuppressed "Immunosuppressive diseases"

. safetab cardiovascular
0

Cardiovascu |
        lar |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,228       78.89       78.89
          1 |      5,679       21.11      100.00
------------+-----------------------------------
      Total |     26,907      100.00

. safetab immunosuppressed
0

Immunosuppr |
     essive |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,312       90.36       90.36
          1 |      2,595        9.64      100.00
------------+-----------------------------------
      Total |     26,907      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                              
>    creatinine_mar2017 ///
>                                                                              
>    creatinine_apr2017 ///
>                                                                              
>    creatinine_may2017 ///
>                                                                              
>    creatinine_jun2017 ///
>                                                                              
>    creatinine_jul2017 ///
>                                                                              
>    creatinine_aug2017 ///
>                                                                              
>    creatinine_sep2017 ///
>                                                                              
>    creatinine_oct2017 ///
>                                                                              
>    creatinine_nov2017 ///
>                                                                              
>    creatinine_dec2017 ///
>                                                                              
>    creatinine_jan2018 ///
>                                                                              
>    creatinine_feb2018 ///
>                                                                              
>    creatinine_mar2018 ///
>                                                                              
>    creatinine_apr2018 ///
>                                                                              
>    creatinine_may2018 ///
>                                                                              
>    creatinine_jun2018 ///
>                                                                              
>    creatinine_jul2018 ///
>                                                                              
>    creatinine_aug2018 ///
>                                                                              
>    creatinine_sep2018 ///
>                                                                              
>    creatinine_oct2018 ///
>                                                                              
>    creatinine_nov2018 ///
>                                                                              
>    creatinine_dec2018 ///
>                                                                              
>    creatinine_jan2019 ///
>                                                                              
>    creatinine_feb2019 ///
>                                                                              
>    creatinine_mar2019 ///
>                                                                              
>    creatinine_apr2019 ///
>                                                                              
>    creatinine_may2019 ///
>                                                                              
>    creatinine_jun2019 ///
>                                                                              
>    creatinine_jul2019 ///
>                                                                              
>    creatinine_aug2019 ///
>                                                                              
>    creatinine_sep2019 ///
>                                                                              
>    creatinine_feb2020 ///
>                                                                              
>    creatinine_mar2020 ///
>                                                                              
>    creatinine_apr2020 ///
>                                                                              
>    creatinine_may2020 ///
>                                                                              
>    creatinine_jun2020 ///
>                                                                              
>    creatinine_jul2020 ///
>                                                                              
>    creatinine_aug2020 ///
>                                                                              
>    creatinine_sep2020 ///
>                                                                              
>    creatinine_oct2020 ///
>                                                                              
>    creatinine_nov2020 ///
>                                                                              
>    creatinine_dec2020 ///
>                                                                              
>    creatinine_jan2021 ///
>                                                                              
>    creatinine_feb2021 ///
>                                                                              
>    creatinine_mar2021 ///
>                                                                              
>    creatinine_apr2021 ///
>                                                                              
>    creatinine_may2021 ///
>                                                                              
>    creatinine_jun2021 ///
>                                                                              
>    creatinine_jul2021 ///
>                                                                              
>    creatinine_aug2021 ///
>                                                                              
>    creatinine_sep2021 ///
>                                                                              
>    creatinine_oct2021 ///
>                                                                              
>    creatinine_nov2021 ///
>                                                                              
>    creatinine_dec2021 ///
>                                                                              
>    creatinine_jan2022 ///
>                                                                              
>    creatinine_feb2022 ///
>                                                                              
>    creatinine_mar2022 ///
>                                                                              
>    creatinine_apr2022 ///
>                                                                              
>    creatinine_may2022 ///
>                                                                              
>    creatinine_jun2022 ///
>                                                                              
>    creatinine_jul2022 ///
>                                                                              
>    creatinine_aug2022 ///
>                                                                              
>    creatinine_sep2022 ///
>                                                                              
>    creatinine_oct2022 ///
>                                                                              
>    creatinine_nov2022 ///
>                                                                              
>    creatinine_dec2022 ///
>                                                                              
>    creatinine_jan2023 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 300
> 0)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex=
> =0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex=
> =1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_m
> onthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex
> ==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(8,463 real changes made, 8,463 to missing)
(16,153 missing values generated)
(26,907 missing values generated)
(5,541 real changes made)
(5,213 real changes made)
(5,541 real changes made)
(5,213 real changes made)
(6,737 real changes made)
(26,907 missing values generated)
(5,541 real changes made)
(5,213 real changes made)
(10,754 real changes made)
(20,170 real changes made)
(16,153 missing values generated)
(10,754 real changes made)
(5,541 real changes made)
(8,479 real changes made, 8,479 to missing)
(16,169 missing values generated)
(26,907 missing values generated)
(5,545 real changes made)
(5,193 real changes made)
(5,545 real changes made)
(5,193 real changes made)
(6,795 real changes made)
(26,907 missing values generated)
(5,545 real changes made)
(5,193 real changes made)
(10,738 real changes made)
(20,112 real changes made)
(16,169 missing values generated)
(10,738 real changes made)
(5,545 real changes made)
(8,500 real changes made, 8,500 to missing)
(16,190 missing values generated)
(26,907 missing values generated)
(5,441 real changes made)
(5,276 real changes made)
(5,441 real changes made)
(5,276 real changes made)
(6,819 real changes made)
(26,907 missing values generated)
(5,441 real changes made)
(5,276 real changes made)
(10,717 real changes made)
(20,088 real changes made)
(16,190 missing values generated)
(10,717 real changes made)
(5,441 real changes made)
(8,457 real changes made, 8,457 to missing)
(16,147 missing values generated)
(26,907 missing values generated)
(5,567 real changes made)
(5,193 real changes made)
(5,567 real changes made)
(5,193 real changes made)
(6,832 real changes made)
(26,907 missing values generated)
(5,567 real changes made)
(5,193 real changes made)
(10,760 real changes made)
(20,075 real changes made)
(16,147 missing values generated)
(10,760 real changes made)
(5,567 real changes made)
(8,411 real changes made, 8,411 to missing)
(16,101 missing values generated)
(26,907 missing values generated)
(5,595 real changes made)
(5,211 real changes made)
(5,595 real changes made)
(5,211 real changes made)
(6,940 real changes made)
(26,907 missing values generated)
(5,595 real changes made)
(5,211 real changes made)
(10,806 real changes made)
(19,967 real changes made)
(16,101 missing values generated)
(10,806 real changes made)
(5,595 real changes made)
(8,440 real changes made, 8,440 to missing)
(16,130 missing values generated)
(26,907 missing values generated)
(5,534 real changes made)
(5,243 real changes made)
(5,534 real changes made)
(5,243 real changes made)
(6,892 real changes made)
(26,907 missing values generated)
(5,534 real changes made)
(5,243 real changes made)
(10,777 real changes made)
(20,015 real changes made)
(16,130 missing values generated)
(10,777 real changes made)
(5,534 real changes made)
(8,424 real changes made, 8,424 to missing)
(16,114 missing values generated)
(26,907 missing values generated)
(5,550 real changes made)
(5,243 real changes made)
(5,550 real changes made)
(5,242 real changes made)
(6,866 real changes made)
(26,907 missing values generated)
(5,550 real changes made)
(5,243 real changes made)
(10,792 real changes made)
(20,040 real changes made)
(16,114 missing values generated)
(10,793 real changes made)
(5,550 real changes made)
(8,492 real changes made, 8,492 to missing)
(16,182 missing values generated)
(26,907 missing values generated)
(5,505 real changes made)
(5,220 real changes made)
(5,505 real changes made)
(5,220 real changes made)
(6,856 real changes made)
(26,907 missing values generated)
(5,505 real changes made)
(5,220 real changes made)
(10,725 real changes made)
(20,051 real changes made)
(16,182 missing values generated)
(10,725 real changes made)
(5,505 real changes made)
(8,480 real changes made, 8,480 to missing)
(16,170 missing values generated)
(26,907 missing values generated)
(5,522 real changes made)
(5,215 real changes made)
(5,522 real changes made)
(5,215 real changes made)
(6,910 real changes made)
(26,907 missing values generated)
(5,522 real changes made)
(5,215 real changes made)
(10,737 real changes made)
(19,997 real changes made)
(16,170 missing values generated)
(10,737 real changes made)
(5,522 real changes made)
(8,417 real changes made, 8,417 to missing)
(16,107 missing values generated)
(26,907 missing values generated)
(5,542 real changes made)
(5,258 real changes made)
(5,542 real changes made)
(5,258 real changes made)
(6,831 real changes made)
(26,907 missing values generated)
(5,542 real changes made)
(5,258 real changes made)
(10,800 real changes made)
(20,076 real changes made)
(16,107 missing values generated)
(10,800 real changes made)
(5,542 real changes made)
(8,485 real changes made, 8,485 to missing)
(16,175 missing values generated)
(26,907 missing values generated)
(5,508 real changes made)
(5,224 real changes made)
(5,508 real changes made)
(5,224 real changes made)
(6,874 real changes made)
(26,907 missing values generated)
(5,508 real changes made)
(5,224 real changes made)
(10,732 real changes made)
(20,033 real changes made)
(16,175 missing values generated)
(10,732 real changes made)
(5,508 real changes made)
(8,435 real changes made, 8,435 to missing)
(16,125 missing values generated)
(26,907 missing values generated)
(5,608 real changes made)
(5,174 real changes made)
(5,608 real changes made)
(5,174 real changes made)
(6,854 real changes made)
(26,907 missing values generated)
(5,608 real changes made)
(5,174 real changes made)
(10,782 real changes made)
(20,053 real changes made)
(16,125 missing values generated)
(10,782 real changes made)
(5,608 real changes made)
(8,423 real changes made, 8,423 to missing)
(16,113 missing values generated)
(26,907 missing values generated)
(5,595 real changes made)
(5,199 real changes made)
(5,595 real changes made)
(5,199 real changes made)
(6,931 real changes made)
(26,907 missing values generated)
(5,595 real changes made)
(5,199 real changes made)
(10,794 real changes made)
(19,976 real changes made)
(16,113 missing values generated)
(10,794 real changes made)
(5,595 real changes made)
(8,475 real changes made, 8,475 to missing)
(16,165 missing values generated)
(26,907 missing values generated)
(5,419 real changes made)
(5,323 real changes made)
(5,419 real changes made)
(5,323 real changes made)
(6,908 real changes made)
(26,907 missing values generated)
(5,419 real changes made)
(5,323 real changes made)
(10,742 real changes made)
(19,999 real changes made)
(16,165 missing values generated)
(10,742 real changes made)
(5,419 real changes made)
(8,459 real changes made, 8,459 to missing)
(16,149 missing values generated)
(26,907 missing values generated)
(5,482 real changes made)
(5,276 real changes made)
(5,482 real changes made)
(5,276 real changes made)
(6,876 real changes made)
(26,907 missing values generated)
(5,482 real changes made)
(5,276 real changes made)
(10,758 real changes made)
(20,031 real changes made)
(16,149 missing values generated)
(10,758 real changes made)
(5,482 real changes made)
(8,510 real changes made, 8,510 to missing)
(16,200 missing values generated)
(26,907 missing values generated)
(5,465 real changes made)
(5,242 real changes made)
(5,465 real changes made)
(5,242 real changes made)
(6,684 real changes made)
(26,907 missing values generated)
(5,465 real changes made)
(5,242 real changes made)
(10,707 real changes made)
(20,223 real changes made)
(16,200 missing values generated)
(10,707 real changes made)
(5,465 real changes made)
(8,464 real changes made, 8,464 to missing)
(16,154 missing values generated)
(26,907 missing values generated)
(5,506 real changes made)
(5,247 real changes made)
(5,506 real changes made)
(5,247 real changes made)
(6,739 real changes made)
(26,907 missing values generated)
(5,506 real changes made)
(5,247 real changes made)
(10,753 real changes made)
(20,168 real changes made)
(16,154 missing values generated)
(10,753 real changes made)
(5,506 real changes made)
(8,447 real changes made, 8,447 to missing)
(16,137 missing values generated)
(26,907 missing values generated)
(5,546 real changes made)
(5,224 real changes made)
(5,546 real changes made)
(5,224 real changes made)
(6,921 real changes made)
(26,907 missing values generated)
(5,546 real changes made)
(5,224 real changes made)
(10,770 real changes made)
(19,986 real changes made)
(16,137 missing values generated)
(10,770 real changes made)
(5,546 real changes made)
(8,421 real changes made, 8,421 to missing)
(16,111 missing values generated)
(26,907 missing values generated)
(5,553 real changes made)
(5,243 real changes made)
(5,553 real changes made)
(5,243 real changes made)
(6,818 real changes made)
(26,907 missing values generated)
(5,553 real changes made)
(5,243 real changes made)
(10,796 real changes made)
(20,089 real changes made)
(16,111 missing values generated)
(10,796 real changes made)
(5,553 real changes made)
(8,431 real changes made, 8,431 to missing)
(16,121 missing values generated)
(26,907 missing values generated)
(5,566 real changes made)
(5,220 real changes made)
(5,566 real changes made)
(5,220 real changes made)
(6,952 real changes made)
(26,907 missing values generated)
(5,566 real changes made)
(5,220 real changes made)
(10,786 real changes made)
(19,955 real changes made)
(16,121 missing values generated)
(10,786 real changes made)
(5,566 real changes made)
(8,456 real changes made, 8,456 to missing)
(16,146 missing values generated)
(26,907 missing values generated)
(5,594 real changes made)
(5,167 real changes made)
(5,594 real changes made)
(5,167 real changes made)
(6,856 real changes made)
(26,907 missing values generated)
(5,594 real changes made)
(5,167 real changes made)
(10,761 real changes made)
(20,051 real changes made)
(16,146 missing values generated)
(10,761 real changes made)
(5,594 real changes made)
(8,477 real changes made, 8,477 to missing)
(16,167 missing values generated)
(26,907 missing values generated)
(5,473 real changes made)
(5,267 real changes made)
(5,473 real changes made)
(5,267 real changes made)
(6,777 real changes made)
(26,907 missing values generated)
(5,473 real changes made)
(5,267 real changes made)
(10,740 real changes made)
(20,130 real changes made)
(16,167 missing values generated)
(10,740 real changes made)
(5,473 real changes made)
(8,413 real changes made, 8,413 to missing)
(16,103 missing values generated)
(26,907 missing values generated)
(5,506 real changes made)
(5,298 real changes made)
(5,506 real changes made)
(5,298 real changes made)
(6,795 real changes made)
(26,907 missing values generated)
(5,506 real changes made)
(5,298 real changes made)
(10,804 real changes made)
(20,112 real changes made)
(16,103 missing values generated)
(10,804 real changes made)
(5,506 real changes made)
(8,440 real changes made, 8,440 to missing)
(16,130 missing values generated)
(26,907 missing values generated)
(5,524 real changes made)
(5,253 real changes made)
(5,524 real changes made)
(5,253 real changes made)
(6,870 real changes made)
(26,907 missing values generated)
(5,524 real changes made)
(5,253 real changes made)
(10,777 real changes made)
(20,037 real changes made)
(16,130 missing values generated)
(10,777 real changes made)
(5,524 real changes made)
(8,500 real changes made, 8,500 to missing)
(16,190 missing values generated)
(26,907 missing values generated)
(5,559 real changes made)
(5,158 real changes made)
(5,559 real changes made)
(5,158 real changes made)
(6,830 real changes made)
(26,907 missing values generated)
(5,559 real changes made)
(5,158 real changes made)
(10,717 real changes made)
(20,077 real changes made)
(16,190 missing values generated)
(10,717 real changes made)
(5,559 real changes made)
(8,432 real changes made, 8,432 to missing)
(16,122 missing values generated)
(26,907 missing values generated)
(5,537 real changes made)
(5,248 real changes made)
(5,537 real changes made)
(5,248 real changes made)
(6,831 real changes made)
(26,907 missing values generated)
(5,537 real changes made)
(5,248 real changes made)
(10,785 real changes made)
(20,076 real changes made)
(16,122 missing values generated)
(10,785 real changes made)
(5,537 real changes made)
(8,472 real changes made, 8,472 to missing)
(16,162 missing values generated)
(26,907 missing values generated)
(5,569 real changes made)
(5,176 real changes made)
(5,569 real changes made)
(5,176 real changes made)
(6,796 real changes made)
(26,907 missing values generated)
(5,569 real changes made)
(5,176 real changes made)
(10,745 real changes made)
(20,111 real changes made)
(16,162 missing values generated)
(10,745 real changes made)
(5,569 real changes made)
(8,429 real changes made, 8,429 to missing)
(16,119 missing values generated)
(26,907 missing values generated)
(5,559 real changes made)
(5,229 real changes made)
(5,559 real changes made)
(5,229 real changes made)
(6,809 real changes made)
(26,907 missing values generated)
(5,559 real changes made)
(5,229 real changes made)
(10,788 real changes made)
(20,098 real changes made)
(16,119 missing values generated)
(10,788 real changes made)
(5,559 real changes made)
(8,466 real changes made, 8,466 to missing)
(16,156 missing values generated)
(26,907 missing values generated)
(5,501 real changes made)
(5,250 real changes made)
(5,501 real changes made)
(5,250 real changes made)
(6,819 real changes made)
(26,907 missing values generated)
(5,501 real changes made)
(5,250 real changes made)
(10,751 real changes made)
(20,088 real changes made)
(16,156 missing values generated)
(10,751 real changes made)
(5,501 real changes made)
(8,466 real changes made, 8,466 to missing)
(16,156 missing values generated)
(26,907 missing values generated)
(5,531 real changes made)
(5,220 real changes made)
(5,531 real changes made)
(5,220 real changes made)
(6,798 real changes made)
(26,907 missing values generated)
(5,531 real changes made)
(5,220 real changes made)
(10,751 real changes made)
(20,109 real changes made)
(16,156 missing values generated)
(10,751 real changes made)
(5,531 real changes made)
(8,383 real changes made, 8,383 to missing)
(16,073 missing values generated)
(26,907 missing values generated)
(5,558 real changes made)
(5,276 real changes made)
(5,558 real changes made)
(5,276 real changes made)
(6,890 real changes made)
(26,907 missing values generated)
(5,558 real changes made)
(5,276 real changes made)
(10,834 real changes made)
(20,017 real changes made)
(16,073 missing values generated)
(10,834 real changes made)
(5,558 real changes made)
(8,549 real changes made, 8,549 to missing)
(16,239 missing values generated)
(26,907 missing values generated)
(5,440 real changes made)
(5,228 real changes made)
(5,440 real changes made)
(5,228 real changes made)
(6,731 real changes made)
(26,907 missing values generated)
(5,440 real changes made)
(5,228 real changes made)
(10,668 real changes made)
(20,176 real changes made)
(16,239 missing values generated)
(10,668 real changes made)
(5,440 real changes made)
(3,429 real changes made, 3,429 to missing)
(22,646 missing values generated)
(26,907 missing values generated)
(2,173 real changes made)
(2,088 real changes made)
(2,173 real changes made)
(2,088 real changes made)
(2,680 real changes made)
(26,907 missing values generated)
(2,173 real changes made)
(2,088 real changes made)
(4,261 real changes made)
(24,227 real changes made)
(22,646 missing values generated)
(4,261 real changes made)
(2,173 real changes made)
(3,401 real changes made, 3,401 to missing)
(22,618 missing values generated)
(26,907 missing values generated)
(2,163 real changes made)
(2,126 real changes made)
(2,163 real changes made)
(2,126 real changes made)
(2,740 real changes made)
(26,907 missing values generated)
(2,163 real changes made)
(2,126 real changes made)
(4,289 real changes made)
(24,167 real changes made)
(22,618 missing values generated)
(4,289 real changes made)
(2,163 real changes made)
(3,408 real changes made, 3,408 to missing)
(22,625 missing values generated)
(26,907 missing values generated)
(2,223 real changes made)
(2,059 real changes made)
(2,223 real changes made)
(2,059 real changes made)
(2,770 real changes made)
(26,907 missing values generated)
(2,223 real changes made)
(2,059 real changes made)
(4,282 real changes made)
(24,137 real changes made)
(22,625 missing values generated)
(4,282 real changes made)
(2,223 real changes made)
(3,476 real changes made, 3,476 to missing)
(22,693 missing values generated)
(26,907 missing values generated)
(2,169 real changes made)
(2,045 real changes made)
(2,169 real changes made)
(2,045 real changes made)
(2,660 real changes made)
(26,907 missing values generated)
(2,169 real changes made)
(2,045 real changes made)
(4,214 real changes made)
(24,247 real changes made)
(22,693 missing values generated)
(4,214 real changes made)
(2,169 real changes made)
(3,447 real changes made, 3,447 to missing)
(22,664 missing values generated)
(26,907 missing values generated)
(2,171 real changes made)
(2,072 real changes made)
(2,171 real changes made)
(2,072 real changes made)
(2,719 real changes made)
(26,907 missing values generated)
(2,171 real changes made)
(2,072 real changes made)
(4,243 real changes made)
(24,188 real changes made)
(22,664 missing values generated)
(4,243 real changes made)
(2,171 real changes made)
(3,379 real changes made, 3,379 to missing)
(22,596 missing values generated)
(26,907 missing values generated)
(2,261 real changes made)
(2,050 real changes made)
(2,261 real changes made)
(2,050 real changes made)
(2,766 real changes made)
(26,907 missing values generated)
(2,261 real changes made)
(2,050 real changes made)
(4,311 real changes made)
(24,141 real changes made)
(22,596 missing values generated)
(4,311 real changes made)
(2,261 real changes made)
(3,422 real changes made, 3,422 to missing)
(22,639 missing values generated)
(26,907 missing values generated)
(2,173 real changes made)
(2,095 real changes made)
(2,173 real changes made)
(2,095 real changes made)
(2,662 real changes made)
(26,907 missing values generated)
(2,173 real changes made)
(2,095 real changes made)
(4,268 real changes made)
(24,245 real changes made)
(22,639 missing values generated)
(4,268 real changes made)
(2,173 real changes made)
(3,360 real changes made, 3,360 to missing)
(22,577 missing values generated)
(26,907 missing values generated)
(2,225 real changes made)
(2,105 real changes made)
(2,225 real changes made)
(2,105 real changes made)
(2,808 real changes made)
(26,907 missing values generated)
(2,225 real changes made)
(2,105 real changes made)
(4,330 real changes made)
(24,099 real changes made)
(22,577 missing values generated)
(4,330 real changes made)
(2,225 real changes made)
(3,387 real changes made, 3,387 to missing)
(22,604 missing values generated)
(26,907 missing values generated)
(2,174 real changes made)
(2,129 real changes made)
(2,174 real changes made)
(2,129 real changes made)
(2,765 real changes made)
(26,907 missing values generated)
(2,174 real changes made)
(2,129 real changes made)
(4,303 real changes made)
(24,142 real changes made)
(22,604 missing values generated)
(4,303 real changes made)
(2,174 real changes made)
(3,401 real changes made, 3,401 to missing)
(22,618 missing values generated)
(26,907 missing values generated)
(2,169 real changes made)
(2,120 real changes made)
(2,169 real changes made)
(2,120 real changes made)
(2,690 real changes made)
(26,907 missing values generated)
(2,169 real changes made)
(2,120 real changes made)
(4,289 real changes made)
(24,217 real changes made)
(22,618 missing values generated)
(4,289 real changes made)
(2,169 real changes made)
(3,352 real changes made, 3,352 to missing)
(22,569 missing values generated)
(26,907 missing values generated)
(2,231 real changes made)
(2,107 real changes made)
(2,231 real changes made)
(2,107 real changes made)
(2,731 real changes made)
(26,907 missing values generated)
(2,231 real changes made)
(2,107 real changes made)
(4,338 real changes made)
(24,176 real changes made)
(22,569 missing values generated)
(4,338 real changes made)
(2,231 real changes made)
(3,420 real changes made, 3,420 to missing)
(22,637 missing values generated)
(26,907 missing values generated)
(2,219 real changes made)
(2,051 real changes made)
(2,219 real changes made)
(2,051 real changes made)
(2,762 real changes made)
(26,907 missing values generated)
(2,219 real changes made)
(2,051 real changes made)
(4,270 real changes made)
(24,145 real changes made)
(22,637 missing values generated)
(4,270 real changes made)
(2,219 real changes made)
(3,395 real changes made, 3,395 to missing)
(22,612 missing values generated)
(26,907 missing values generated)
(2,231 real changes made)
(2,064 real changes made)
(2,231 real changes made)
(2,064 real changes made)
(2,709 real changes made)
(26,907 missing values generated)
(2,231 real changes made)
(2,064 real changes made)
(4,295 real changes made)
(24,198 real changes made)
(22,612 missing values generated)
(4,295 real changes made)
(2,231 real changes made)
(3,435 real changes made, 3,435 to missing)
(22,652 missing values generated)
(26,907 missing values generated)
(2,190 real changes made)
(2,065 real changes made)
(2,190 real changes made)
(2,065 real changes made)
(2,641 real changes made)
(26,907 missing values generated)
(2,190 real changes made)
(2,065 real changes made)
(4,255 real changes made)
(24,266 real changes made)
(22,652 missing values generated)
(4,255 real changes made)
(2,190 real changes made)
(3,350 real changes made, 3,350 to missing)
(22,567 missing values generated)
(26,907 missing values generated)
(2,216 real changes made)
(2,124 real changes made)
(2,216 real changes made)
(2,124 real changes made)
(2,684 real changes made)
(26,907 missing values generated)
(2,216 real changes made)
(2,124 real changes made)
(4,340 real changes made)
(24,223 real changes made)
(22,567 missing values generated)
(4,340 real changes made)
(2,216 real changes made)
(3,405 real changes made, 3,405 to missing)
(22,622 missing values generated)
(26,907 missing values generated)
(2,208 real changes made)
(2,077 real changes made)
(2,208 real changes made)
(2,077 real changes made)
(2,717 real changes made)
(26,907 missing values generated)
(2,208 real changes made)
(2,077 real changes made)
(4,285 real changes made)
(24,190 real changes made)
(22,622 missing values generated)
(4,285 real changes made)
(2,208 real changes made)
(3,402 real changes made, 3,402 to missing)
(22,619 missing values generated)
(26,907 missing values generated)
(2,179 real changes made)
(2,109 real changes made)
(2,179 real changes made)
(2,109 real changes made)
(2,691 real changes made)
(26,907 missing values generated)
(2,179 real changes made)
(2,109 real changes made)
(4,288 real changes made)
(24,216 real changes made)
(22,619 missing values generated)
(4,288 real changes made)
(2,179 real changes made)
(3,409 real changes made, 3,409 to missing)
(22,626 missing values generated)
(26,907 missing values generated)
(2,233 real changes made)
(2,048 real changes made)
(2,233 real changes made)
(2,048 real changes made)
(2,762 real changes made)
(26,907 missing values generated)
(2,233 real changes made)
(2,048 real changes made)
(4,281 real changes made)
(24,145 real changes made)
(22,626 missing values generated)
(4,281 real changes made)
(2,233 real changes made)
(3,397 real changes made, 3,397 to missing)
(22,614 missing values generated)
(26,907 missing values generated)
(2,142 real changes made)
(2,151 real changes made)
(2,142 real changes made)
(2,151 real changes made)
(2,670 real changes made)
(26,907 missing values generated)
(2,142 real changes made)
(2,151 real changes made)
(4,293 real changes made)
(24,237 real changes made)
(22,614 missing values generated)
(4,293 real changes made)
(2,142 real changes made)
(3,402 real changes made, 3,402 to missing)
(22,619 missing values generated)
(26,907 missing values generated)
(2,276 real changes made)
(2,012 real changes made)
(2,276 real changes made)
(2,012 real changes made)
(2,737 real changes made)
(26,907 missing values generated)
(2,276 real changes made)
(2,012 real changes made)
(4,288 real changes made)
(24,170 real changes made)
(22,619 missing values generated)
(4,288 real changes made)
(2,276 real changes made)
(3,375 real changes made, 3,375 to missing)
(22,592 missing values generated)
(26,907 missing values generated)
(2,251 real changes made)
(2,064 real changes made)
(2,251 real changes made)
(2,064 real changes made)
(2,738 real changes made)
(26,907 missing values generated)
(2,251 real changes made)
(2,064 real changes made)
(4,315 real changes made)
(24,169 real changes made)
(22,592 missing values generated)
(4,315 real changes made)
(2,251 real changes made)
(3,329 real changes made, 3,329 to missing)
(22,546 missing values generated)
(26,907 missing values generated)
(2,254 real changes made)
(2,107 real changes made)
(2,254 real changes made)
(2,107 real changes made)
(2,705 real changes made)
(26,907 missing values generated)
(2,254 real changes made)
(2,107 real changes made)
(4,361 real changes made)
(24,202 real changes made)
(22,546 missing values generated)
(4,361 real changes made)
(2,254 real changes made)
(3,412 real changes made, 3,412 to missing)
(22,629 missing values generated)
(26,907 missing values generated)
(2,185 real changes made)
(2,093 real changes made)
(2,185 real changes made)
(2,093 real changes made)
(2,735 real changes made)
(26,907 missing values generated)
(2,185 real changes made)
(2,093 real changes made)
(4,278 real changes made)
(24,172 real changes made)
(22,629 missing values generated)
(4,278 real changes made)
(2,185 real changes made)
(3,342 real changes made, 3,342 to missing)
(22,559 missing values generated)
(26,907 missing values generated)
(2,215 real changes made)
(2,133 real changes made)
(2,215 real changes made)
(2,133 real changes made)
(2,754 real changes made)
(26,907 missing values generated)
(2,215 real changes made)
(2,133 real changes made)
(4,348 real changes made)
(24,153 real changes made)
(22,559 missing values generated)
(4,348 real changes made)
(2,215 real changes made)
(3,387 real changes made, 3,387 to missing)
(22,604 missing values generated)
(26,907 missing values generated)
(2,193 real changes made)
(2,110 real changes made)
(2,193 real changes made)
(2,110 real changes made)
(2,763 real changes made)
(26,907 missing values generated)
(2,193 real changes made)
(2,110 real changes made)
(4,303 real changes made)
(24,144 real changes made)
(22,604 missing values generated)
(4,303 real changes made)
(2,193 real changes made)
(3,361 real changes made, 3,361 to missing)
(22,578 missing values generated)
(26,907 missing values generated)
(2,237 real changes made)
(2,092 real changes made)
(2,237 real changes made)
(2,092 real changes made)
(2,758 real changes made)
(26,907 missing values generated)
(2,237 real changes made)
(2,092 real changes made)
(4,329 real changes made)
(24,149 real changes made)
(22,578 missing values generated)
(4,329 real changes made)
(2,237 real changes made)
(3,376 real changes made, 3,376 to missing)
(22,593 missing values generated)
(26,907 missing values generated)
(2,216 real changes made)
(2,098 real changes made)
(2,216 real changes made)
(2,098 real changes made)
(2,744 real changes made)
(26,907 missing values generated)
(2,216 real changes made)
(2,098 real changes made)
(4,314 real changes made)
(24,163 real changes made)
(22,593 missing values generated)
(4,314 real changes made)
(2,216 real changes made)
(3,407 real changes made, 3,407 to missing)
(22,624 missing values generated)
(26,907 missing values generated)
(2,218 real changes made)
(2,065 real changes made)
(2,218 real changes made)
(2,065 real changes made)
(2,753 real changes made)
(26,907 missing values generated)
(2,218 real changes made)
(2,065 real changes made)
(4,283 real changes made)
(24,154 real changes made)
(22,624 missing values generated)
(4,283 real changes made)
(2,218 real changes made)
(3,394 real changes made, 3,394 to missing)
(22,611 missing values generated)
(26,907 missing values generated)
(2,207 real changes made)
(2,089 real changes made)
(2,207 real changes made)
(2,089 real changes made)
(2,739 real changes made)
(26,907 missing values generated)
(2,207 real changes made)
(2,089 real changes made)
(4,296 real changes made)
(24,168 real changes made)
(22,611 missing values generated)
(4,296 real changes made)
(2,207 real changes made)
(3,412 real changes made, 3,412 to missing)
(22,629 missing values generated)
(26,907 missing values generated)
(2,203 real changes made)
(2,075 real changes made)
(2,203 real changes made)
(2,075 real changes made)
(2,683 real changes made)
(26,907 missing values generated)
(2,203 real changes made)
(2,075 real changes made)
(4,278 real changes made)
(24,224 real changes made)
(22,629 missing values generated)
(4,278 real changes made)
(2,203 real changes made)
(3,364 real changes made, 3,364 to missing)
(22,581 missing values generated)
(26,907 missing values generated)
(2,234 real changes made)
(2,092 real changes made)
(2,234 real changes made)
(2,092 real changes made)
(2,683 real changes made)
(26,907 missing values generated)
(2,234 real changes made)
(2,092 real changes made)
(4,326 real changes made)
(24,224 real changes made)
(22,581 missing values generated)
(4,326 real changes made)
(2,234 real changes made)
(3,423 real changes made, 3,423 to missing)
(22,640 missing values generated)
(26,907 missing values generated)
(2,177 real changes made)
(2,090 real changes made)
(2,177 real changes made)
(2,090 real changes made)
(2,728 real changes made)
(26,907 missing values generated)
(2,177 real changes made)
(2,090 real changes made)
(4,267 real changes made)
(24,179 real changes made)
(22,640 missing values generated)
(4,267 real changes made)
(2,177 real changes made)
(3,425 real changes made, 3,425 to missing)
(22,642 missing values generated)
(26,907 missing values generated)
(2,188 real changes made)
(2,077 real changes made)
(2,188 real changes made)
(2,077 real changes made)
(2,664 real changes made)
(26,907 missing values generated)
(2,188 real changes made)
(2,077 real changes made)
(4,265 real changes made)
(24,243 real changes made)
(22,642 missing values generated)
(4,265 real changes made)
(2,188 real changes made)
(3,342 real changes made, 3,342 to missing)
(22,559 missing values generated)
(26,907 missing values generated)
(2,213 real changes made)
(2,135 real changes made)
(2,213 real changes made)
(2,135 real changes made)
(2,766 real changes made)
(26,907 missing values generated)
(2,213 real changes made)
(2,135 real changes made)
(4,348 real changes made)
(24,141 real changes made)
(22,559 missing values generated)
(4,348 real changes made)
(2,213 real changes made)
(3,404 real changes made, 3,404 to missing)
(22,621 missing values generated)
(26,907 missing values generated)
(2,193 real changes made)
(2,093 real changes made)
(2,193 real changes made)
(2,093 real changes made)
(2,687 real changes made)
(26,907 missing values generated)
(2,193 real changes made)
(2,093 real changes made)
(4,286 real changes made)
(24,220 real changes made)
(22,621 missing values generated)
(4,286 real changes made)
(2,193 real changes made)
(3,353 real changes made, 3,353 to missing)
(22,570 missing values generated)
(26,907 missing values generated)
(2,201 real changes made)
(2,136 real changes made)
(2,201 real changes made)
(2,136 real changes made)
(2,800 real changes made)
(26,907 missing values generated)
(2,201 real changes made)
(2,136 real changes made)
(4,337 real changes made)
(24,107 real changes made)
(22,570 missing values generated)
(4,337 real changes made)
(2,201 real changes made)

. 
. replace index_date = index_date_28
(26,907 real changes made)

. drop index_date_28

. gen egfr15_date=.
(26,907 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022 n
> ov2022 dec2022 jan2023"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatin
> ine_`x'<15 & date("01`x'", "DMY")>index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen index_date_esrd = index_date

. gen esrd_date = egfr15_date
(26,907 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if esrd_date==.
(2,583 real changes made)

. gen esrd = 0

. replace esrd = 1 if esrd_date!=.
(2,583 real changes made)

. label var esrd "Kidney failure"

. gen esrd_time = (esrd_date - index_date_esrd)
(24,324 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(24,324 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/1096=8      ///
>                                                 1097/max=9
(esrd_time_cat: 2577 changes made)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"           
>            ///
>                                                         3 "1 to 28 days"     
>    ///
>                                                         4 "20 to 90 days"    
>    ///
>                                                         5 "91 to 180 days"   
>    ///
>                                                         6 "181 to 365 days"  
>    ///
>                                                         7 "366 to 730 days"  
>    ///
>                                                         8 "731 to 1096 days" 
>    ///
>                                                         9 ">1096 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 covid_severit
> y  ///
>                                                                 covid_aki    
>            {
  2.                                                                 by `exposu
> re',sort: sum esrd_time, de
  3.                                                                 tab esrd_t
> ime_cat `exposure', m col chi
  4.                                                                 }

-------------------------------------------------------------------------------
-> case = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%           38              1       Obs               1,859
25%          139              1       Sum of Wgt.       1,859

50%          337                      Mean           370.1442
                        Largest       Std. Dev.      267.0389
75%          568           1031
90%          754           1045       Variance       71309.78
95%          865           1045       Skewness       .4569445
99%          987           1049       Kurtosis       2.268825

-------------------------------------------------------------------------------
-> case = SARS-CoV-2

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            6              1
10%           39              1       Obs                 724
25%        137.5              1       Sum of Wgt.         724

50%        330.5                      Mean           366.5718
                        Largest       Std. Dev.      262.3331
75%        572.5           1003
90%          740           1008       Variance       68818.67
95%          831           1011       Skewness       .3930126
99%          958           1020       Kurtosis       2.132398


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |         case
   esrd_time_cat | Historica  SARS-CoV- |     Total
-----------------+----------------------+----------
    1 to 28 days |       165         60 |       225 
                 |      0.86       0.78 |      0.84 
-----------------+----------------------+----------
   20 to 90 days |       178         73 |       251 
                 |      0.93       0.95 |      0.93 
-----------------+----------------------+----------
  91 to 180 days |       209         93 |       302 
                 |      1.09       1.21 |      1.12 
-----------------+----------------------+----------
 181 to 365 days |       447        163 |       610 
                 |      2.33       2.12 |      2.27 
-----------------+----------------------+----------
 366 to 730 days |       644        258 |       902 
                 |      3.35       3.36 |      3.35 
-----------------+----------------------+----------
731 to 1096 days |       216         77 |       293 
                 |      1.12       1.00 |      1.09 
-----------------+----------------------+----------
               . |    17,358      6,966 |    24,324 
                 |     90.33      90.59 |     90.40 
-----------------+----------------------+----------
           Total |    19,217      7,690 |    26,907 
                 |    100.00     100.00 |    100.00 

          Pearson chi2(6) =   2.9932   Pr = 0.810

-------------------------------------------------------------------------------
-> covid_severity = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%           38              1       Obs               1,859
25%          139              1       Sum of Wgt.       1,859

50%          337                      Mean           370.1442
                        Largest       Std. Dev.      267.0389
75%          568           1031
90%          754           1045       Variance       71309.78
95%          865           1045       Skewness       .4569445
99%          987           1049       Kurtosis       2.268825

-------------------------------------------------------------------------------
-> covid_severity = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            7              1
10%           44              1       Obs                 587
25%          130              1       Sum of Wgt.         587

50%          324                      Mean           362.7257
                        Largest       Std. Dev.      262.4781
75%          574            977
90%          733           1003       Variance       68894.76
95%          825           1008       Skewness       .4111875
99%          958           1011       Kurtosis       2.105639

-------------------------------------------------------------------------------
-> covid_severity = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            7              1
10%           29              4       Obs                  69
25%          235              7       Sum of Wgt.          69

50%          350                      Mean           374.2029
                        Largest       Std. Dev.      240.0603
75%          541            810
90%          732            826       Variance       57628.93
95%          810            873       Skewness       .2825456
99%          990            990       Kurtosis       2.546011

-------------------------------------------------------------------------------
-> covid_severity = Critical care COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           10              1       Obs                  68
25%          155              1       Sum of Wgt.          68

50%          338                      Mean           392.0294
                        Largest       Std. Dev.      284.1072
75%          618            865
90%          812            866       Variance       80716.92
95%          865            907       Skewness       .3087099
99%         1020           1020       Kurtosis       2.006799


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |             SARS-CoV-2 severity
   esrd_time_cat | Historica  Non-hospi  Hospitali  Critical  |     Total
-----------------+--------------------------------------------+----------
    1 to 28 days |       165         47          5          8 |       225 
                 |      0.86       0.76       0.71       1.04 |      0.84 
-----------------+--------------------------------------------+----------
   20 to 90 days |       178         59          8          6 |       251 
                 |      0.93       0.95       1.14       0.78 |      0.93 
-----------------+--------------------------------------------+----------
  91 to 180 days |       209         88          0          5 |       302 
                 |      1.09       1.41       0.00       0.65 |      1.12 
-----------------+--------------------------------------------+----------
 181 to 365 days |       447        123         24         16 |       610 
                 |      2.33       1.98       3.43       2.09 |      2.27 
-----------------+--------------------------------------------+----------
 366 to 730 days |       644        211         25         22 |       902 
                 |      3.35       3.39       3.57       2.87 |      3.35 
-----------------+--------------------------------------------+----------
731 to 1096 days |       216         59          7         11 |       293 
                 |      1.12       0.95       1.00       1.43 |      1.09 
-----------------+--------------------------------------------+----------
               . |    17,358      5,636        631        699 |    24,324 
                 |     90.33      90.57      90.14      91.13 |     90.40 
-----------------+--------------------------------------------+----------
           Total |    19,217      6,223        700        767 |    26,907 
                 |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(18) =  25.8315   Pr = 0.104

-------------------------------------------------------------------------------
-> covid_aki = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%           38              1       Obs               1,859
25%          139              1       Sum of Wgt.       1,859

50%          337                      Mean           370.1442
                        Largest       Std. Dev.      267.0389
75%          568           1031
90%          754           1045       Variance       71309.78
95%          865           1045       Skewness       .4569445
99%          987           1049       Kurtosis       2.268825

-------------------------------------------------------------------------------
-> covid_aki = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            5              1
10%           42              1       Obs                 617
25%          133              1       Sum of Wgt.         617

50%          324                      Mean           363.0989
                        Largest       Std. Dev.      260.9956
75%          572            973
90%          728            977       Variance       68118.72
95%          825           1011       Skewness         .38394
99%          949           1020       Kurtosis       2.092125

-------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            7              1
10%           29              4       Obs                  69
25%          230              7       Sum of Wgt.          69

50%          349                      Mean           371.3478
                        Largest       Std. Dev.      244.2006
75%          541            793
90%          733            810       Variance       59633.94
95%          793            873       Skewness       .3150816
99%          990            990       Kurtosis       2.431611

-------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID-AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           21             21
10%           40             23       Obs                  38
25%          150             40       Sum of Wgt.          38

50%          369                      Mean           414.2895
                        Largest       Std. Dev.      313.8307
75%          640            865
90%          865            912       Variance       98489.72
95%         1003           1003       Skewness       .4151486
99%         1008           1008       Kurtosis       1.863379


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |        COVID-19 acute kidney injury
   esrd_time_cat | Historica  Non-hospi  Hospitali  Hospitali |     Total
-----------------+--------------------------------------------+----------
    1 to 28 days |       165         52          5          3 |       225 
                 |      0.86       0.79       0.68       0.78 |      0.84 
-----------------+--------------------------------------------+----------
   20 to 90 days |       178         62          8          3 |       251 
                 |      0.93       0.94       1.08       0.78 |      0.93 
-----------------+--------------------------------------------+----------
  91 to 180 days |       209         85          1          7 |       302 
                 |      1.09       1.29       0.14       1.81 |      1.12 
-----------------+--------------------------------------------+----------
 181 to 365 days |       447        133         24          6 |       610 
                 |      2.33       2.03       3.24       1.55 |      2.27 
-----------------+--------------------------------------------+----------
 366 to 730 days |       644        225         23         10 |       902 
                 |      3.35       3.43       3.11       2.59 |      3.35 
-----------------+--------------------------------------------+----------
731 to 1096 days |       216         60          8          9 |       293 
                 |      1.12       0.91       1.08       2.33 |      1.09 
-----------------+--------------------------------------------+----------
               . |    17,358      5,947        671        348 |    24,324 
                 |     90.33      90.60      90.68      90.16 |     90.40 
-----------------+--------------------------------------------+----------
           Total |    19,217      6,564        740        386 |    26,907 
                 |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(18) =  25.2671   Pr = 0.118

. gen exit_date_esrd = esrd_date
(24,324 missing values generated)

. format exit_date_esrd %td

. gen end_date = date("2023-01-31", "YMD") if case==1
(19,217 missing values generated)

. replace end_date = date("2020-01-31", "YMD") if case==0
(19,217 real changes made)

. format end_date %td

. replace exit_date_esrd = min(deregistered_date, death_date, end_date) if esrd
> _date==.
(24,324 real changes made)

. gen esrd_denominator = 1

. gen follow_up_time_esrd = (exit_date_esrd - index_date_esrd)

. label var follow_up_time_esrd "Follow-up time (Days)"

. gen follow_up_cat_esrd = follow_up_time_esrd

. recode follow_up_cat_esrd       min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0=3                     ///
>                                                 1/365=4         ///
>                                                 366/730=5       ///
>                                                 731/1096=6      ///          
>                            
>                                                 1097/max=7
(follow_up_cat_esrd: 26885 changes made)

. label define follow_up_cat_esrd         1 "<-29 days"   ///
>                                                         2 "-28 to -1 days"   
>            ///
>                                                         3 "0 days"           
>                    ///
>                                                         4 "1 to 365 days"    
>            ///
>                                                         5 "366 to 730 days"  
>    ///
>                                                         6 "731 to 1096 days" 
>    ///
>                                                         7 ">1096 days"

. label values follow_up_cat_esrd follow_up_cat_esrd

. label var follow_up_cat_esrd "Follow_up time"

. tab case follow_up_cat_esrd

                      |               Follow_up time
                 case | -28 to -1     0 days  1 to 365   366 to 73 |     Total
----------------------+--------------------------------------------+----------
Historical comparator |       112          3      4,196      6,229 |    19,217 
           SARS-CoV-2 |        57          2      1,698      2,577 |     7,690 
----------------------+--------------------------------------------+----------
                Total |       169          5      5,894      8,806 |    26,907 


                      | Follow_up
                      |    time
                 case | 731 to 10 |     Total
----------------------+-----------+----------
Historical comparator |     8,677 |    19,217 
           SARS-CoV-2 |     3,356 |     7,690 
----------------------+-----------+----------
                Total |    12,033 |    26,907 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |               Follow_up time
  replacement therapy | -28 to -1     0 days  1 to 365   366 to 73 |     Total
----------------------+--------------------------------------------+----------
Historical comparator |       112          3      4,196      6,229 |    19,217 
Non-hospitalised SARS |        49          1      1,352      2,113 |     6,243 
No KRT hospitalised C |         4          0        161        236 |       703 
KRT hospitalised COVI |         4          1        185        228 |       744 
----------------------+--------------------------------------------+----------
                Total |       169          5      5,894      8,806 |    26,907 


                      | Follow_up
      COVID-19 kidney |    time
  replacement therapy | 731 to 10 |     Total
----------------------+-----------+----------
Historical comparator |     8,677 |    19,217 
Non-hospitalised SARS |     2,728 |     6,243 
No KRT hospitalised C |       302 |       703 
KRT hospitalised COVI |       326 |       744 
----------------------+-----------+----------
                Total |    12,033 |    26,907 

. drop if follow_up_time_esrd<1
(174 observations deleted)

. drop if follow_up_time_esrd>1096
(0 observations deleted)

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,196      6,229      8,677 |    19,102 
           SARS-CoV-2 |     1,698      2,577      3,356 |     7,631 
----------------------+---------------------------------+----------
                Total |     5,894      8,806     12,033 |    26,733 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |          Follow_up time
  replacement therapy | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,196      6,229      8,677 |    19,102 
Non-hospitalised SARS |     1,352      2,113      2,728 |     6,193 
No KRT hospitalised C |       161        236        302 |       699 
KRT hospitalised COVI |       185        228        326 |       739 
----------------------+---------------------------------+----------
                Total |     5,894      8,806     12,033 |    26,733 

. gen follow_up_years_esrd = follow_up_time_esrd/365.25

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(26,733 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022 n
> ov2022 dec2022 jan2023"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_h
> alf_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>ind
> ex_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(46 real changes made)
(85 real changes made)
(92 real changes made)
(130 real changes made)
(133 real changes made)
(142 real changes made)
(151 real changes made)
(168 real changes made)
(184 real changes made)
(154 real changes made)
(177 real changes made)
(183 real changes made)
(178 real changes made)
(187 real changes made)
(161 real changes made)
(193 real changes made)
(179 real changes made)
(178 real changes made)
(156 real changes made)
(168 real changes made)
(146 real changes made)
(143 real changes made)
(170 real changes made)
(130 real changes made)
(158 real changes made)
(120 real changes made)
(135 real changes made)
(113 real changes made)
(121 real changes made)
(133 real changes made)
(0 real changes made)
(0 real changes made)
(14 real changes made)
(25 real changes made)
(26 real changes made)
(53 real changes made)
(52 real changes made)
(52 real changes made)
(63 real changes made)
(61 real changes made)
(72 real changes made)
(68 real changes made)
(75 real changes made)
(62 real changes made)
(78 real changes made)
(71 real changes made)
(78 real changes made)
(62 real changes made)
(66 real changes made)
(66 real changes made)
(69 real changes made)
(58 real changes made)
(51 real changes made)
(64 real changes made)
(59 real changes made)
(62 real changes made)
(64 real changes made)
(49 real changes made)
(57 real changes made)
(47 real changes made)
(42 real changes made)
(44 real changes made)
(39 real changes made)
(37 real changes made)
(37 real changes made)
(50 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(1,901 real changes made)

. gen egfr_half = 0

. replace egfr_half = 1 if egfr_half_date!=.
(8,188 real changes made)

. label var egfr_half "50% reduction in eGFR"

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(12,019 real changes made, 12,019 to missing)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(18,545 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date) if e
> gfr_half_date==. & index_date_egfr_half!=.
(7,649 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(12,019 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days
> )"

. gen egfr_half_denominator = 0

. replace egfr_half_denominator = 1 if index_date_egfr_half!=.
(14,714 real changes made)

. gen follow_up_years_egfr_half = follow_up_time_egfr_half/365.25
(12,019 missing values generated)

. 
. * AKI (or ESRD)
. gen index_date_aki = index_date

. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(24,036 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(2,299 real changes made)

. gen aki = 0

. replace aki = 1 if aki_date!=.
(4,996 real changes made)

. label var aki "Acute kidney injury"

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(21,737 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date)  if aki_da
> te==.
(21,737 real changes made)

. gen aki_denominator = 1

. gen follow_up_time_aki = (exit_date_aki - index_date_aki)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. gen follow_up_years_aki = follow_up_time_aki/365.25

. 
. * Exit date (death)
. gen index_date_death = index_date

. gen exit_date_death = death_date
(25,154 missing values generated)

. gen death = 0

. replace death = 1 if death_date!=.
(1,579 real changes made)

. label var death "Death"

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(25,154 real changes made)

. gen death_denominator = 1

. gen follow_up_time_death = (exit_date_death - index_date_death)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. gen follow_up_years_death = follow_up_time_death/365.25

. 
. *Outcomes stratified by time period
. 
. local outcome "esrd egfr_half aki death"

. foreach out of local outcome {
  2. *0-29 days
. gen `out'_date29 = `out'_date if `out'_date < (index_date_`out' + 30) 
  3. gen exit_date29_`out' = `out'_date29
  4. gen index_date29_`out' = index_date_`out'
  5. format exit_date29_`out' %td
  6. replace exit_date29_`out' = min(deregistered_date, death_date, end_date, (
> index_date_`out' + 29)) if `out'_date29==.
  7. *stset exit_date29_`out', fail(`out'_date29) origin(index_date29_`out') id
> (unique) scale(365.25)
. *30-89 days
. gen `out'_date89 = `out'_date if `out'_date < (index_date_`out' + 90) 
  8. gen exit_date89_`out' = `out'_date89
  9. gen index_date89_`out' = index_date_`out' + 30
 10. format exit_date89_`out' %td
 11. replace exit_date89_`out' = min(deregistered_date, death_date, end_date, (
> index_date_`out' + 89)) if `out'_date89==.
 12. *stset exit_date89_`out', fail(`out'_date89) origin(index_date89_`out') id
> (unique) scale(365.25)
. *90-179 days
. gen `out'_date179 = `out'_date if `out'_date < (index_date_`out' + 180) 
 13. gen exit_date179_`out' = `out'_date179
 14. gen index_date179_`out' = index_date_`out' + 90
 15. format exit_date179_`out' %td
 16. replace exit_date179_`out' = min(deregistered_date, death_date, end_date, 
> (index_date_`out' + 179)) if `out'_date179==.
 17. *stset exit_date179_`out', fail(`out'_date179) origin(index_date179_`out')
>  id(unique) scale(365.25)
. *180+ days
. gen index_datemax_`out' = index_date_`out' + 180
 18. gen exit_datemax_`out' = exit_date_`out'
 19. gen `out'_datemax = `out'_date
 20. *stset exit_date_`out', fail(`out'_date) origin(index_datemax_`out') id(un
> ique) scale(365.25)
. }       
(26,503 missing values generated)
(26,503 missing values generated)
(26,503 real changes made)
(26,260 missing values generated)
(26,260 missing values generated)
(26,260 real changes made)
(25,956 missing values generated)
(25,956 missing values generated)
(25,956 real changes made)
(24,150 missing values generated)
(25,111 missing values generated)
(25,111 missing values generated)
(12,019 missing values generated)
(25,111 real changes made)
(23,571 missing values generated)
(23,571 missing values generated)
(12,019 missing values generated)
(23,571 real changes made)
(22,074 missing values generated)
(22,074 missing values generated)
(12,019 missing values generated)
(22,074 real changes made)
(12,019 missing values generated)
(10,896 missing values generated)
(18,545 missing values generated)
(25,573 missing values generated)
(25,573 missing values generated)
(25,573 real changes made)
(25,199 missing values generated)
(25,199 missing values generated)
(25,199 real changes made)
(24,729 missing values generated)
(24,729 missing values generated)
(24,729 real changes made)
(21,737 missing values generated)
(26,671 missing values generated)
(26,671 missing values generated)
(26,671 real changes made)
(26,533 missing values generated)
(26,533 missing values generated)
(26,533 real changes made)
(26,341 missing values generated)
(26,341 missing values generated)
(26,341 real changes made)
(25,154 missing values generated)

.         
. /*stset exit_date_esrd, fail(esrd_date) origin(index_date_esrd) id(unique) sc
> ale(365.25)
> tab _st follow_up_cat_esrd
> 
> foreach outcome of varlist esrd egfr_half aki death {
>         stset exit_date_`outcome', fail(`outcome'_date) origin(index_date_`ou
> tcome') id(unique) scale(365.25)
>         bysort case: egen total_follow_up_`outcome' = total(_t)
>         forvalues i=0/1 {
>         di "Denominator case=`i' `outcome':"
>         count if case==`i' & `outcome'_denominator==1
>         local denominator = r(N)
>         di "Denominator(_st=1) case=`i' `outcome':"
>         count if case==`i' & `outcome'_denominator==1 & _st==1
>         local st_denominator = r(N)
>         di "Events case=`i' `outcome':"
>         count if case==`i' & `outcome'==1
>         local event = r(N)
>         di "Events (_st=1) case=`i' `outcome':"
>         count if case==`i' & `outcome'==1 & _st==1
>         local st_event = r(N)
>         di "Total follow_up case=`i' `outcome':"
>         su total_follow_up_`outcome' if case==`i'
>         local person_year = r(mean)
>         local rate = 100000*(`event'/`person_year')
>         di "Rate case=`i' `outcome':"
>         di `rate'
>         local st_rate = 100000*(`st_event'/`person_year')
>         di "Rate (_st=1) case=`i' `outcome':"
>         di `st_rate'
>         }
>         drop total_follow_up_`outcome'
> }*/
. 
. save ./output/analysis_2017.dta, replace
(note: file ./output/analysis_2017.dta not found)
file ./output/analysis_2017.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/analysis_2017.log
  log type:  text
 closed on:  20 Apr 2024, 23:25:29
-------------------------------------------------------------------------------
