------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_hospitalised.log
  log type:  text
 opened on:  30 Mar 2023, 17:04:49

. 
. capture noisily import delimited ./output/input_covid_hospitalised.csv, clear
(encoding automatically selected: ISO-8859-9)
(118 vars, 50,000 obs)

. tempfile covid_hospitalised

. save `covid_hospitalised', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_3abc_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_3abc_000001.tmp saved as .dta format

. di "COVID-19 hospitalised:"
COVID-19 hospitalised:

. safecount
  50,000

. 
. capture noisily import delimited ./output/input_pneumonia_hospitalised.csv, clear
(encoding automatically selected: ISO-8859-9)
(114 vars, 50,000 obs)

. tempfile pneumonia_hospitalised

. save `pneumonia_hospitalised', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_3abc_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_3abc_000002.tmp saved as .dta format

. di "Pneumonia hospitalised:"
Pneumonia hospitalised:

. safecount
  50,000

. 
. append using `covid_hospitalised', force

. 
. **ID
. * Need to create unique identifiers as individuals may be in both covid_hospitalised and pneumonia_hospitalised so will have the s
> ame patient_id
. gen unique = _n

. label var unique "Unique ID"

. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      5,020        5.02        5.02
 1 Most deprived |     18,979       18.98       24.00
               2 |     19,106       19.11       43.11
               3 |     18,949       18.95       62.05
               4 |     18,989       18.99       81.04
5 Least deprived |     18,957       18.96      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. drop if imd==0
(5,020 observations deleted)

. safetab imd

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |     18,979       19.98       19.98
               2 |     19,106       20.12       40.10
               3 |     18,949       19.95       60.05
               4 |     18,989       19.99       80.04
5 Least deprived |     18,957       19.96      100.00
-----------------+-----------------------------------
           Total |     94,980      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(94,979 missing values generated)

. replace stp1 = sum(stp1)
(94,979 real changes made)

. drop stp

. rename stp1 stp

. label define stp        1 "1"   ///
>                                         2 "2"   ///
>                                         3 "3"   ///
>                                         4 "4"   ///
>                                         5 "5"   ///
>                                         6 "6"   ///
>                                         7 "7"   ///
>                                         8 "8"   ///
>                                         9 "9"   ///
>                                         10 "10" ///
>                                         11 "11" ///                                     
>                                         12 "12" ///
>                                         13 "13" ///
>                                         14 "14" ///
>                                         15 "15" ///
>                                         16 "16" ///
>                                         17 "17" ///
>                                         18 "18" ///
>                                         19 "19" ///
>                                         20 "20" ///
>                                         21 "21" ///                                     
>                                         22 "22" ///
>                                         23 "23" ///
>                                         24 "24" ///
>                                         25 "25" ///
>                                         26 "26" ///
>                                         27 "27" ///
>                                         28 "28" ///
>                                         29 "29" ///
>                                         30 "30" ///
>                                         31 "31" 

. label values stp stp

. label var stp "STP"

. safetab stp

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     94,980      100.00      100.00
------------+-----------------------------------
      Total |     94,980      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(85,572 missing values generated)

. replace region = 2 if region_string=="East"
(9,416 real changes made)

. replace region = 3 if region_string=="London"
(19,007 real changes made)

. replace region = 4 if region_string=="North East"
(9,504 real changes made)

. replace region = 5 if region_string=="North West"
(9,664 real changes made)

. replace region = 6 if region_string=="South East"
(9,600 real changes made)

. replace region = 7 if region_string=="South West"
(9,637 real changes made)

. replace region = 8 if region_string=="West Midlands"
(9,386 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(9,358 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,408        9.91        9.91
                    East |      9,416        9.91       19.82
                  London |     19,007       20.01       39.83
              North East |      9,504       10.01       49.84
              North West |      9,664       10.17       60.01
              South East |      9,600       10.11       70.12
              South West |      9,637       10.15       80.27
           West Midlands |      9,386        9.88       90.15
Yorkshire and The Humber |      9,358        9.85      100.00
-------------------------+-----------------------------------
                   Total |     94,980      100.00

. drop if region==10
(0 observations deleted)

. safetab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,408        9.91        9.91
                    East |      9,416        9.91       19.82
                  London |     19,007       20.01       39.83
              North East |      9,504       10.01       49.84
              North West |      9,664       10.17       60.01
              South East |      9,600       10.11       70.12
              South West |      9,637       10.15       80.27
           West Midlands |      9,386        9.88       90.15
Yorkshire and The Humber |      9,358        9.85      100.00
-------------------------+-----------------------------------
                   Total |     94,980      100.00

. 
. * Create new index date variable 28 days after case_index_date (i.e. to exclude anyone who does not survive to start follow-up)
. gen index_date = date(patient_index_date, "YMD")
(7,379 missing values generated)

. format index_date %td

. gen index_date_28 = index_date + 28
(7,379 missing values generated)

. format index_date_28 %td

. 
. * Deregistered before index_date + 29 days
. gen deregistered_date = date(date_deregistered, "YMD")
(28,710 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date_28 + 1
(64,200 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(26,457 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(2,242 observations deleted)

. replace krt_date = index_date_28 + 1 if krt_date < index_date_28 + 1
(109 real changes made)

. 
. * Death before index_date + 29 days (i.e. only include people who survived beyond 28 days after admission)
. drop if deceased==1
(309 observations deleted)

. drop deceased

. gen death_date1 = date(death_date, "YMD")
(25,422 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28 + 1
(1,754 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased within 28 days of index date"

. label values deceased deceased

. tab covid deceased

           |       deceased
     covid | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,099      1,021 |    14,120 
-----------+----------------------+----------
     Total |    13,099      1,021 |    14,120 

. tab pneumonia deceased

           |       deceased
 pneumonia | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,376        733 |    14,109 
-----------+----------------------+----------
     Total |    13,376        733 |    14,109 

. drop if deceased==1
(1,754 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators only
. gen sex1 = 1 if sex=="M"
(13,530 missing values generated)

. replace sex1 = 0 if sex=="F"
(13,530 real changes made)

. drop sex

. rename sex1 sex

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 ///
>                                                                                                 baseline_creatinine_mar2017 ///
>                                                                                                 baseline_creatinine_apr2017 ///
>                                                                                                 baseline_creatinine_may2017 ///
>                                                                                                 baseline_creatinine_jun2017 ///
>                                                                                                 baseline_creatinine_jul2017 ///
>                                                                                                 baseline_creatinine_aug2017 ///
>                                                                                                 baseline_creatinine_sep2017 ///
>                                                                                                 baseline_creatinine_oct2017 ///
>                                                                                                 baseline_creatinine_nov2017 ///
>                                                                                                 baseline_creatinine_dec2017 ///
>                                                                                                 baseline_creatinine_jan2018 ///
>                                                                                                 baseline_creatinine_feb2018 ///
>                                                                                                 baseline_creatinine_mar2018 ///
>                                                                                                 baseline_creatinine_apr2018 ///
>                                                                                                 baseline_creatinine_may2018 ///
>                                                                                                 baseline_creatinine_jun2018 ///
>                                                                                                 baseline_creatinine_jul2018 ///
>                                                                                                 baseline_creatinine_aug2018 ///
>                                                                                                 baseline_creatinine_sep2018 ///
>                                                                                                 baseline_creatinine_oct2018 ///
>                                                                                                 baseline_creatinine_nov2018 ///
>                                                                                                 baseline_creatinine_dec2018 ///
>                                                                                                 baseline_creatinine_jan2019 ///
>                                                                                                 baseline_creatinine_feb2019 ///
>                                                                                                 baseline_creatinine_mar2019 ///
>                                                                                                 baseline_creatinine_apr2019 ///
>                                                                                                 baseline_creatinine_may2019 ///
>                                                                                                 baseline_creatinine_jun2019 ///
>                                                                                                 baseline_creatinine_jul2019 ///
>                                                                                                 baseline_creatinine_aug2019 ///
>                                                                                                 baseline_creatinine_sep2019 ///
>                                                                                                 baseline_creatinine_feb2020 ///
>                                                                                                 baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 ///
>                                                                                                 baseline_creatinine_feb2022 ///
>                                                                                                 baseline_creatinine_mar2022 ///
>                                                                                                 baseline_creatinine_apr2022 ///
>                                                                                                 baseline_creatinine_may2022 ///
>                                                                                                 baseline_creatinine_jun2022 ///
>                                                                                                 baseline_creatinine_jul2022 ///
>                                                                                                 baseline_creatinine_aug2022 ///
>                                                                                                 baseline_creatinine_sep2022 ///
>                                                                                                 baseline_creatinine_oct2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(5,868 real changes made, 5,868 to missing)
(18,967 missing values generated)
(26,475 missing values generated)
(3,874 real changes made)
(3,634 real changes made)
(3,874 real changes made)
(3,634 real changes made)
(4,737 real changes made)
(26,475 missing values generated)
(3,874 real changes made)
(3,634 real changes made)
(7,508 real changes made)
(21,738 real changes made)
(18,967 missing values generated)
(7,433 real changes made)
(3,874 real changes made)
(5,804 real changes made, 5,804 to missing)
(18,903 missing values generated)
(26,475 missing values generated)
(3,910 real changes made)
(3,662 real changes made)
(3,910 real changes made)
(3,662 real changes made)
(4,794 real changes made)
(26,475 missing values generated)
(3,910 real changes made)
(3,662 real changes made)
(7,572 real changes made)
(21,681 real changes made)
(18,903 missing values generated)
(7,482 real changes made)
(3,910 real changes made)
(5,967 real changes made, 5,967 to missing)
(19,066 missing values generated)
(26,475 missing values generated)
(3,753 real changes made)
(3,656 real changes made)
(3,753 real changes made)
(3,656 real changes made)
(4,715 real changes made)
(26,475 missing values generated)
(3,753 real changes made)
(3,656 real changes made)
(7,409 real changes made)
(21,760 real changes made)
(19,066 missing values generated)
(7,328 real changes made)
(3,753 real changes made)
(5,901 real changes made, 5,901 to missing)
(19,000 missing values generated)
(26,475 missing values generated)
(3,824 real changes made)
(3,651 real changes made)
(3,824 real changes made)
(3,651 real changes made)
(4,739 real changes made)
(26,475 missing values generated)
(3,824 real changes made)
(3,651 real changes made)
(7,475 real changes made)
(21,736 real changes made)
(19,000 missing values generated)
(7,391 real changes made)
(3,824 real changes made)
(5,853 real changes made, 5,853 to missing)
(18,952 missing values generated)
(26,475 missing values generated)
(3,892 real changes made)
(3,631 real changes made)
(3,892 real changes made)
(3,631 real changes made)
(4,757 real changes made)
(26,475 missing values generated)
(3,892 real changes made)
(3,631 real changes made)
(7,523 real changes made)
(21,718 real changes made)
(18,952 missing values generated)
(7,428 real changes made)
(3,892 real changes made)
(5,913 real changes made, 5,913 to missing)
(19,012 missing values generated)
(26,475 missing values generated)
(3,818 real changes made)
(3,645 real changes made)
(3,818 real changes made)
(3,645 real changes made)
(4,763 real changes made)
(26,475 missing values generated)
(3,818 real changes made)
(3,645 real changes made)
(7,463 real changes made)
(21,712 real changes made)
(19,012 missing values generated)
(7,386 real changes made)
(3,818 real changes made)
(5,860 real changes made, 5,860 to missing)
(18,959 missing values generated)
(26,475 missing values generated)
(3,824 real changes made)
(3,692 real changes made)
(3,824 real changes made)
(3,692 real changes made)
(4,689 real changes made)
(26,475 missing values generated)
(3,824 real changes made)
(3,692 real changes made)
(7,516 real changes made)
(21,786 real changes made)
(18,959 missing values generated)
(7,430 real changes made)
(3,824 real changes made)
(5,930 real changes made, 5,930 to missing)
(19,029 missing values generated)
(26,475 missing values generated)
(3,777 real changes made)
(3,669 real changes made)
(3,777 real changes made)
(3,669 real changes made)
(4,720 real changes made)
(26,475 missing values generated)
(3,777 real changes made)
(3,669 real changes made)
(7,446 real changes made)
(21,755 real changes made)
(19,029 missing values generated)
(7,364 real changes made)
(3,777 real changes made)
(5,901 real changes made, 5,901 to missing)
(19,000 missing values generated)
(26,475 missing values generated)
(3,792 real changes made)
(3,683 real changes made)
(3,792 real changes made)
(3,683 real changes made)
(4,789 real changes made)
(26,475 missing values generated)
(3,792 real changes made)
(3,683 real changes made)
(7,475 real changes made)
(21,686 real changes made)
(19,000 missing values generated)
(7,385 real changes made)
(3,792 real changes made)
(5,856 real changes made, 5,856 to missing)
(18,955 missing values generated)
(26,475 missing values generated)
(3,776 real changes made)
(3,744 real changes made)
(3,776 real changes made)
(3,744 real changes made)
(4,797 real changes made)
(26,475 missing values generated)
(3,776 real changes made)
(3,744 real changes made)
(7,520 real changes made)
(21,678 real changes made)
(18,955 missing values generated)
(7,428 real changes made)
(3,776 real changes made)
(5,924 real changes made, 5,924 to missing)
(19,023 missing values generated)
(26,475 missing values generated)
(3,753 real changes made)
(3,699 real changes made)
(3,753 real changes made)
(3,699 real changes made)
(4,696 real changes made)
(26,475 missing values generated)
(3,753 real changes made)
(3,699 real changes made)
(7,452 real changes made)
(21,779 real changes made)
(19,023 missing values generated)
(7,377 real changes made)
(3,753 real changes made)
(5,909 real changes made, 5,909 to missing)
(19,008 missing values generated)
(26,475 missing values generated)
(3,871 real changes made)
(3,596 real changes made)
(3,871 real changes made)
(3,596 real changes made)
(4,691 real changes made)
(26,475 missing values generated)
(3,871 real changes made)
(3,596 real changes made)
(7,467 real changes made)
(21,784 real changes made)
(19,008 missing values generated)
(7,379 real changes made)
(3,871 real changes made)
(5,871 real changes made, 5,871 to missing)
(18,970 missing values generated)
(26,475 missing values generated)
(3,889 real changes made)
(3,616 real changes made)
(3,889 real changes made)
(3,616 real changes made)
(4,639 real changes made)
(26,475 missing values generated)
(3,889 real changes made)
(3,616 real changes made)
(7,505 real changes made)
(21,836 real changes made)
(18,970 missing values generated)
(7,431 real changes made)
(3,889 real changes made)
(5,929 real changes made, 5,929 to missing)
(19,028 missing values generated)
(26,475 missing values generated)
(3,797 real changes made)
(3,650 real changes made)
(3,797 real changes made)
(3,650 real changes made)
(4,694 real changes made)
(26,475 missing values generated)
(3,797 real changes made)
(3,650 real changes made)
(7,447 real changes made)
(21,781 real changes made)
(19,028 missing values generated)
(7,359 real changes made)
(3,797 real changes made)
(5,972 real changes made, 5,972 to missing)
(19,071 missing values generated)
(26,475 missing values generated)
(3,820 real changes made)
(3,584 real changes made)
(3,820 real changes made)
(3,584 real changes made)
(4,776 real changes made)
(26,475 missing values generated)
(3,820 real changes made)
(3,584 real changes made)
(7,404 real changes made)
(21,699 real changes made)
(19,071 missing values generated)
(7,323 real changes made)
(3,820 real changes made)
(5,885 real changes made, 5,885 to missing)
(18,984 missing values generated)
(26,475 missing values generated)
(3,820 real changes made)
(3,671 real changes made)
(3,820 real changes made)
(3,671 real changes made)
(4,740 real changes made)
(26,475 missing values generated)
(3,820 real changes made)
(3,671 real changes made)
(7,491 real changes made)
(21,735 real changes made)
(18,984 missing values generated)
(7,401 real changes made)
(3,820 real changes made)
(5,911 real changes made, 5,911 to missing)
(19,010 missing values generated)
(26,475 missing values generated)
(3,793 real changes made)
(3,672 real changes made)
(3,793 real changes made)
(3,672 real changes made)
(4,764 real changes made)
(26,475 missing values generated)
(3,793 real changes made)
(3,672 real changes made)
(7,465 real changes made)
(21,711 real changes made)
(19,010 missing values generated)
(7,383 real changes made)
(3,793 real changes made)
(5,882 real changes made, 5,882 to missing)
(18,981 missing values generated)
(26,475 missing values generated)
(3,862 real changes made)
(3,632 real changes made)
(3,862 real changes made)
(3,632 real changes made)
(4,783 real changes made)
(26,475 missing values generated)
(3,862 real changes made)
(3,632 real changes made)
(7,494 real changes made)
(21,692 real changes made)
(18,981 missing values generated)
(7,410 real changes made)
(3,862 real changes made)
(5,847 real changes made, 5,847 to missing)
(18,946 missing values generated)
(26,475 missing values generated)
(3,861 real changes made)
(3,668 real changes made)
(3,861 real changes made)
(3,668 real changes made)
(4,743 real changes made)
(26,475 missing values generated)
(3,861 real changes made)
(3,668 real changes made)
(7,529 real changes made)
(21,732 real changes made)
(18,946 missing values generated)
(7,431 real changes made)
(3,861 real changes made)
(5,903 real changes made, 5,903 to missing)
(19,002 missing values generated)
(26,475 missing values generated)
(3,844 real changes made)
(3,629 real changes made)
(3,844 real changes made)
(3,629 real changes made)
(4,701 real changes made)
(26,475 missing values generated)
(3,844 real changes made)
(3,629 real changes made)
(7,473 real changes made)
(21,774 real changes made)
(19,002 missing values generated)
(7,389 real changes made)
(3,844 real changes made)
(5,901 real changes made, 5,901 to missing)
(19,000 missing values generated)
(26,475 missing values generated)
(3,836 real changes made)
(3,639 real changes made)
(3,836 real changes made)
(3,639 real changes made)
(4,787 real changes made)
(26,475 missing values generated)
(3,836 real changes made)
(3,639 real changes made)
(7,475 real changes made)
(21,688 real changes made)
(19,000 missing values generated)
(7,388 real changes made)
(3,836 real changes made)
(6,003 real changes made, 6,003 to missing)
(19,102 missing values generated)
(26,475 missing values generated)
(3,792 real changes made)
(3,581 real changes made)
(3,792 real changes made)
(3,581 real changes made)
(4,651 real changes made)
(26,475 missing values generated)
(3,792 real changes made)
(3,581 real changes made)
(7,373 real changes made)
(21,824 real changes made)
(19,102 missing values generated)
(7,286 real changes made)
(3,792 real changes made)
(5,908 real changes made, 5,908 to missing)
(19,007 missing values generated)
(26,475 missing values generated)
(3,826 real changes made)
(3,642 real changes made)
(3,826 real changes made)
(3,642 real changes made)
(4,764 real changes made)
(26,475 missing values generated)
(3,826 real changes made)
(3,642 real changes made)
(7,468 real changes made)
(21,711 real changes made)
(19,007 missing values generated)
(7,378 real changes made)
(3,826 real changes made)
(5,938 real changes made, 5,938 to missing)
(19,037 missing values generated)
(26,475 missing values generated)
(3,756 real changes made)
(3,682 real changes made)
(3,756 real changes made)
(3,682 real changes made)
(4,716 real changes made)
(26,475 missing values generated)
(3,756 real changes made)
(3,682 real changes made)
(7,438 real changes made)
(21,759 real changes made)
(19,037 missing values generated)
(7,356 real changes made)
(3,756 real changes made)
(5,817 real changes made, 5,817 to missing)
(18,916 missing values generated)
(26,475 missing values generated)
(3,836 real changes made)
(3,723 real changes made)
(3,836 real changes made)
(3,723 real changes made)
(4,739 real changes made)
(26,475 missing values generated)
(3,836 real changes made)
(3,723 real changes made)
(7,559 real changes made)
(21,736 real changes made)
(18,916 missing values generated)
(7,490 real changes made)
(3,836 real changes made)
(5,939 real changes made, 5,939 to missing)
(19,038 missing values generated)
(26,475 missing values generated)
(3,827 real changes made)
(3,610 real changes made)
(3,827 real changes made)
(3,610 real changes made)
(4,689 real changes made)
(26,475 missing values generated)
(3,827 real changes made)
(3,610 real changes made)
(7,437 real changes made)
(21,786 real changes made)
(19,038 missing values generated)
(7,361 real changes made)
(3,827 real changes made)
(5,964 real changes made, 5,964 to missing)
(19,063 missing values generated)
(26,475 missing values generated)
(3,782 real changes made)
(3,630 real changes made)
(3,782 real changes made)
(3,630 real changes made)
(4,678 real changes made)
(26,475 missing values generated)
(3,782 real changes made)
(3,630 real changes made)
(7,412 real changes made)
(21,797 real changes made)
(19,063 missing values generated)
(7,324 real changes made)
(3,782 real changes made)
(5,945 real changes made, 5,945 to missing)
(19,044 missing values generated)
(26,475 missing values generated)
(3,845 real changes made)
(3,586 real changes made)
(3,845 real changes made)
(3,586 real changes made)
(4,671 real changes made)
(26,475 missing values generated)
(3,845 real changes made)
(3,586 real changes made)
(7,431 real changes made)
(21,804 real changes made)
(19,044 missing values generated)
(7,346 real changes made)
(3,845 real changes made)
(5,886 real changes made, 5,886 to missing)
(18,985 missing values generated)
(26,475 missing values generated)
(3,864 real changes made)
(3,626 real changes made)
(3,864 real changes made)
(3,626 real changes made)
(4,662 real changes made)
(26,475 missing values generated)
(3,864 real changes made)
(3,626 real changes made)
(7,490 real changes made)
(21,813 real changes made)
(18,985 missing values generated)
(7,410 real changes made)
(3,864 real changes made)
(5,911 real changes made, 5,911 to missing)
(19,010 missing values generated)
(26,475 missing values generated)
(3,840 real changes made)
(3,625 real changes made)
(3,840 real changes made)
(3,625 real changes made)
(4,710 real changes made)
(26,475 missing values generated)
(3,840 real changes made)
(3,625 real changes made)
(7,465 real changes made)
(21,765 real changes made)
(19,010 missing values generated)
(7,382 real changes made)
(3,840 real changes made)
(5,969 real changes made, 5,969 to missing)
(19,068 missing values generated)
(26,475 missing values generated)
(3,793 real changes made)
(3,614 real changes made)
(3,793 real changes made)
(3,614 real changes made)
(4,750 real changes made)
(26,475 missing values generated)
(3,793 real changes made)
(3,614 real changes made)
(7,407 real changes made)
(21,725 real changes made)
(19,068 missing values generated)
(7,336 real changes made)
(3,793 real changes made)
(5,916 real changes made, 5,916 to missing)
(19,015 missing values generated)
(26,475 missing values generated)
(3,835 real changes made)
(3,625 real changes made)
(3,835 real changes made)
(3,625 real changes made)
(4,684 real changes made)
(26,475 missing values generated)
(3,835 real changes made)
(3,625 real changes made)
(7,460 real changes made)
(21,791 real changes made)
(19,015 missing values generated)
(7,372 real changes made)
(3,835 real changes made)
(5,801 real changes made, 5,801 to missing)
(19,177 missing values generated)
(26,475 missing values generated)
(3,760 real changes made)
(3,538 real changes made)
(3,760 real changes made)
(3,538 real changes made)
(4,666 real changes made)
(26,475 missing values generated)
(3,760 real changes made)
(3,538 real changes made)
(7,298 real changes made)
(21,809 real changes made)
(19,177 missing values generated)
(7,215 real changes made)
(3,760 real changes made)
(5,661 real changes made, 5,661 to missing)
(19,037 missing values generated)
(26,475 missing values generated)
(3,765 real changes made)
(3,673 real changes made)
(3,765 real changes made)
(3,673 real changes made)
(4,746 real changes made)
(26,475 missing values generated)
(3,765 real changes made)
(3,673 real changes made)
(7,438 real changes made)
(21,729 real changes made)
(19,037 missing values generated)
(7,355 real changes made)
(3,765 real changes made)
(5,762 real changes made, 5,762 to missing)
(19,138 missing values generated)
(26,475 missing values generated)
(3,719 real changes made)
(3,618 real changes made)
(3,719 real changes made)
(3,618 real changes made)
(4,644 real changes made)
(26,475 missing values generated)
(3,719 real changes made)
(3,618 real changes made)
(7,337 real changes made)
(21,831 real changes made)
(19,138 missing values generated)
(7,251 real changes made)
(3,719 real changes made)
(5,797 real changes made, 5,797 to missing)
(19,173 missing values generated)
(26,475 missing values generated)
(3,712 real changes made)
(3,590 real changes made)
(3,712 real changes made)
(3,590 real changes made)
(4,673 real changes made)
(26,475 missing values generated)
(3,712 real changes made)
(3,590 real changes made)
(7,302 real changes made)
(21,802 real changes made)
(19,173 missing values generated)
(7,224 real changes made)
(3,712 real changes made)
(5,791 real changes made, 5,791 to missing)
(19,167 missing values generated)
(26,475 missing values generated)
(3,744 real changes made)
(3,564 real changes made)
(3,744 real changes made)
(3,564 real changes made)
(4,623 real changes made)
(26,475 missing values generated)
(3,744 real changes made)
(3,564 real changes made)
(7,308 real changes made)
(21,852 real changes made)
(19,167 missing values generated)
(7,233 real changes made)
(3,744 real changes made)
(5,724 real changes made, 5,724 to missing)
(19,100 missing values generated)
(26,475 missing values generated)
(3,782 real changes made)
(3,593 real changes made)
(3,782 real changes made)
(3,593 real changes made)
(4,632 real changes made)
(26,475 missing values generated)
(3,782 real changes made)
(3,593 real changes made)
(7,375 real changes made)
(21,843 real changes made)
(19,100 missing values generated)
(7,294 real changes made)
(3,782 real changes made)
(5,706 real changes made, 5,706 to missing)
(19,082 missing values generated)
(26,475 missing values generated)
(3,766 real changes made)
(3,627 real changes made)
(3,766 real changes made)
(3,627 real changes made)
(4,725 real changes made)
(26,475 missing values generated)
(3,766 real changes made)
(3,627 real changes made)
(7,393 real changes made)
(21,750 real changes made)
(19,082 missing values generated)
(7,307 real changes made)
(3,766 real changes made)
(5,779 real changes made, 5,779 to missing)
(19,155 missing values generated)
(26,475 missing values generated)
(3,695 real changes made)
(3,625 real changes made)
(3,695 real changes made)
(3,625 real changes made)
(4,648 real changes made)
(26,475 missing values generated)
(3,695 real changes made)
(3,625 real changes made)
(7,320 real changes made)
(21,827 real changes made)
(19,155 missing values generated)
(7,242 real changes made)
(3,695 real changes made)
(5,795 real changes made, 5,795 to missing)
(19,171 missing values generated)
(26,475 missing values generated)
(3,754 real changes made)
(3,550 real changes made)
(3,754 real changes made)
(3,550 real changes made)
(4,614 real changes made)
(26,475 missing values generated)
(3,754 real changes made)
(3,550 real changes made)
(7,304 real changes made)
(21,861 real changes made)
(19,171 missing values generated)
(7,222 real changes made)
(3,754 real changes made)
(5,738 real changes made, 5,738 to missing)
(19,114 missing values generated)
(26,475 missing values generated)
(3,735 real changes made)
(3,626 real changes made)
(3,735 real changes made)
(3,626 real changes made)
(4,747 real changes made)
(26,475 missing values generated)
(3,735 real changes made)
(3,626 real changes made)
(7,361 real changes made)
(21,728 real changes made)
(19,114 missing values generated)
(7,283 real changes made)
(3,735 real changes made)
(5,755 real changes made, 5,755 to missing)
(19,131 missing values generated)
(26,475 missing values generated)
(3,766 real changes made)
(3,578 real changes made)
(3,766 real changes made)
(3,578 real changes made)
(4,634 real changes made)
(26,475 missing values generated)
(3,766 real changes made)
(3,578 real changes made)
(7,344 real changes made)
(21,841 real changes made)
(19,131 missing values generated)
(7,268 real changes made)
(3,766 real changes made)
(5,757 real changes made, 5,757 to missing)
(19,133 missing values generated)
(26,475 missing values generated)
(3,765 real changes made)
(3,577 real changes made)
(3,765 real changes made)
(3,577 real changes made)
(4,651 real changes made)
(26,475 missing values generated)
(3,765 real changes made)
(3,577 real changes made)
(7,342 real changes made)
(21,824 real changes made)
(19,133 missing values generated)
(7,259 real changes made)
(3,765 real changes made)
(5,700 real changes made, 5,700 to missing)
(19,076 missing values generated)
(26,475 missing values generated)
(3,753 real changes made)
(3,646 real changes made)
(3,753 real changes made)
(3,646 real changes made)
(4,664 real changes made)
(26,475 missing values generated)
(3,753 real changes made)
(3,646 real changes made)
(7,399 real changes made)
(21,811 real changes made)
(19,076 missing values generated)
(7,326 real changes made)
(3,753 real changes made)
(5,718 real changes made, 5,718 to missing)
(19,094 missing values generated)
(26,475 missing values generated)
(3,692 real changes made)
(3,689 real changes made)
(3,692 real changes made)
(3,689 real changes made)
(4,596 real changes made)
(26,475 missing values generated)
(3,692 real changes made)
(3,689 real changes made)
(7,381 real changes made)
(21,879 real changes made)
(19,094 missing values generated)
(7,293 real changes made)
(3,692 real changes made)
(5,677 real changes made, 5,677 to missing)
(19,053 missing values generated)
(26,475 missing values generated)
(3,727 real changes made)
(3,695 real changes made)
(3,727 real changes made)
(3,695 real changes made)
(4,659 real changes made)
(26,475 missing values generated)
(3,727 real changes made)
(3,695 real changes made)
(7,422 real changes made)
(21,816 real changes made)
(19,053 missing values generated)
(7,334 real changes made)
(3,727 real changes made)
(5,758 real changes made, 5,758 to missing)
(19,134 missing values generated)
(26,475 missing values generated)
(3,737 real changes made)
(3,604 real changes made)
(3,737 real changes made)
(3,604 real changes made)
(4,616 real changes made)
(26,475 missing values generated)
(3,737 real changes made)
(3,604 real changes made)
(7,341 real changes made)
(21,859 real changes made)
(19,134 missing values generated)
(7,256 real changes made)
(3,737 real changes made)
(5,782 real changes made, 5,782 to missing)
(19,158 missing values generated)
(26,475 missing values generated)
(3,734 real changes made)
(3,583 real changes made)
(3,734 real changes made)
(3,583 real changes made)
(4,529 real changes made)
(26,475 missing values generated)
(3,734 real changes made)
(3,583 real changes made)
(7,317 real changes made)
(21,946 real changes made)
(19,158 missing values generated)
(7,233 real changes made)
(3,734 real changes made)
(5,818 real changes made, 5,818 to missing)
(19,194 missing values generated)
(26,475 missing values generated)
(3,691 real changes made)
(3,590 real changes made)
(3,691 real changes made)
(3,590 real changes made)
(4,615 real changes made)
(26,475 missing values generated)
(3,691 real changes made)
(3,590 real changes made)
(7,281 real changes made)
(21,860 real changes made)
(19,194 missing values generated)
(7,194 real changes made)
(3,691 real changes made)
(5,757 real changes made, 5,757 to missing)
(19,133 missing values generated)
(26,475 missing values generated)
(3,719 real changes made)
(3,623 real changes made)
(3,719 real changes made)
(3,623 real changes made)
(4,692 real changes made)
(26,475 missing values generated)
(3,719 real changes made)
(3,623 real changes made)
(7,342 real changes made)
(21,783 real changes made)
(19,133 missing values generated)
(7,261 real changes made)
(3,719 real changes made)
(5,766 real changes made, 5,766 to missing)
(19,142 missing values generated)
(26,475 missing values generated)
(3,746 real changes made)
(3,587 real changes made)
(3,746 real changes made)
(3,587 real changes made)
(4,630 real changes made)
(26,475 missing values generated)
(3,746 real changes made)
(3,587 real changes made)
(7,333 real changes made)
(21,845 real changes made)
(19,142 missing values generated)
(7,261 real changes made)
(3,746 real changes made)
(5,752 real changes made, 5,752 to missing)
(19,128 missing values generated)
(26,475 missing values generated)
(3,779 real changes made)
(3,568 real changes made)
(3,779 real changes made)
(3,568 real changes made)
(4,587 real changes made)
(26,475 missing values generated)
(3,779 real changes made)
(3,568 real changes made)
(7,347 real changes made)
(21,888 real changes made)
(19,128 missing values generated)
(7,276 real changes made)
(3,779 real changes made)
(5,821 real changes made, 5,821 to missing)
(19,197 missing values generated)
(26,475 missing values generated)
(3,693 real changes made)
(3,585 real changes made)
(3,693 real changes made)
(3,585 real changes made)
(4,602 real changes made)
(26,475 missing values generated)
(3,693 real changes made)
(3,585 real changes made)
(7,278 real changes made)
(21,873 real changes made)
(19,197 missing values generated)
(7,191 real changes made)
(3,693 real changes made)
(5,713 real changes made, 5,713 to missing)
(19,089 missing values generated)
(26,475 missing values generated)
(3,808 real changes made)
(3,578 real changes made)
(3,808 real changes made)
(3,578 real changes made)
(4,696 real changes made)
(26,475 missing values generated)
(3,808 real changes made)
(3,578 real changes made)
(7,386 real changes made)
(21,779 real changes made)
(19,089 missing values generated)
(7,309 real changes made)
(3,808 real changes made)
(5,811 real changes made, 5,811 to missing)
(19,187 missing values generated)
(26,475 missing values generated)
(3,703 real changes made)
(3,585 real changes made)
(3,703 real changes made)
(3,585 real changes made)
(4,615 real changes made)
(26,475 missing values generated)
(3,703 real changes made)
(3,585 real changes made)
(7,288 real changes made)
(21,860 real changes made)
(19,187 missing values generated)
(7,209 real changes made)
(3,703 real changes made)
(5,767 real changes made, 5,767 to missing)
(19,143 missing values generated)
(26,475 missing values generated)
(3,762 real changes made)
(3,570 real changes made)
(3,762 real changes made)
(3,570 real changes made)
(4,688 real changes made)
(26,475 missing values generated)
(3,762 real changes made)
(3,570 real changes made)
(7,332 real changes made)
(21,787 real changes made)
(19,143 missing values generated)
(7,262 real changes made)
(3,762 real changes made)
(5,770 real changes made, 5,770 to missing)
(19,146 missing values generated)
(26,475 missing values generated)
(3,727 real changes made)
(3,602 real changes made)
(3,727 real changes made)
(3,602 real changes made)
(4,683 real changes made)
(26,475 missing values generated)
(3,727 real changes made)
(3,602 real changes made)
(7,329 real changes made)
(21,792 real changes made)
(19,146 missing values generated)
(7,251 real changes made)
(3,727 real changes made)
(5,765 real changes made, 5,765 to missing)
(19,141 missing values generated)
(26,475 missing values generated)
(3,759 real changes made)
(3,575 real changes made)
(3,759 real changes made)
(3,575 real changes made)
(4,684 real changes made)
(26,475 missing values generated)
(3,759 real changes made)
(3,575 real changes made)
(7,334 real changes made)
(21,791 real changes made)
(19,141 missing values generated)
(7,255 real changes made)
(3,759 real changes made)
(5,736 real changes made, 5,736 to missing)
(19,112 missing values generated)
(26,475 missing values generated)
(3,744 real changes made)
(3,619 real changes made)
(3,744 real changes made)
(3,619 real changes made)
(4,689 real changes made)
(26,475 missing values generated)
(3,744 real changes made)
(3,619 real changes made)
(7,363 real changes made)
(21,786 real changes made)
(19,112 missing values generated)
(7,285 real changes made)
(3,744 real changes made)
(5,774 real changes made, 5,774 to missing)
(19,150 missing values generated)
(26,475 missing values generated)
(3,803 real changes made)
(3,522 real changes made)
(3,803 real changes made)
(3,522 real changes made)
(4,638 real changes made)
(26,475 missing values generated)
(3,803 real changes made)
(3,522 real changes made)
(7,325 real changes made)
(21,837 real changes made)
(19,150 missing values generated)
(7,248 real changes made)
(3,803 real changes made)
(5,661 real changes made, 5,661 to missing)
(19,037 missing values generated)
(26,475 missing values generated)
(3,784 real changes made)
(3,654 real changes made)
(3,784 real changes made)
(3,654 real changes made)
(4,733 real changes made)
(26,475 missing values generated)
(3,784 real changes made)
(3,654 real changes made)
(7,438 real changes made)
(21,742 real changes made)
(19,037 missing values generated)
(7,355 real changes made)
(3,784 real changes made)
(5,732 real changes made, 5,732 to missing)
(19,108 missing values generated)
(26,475 missing values generated)
(3,759 real changes made)
(3,608 real changes made)
(3,759 real changes made)
(3,608 real changes made)
(4,645 real changes made)
(26,475 missing values generated)
(3,759 real changes made)
(3,608 real changes made)
(7,367 real changes made)
(21,830 real changes made)
(19,108 missing values generated)
(7,279 real changes made)
(3,759 real changes made)
(5,813 real changes made, 5,813 to missing)
(19,189 missing values generated)
(26,475 missing values generated)
(3,660 real changes made)
(3,626 real changes made)
(3,660 real changes made)
(3,626 real changes made)
(4,660 real changes made)
(26,475 missing values generated)
(3,660 real changes made)
(3,626 real changes made)
(7,286 real changes made)
(21,815 real changes made)
(19,189 missing values generated)
(7,200 real changes made)
(3,660 real changes made)
(5,662 real changes made, 5,662 to missing)
(19,038 missing values generated)
(26,475 missing values generated)
(3,771 real changes made)
(3,666 real changes made)
(3,771 real changes made)
(3,666 real changes made)
(4,714 real changes made)
(26,475 missing values generated)
(3,771 real changes made)
(3,666 real changes made)
(7,437 real changes made)
(21,761 real changes made)
(19,038 missing values generated)
(7,354 real changes made)
(3,771 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)
(1,731 missing values generated)

. gen baseline_egfr=.
(26,475 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 
> apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 jul2019 au
> g2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2
> 021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug202
> 2 sep2022 oct2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(231 real changes made)
(266 real changes made)
(247 real changes made)
(312 real changes made)
(266 real changes made)
(271 real changes made)
(283 real changes made)
(278 real changes made)
(259 real changes made)
(214 real changes made)
(229 real changes made)
(216 real changes made)
(204 real changes made)
(241 real changes made)
(235 real changes made)
(199 real changes made)
(224 real changes made)
(220 real changes made)
(219 real changes made)
(219 real changes made)
(229 real changes made)
(192 real changes made)
(200 real changes made)
(189 real changes made)
(198 real changes made)
(201 real changes made)
(178 real changes made)
(216 real changes made)
(182 real changes made)
(214 real changes made)
(170 real changes made)
(173 real changes made)
(203 real changes made)
(258 real changes made)
(227 real changes made)
(217 real changes made)
(229 real changes made)
(179 real changes made)
(220 real changes made)
(194 real changes made)
(195 real changes made)
(188 real changes made)
(204 real changes made)
(189 real changes made)
(219 real changes made)
(201 real changes made)
(198 real changes made)
(215 real changes made)
(193 real changes made)
(197 real changes made)
(205 real changes made)
(165 real changes made)
(192 real changes made)
(168 real changes made)
(180 real changes made)
(214 real changes made)
(157 real changes made)
(174 real changes made)
(189 real changes made)
(180 real changes made)
(165 real changes made)
(196 real changes made)
(194 real changes made)
(191 real changes made)
(191 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(1 real change made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab covid baseline_esrd

           |     baseline_esrd
     covid |   No ESRD       ESRD |     Total
-----------+----------------------+----------
         1 |    13,098          1 |    13,099 
-----------+----------------------+----------
     Total |    13,098          1 |    13,099 

. tab pneumonia baseline_esrd

           | baseline_e
           |    srd
 pneumonia |   No ESRD |     Total
-----------+-----------+----------
         1 |    13,376 |    13,376 
-----------+-----------+----------
     Total |    13,376 |    13,376 

. drop if baseline_esrd==1
(1 observation deleted)

. drop baseline_esrd

. 
. ** Exposure
. gen case = covid
(13,376 missing values generated)

. replace case = 0 if covid==.
(13,376 real changes made)

. label define case 0 "Pneumonia (pre-pandemic)" ///
>                                   1 "COVID-19"

. label values case case

. tab case covid

                      |   covid
                 case |         1 |     Total
----------------------+-----------+----------
             COVID-19 |    13,098 |    13,098 
----------------------+-----------+----------
                Total |    13,098 |    13,098 

. tab case pneumonia

                      | pneumonia
                 case |         1 |     Total
----------------------+-----------+----------
Pneumonia (pre-pandem |    13,376 |    13,376 
----------------------+-----------+----------
                Total |    13,376 |    13,376 

. drop covid

. drop pneumonia

. safetab case 

                    case |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,376       50.53       50.53
                COVID-19 |     13,098       49.47      100.00
-------------------------+-----------------------------------
                   Total |     26,474      100.00

. 
. * Critical care during index admission
. replace critical_care = 1 if critical_days==1
(1,272 real changes made)

. drop critical_days

. label define critical_care      0 "Ward-based"          ///
>                                                         1 "Critical care"

. label values critical_care critical_care

. label var critical_care "Critical care"

. safetab critical_care, m

Critical care |      Freq.     Percent        Cum.
--------------+-----------------------------------
   Ward-based |     23,892       90.25       90.25
Critical care |      2,582        9.75      100.00
--------------+-----------------------------------
        Total |     26,474      100.00

. gen case_critical_care = critical_care

. replace case_critical_care = 2 if case==1
(13,098 real changes made)

. replace case_critical_care = 3 if case==1 &critical_care==1
(1,318 real changes made)

. label define case_critical_care 0 "Ward-based pneumonia (pre-pandemic)"         ///
>                                                                 1 "Critical care pneumonia (pre-pandemic)"      ///
>                                                                 2 "Ward-based COVID-19"                                         //
> /
>                                                                 3 "Critical care COVID-19"

. label values case_critical_care case_critical_care

. safetab case_critical_care, m

                    case_critical_care |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
   Ward-based pneumonia (pre-pandemic) |     12,112       45.75       45.75
Critical care pneumonia (pre-pandemic) |      1,264        4.77       50.53
                   Ward-based COVID-19 |     11,780       44.50       95.02
                Critical care COVID-19 |      1,318        4.98      100.00
---------------------------------------+-----------------------------------
                                 Total |     26,474      100.00

. 
. * Acute kidney injury during index admission
. rename acute_kidney_injury adm_aki

. label define adm_aki    0 "No AKI"      ///
>                                                 1 "AKI"

. label values adm_aki adm_aki

. label var adm_aki "Acute kidney injury"

. safetab adm_aki, m

      Acute |
     kidney |
     injury |      Freq.     Percent        Cum.
------------+-----------------------------------
     No AKI |     15,764       59.55       59.55
        AKI |     10,710       40.45      100.00
------------+-----------------------------------
      Total |     26,474      100.00

. gen case_adm_aki = adm_aki

. replace case_adm_aki = 2 if case==1
(13,098 real changes made)

. replace case_adm_aki = 3 if case==1 &adm_aki==1
(5,295 real changes made)

. label define case_adm_aki       0 "No AKI pneumonia (pre-pandemic)"     ///
>                                                                                 1 "AKI pneumonia (pre-pandemic)"        ///
>                                                                                 2 "No AKI COVID-19"                             //
> /
>                                                                                 3 "AKI COVID-19"

. label values case_adm_aki case_adm_aki

. safetab case_adm_aki, m

                   case_adm_aki |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
No AKI pneumonia (pre-pandemic) |      7,961       30.07       30.07
   AKI pneumonia (pre-pandemic) |      5,415       20.45       50.53
                No AKI COVID-19 |      7,803       29.47       80.00
                   AKI COVID-19 |      5,295       20.00      100.00
--------------------------------+-----------------------------------
                          Total |     26,474      100.00

. 
. * Kidney replacement therapy during index admission
. gen krt = adm_aki

. replace krt = 2 if krt_icd_10==1
(257 real changes made)

. drop krt_icd_10

. replace krt = 2 if krt_opcs_4==1
(259 real changes made)

. drop krt_opcs_4

. label define krt        0 "No AKI"                              ///
>                                         1 "AKI without KRT"             ///
>                                         2 "AKI requiring KRT"

. label values krt krt

. label var krt "Kidney replacement therapy"

. safetab krt, m

           Kidney |
      replacement |
          therapy |      Freq.     Percent        Cum.
------------------+-----------------------------------
           No AKI |     15,461       58.40       58.40
  AKI without KRT |     10,497       39.65       98.05
AKI requiring KRT |        516        1.95      100.00
------------------+-----------------------------------
            Total |     26,474      100.00

. gen case_krt = krt

. replace case_krt = 3 if case==1
(13,098 real changes made)

. replace case_krt = 4 if case==1 &krt==1
(5,178 real changes made)

. replace case_krt = 5 if case==1 &krt==2
(269 real changes made)

. label define case_krt   0 "No AKI pneumonia (pre-pandemic)"                     ///
>                                                 1 "AKI without KRT pneumonia (pre-pandemic)"    ///
>                                                 2 "AKI requiring KRT pneumonia (pre-pandemic)"  ///
>                                                 3 "No AKI COVID-19"                                                             //
> /
>                                                 4 "AKI without KRT COVID-19"                                    ///
>                                                 5 "AKI requiring KRT COVID-19"

. label values case_krt case_krt

. safetab case_krt, m

                               case_krt |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
        No AKI pneumonia (pre-pandemic) |      7,810       29.50       29.50
AKI without KRT pneumonia (pre-pandemic |      5,319       20.09       49.59
AKI requiring KRT pneumonia (pre-pandem |        247        0.93       50.53
                        No AKI COVID-19 |      7,651       28.90       79.43
               AKI without KRT COVID-19 |      5,178       19.56       98.98
             AKI requiring KRT COVID-19 |        269        1.02      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,474      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(17,214 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(17,302 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(17,341 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(17,336 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(9,138 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(2,772 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(834 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(242 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Pneumonia (pre-pandemic)"    ///
>                                                 1 "COVID pre-vaccination"                       ///
>                                                 2 "COVID 1 vaccine dose"                        ///
>                                                 3 "COVID 2 vaccine doses"                       ///
>                                                 4 "COVID 3 vaccine doses"                       ///
>                                                 5 "COVID 4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "COVID-19 vaccination status"

. safetab covid_vax, m

    COVID-19 vaccination |
                  status |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,376       50.53       50.53
   COVID pre-vaccination |        112        0.42       50.95
    COVID 1 vaccine dose |        242        0.91       51.86
   COVID 2 vaccine doses |        834        3.15       55.01
   COVID 3 vaccine doses |      2,772       10.47       65.48
   COVID 4 vaccine doses |      9,138       34.52      100.00
-------------------------+-----------------------------------
                   Total |     26,474      100.00

. 
. * COVID-19 wave
. gen wave = case

. replace wave = 2 if index_month=="sep2020"
(375 real changes made)

. replace wave = 2 if index_month=="oct2020"
(378 real changes made)

. replace wave = 2 if index_month=="nov2020"
(334 real changes made)

. replace wave = 2 if index_month=="dec2020"
(376 real changes made)

. replace wave = 2 if index_month=="jan2021"
(374 real changes made)

. replace wave = 2 if index_month=="feb2021"
(367 real changes made)

. replace wave = 2 if index_month=="mar2021"
(353 real changes made)

. replace wave = 2 if index_month=="apr2021"
(379 real changes made)

. replace wave = 2 if index_month=="may2021"
(376 real changes made)

. replace wave = 2 if index_month=="jun2021"
(368 real changes made)

. replace wave = 3 if index_month=="jul2021"
(365 real changes made)

. replace wave = 3 if index_month=="aug2021"
(357 real changes made)

. replace wave = 3 if index_month=="sep2021"
(297 real changes made)

. replace wave = 3 if index_month=="oct2021"
(353 real changes made)

. replace wave = 3 if index_month=="nov2021"
(322 real changes made)

. replace wave = 4 if index_month=="dec2021"
(332 real changes made)

. replace wave = 4 if index_month=="jan2022"
(359 real changes made)

. replace wave = 4 if index_month=="feb2022"
(283 real changes made)

. replace wave = 4 if index_month=="mar2022"
(313 real changes made)

. replace wave = 4 if index_month=="apr2022"
(340 real changes made)

. replace wave = 4 if index_month=="may2022"
(310 real changes made)

. replace wave = 4 if index_month=="jun2022"
(291 real changes made)

. replace wave = 4 if index_month=="jul2022"
(328 real changes made)

. replace wave = 4 if index_month=="aug2022"
(340 real changes made)

. replace wave = 4 if index_month=="sep2022"
(346 real changes made)

. replace wave = 4 if index_month=="oct2022"
(314 real changes made)

. label define wave       0 "Pneumonia (pre-pandemic)"    ///
>                                         1 "COVID Feb20-Aug20"   ///
>                                         2 "COVID Sep20-Jun21"   ///
>                                         3 "COVID Jul21-Nov21"   ///
>                                         4 "COVID Dec21-Oct22"   

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m

           COVID-19 wave |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,376       50.53       50.53
       COVID Feb20-Aug20 |      4,168       15.74       66.27
       COVID Sep20-Jun21 |      3,680       13.90       80.17
       COVID Jul21-Nov21 |      1,694        6.40       86.57
       COVID Dec21-Oct22 |      3,556       13.43      100.00
-------------------------+-----------------------------------
                   Total |     26,474      100.00

. 
. * Month
. gen month_string=substr(index_date_string ,3,3)
(1,731 missing values generated)

. gen month = 1 if month_string=="jan"
(24,990 missing values generated)

. replace month = 2 if month_string=="feb"
(2,152 real changes made)

. replace month = 3 if month_string=="mar"
(2,364 real changes made)

. replace month = 4 if month_string=="apr"
(2,376 real changes made)

. replace month = 5 if month_string=="may"
(2,345 real changes made)

. replace month = 6 if month_string=="jun"
(2,245 real changes made)

. replace month = 7 if month_string=="jul"
(2,285 real changes made)

. replace month = 8 if month_string=="aug"
(2,251 real changes made)

. replace month = 9 if month_string=="sep"
(2,150 real changes made)

. replace month = 10 if month_string=="oct"
(2,207 real changes made)

. replace month = 11 if month_string=="nov"
(1,392 real changes made)

. replace month = 12 if month_string=="dec"
(1,492 real changes made)

. drop month_string

. label define month      1 "January"             ///
>                                         2 "February"    ///
>                                         3 "March"               ///
>                                         4 "April"               ///
>                                         5 "May"                 ///
>                                         6 "June"                ///
>                                         7 "July"                ///
>                                         8 "August"              ///
>                                         9 "September"   ///
>                                         10 "October"    ///
>                                         11 "November"   ///
>                                         12 "December"

. label values month month

. safetab month case, m

           |         case
     month | Pneumonia   COVID-19 |     Total
-----------+----------------------+----------
   January |       751        733 |     1,484 
  February |     1,139      1,013 |     2,152 
     March |     1,258      1,106 |     2,364 
     April |     1,257      1,119 |     2,376 
       May |     1,267      1,078 |     2,345 
      June |     1,175      1,070 |     2,245 
      July |     1,249      1,036 |     2,285 
    August |     1,156      1,095 |     2,251 
 September |     1,132      1,018 |     2,150 
   October |     1,162      1,045 |     2,207 
  November |       736        656 |     1,392 
  December |       784        708 |     1,492 
         . |       310      1,421 |     1,731 
-----------+----------------------+----------
     Total |    13,376     13,098 |    26,474 

. 
end of do-file

. browse

. sum gp_count

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    gp_count |     26,474    3.281106    3.526095         -4         17

. sum gp_count, detail

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -4
 5%            0             -4
10%            0             -4       Obs              26,474
25%            0             -4       Sum of wgt.      26,474

50%            3                      Mean           3.281106
                        Largest       Std. dev.      3.526095
75%            6             16
90%            8             16       Variance       12.43335
95%           10             16       Skewness        .638474
99%           12             17       Kurtosis       2.270093

. by case: sum gp_count, detail
not sorted
r(5);

. bysort case: sum gp_count, detail

------------------------------------------------------------------------------------------------------------------------------------
-> case = Pneumonia (pre-pandemic)

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -4
 5%            0             -4
10%            0             -4       Obs              13,376
25%            0             -4       Sum of wgt.      13,376

50%            3                      Mean           3.265775
                        Largest       Std. dev.      3.507324
75%            6             15
90%            8             16       Variance       12.30132
95%           10             16       Skewness       .6338741
99%           12             17       Kurtosis       2.257696

------------------------------------------------------------------------------------------------------------------------------------
-> case = COVID-19

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -4
 5%            0             -4
10%            0             -4       Obs              13,098
25%            0             -4       Sum of wgt.      13,098

50%            3                      Mean           3.296763
                        Largest       Std. dev.      3.545228
75%            6             15
90%            8             15       Variance       12.56864
95%           10             15       Skewness       .6427224
99%           12             16       Kurtosis       2.281134


