------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_2020.log
  log type:  text
 opened on:  24 Apr 2024, 16:18:25

. 
. ** Analysis cohort selection
. capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-9)
(55 vars, 50,000 obs)

. di "Potential COVID-19 cases extracted from OpenSAFELY:"
Potential COVID-19 cases extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/input_2020_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(20 vars, 50,000 obs)

. di "Potential contemporary comparators extracted from OpenSAFELY:"
Potential contemporary comparators extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/covid_matching_2020.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 2,020 obs)

. di "Potential COVID-19 cases after application of exclusion criteria:"
Potential COVID-19 cases after application of exclusion criteria:

. safecount
  2,020

. capture noisily import delimited ./output/2020_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(9 vars, 28,657 obs)

. di "Potential contemporary comparators after application of exclusion criteria:"
Potential contemporary comparators after application of exclusion criteria:

. safecount
  28,657

. * Import COVID-19 dataset comprising individuals matched with contemporary comparators (limited matching variables only)        
. capture noisily import delimited ./output/input_combined_stps_covid_2020.csv, clear
(encoding automatically selected: ISO-8859-1)
(13 vars, 1,782 obs)

. * Drop age & covid_diagnosis_date
. keep patient_id death_date date_deregistered stp krt_outcome_date male covid_date covid_month set_id case match_counts

. tempfile covid_2020_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `covid_2020_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000001.tmp saved as .dta format

. * Number of matched COVID-19 cases
. count
  1,782

. * Import matched contemporary comparators (limited matching variables only)
. capture noisily import delimited ./output/input_combined_stps_matches_2020.csv, clear
(encoding automatically selected: ISO-8859-1)
(12 vars, 4,740 obs)

. * Drop age
. * NB covid_date = date at which COVID case matched to a contemporary comparator
. * covid_diagnosis_date = date at which contemporary comparator first diagnosed with COVID
. keep patient_id death_date date_deregistered stp krt_outcome_date male set_id case covid_date covid_diagnosis_date

. tempfile 2020_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `2020_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000002.tmp saved as .dta format

. * Number of matched contemporary comparators
. count
  4,740

. * Merge limited COVID-19 dataset with additional variables
. capture noisily import delimited ./output/input_covid_2020_additional.csv, clear
(encoding automatically selected: ISO-8859-9)
(117 vars, 1,782 obs)

. merge 1:1 patient_id using `covid_2020_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             1,782  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile covid_2020_complete

. save `covid_2020_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000003.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000003.tmp saved as .dta format

. di "Matched COVID-19 cases:"
Matched COVID-19 cases:

. safecount
  1,782

. * Merge limited contemporary comparator dataset with additional variables
. capture noisily import delimited ./output/input_2020_additional.csv, clear
(encoding automatically selected: ISO-8859-9)
(110 vars, 4,740 obs)

. merge 1:1 patient_id using `2020_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             4,740  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile 2020_complete

. save `2020_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000004.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000004.tmp saved as .dta format

. di "Matched contemporary comparators:"
Matched contemporary comparators:

. safecount
  4,740

. * Append matched COVID-19 cases and contemporary comparators
. append using `covid_2020_complete', force

. order patient_id set_id match_count case

. gsort set_id -case

. count if case==0
  4,740

. di "Matched COVID-19 cases and contemporary comparators:"
Matched COVID-19 cases and contemporary comparators:

. safecount
  6,522

. tab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,740       72.68       72.68
          1 |      1,782       27.32      100.00
------------+-----------------------------------
      Total |      6,522      100.00

. * Save list of matched COVID-19 cases
. preserve

.         keep if case==1
(4,740 observations deleted)

.         keep patient_id

.         tempfile covid_2020_matched_list

.         save `covid_2020_matched_list', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000006.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000006.tmp saved as .dta format

. restore

. * Generate list of unmatched COVID-19 cases
. preserve

.         capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-9)
(55 vars, 50,000 obs)

.         * For dummy data, should do nothing in the real data
.         duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

.         tempfile covid_prematching

.         save `covid_prematching', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000008.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000008.tmp saved as .dta format

.         use `covid_2020_matched_list', clear

.         merge 1:1 patient_id using `covid_prematching'

    Result                      Number of obs
    -----------------------------------------
    Not matched                        51,390
        from master                     1,586  (_merge==1)
        from using                     49,804  (_merge==2)

    Matched                               196  (_merge==3)
    -----------------------------------------

.         keep if _merge==2
(1,782 observations deleted)

.         safecount
  49,804

.         save output/covid_unmatched_2020.dta, replace
file output/covid_unmatched_2020.dta saved

.         di "Unmatched COVID-19 cases:"
Unmatched COVID-19 cases:

.         safecount
  49,804

. restore

. 
. **ID
. * Need to create unique identifiers as individuals may be in both covid_2020_matched and 2020_matched so will have the same patient_id
. gen unique = _n

. label var unique "Unique ID"

. 
. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label var imd "Index of multiple deprivation (IMD)"

. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |        320        4.91        4.91
 1 Most deprived |      1,230       18.86       23.77
               2 |      1,248       19.14       42.90
               3 |      1,206       18.49       61.39
               4 |      1,267       19.43       80.82
5 Least deprived |      1,251       19.18      100.00
-----------------+-----------------------------------
           Total |      6,522      100.00

. drop if imd==0
(320 observations deleted)

. safetab imd

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |      1,230       19.83       19.83
               2 |      1,248       20.12       39.95
               3 |      1,206       19.45       59.40
               4 |      1,267       20.43       79.83
5 Least deprived |      1,251       20.17      100.00
-----------------+-----------------------------------
           Total |      6,202      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(6,171 missing values generated)

. replace stp1 = sum(stp1)
(6,201 real changes made)

. drop stp

. rename stp1 stp

. label define stp        1 "1"   ///
>                                         2 "2"   ///
>                                         3 "3"   ///
>                                         4 "4"   ///
>                                         5 "5"   ///
>                                         6 "6"   ///
>                                         7 "7"   ///
>                                         8 "8"   ///
>                                         9 "9"   ///
>                                         10 "10" ///
>                                         11 "11" ///                                     
>                                         12 "12" ///
>                                         13 "13" ///
>                                         14 "14" ///
>                                         15 "15" ///
>                                         16 "16" ///
>                                         17 "17" ///
>                                         18 "18" ///
>                                         19 "19" ///
>                                         20 "20" ///
>                                         21 "21" ///                                     
>                                         22 "22" ///
>                                         23 "23" ///
>                                         24 "24" ///
>                                         25 "25" ///
>                                         26 "26" ///
>                                         27 "27" ///
>                                         28 "28" ///
>                                         29 "29" ///
>                                         30 "30" ///
>                                         31 "31" 

. label values stp stp

. label var stp "STP"

. safetab stp

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        294        4.74        4.74
          2 |        213        3.43        8.17
          3 |        205        3.31       11.48
          4 |        194        3.13       14.61
          5 |        189        3.05       17.66
          6 |        199        3.21       20.86
          7 |        193        3.11       23.98
          8 |        203        3.27       27.25
          9 |        201        3.24       30.49
         10 |        196        3.16       33.65
         11 |        199        3.21       36.86
         12 |        206        3.32       40.18
         13 |        182        2.93       43.12
         14 |        207        3.34       46.45
         15 |        190        3.06       49.52
         16 |        191        3.08       52.60
         17 |        195        3.14       55.74
         18 |        185        2.98       58.72
         19 |        203        3.27       62.00
         20 |        208        3.35       65.35
         21 |        192        3.10       68.45
         22 |        200        3.22       71.67
         23 |        182        2.93       74.60
         24 |        198        3.19       77.80
         25 |        198        3.19       80.99
         26 |        194        3.13       84.12
         27 |        175        2.82       86.94
         28 |        203        3.27       90.21
         29 |        190        3.06       93.28
         30 |        213        3.43       96.71
         31 |        204        3.29      100.00
------------+-----------------------------------
      Total |      6,202      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(5,601 missing values generated)

. replace region = 2 if region_string=="East"
(629 real changes made)

. replace region = 3 if region_string=="London"
(1,251 real changes made)

. replace region = 4 if region_string=="North East"
(620 real changes made)

. replace region = 5 if region_string=="North West"
(654 real changes made)

. replace region = 6 if region_string=="South East"
(579 real changes made)

. replace region = 7 if region_string=="South West"
(608 real changes made)

. replace region = 8 if region_string=="West Midlands"
(649 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(611 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |        601        9.69        9.69
                    East |        629       10.14       19.83
                  London |      1,251       20.17       40.00
              North East |        620       10.00       50.00
              North West |        654       10.54       60.54
              South East |        579        9.34       69.88
              South West |        608        9.80       79.68
           West Midlands |        649       10.46       90.15
Yorkshire and The Humber |        611        9.85      100.00
-------------------------+-----------------------------------
                   Total |      6,202      100.00

. drop if region==10
(0 observations deleted)

. safetab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |        601        9.69        9.69
                    East |        629       10.14       19.83
                  London |      1,251       20.17       40.00
              North East |        620       10.00       50.00
              North West |        654       10.54       60.54
              South East |        579        9.34       69.88
              South West |        608        9.80       79.68
           West Midlands |        649       10.46       90.15
Yorkshire and The Humber |        611        9.85      100.00
-------------------------+-----------------------------------
                   Total |      6,202      100.00

. 
. * Create new index date variable 28 days after case_index_date (i.e. to exclude anyone who does not survive to start follow-up)
. gen index_date = date(case_index_date, "YMD")

. format index_date %td

. gen index_date_28 = index_date + 28

. format index_date_28 %td

. 
. * Create exit date for COVID amongst general population comparator
. gen covid_exit = date(covid_diagnosis_date, "YMD")
(5,961 missing values generated)

. format covid_exit %td

. replace covid_exit=. if case==1
(0 real changes made)

. drop if covid_exit < index_date_28 + 1
(13 observations deleted)

. gen comparator_covid = .
(6,189 missing values generated)

. replace comparator_covid = 0 if case==0
(4,500 real changes made)

. replace comparator_covid = 1 if covid_exit!=.
(228 real changes made)

. tab case comparator_covid, m

           |         comparator_covid
      case |         0          1          . |     Total
-----------+---------------------------------+----------
         0 |     4,272        228          0 |     4,500 
         1 |         0          0      1,689 |     1,689 
-----------+---------------------------------+----------
     Total |     4,272        228      1,689 |     6,189 

. 
. * Deregistered before index_date + 29 days
. gen deregistered_date = date(date_deregistered, "YMD")
(6,027 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date_28 + 1
(2 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(5,669 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(0 observations deleted)

. replace krt_date = index_date_28 + 1 if krt_date < index_date_28 + 1
(31 real changes made)

. 
. * Death before index_date + 29 days (i.e. only include people who survived 29 days after index_date)
. gen death_date1 = date(death_date, "YMD")
(5,891 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28 + 1
(19 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased within 28 days of index date"

. label values deceased deceased

. tab case deceased

           |       deceased
      case | Alive at   Deceased  |     Total
-----------+----------------------+----------
         0 |     4,483         16 |     4,499 
         1 |     1,685          3 |     1,688 
-----------+----------------------+----------
     Total |     6,168         19 |     6,187 

. drop if deceased==1
(19 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched contemporary comparators only
. gen index_year = yofd(index_date)

. gen age = index_year - year_of_birth

. *age>=18*
. drop if age<18|age==.
(0 observations deleted)

. gen sex = 1 if male == "Male"
(3,132 missing values generated)

. label var sex "Sex"

. replace sex = 0 if male == "Female"
(3,132 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2020 ///
>                                                                                                 baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 ///
>                                                                                                 baseline_creatinine_feb2022 ///
>                                                                                                 baseline_creatinine_mar2022 ///
>                                                                                                 baseline_creatinine_apr2022 ///
>                                                                                                 baseline_creatinine_may2022 ///
>                                                                                                 baseline_creatinine_jun2022 ///
>                                                                                                 baseline_creatinine_jul2022 ///
>                                                                                                 baseline_creatinine_aug2022 ///
>                                                                                                 baseline_creatinine_sep2022 ///
>                                                                                                 baseline_creatinine_oct2022 ///
>                                                                                                 baseline_creatinine_nov2022 ///
>                                                                                                 baseline_creatinine_dec2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(2,743 real changes made, 2,743 to missing)
(2,743 missing values generated)
(6,168 missing values generated)
(1,749 real changes made)
(1,676 real changes made)
(1,749 real changes made)
(1,676 real changes made)
(2,166 real changes made)
(6,168 missing values generated)
(1,749 real changes made)
(1,676 real changes made)
(3,425 real changes made)
(4,002 real changes made)
(2,743 missing values generated)
(3,425 real changes made)
(1,749 real changes made)
(2,752 real changes made, 2,752 to missing)
(2,752 missing values generated)
(6,168 missing values generated)
(1,721 real changes made)
(1,695 real changes made)
(1,721 real changes made)
(1,695 real changes made)
(2,162 real changes made)
(6,168 missing values generated)
(1,721 real changes made)
(1,695 real changes made)
(3,416 real changes made)
(4,006 real changes made)
(2,752 missing values generated)
(3,416 real changes made)
(1,721 real changes made)
(2,711 real changes made, 2,711 to missing)
(2,711 missing values generated)
(6,168 missing values generated)
(1,749 real changes made)
(1,708 real changes made)
(1,749 real changes made)
(1,708 real changes made)
(2,184 real changes made)
(6,168 missing values generated)
(1,749 real changes made)
(1,708 real changes made)
(3,457 real changes made)
(3,984 real changes made)
(2,711 missing values generated)
(3,457 real changes made)
(1,749 real changes made)
(2,712 real changes made, 2,712 to missing)
(2,712 missing values generated)
(6,168 missing values generated)
(1,737 real changes made)
(1,719 real changes made)
(1,737 real changes made)
(1,719 real changes made)
(2,187 real changes made)
(6,168 missing values generated)
(1,737 real changes made)
(1,719 real changes made)
(3,456 real changes made)
(3,981 real changes made)
(2,712 missing values generated)
(3,456 real changes made)
(1,737 real changes made)
(2,717 real changes made, 2,717 to missing)
(2,717 missing values generated)
(6,168 missing values generated)
(1,754 real changes made)
(1,697 real changes made)
(1,754 real changes made)
(1,697 real changes made)
(2,186 real changes made)
(6,168 missing values generated)
(1,754 real changes made)
(1,697 real changes made)
(3,451 real changes made)
(3,982 real changes made)
(2,717 missing values generated)
(3,451 real changes made)
(1,754 real changes made)
(2,723 real changes made, 2,723 to missing)
(2,723 missing values generated)
(6,168 missing values generated)
(1,733 real changes made)
(1,712 real changes made)
(1,733 real changes made)
(1,712 real changes made)
(2,161 real changes made)
(6,168 missing values generated)
(1,733 real changes made)
(1,712 real changes made)
(3,445 real changes made)
(4,007 real changes made)
(2,723 missing values generated)
(3,445 real changes made)
(1,733 real changes made)
(2,711 real changes made, 2,711 to missing)
(2,711 missing values generated)
(6,168 missing values generated)
(1,759 real changes made)
(1,698 real changes made)
(1,759 real changes made)
(1,698 real changes made)
(2,190 real changes made)
(6,168 missing values generated)
(1,759 real changes made)
(1,698 real changes made)
(3,457 real changes made)
(3,978 real changes made)
(2,711 missing values generated)
(3,457 real changes made)
(1,759 real changes made)
(2,670 real changes made, 2,670 to missing)
(2,670 missing values generated)
(6,168 missing values generated)
(1,797 real changes made)
(1,701 real changes made)
(1,797 real changes made)
(1,701 real changes made)
(2,267 real changes made)
(6,168 missing values generated)
(1,797 real changes made)
(1,701 real changes made)
(3,498 real changes made)
(3,901 real changes made)
(2,670 missing values generated)
(3,498 real changes made)
(1,797 real changes made)
(2,719 real changes made, 2,719 to missing)
(2,719 missing values generated)
(6,168 missing values generated)
(1,740 real changes made)
(1,709 real changes made)
(1,740 real changes made)
(1,709 real changes made)
(2,175 real changes made)
(6,168 missing values generated)
(1,740 real changes made)
(1,709 real changes made)
(3,449 real changes made)
(3,993 real changes made)
(2,719 missing values generated)
(3,449 real changes made)
(1,740 real changes made)
(2,715 real changes made, 2,715 to missing)
(2,715 missing values generated)
(6,168 missing values generated)
(1,793 real changes made)
(1,660 real changes made)
(1,793 real changes made)
(1,660 real changes made)
(2,219 real changes made)
(6,168 missing values generated)
(1,793 real changes made)
(1,660 real changes made)
(3,453 real changes made)
(3,949 real changes made)
(2,715 missing values generated)
(3,453 real changes made)
(1,793 real changes made)
(2,724 real changes made, 2,724 to missing)
(2,724 missing values generated)
(6,168 missing values generated)
(1,792 real changes made)
(1,652 real changes made)
(1,792 real changes made)
(1,652 real changes made)
(2,183 real changes made)
(6,168 missing values generated)
(1,792 real changes made)
(1,652 real changes made)
(3,444 real changes made)
(3,985 real changes made)
(2,724 missing values generated)
(3,444 real changes made)
(1,792 real changes made)
(2,687 real changes made, 2,687 to missing)
(2,687 missing values generated)
(6,168 missing values generated)
(1,770 real changes made)
(1,711 real changes made)
(1,770 real changes made)
(1,711 real changes made)
(2,244 real changes made)
(6,168 missing values generated)
(1,770 real changes made)
(1,711 real changes made)
(3,481 real changes made)
(3,924 real changes made)
(2,687 missing values generated)
(3,481 real changes made)
(1,770 real changes made)
(2,720 real changes made, 2,720 to missing)
(2,720 missing values generated)
(6,168 missing values generated)
(1,744 real changes made)
(1,704 real changes made)
(1,744 real changes made)
(1,704 real changes made)
(2,158 real changes made)
(6,168 missing values generated)
(1,744 real changes made)
(1,704 real changes made)
(3,448 real changes made)
(4,010 real changes made)
(2,720 missing values generated)
(3,448 real changes made)
(1,744 real changes made)
(2,700 real changes made, 2,700 to missing)
(2,700 missing values generated)
(6,168 missing values generated)
(1,758 real changes made)
(1,710 real changes made)
(1,758 real changes made)
(1,710 real changes made)
(2,191 real changes made)
(6,168 missing values generated)
(1,758 real changes made)
(1,710 real changes made)
(3,468 real changes made)
(3,977 real changes made)
(2,700 missing values generated)
(3,468 real changes made)
(1,758 real changes made)
(2,717 real changes made, 2,717 to missing)
(2,717 missing values generated)
(6,168 missing values generated)
(1,756 real changes made)
(1,695 real changes made)
(1,756 real changes made)
(1,695 real changes made)
(2,161 real changes made)
(6,168 missing values generated)
(1,756 real changes made)
(1,695 real changes made)
(3,451 real changes made)
(4,007 real changes made)
(2,717 missing values generated)
(3,451 real changes made)
(1,756 real changes made)
(2,707 real changes made, 2,707 to missing)
(2,707 missing values generated)
(6,168 missing values generated)
(1,741 real changes made)
(1,720 real changes made)
(1,741 real changes made)
(1,720 real changes made)
(2,178 real changes made)
(6,168 missing values generated)
(1,741 real changes made)
(1,720 real changes made)
(3,461 real changes made)
(3,990 real changes made)
(2,707 missing values generated)
(3,461 real changes made)
(1,741 real changes made)
(2,708 real changes made, 2,708 to missing)
(2,708 missing values generated)
(6,168 missing values generated)
(1,723 real changes made)
(1,737 real changes made)
(1,723 real changes made)
(1,737 real changes made)
(2,216 real changes made)
(6,168 missing values generated)
(1,723 real changes made)
(1,737 real changes made)
(3,460 real changes made)
(3,952 real changes made)
(2,708 missing values generated)
(3,460 real changes made)
(1,723 real changes made)
(2,747 real changes made, 2,747 to missing)
(2,747 missing values generated)
(6,168 missing values generated)
(1,720 real changes made)
(1,701 real changes made)
(1,720 real changes made)
(1,701 real changes made)
(2,133 real changes made)
(6,168 missing values generated)
(1,720 real changes made)
(1,701 real changes made)
(3,421 real changes made)
(4,035 real changes made)
(2,747 missing values generated)
(3,421 real changes made)
(1,720 real changes made)
(2,730 real changes made, 2,730 to missing)
(2,730 missing values generated)
(6,168 missing values generated)
(1,730 real changes made)
(1,708 real changes made)
(1,730 real changes made)
(1,708 real changes made)
(2,190 real changes made)
(6,168 missing values generated)
(1,730 real changes made)
(1,708 real changes made)
(3,438 real changes made)
(3,978 real changes made)
(2,730 missing values generated)
(3,438 real changes made)
(1,730 real changes made)
(2,721 real changes made, 2,721 to missing)
(2,721 missing values generated)
(6,168 missing values generated)
(1,772 real changes made)
(1,675 real changes made)
(1,772 real changes made)
(1,675 real changes made)
(2,231 real changes made)
(6,168 missing values generated)
(1,772 real changes made)
(1,675 real changes made)
(3,447 real changes made)
(3,937 real changes made)
(2,721 missing values generated)
(3,447 real changes made)
(1,772 real changes made)
(2,718 real changes made, 2,718 to missing)
(2,718 missing values generated)
(6,168 missing values generated)
(1,751 real changes made)
(1,699 real changes made)
(1,751 real changes made)
(1,699 real changes made)
(2,175 real changes made)
(6,168 missing values generated)
(1,751 real changes made)
(1,699 real changes made)
(3,450 real changes made)
(3,993 real changes made)
(2,718 missing values generated)
(3,450 real changes made)
(1,751 real changes made)
(2,725 real changes made, 2,725 to missing)
(2,725 missing values generated)
(6,168 missing values generated)
(1,762 real changes made)
(1,681 real changes made)
(1,762 real changes made)
(1,681 real changes made)
(2,127 real changes made)
(6,168 missing values generated)
(1,762 real changes made)
(1,681 real changes made)
(3,443 real changes made)
(4,041 real changes made)
(2,725 missing values generated)
(3,443 real changes made)
(1,762 real changes made)
(2,707 real changes made, 2,707 to missing)
(2,707 missing values generated)
(6,168 missing values generated)
(1,758 real changes made)
(1,703 real changes made)
(1,758 real changes made)
(1,703 real changes made)
(2,222 real changes made)
(6,168 missing values generated)
(1,758 real changes made)
(1,703 real changes made)
(3,461 real changes made)
(3,946 real changes made)
(2,707 missing values generated)
(3,461 real changes made)
(1,758 real changes made)
(2,736 real changes made, 2,736 to missing)
(2,736 missing values generated)
(6,168 missing values generated)
(1,745 real changes made)
(1,687 real changes made)
(1,745 real changes made)
(1,687 real changes made)
(2,143 real changes made)
(6,168 missing values generated)
(1,745 real changes made)
(1,687 real changes made)
(3,432 real changes made)
(4,025 real changes made)
(2,736 missing values generated)
(3,432 real changes made)
(1,745 real changes made)
(2,693 real changes made, 2,693 to missing)
(2,693 missing values generated)
(6,168 missing values generated)
(1,759 real changes made)
(1,716 real changes made)
(1,759 real changes made)
(1,716 real changes made)
(2,207 real changes made)
(6,168 missing values generated)
(1,759 real changes made)
(1,716 real changes made)
(3,475 real changes made)
(3,961 real changes made)
(2,693 missing values generated)
(3,475 real changes made)
(1,759 real changes made)
(2,709 real changes made, 2,709 to missing)
(2,709 missing values generated)
(6,168 missing values generated)
(1,755 real changes made)
(1,704 real changes made)
(1,755 real changes made)
(1,704 real changes made)
(2,206 real changes made)
(6,168 missing values generated)
(1,755 real changes made)
(1,704 real changes made)
(3,459 real changes made)
(3,962 real changes made)
(2,709 missing values generated)
(3,459 real changes made)
(1,755 real changes made)
(2,705 real changes made, 2,705 to missing)
(2,705 missing values generated)
(6,168 missing values generated)
(1,749 real changes made)
(1,714 real changes made)
(1,749 real changes made)
(1,714 real changes made)
(2,218 real changes made)
(6,168 missing values generated)
(1,749 real changes made)
(1,714 real changes made)
(3,463 real changes made)
(3,950 real changes made)
(2,705 missing values generated)
(3,463 real changes made)
(1,749 real changes made)
(2,730 real changes made, 2,730 to missing)
(2,730 missing values generated)
(6,168 missing values generated)
(1,758 real changes made)
(1,680 real changes made)
(1,758 real changes made)
(1,680 real changes made)
(2,171 real changes made)
(6,168 missing values generated)
(1,758 real changes made)
(1,680 real changes made)
(3,438 real changes made)
(3,997 real changes made)
(2,730 missing values generated)
(3,438 real changes made)
(1,758 real changes made)
(2,730 real changes made, 2,730 to missing)
(2,730 missing values generated)
(6,168 missing values generated)
(1,720 real changes made)
(1,718 real changes made)
(1,720 real changes made)
(1,718 real changes made)
(2,181 real changes made)
(6,168 missing values generated)
(1,720 real changes made)
(1,718 real changes made)
(3,438 real changes made)
(3,987 real changes made)
(2,730 missing values generated)
(3,438 real changes made)
(1,720 real changes made)
(2,729 real changes made, 2,729 to missing)
(2,729 missing values generated)
(6,168 missing values generated)
(1,718 real changes made)
(1,721 real changes made)
(1,718 real changes made)
(1,721 real changes made)
(2,155 real changes made)
(6,168 missing values generated)
(1,718 real changes made)
(1,721 real changes made)
(3,439 real changes made)
(4,013 real changes made)
(2,729 missing values generated)
(3,439 real changes made)
(1,718 real changes made)
(2,701 real changes made, 2,701 to missing)
(2,701 missing values generated)
(6,168 missing values generated)
(1,759 real changes made)
(1,708 real changes made)
(1,759 real changes made)
(1,708 real changes made)
(2,162 real changes made)
(6,168 missing values generated)
(1,759 real changes made)
(1,708 real changes made)
(3,467 real changes made)
(4,006 real changes made)
(2,701 missing values generated)
(3,467 real changes made)
(1,759 real changes made)
(2,736 real changes made, 2,736 to missing)
(2,736 missing values generated)
(6,168 missing values generated)
(1,764 real changes made)
(1,668 real changes made)
(1,764 real changes made)
(1,668 real changes made)
(2,138 real changes made)
(6,168 missing values generated)
(1,764 real changes made)
(1,668 real changes made)
(3,432 real changes made)
(4,030 real changes made)
(2,736 missing values generated)
(3,432 real changes made)
(1,764 real changes made)
(2,705 real changes made, 2,705 to missing)
(2,705 missing values generated)
(6,168 missing values generated)
(1,739 real changes made)
(1,724 real changes made)
(1,739 real changes made)
(1,724 real changes made)
(2,215 real changes made)
(6,168 missing values generated)
(1,739 real changes made)
(1,724 real changes made)
(3,463 real changes made)
(3,953 real changes made)
(2,705 missing values generated)
(3,463 real changes made)
(1,739 real changes made)
(2,707 real changes made, 2,707 to missing)
(2,707 missing values generated)
(6,168 missing values generated)
(1,745 real changes made)
(1,716 real changes made)
(1,745 real changes made)
(1,716 real changes made)
(2,185 real changes made)
(6,168 missing values generated)
(1,745 real changes made)
(1,716 real changes made)
(3,461 real changes made)
(3,983 real changes made)
(2,707 missing values generated)
(3,461 real changes made)
(1,745 real changes made)
(2,706 real changes made, 2,706 to missing)
(2,706 missing values generated)
(6,168 missing values generated)
(1,767 real changes made)
(1,695 real changes made)
(1,767 real changes made)
(1,695 real changes made)
(2,211 real changes made)
(6,168 missing values generated)
(1,767 real changes made)
(1,695 real changes made)
(3,462 real changes made)
(3,957 real changes made)
(2,706 missing values generated)
(3,462 real changes made)
(1,767 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)

. gen baseline_egfr=.
(6,168 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 
> jul2022 aug2022 sep2022 oct2022 nov2022 dec2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(132 real changes made)
(121 real changes made)
(113 real changes made)
(134 real changes made)
(120 real changes made)
(133 real changes made)
(93 real changes made)
(96 real changes made)
(104 real changes made)
(102 real changes made)
(91 real changes made)
(96 real changes made)
(92 real changes made)
(108 real changes made)
(97 real changes made)
(100 real changes made)
(104 real changes made)
(108 real changes made)
(110 real changes made)
(94 real changes made)
(109 real changes made)
(84 real changes made)
(93 real changes made)
(92 real changes made)
(76 real changes made)
(82 real changes made)
(77 real changes made)
(107 real changes made)
(85 real changes made)
(103 real changes made)
(76 real changes made)
(52 real changes made)
(103 real changes made)
(85 real changes made)
(80 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab case baseline_esrd

           | baseline_e
           |    srd
      case |   No ESRD |     Total
-----------+-----------+----------
         0 |     4,483 |     4,483 
         1 |     1,685 |     1,685 
-----------+-----------+----------
     Total |     6,168 |     6,168 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. * Drop COVID-19 cases without any matched contemporary comparators after further application of exclusion criteria
. generate match_counts1=.
(6,168 missing values generated)

. order patient_id set_id match_counts match_counts1

. bysort set_id: replace match_counts1=_N-1
(6,168 real changes made)

. replace match_counts1=. if case==0
(4,483 real changes made, 4,483 to missing)

. drop match_counts

. rename match_counts1 match_counts

. count if match_counts==0
  95

. drop if match_counts==0
(95 observations deleted)

. safetab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,483       73.82       73.82
          1 |      1,590       26.18      100.00
------------+-----------------------------------
      Total |      6,073      100.00

. tab match_counts

match_count |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        105        6.60        6.60
          2 |        314       19.75       26.35
          3 |      1,171       73.65      100.00
------------+-----------------------------------
      Total |      1,590      100.00

. 
. bysort set_id: egen set_case_mean = mean(case) // if mean of exposure var is 0 then only uncase in set, if 1 then only case in set

. gen valid_set = (set_case_mean>0 & set_case_mean<1) // ==1 is valid set containing both case and uncase

. tab valid_set, miss

  valid_set |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        237        3.90        3.90
          1 |      5,836       96.10      100.00
------------+-----------------------------------
      Total |      6,073      100.00

. tab valid_set case, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |         case
 valid_set |         0          1 |     Total
-----------+----------------------+----------
         0 |       237          0 |       237 
           |      5.29       0.00 |      3.90 
-----------+----------------------+----------
         1 |     4,246      1,590 |     5,836 
           |     94.71     100.00 |     96.10 
-----------+----------------------+----------
     Total |     4,483      1,590 |     6,073 
           |    100.00     100.00 |    100.00 

. keep if valid_set==1
(237 observations deleted)

. drop valid_set set_case_mean

. 
. ** Exposure
. label define case 0 "Contemporary comparator" ///
>                                   1 "SARS-CoV-2"

. label values case case

. safetab case 

                   case |      Freq.     Percent        Cum.
------------------------+-----------------------------------
Contemporary comparator |      4,246       72.76       72.76
             SARS-CoV-2 |      1,590       27.24      100.00
------------------------+-----------------------------------
                  Total |      5,836      100.00

. 
. * COVID-19 severity
. gen covid_severity = case

. replace covid_severity = 2 if covid_hospitalised==1
(166 real changes made)

. replace covid_severity = 3 if covid_critical_care==1
(80 real changes made)

. replace covid_severity = 3 if covid_critical_days==1
(80 real changes made)

. label define covid_severity     0 "Contemporary comparator"             ///
>                                                         1 "Non-hospitalised COVID" ///
>                                                         2 "Hospitalised COVID"          ///
>                                                         3 "Critical care COVID"

. label values covid_severity covid_severity

. label var covid_severity "SARS-CoV-2 severity"

. drop covid_critical_care

. drop covid_critical_days

. safetab covid_severity, m

    SARS-CoV-2 severity |      Freq.     Percent        Cum.
------------------------+-----------------------------------
Contemporary comparator |      4,246       72.76       72.76
 Non-hospitalised COVID |      1,283       21.98       94.74
     Hospitalised COVID |        147        2.52       97.26
    Critical care COVID |        160        2.74      100.00
------------------------+-----------------------------------
                  Total |      5,836      100.00

. 
. * COVID-19 acute kidney injury
. gen covid_aki = case

. replace covid_aki = 2 if covid_hospitalised==1
(166 real changes made)

. replace covid_aki = 3 if covid_acute_kidney_injury==1
(81 real changes made)

. label define covid_aki  0 "Contemporary comparator"                     ///
>                                                 1 "Non-hospitalised COVID"              ///
>                                                 2 "Hospitalised COVID"  ///
>                                                 3 "Hospitalised COVID-AKI"

. label values covid_aki covid_aki

. label var covid_aki "COVID-19 acute kidney injury"

. drop covid_acute_kidney_injury

. safetab covid_aki, m

  COVID-19 acute kidney |
                 injury |      Freq.     Percent        Cum.
------------------------+-----------------------------------
Contemporary comparator |      4,246       72.76       72.76
 Non-hospitalised COVID |      1,350       23.13       95.89
     Hospitalised COVID |        159        2.72       98.61
 Hospitalised COVID-AKI |         81        1.39      100.00
------------------------+-----------------------------------
                  Total |      5,836      100.00

. 
. * COVID-19 kidney replacement therapy
. gen covid_krt_combined = covid_krt_icd_10
(4,246 missing values generated)

. replace covid_krt_combined = covid_krt_opcs_4 if covid_krt_icd_10==0
(71 real changes made)

. gen covid_krt = case

. replace covid_krt = 2 if covid_hospitalised==1
(166 real changes made)

. replace covid_krt = 3 if covid_krt_combined==1
(156 real changes made)

. label define covid_krt  0 "Contemporary comparator"                     ///
>                                                 1 "Non-hospitalised SARS-CoV-2"         ///
>                                                 2 "No KRT hospitalised COVID-19"        ///
>                                                 3 "KRT hospitalised COVID-19"

. label values covid_krt covid_krt

. label var covid_krt "COVID-19 kidney replacement therapy"

. drop covid_krt_icd_10

. drop covid_krt_opcs_4

. safetab covid_krt, m

 COVID-19 kidney replacement |
                     therapy |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
     Contemporary comparator |      4,246       72.76       72.76
 Non-hospitalised SARS-CoV-2 |      1,280       21.93       94.69
No KRT hospitalised COVID-19 |        154        2.64       97.33
   KRT hospitalised COVID-19 |        156        2.67      100.00
-----------------------------+-----------------------------------
                       Total |      5,836      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(4,669 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(4,658 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(4,661 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(4,671 missing values generated)

. format covidvax4date %td

. *First vaccination in the UK was on 08/12/2020
. *di date("20201208", "YMD") -> 22257
. foreach var of varlist covidvax1date covidvax2date covidvax3date covidvax4date {
  2. replace `var' = . if `var'<22257
  3. replace `var' = . if `var' >= (index_date - 7)
  4. }
(0 real changes made)
(822 real changes made, 822 to missing)
(0 real changes made)
(844 real changes made, 844 to missing)
(0 real changes made)
(845 real changes made, 845 to missing)
(0 real changes made)
(896 real changes made, 896 to missing)

. gen covid_vax = 1

. replace covid_vax = 2 if covidvax1date!=.
(345 real changes made)

. replace covid_vax = 3 if covidvax2date!=.
(334 real changes made)

. replace covid_vax = 4 if covidvax3date!=.
(330 real changes made)

. replace covid_vax = 5 if covidvax4date!=.
(269 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  1 "Pre-vaccination"                     ///
>                                                 2 "1 vaccine dose"                      ///
>                                                 3 "2 vaccine doses"                     ///
>                                                 4 "3 vaccine doses"                     ///
>                                                 5 "4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "Vaccination status"

. safetab covid_vax, m

    Vaccination |
         status |      Freq.     Percent        Cum.
----------------+-----------------------------------
Pre-vaccination |      4,797       82.20       82.20
 1 vaccine dose |        225        3.86       86.05
2 vaccine doses |        253        4.34       90.39
3 vaccine doses |        292        5.00       95.39
4 vaccine doses |        269        4.61      100.00
----------------+-----------------------------------
          Total |      5,836      100.00

. 
. * COVID-19 wave
. gen wave = 1

. replace wave = 2 if index_month=="sep2020"
(208 real changes made)

. replace wave = 2 if index_month=="oct2020"
(168 real changes made)

. replace wave = 2 if index_month=="nov2020"
(158 real changes made)

. replace wave = 2 if index_month=="dec2020"
(150 real changes made)

. replace wave = 2 if index_month=="jan2021"
(180 real changes made)

. replace wave = 2 if index_month=="feb2021"
(160 real changes made)

. replace wave = 2 if index_month=="mar2021"
(177 real changes made)

. replace wave = 2 if index_month=="apr2021"
(150 real changes made)

. replace wave = 2 if index_month=="may2021"
(157 real changes made)

. replace wave = 2 if index_month=="jun2021"
(154 real changes made)

. replace wave = 3 if index_month=="jul2021"
(153 real changes made)

. replace wave = 3 if index_month=="aug2021"
(189 real changes made)

. replace wave = 3 if index_month=="sep2021"
(152 real changes made)

. replace wave = 3 if index_month=="oct2021"
(186 real changes made)

. replace wave = 3 if index_month=="nov2021"
(130 real changes made)

. replace wave = 4 if index_month=="dec2021"
(149 real changes made)

. replace wave = 4 if index_month=="jan2022"
(133 real changes made)

. replace wave = 4 if index_month=="feb2022"
(124 real changes made)

. replace wave = 4 if index_month=="mar2022"
(142 real changes made)

. replace wave = 4 if index_month=="apr2022"
(149 real changes made)

. replace wave = 4 if index_month=="may2022"
(178 real changes made)

. replace wave = 4 if index_month=="jun2022"
(147 real changes made)

. replace wave = 4 if index_month=="jul2022"
(168 real changes made)

. replace wave = 4 if index_month=="aug2022"
(141 real changes made)

. replace wave = 4 if index_month=="sep2022"
(90 real changes made)

. replace wave = 4 if index_month=="oct2022"
(165 real changes made)

. replace wave = 4 if index_month=="nov2022"
(152 real changes made)

. replace wave = 4 if index_month=="dec2022"
(137 real changes made)

. label define wave       1 "Feb20-Aug20" ///
>                                         2 "Sep20-Jun21" ///
>                                         3 "Jul21-Nov21" ///
>                                         4 "Dec21-Dec22" 

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m

   COVID-19 |
       wave |      Freq.     Percent        Cum.
------------+-----------------------------------
Feb20-Aug20 |      1,489       25.51       25.51
Sep20-Jun21 |      1,662       28.48       53.99
Jul21-Nov21 |        810       13.88       67.87
Dec21-Dec22 |      1,875       32.13      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. 
. ** Covariates
. * Check of GP consultations over past year by groups
. sum gp_count, detail

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -4
 5%            0             -3
10%            0             -3       Obs               5,836
25%            0             -3       Sum of wgt.       5,836

50%            2                      Mean            3.26268
                        Largest       Std. dev.      3.529635
75%            6             15
90%            8             15       Variance       12.45832
95%           10             16       Skewness       .6507704
99%           12             18       Kurtosis       2.314628

. bysort case: sum gp_count, detail

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Contemporary comparator

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -4
 5%            0             -3
10%            0             -3       Obs               4,246
25%            0             -3       Sum of wgt.       4,246

50%            3                      Mean           3.263542
                        Largest       Std. dev.      3.532321
75%            6             15
90%            8             15       Variance       12.47729
95%           10             15       Skewness       .6662644
99%           12             18       Kurtosis       2.371515

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = SARS-CoV-2

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -3
 5%            0             -2
10%            0             -2       Obs               1,590
25%            0             -2       Sum of wgt.       1,590

50%            2                      Mean           3.260377
                        Largest       Std. dev.      3.523561
75%            6             13
90%            8             13       Variance       12.41548
95%           10             15       Skewness       .6090456
99%           11             16       Kurtosis       2.160866


. egen gp_consults = cut(gp_count), at(0, 1, 3, 10, 1500)
(34 missing values generated)

. recode gp_consults 3=2 10=3
(2,908 changes made to gp_consults)

. label define gp_consults 0 "0" 1 "1-2" 2 "3-9" 3 ">9"

. label values gp_consults gp_consults

. label var gp_consults "GP interactions"

. tab case gp_consults

                      |               GP interactions
                 case |         0        1-2        3-9         >9 |     Total
----------------------+--------------------------------------------+----------
Contemporary comparat |     1,822        277      1,908        216 |     4,223 
           SARS-CoV-2 |       685        110        693         91 |     1,579 
----------------------+--------------------------------------------+----------
                Total |     2,507        387      2,601        307 |     5,802 

. 
. * Check of hospital admissions in preceding 5 years
. sum hosp_count, detail

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -1
10%            0             -1       Obs               5,836
25%            0             -1       Sum of wgt.       5,836

50%            0                      Mean           .4132968
                        Largest       Std. dev.      .7320697
75%            1              4
90%            2              4       Variance        .535926
95%            2              4       Skewness       1.510083
99%            3              4       Kurtosis       4.978569

. bysort case: sum hosp_count, detail

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Contemporary comparator

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -1
 5%            0             -1
10%            0             -1       Obs               4,246
25%            0             -1       Sum of wgt.       4,246

50%            0                      Mean           .4083844
                        Largest       Std. dev.      .7250948
75%            1              4
90%            2              4       Variance       .5257624
95%            2              4       Skewness       1.557631
99%            3              4       Kurtosis       5.103619

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = SARS-CoV-2

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -1
10%            0             -1       Obs               1,590
25%            0             -1       Sum of wgt.       1,590

50%            0                      Mean           .4264151
                        Largest       Std. dev.      .7504522
75%            1              3
90%            2              3       Variance       .5631785
95%            2              3       Skewness       1.391106
99%            3              3       Kurtosis       4.674027


. egen admissions = cut(hosp_count), at(0, 1, 2, 1000)
(68 missing values generated)

. label define admissions 0 "0" 1 "1" 2 ">1"

. label values admissions admissions

. label var admissions "Hospital admissions"

. tab case admissions

                      |       Hospital admissions
                 case |         0          1         >1 |     Total
----------------------+---------------------------------+----------
Contemporary comparat |     2,920        856        428 |     4,204 
           SARS-CoV-2 |     1,054        345        165 |     1,564 
----------------------+---------------------------------+----------
                Total |     3,974      1,201        593 |     5,768 

. 
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         21 |         51        0.87        0.87
         22 |         72        1.23        2.11
         23 |        110        1.88        3.99
         24 |        107        1.83        5.83
         25 |        123        2.11        7.93
         26 |        126        2.16       10.09
         27 |         91        1.56       11.65
         28 |        115        1.97       13.62
         29 |        122        2.09       15.71
         30 |        113        1.94       17.65
         31 |        128        2.19       19.84
         32 |        115        1.97       21.81
         33 |        106        1.82       23.63
         34 |        123        2.11       25.74
         35 |        119        2.04       27.78
         36 |        118        2.02       29.80
         37 |        112        1.92       31.72
         38 |        140        2.40       34.12
         39 |         97        1.66       35.78
         40 |        108        1.85       37.63
         41 |        129        2.21       39.84
         42 |        134        2.30       42.14
         43 |        122        2.09       44.23
         44 |        109        1.87       46.09
         45 |        142        2.43       48.53
         46 |        120        2.06       50.58
         47 |        121        2.07       52.66
         48 |         99        1.70       54.35
         49 |        103        1.76       56.12
         50 |        110        1.88       58.00
         51 |        111        1.90       59.90
         52 |        114        1.95       61.86
         53 |        123        2.11       63.97
         54 |        116        1.99       65.95
         55 |        117        2.00       67.96
         56 |        113        1.94       69.89
         57 |        122        2.09       71.98
         58 |        115        1.97       73.95
         59 |        108        1.85       75.81
         60 |        111        1.90       77.71
         61 |        128        2.19       79.90
         62 |         91        1.56       81.46
         63 |        112        1.92       83.38
         64 |        123        2.11       85.49
         65 |        134        2.30       87.78
         66 |        150        2.57       90.35
         67 |        119        2.04       92.39
         68 |        118        2.02       94.41
         69 |        102        1.75       96.16
         70 |        125        2.14       98.30
         71 |         69        1.18       99.49
         72 |         30        0.51      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. safecount
  5,836

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///                                     
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(5,836 differences between age and agegroup)

. 
. label var age "Age"

. label values age age

. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label var agegroup "Age group"

. label values agegroup agegroup

. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex

        Sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      2,958       50.69       50.69
       Male |      2,878       49.31      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. safecount
  5,836

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(216 real changes made)

. replace ethnicity=2 if ethnicity==3
(222 real changes made)

. replace ethnicity=3 if ethnicity==4
(225 real changes made)

. replace ethnicity=4 if ethnicity==6
(216 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///                                             
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                                                               

. label values ethnicity ethnicity

. safetab ethnicity, m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      3,487       59.75       59.75
South Asian |        222        3.80       63.55
      Black |        225        3.86       67.41
      Mixed |        216        3.70       71.11
      Other |        218        3.74       74.85
          . |      1,468       25.15      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(1,468 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(1,468 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. label var ethnicity1 "Ethnicity"

. safetab ethnicity1, m

  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      3,487       59.75       59.75
South Asian |        222        3.80       63.55
      Black |        225        3.86       67.41
      Mixed |        216        3.70       71.11
      Other |        218        3.74       74.85
    Unknown |      1,468       25.15      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |        599       10.26       10.26
                Urban minor conurbation |        551        9.44       19.71
                    Urban city and town |        594       10.18       29.88
Urban city and town in a sparse setting |        581        9.96       39.84
                  Rural town and fringe |        557        9.54       49.38
Rural town and fringe in a sparse setti |        625       10.71       60.09
            Rural village and dispersed |      1,175       20.13       80.23
Rural village and dispersed in a sparse |      1,154       19.77      100.00
----------------------------------------+-----------------------------------
                                  Total |      5,836      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(5,836 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(2,325 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(3,511 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                                       rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow  Rural tow  Rural vil  Rural vil |     Total
-----------+----------------------------------------------------------------------------------------+----------
     Rural |         0          0          0          0        557        625      1,175      1,154 |     3,511 
     Urban |       599        551        594        581          0          0          0          0 |     2,325 
-----------+----------------------------------------------------------------------------------------+----------
     Total |       599        551        594        581        557        625      1,175      1,154 |     5,836 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Contemporary comparat |     2,552      1,694 |     4,246 
           SARS-CoV-2 |       959        631 |     1,590 
----------------------+----------------------+----------
                Total |     3,511      2,325 |     5,836 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(600 real changes made, 600 to missing)

. gen     bmi = .
(5,836 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(349 changes made to bmi)

. recode  bmi . = 2 if body_mass_index<25
(1,309 changes made to bmi)

. recode  bmi . = 3 if body_mass_index<30
(1,353 changes made to bmi)

. recode  bmi . = 4 if body_mass_index<35
(1,196 changes made to bmi)

. recode  bmi . = 5 if body_mass_index<40
(679 changes made to bmi)

. recode  bmi . = 6 if body_mass_index<.
(350 changes made to bmi)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                             

. label values bmi bmi

. label var bmi "Body mass index (BMI)"

. safetab bmi, m

     Body mass index |
               (BMI) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        349        5.98        5.98
  Normal (18.5-24.9) |      1,309       22.43       28.41
Overweight (25-29.9) |      1,353       23.18       51.59
   Obese I (30-34.9) |      1,196       20.49       72.09
  Obese II (35-39.9) |        679       11.63       83.72
     Obese III (40+) |        350        6.00       89.72
                   . |        600       10.28      100.00
---------------------+-----------------------------------
               Total |      5,836      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(5,119 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(106 real changes made)

. replace smoking = 0 if smoking_status=="N"
(238 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |        238        4.08        4.08
Current/former smoker |        823       14.10       18.18
                    . |      4,775       81.82      100.00
----------------------+-----------------------------------
                Total |      5,836      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000)
(2,571 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(3,265 changes made to egfr_group)

. label define egfr_group 1 "≥105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       ≥105 |      1,006       17.24       17.24
     90-104 |        469        8.04       25.27
      75-89 |        422        7.23       32.51
      60-74 |        547        9.37       41.88
      45-59 |        524        8.98       50.86
      30-44 |        277        4.75       55.60
      15-29 |         20        0.34       55.95
          . |      2,571       44.05      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 15-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(2,571 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(4,830 changes made to ckd_stage)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6 "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |      2,444       41.88       41.88
                      CKD 3A |        524        8.98       50.86
                      CKD 3B |        277        4.75       55.60
                       CKD 4 |         20        0.34       55.95
No baseline eGFR measurement |      2,571       44.05      100.00
-----------------------------+-----------------------------------
                       Total |      5,836      100.00

. 
. * Comorbidities
. rename acute_kidney_injury_baseline aki_baseline

. safetab aki_baseline

aki_baselin |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,542       94.96       94.96
          1 |        294        5.04      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,546       95.03       95.03
          1 |        290        4.97      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,724       98.08       98.08
          1 |        112        1.92      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. label var diabetes "Diabetes"

. safetab diabetes

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,667       79.97       79.97
          1 |      1,169       20.03      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,776       98.97       98.97
          1 |         60        1.03      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. safetab heart_failure

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,602       95.99       95.99
          1 |        234        4.01      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. safetab hiv

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,717       97.96       97.96
          1 |        119        2.04      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. label var hypertension "Hypertension"

. safetab hypertension

Hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,671       80.04       80.04
          1 |      1,165       19.96      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. label var non_haem_cancer "Cancer (non-haematological)"

. safetab non_haem_cancer

     Cancer |
(non-haemat |
  ological) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,719       98.00       98.00
          1 |        117        2.00      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. safetab myocardial_infarction

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,248       89.92       89.92
          1 |        588       10.08      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,716       97.94       97.94
          1 |        120        2.06      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,535       94.84       94.84
          1 |        301        5.16      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. safetab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,719       98.00       98.00
          1 |        117        2.00      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,720       98.01       98.01
          1 |        116        1.99      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(221 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(528 real changes made)

. replace cardiovascular = 1 if pvd==1
(94 real changes made)

. replace cardiovascular = 1 if stroke==1
(94 real changes made)

. label var cardiovascular "Cardiovascular diseases"

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(116 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(293 real changes made)

. replace immunosuppressed = 1 if lupus==1
(110 real changes made)

. label var immunosuppressed "Immunosuppressive diseases"

. safetab cardiovascular

Cardiovascu |
        lar |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,609       78.98       78.98
          1 |      1,227       21.02      100.00
------------+-----------------------------------
      Total |      5,836      100.00

. safetab immunosuppressed

Immunosuppr |
     essive |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,257       90.08       90.08
          1 |        579        9.92      100.00
------------+-----------------------------------
      Total |      5,836      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2020 ///
>                                                                                 creatinine_mar2020 ///
>                                                                                 creatinine_apr2020 ///
>                                                                                 creatinine_may2020 ///
>                                                                                 creatinine_jun2020 ///
>                                                                                 creatinine_jul2020 ///
>                                                                                 creatinine_aug2020 ///
>                                                                                 creatinine_sep2020 ///
>                                                                                 creatinine_oct2020 ///
>                                                                                 creatinine_nov2020 ///
>                                                                                 creatinine_dec2020 ///
>                                                                                 creatinine_jan2021 ///
>                                                                                 creatinine_feb2021 ///
>                                                                                 creatinine_mar2021 ///
>                                                                                 creatinine_apr2021 ///
>                                                                                 creatinine_may2021 ///
>                                                                                 creatinine_jun2021 ///
>                                                                                 creatinine_jul2021 ///
>                                                                                 creatinine_aug2021 ///
>                                                                                 creatinine_sep2021 ///
>                                                                                 creatinine_oct2021 ///
>                                                                                 creatinine_nov2021 ///
>                                                                                 creatinine_dec2021 ///
>                                                                                 creatinine_jan2022 ///
>                                                                                 creatinine_feb2022 ///
>                                                                                 creatinine_mar2022 ///
>                                                                                 creatinine_apr2022 ///
>                                                                                 creatinine_may2022 ///
>                                                                                 creatinine_jun2022 ///
>                                                                                 creatinine_jul2022 ///
>                                                                                 creatinine_aug2022 ///
>                                                                                 creatinine_sep2022 ///
>                                                                                 creatinine_oct2022 ///
>                                                                                 creatinine_nov2022 ///
>                                                                                 creatinine_dec2022 ///
>                                                                                 creatinine_jan2023 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 3000)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex==0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex==1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_monthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(2,590 real changes made, 2,590 to missing)
(2,590 missing values generated)
(5,836 missing values generated)
(1,601 real changes made)
(1,645 real changes made)
(1,601 real changes made)
(1,645 real changes made)
(2,018 real changes made)
(5,836 missing values generated)
(1,601 real changes made)
(1,645 real changes made)
(3,246 real changes made)
(3,818 real changes made)
(2,590 missing values generated)
(3,246 real changes made)
(1,601 real changes made)
(2,583 real changes made, 2,583 to missing)
(2,583 missing values generated)
(5,836 missing values generated)
(1,627 real changes made)
(1,626 real changes made)
(1,627 real changes made)
(1,626 real changes made)
(2,081 real changes made)
(5,836 missing values generated)
(1,627 real changes made)
(1,626 real changes made)
(3,253 real changes made)
(3,755 real changes made)
(2,583 missing values generated)
(3,253 real changes made)
(1,627 real changes made)
(2,537 real changes made, 2,537 to missing)
(2,537 missing values generated)
(5,836 missing values generated)
(1,667 real changes made)
(1,632 real changes made)
(1,667 real changes made)
(1,632 real changes made)
(2,128 real changes made)
(5,836 missing values generated)
(1,667 real changes made)
(1,632 real changes made)
(3,299 real changes made)
(3,708 real changes made)
(2,537 missing values generated)
(3,299 real changes made)
(1,667 real changes made)
(2,540 real changes made, 2,540 to missing)
(2,540 missing values generated)
(5,836 missing values generated)
(1,636 real changes made)
(1,660 real changes made)
(1,636 real changes made)
(1,660 real changes made)
(2,073 real changes made)
(5,836 missing values generated)
(1,636 real changes made)
(1,660 real changes made)
(3,296 real changes made)
(3,763 real changes made)
(2,540 missing values generated)
(3,296 real changes made)
(1,636 real changes made)
(2,593 real changes made, 2,593 to missing)
(2,593 missing values generated)
(5,836 missing values generated)
(1,670 real changes made)
(1,573 real changes made)
(1,670 real changes made)
(1,573 real changes made)
(2,012 real changes made)
(5,836 missing values generated)
(1,670 real changes made)
(1,573 real changes made)
(3,243 real changes made)
(3,824 real changes made)
(2,593 missing values generated)
(3,243 real changes made)
(1,670 real changes made)
(2,552 real changes made, 2,552 to missing)
(2,552 missing values generated)
(5,836 missing values generated)
(1,681 real changes made)
(1,603 real changes made)
(1,681 real changes made)
(1,603 real changes made)
(2,097 real changes made)
(5,836 missing values generated)
(1,681 real changes made)
(1,603 real changes made)
(3,284 real changes made)
(3,739 real changes made)
(2,552 missing values generated)
(3,284 real changes made)
(1,681 real changes made)
(2,539 real changes made, 2,539 to missing)
(2,539 missing values generated)
(5,836 missing values generated)
(1,653 real changes made)
(1,644 real changes made)
(1,653 real changes made)
(1,644 real changes made)
(2,095 real changes made)
(5,836 missing values generated)
(1,653 real changes made)
(1,644 real changes made)
(3,297 real changes made)
(3,741 real changes made)
(2,539 missing values generated)
(3,297 real changes made)
(1,653 real changes made)
(2,577 real changes made, 2,577 to missing)
(2,577 missing values generated)
(5,836 missing values generated)
(1,654 real changes made)
(1,605 real changes made)
(1,654 real changes made)
(1,605 real changes made)
(2,048 real changes made)
(5,836 missing values generated)
(1,654 real changes made)
(1,605 real changes made)
(3,259 real changes made)
(3,788 real changes made)
(2,577 missing values generated)
(3,259 real changes made)
(1,654 real changes made)
(2,563 real changes made, 2,563 to missing)
(2,563 missing values generated)
(5,836 missing values generated)
(1,664 real changes made)
(1,609 real changes made)
(1,664 real changes made)
(1,609 real changes made)
(2,077 real changes made)
(5,836 missing values generated)
(1,664 real changes made)
(1,609 real changes made)
(3,273 real changes made)
(3,759 real changes made)
(2,563 missing values generated)
(3,273 real changes made)
(1,664 real changes made)
(2,582 real changes made, 2,582 to missing)
(2,582 missing values generated)
(5,836 missing values generated)
(1,654 real changes made)
(1,600 real changes made)
(1,654 real changes made)
(1,600 real changes made)
(2,039 real changes made)
(5,836 missing values generated)
(1,654 real changes made)
(1,600 real changes made)
(3,254 real changes made)
(3,797 real changes made)
(2,582 missing values generated)
(3,254 real changes made)
(1,654 real changes made)
(2,543 real changes made, 2,543 to missing)
(2,543 missing values generated)
(5,836 missing values generated)
(1,695 real changes made)
(1,598 real changes made)
(1,695 real changes made)
(1,598 real changes made)
(2,093 real changes made)
(5,836 missing values generated)
(1,695 real changes made)
(1,598 real changes made)
(3,293 real changes made)
(3,743 real changes made)
(2,543 missing values generated)
(3,293 real changes made)
(1,695 real changes made)
(2,567 real changes made, 2,567 to missing)
(2,567 missing values generated)
(5,836 missing values generated)
(1,627 real changes made)
(1,642 real changes made)
(1,627 real changes made)
(1,642 real changes made)
(2,112 real changes made)
(5,836 missing values generated)
(1,627 real changes made)
(1,642 real changes made)
(3,269 real changes made)
(3,724 real changes made)
(2,567 missing values generated)
(3,269 real changes made)
(1,627 real changes made)
(2,571 real changes made, 2,571 to missing)
(2,571 missing values generated)
(5,836 missing values generated)
(1,664 real changes made)
(1,601 real changes made)
(1,664 real changes made)
(1,601 real changes made)
(2,056 real changes made)
(5,836 missing values generated)
(1,664 real changes made)
(1,601 real changes made)
(3,265 real changes made)
(3,780 real changes made)
(2,571 missing values generated)
(3,265 real changes made)
(1,664 real changes made)
(2,573 real changes made, 2,573 to missing)
(2,573 missing values generated)
(5,836 missing values generated)
(1,669 real changes made)
(1,594 real changes made)
(1,669 real changes made)
(1,594 real changes made)
(2,062 real changes made)
(5,836 missing values generated)
(1,669 real changes made)
(1,594 real changes made)
(3,263 real changes made)
(3,774 real changes made)
(2,573 missing values generated)
(3,263 real changes made)
(1,669 real changes made)
(2,546 real changes made, 2,546 to missing)
(2,546 missing values generated)
(5,836 missing values generated)
(1,642 real changes made)
(1,648 real changes made)
(1,642 real changes made)
(1,648 real changes made)
(2,076 real changes made)
(5,836 missing values generated)
(1,642 real changes made)
(1,648 real changes made)
(3,290 real changes made)
(3,760 real changes made)
(2,546 missing values generated)
(3,290 real changes made)
(1,642 real changes made)
(2,609 real changes made, 2,609 to missing)
(2,609 missing values generated)
(5,836 missing values generated)
(1,621 real changes made)
(1,606 real changes made)
(1,621 real changes made)
(1,606 real changes made)
(2,047 real changes made)
(5,836 missing values generated)
(1,621 real changes made)
(1,606 real changes made)
(3,227 real changes made)
(3,789 real changes made)
(2,609 missing values generated)
(3,227 real changes made)
(1,621 real changes made)
(2,559 real changes made, 2,559 to missing)
(2,559 missing values generated)
(5,836 missing values generated)
(1,695 real changes made)
(1,582 real changes made)
(1,695 real changes made)
(1,582 real changes made)
(2,068 real changes made)
(5,836 missing values generated)
(1,695 real changes made)
(1,582 real changes made)
(3,277 real changes made)
(3,768 real changes made)
(2,559 missing values generated)
(3,277 real changes made)
(1,695 real changes made)
(2,576 real changes made, 2,576 to missing)
(2,576 missing values generated)
(5,836 missing values generated)
(1,657 real changes made)
(1,603 real changes made)
(1,657 real changes made)
(1,603 real changes made)
(2,089 real changes made)
(5,836 missing values generated)
(1,657 real changes made)
(1,603 real changes made)
(3,260 real changes made)
(3,747 real changes made)
(2,576 missing values generated)
(3,260 real changes made)
(1,657 real changes made)
(2,572 real changes made, 2,572 to missing)
(2,572 missing values generated)
(5,836 missing values generated)
(1,628 real changes made)
(1,636 real changes made)
(1,628 real changes made)
(1,636 real changes made)
(2,056 real changes made)
(5,836 missing values generated)
(1,628 real changes made)
(1,636 real changes made)
(3,264 real changes made)
(3,780 real changes made)
(2,572 missing values generated)
(3,264 real changes made)
(1,628 real changes made)
(2,535 real changes made, 2,535 to missing)
(2,535 missing values generated)
(5,836 missing values generated)
(1,656 real changes made)
(1,645 real changes made)
(1,656 real changes made)
(1,645 real changes made)
(2,123 real changes made)
(5,836 missing values generated)
(1,656 real changes made)
(1,645 real changes made)
(3,301 real changes made)
(3,713 real changes made)
(2,535 missing values generated)
(3,301 real changes made)
(1,656 real changes made)
(2,578 real changes made, 2,578 to missing)
(2,578 missing values generated)
(5,836 missing values generated)
(1,640 real changes made)
(1,618 real changes made)
(1,640 real changes made)
(1,618 real changes made)
(2,041 real changes made)
(5,836 missing values generated)
(1,640 real changes made)
(1,618 real changes made)
(3,258 real changes made)
(3,795 real changes made)
(2,578 missing values generated)
(3,258 real changes made)
(1,640 real changes made)
(2,594 real changes made, 2,594 to missing)
(2,594 missing values generated)
(5,836 missing values generated)
(1,662 real changes made)
(1,580 real changes made)
(1,662 real changes made)
(1,580 real changes made)
(2,041 real changes made)
(5,836 missing values generated)
(1,662 real changes made)
(1,580 real changes made)
(3,242 real changes made)
(3,795 real changes made)
(2,594 missing values generated)
(3,242 real changes made)
(1,662 real changes made)
(2,579 real changes made, 2,579 to missing)
(2,579 missing values generated)
(5,836 missing values generated)
(1,622 real changes made)
(1,635 real changes made)
(1,622 real changes made)
(1,635 real changes made)
(2,054 real changes made)
(5,836 missing values generated)
(1,622 real changes made)
(1,635 real changes made)
(3,257 real changes made)
(3,782 real changes made)
(2,579 missing values generated)
(3,257 real changes made)
(1,622 real changes made)
(2,584 real changes made, 2,584 to missing)
(2,584 missing values generated)
(5,836 missing values generated)
(1,653 real changes made)
(1,599 real changes made)
(1,653 real changes made)
(1,599 real changes made)
(2,077 real changes made)
(5,836 missing values generated)
(1,653 real changes made)
(1,599 real changes made)
(3,252 real changes made)
(3,759 real changes made)
(2,584 missing values generated)
(3,252 real changes made)
(1,653 real changes made)
(2,573 real changes made, 2,573 to missing)
(2,573 missing values generated)
(5,836 missing values generated)
(1,703 real changes made)
(1,560 real changes made)
(1,703 real changes made)
(1,560 real changes made)
(2,029 real changes made)
(5,836 missing values generated)
(1,703 real changes made)
(1,560 real changes made)
(3,263 real changes made)
(3,807 real changes made)
(2,573 missing values generated)
(3,263 real changes made)
(1,703 real changes made)
(2,574 real changes made, 2,574 to missing)
(2,574 missing values generated)
(5,836 missing values generated)
(1,623 real changes made)
(1,639 real changes made)
(1,623 real changes made)
(1,639 real changes made)
(2,059 real changes made)
(5,836 missing values generated)
(1,623 real changes made)
(1,639 real changes made)
(3,262 real changes made)
(3,777 real changes made)
(2,574 missing values generated)
(3,262 real changes made)
(1,623 real changes made)
(2,583 real changes made, 2,583 to missing)
(2,583 missing values generated)
(5,836 missing values generated)
(1,666 real changes made)
(1,587 real changes made)
(1,666 real changes made)
(1,587 real changes made)
(2,064 real changes made)
(5,836 missing values generated)
(1,666 real changes made)
(1,587 real changes made)
(3,253 real changes made)
(3,772 real changes made)
(2,583 missing values generated)
(3,253 real changes made)
(1,666 real changes made)
(2,587 real changes made, 2,587 to missing)
(2,587 missing values generated)
(5,836 missing values generated)
(1,631 real changes made)
(1,618 real changes made)
(1,631 real changes made)
(1,618 real changes made)
(2,056 real changes made)
(5,836 missing values generated)
(1,631 real changes made)
(1,618 real changes made)
(3,249 real changes made)
(3,780 real changes made)
(2,587 missing values generated)
(3,249 real changes made)
(1,631 real changes made)
(2,576 real changes made, 2,576 to missing)
(2,576 missing values generated)
(5,836 missing values generated)
(1,658 real changes made)
(1,602 real changes made)
(1,658 real changes made)
(1,602 real changes made)
(2,072 real changes made)
(5,836 missing values generated)
(1,658 real changes made)
(1,602 real changes made)
(3,260 real changes made)
(3,764 real changes made)
(2,576 missing values generated)
(3,260 real changes made)
(1,658 real changes made)
(2,572 real changes made, 2,572 to missing)
(2,572 missing values generated)
(5,836 missing values generated)
(1,695 real changes made)
(1,569 real changes made)
(1,695 real changes made)
(1,569 real changes made)
(2,041 real changes made)
(5,836 missing values generated)
(1,695 real changes made)
(1,569 real changes made)
(3,264 real changes made)
(3,795 real changes made)
(2,572 missing values generated)
(3,264 real changes made)
(1,695 real changes made)
(2,572 real changes made, 2,572 to missing)
(2,572 missing values generated)
(5,836 missing values generated)
(1,669 real changes made)
(1,595 real changes made)
(1,669 real changes made)
(1,595 real changes made)
(2,067 real changes made)
(5,836 missing values generated)
(1,669 real changes made)
(1,595 real changes made)
(3,264 real changes made)
(3,769 real changes made)
(2,572 missing values generated)
(3,264 real changes made)
(1,669 real changes made)
(2,540 real changes made, 2,540 to missing)
(2,540 missing values generated)
(5,836 missing values generated)
(1,692 real changes made)
(1,604 real changes made)
(1,692 real changes made)
(1,604 real changes made)
(1,991 real changes made)
(5,836 missing values generated)
(1,692 real changes made)
(1,604 real changes made)
(3,296 real changes made)
(3,845 real changes made)
(2,540 missing values generated)
(3,296 real changes made)
(1,692 real changes made)
(2,565 real changes made, 2,565 to missing)
(2,565 missing values generated)
(5,836 missing values generated)
(1,641 real changes made)
(1,630 real changes made)
(1,641 real changes made)
(1,630 real changes made)
(2,046 real changes made)
(5,836 missing values generated)
(1,641 real changes made)
(1,630 real changes made)
(3,271 real changes made)
(3,790 real changes made)
(2,565 missing values generated)
(3,271 real changes made)
(1,641 real changes made)
(2,562 real changes made, 2,562 to missing)
(2,562 missing values generated)
(5,836 missing values generated)
(1,686 real changes made)
(1,588 real changes made)
(1,686 real changes made)
(1,588 real changes made)
(2,072 real changes made)
(5,836 missing values generated)
(1,686 real changes made)
(1,588 real changes made)
(3,274 real changes made)
(3,764 real changes made)
(2,562 missing values generated)
(3,274 real changes made)
(1,686 real changes made)
(2,563 real changes made, 2,563 to missing)
(2,563 missing values generated)
(5,836 missing values generated)
(1,665 real changes made)
(1,608 real changes made)
(1,665 real changes made)
(1,608 real changes made)
(2,097 real changes made)
(5,836 missing values generated)
(1,665 real changes made)
(1,608 real changes made)
(3,273 real changes made)
(3,739 real changes made)
(2,563 missing values generated)
(3,273 real changes made)
(1,665 real changes made)
(2,576 real changes made, 2,576 to missing)
(2,576 missing values generated)
(5,836 missing values generated)
(1,623 real changes made)
(1,637 real changes made)
(1,623 real changes made)
(1,637 real changes made)
(2,085 real changes made)
(5,836 missing values generated)
(1,623 real changes made)
(1,637 real changes made)
(3,260 real changes made)
(3,751 real changes made)
(2,576 missing values generated)
(3,260 real changes made)
(1,623 real changes made)

. 
. replace index_date = index_date_28
(5,836 real changes made)

. drop index_date_28

. gen egfr15_date=.
(5,836 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 
> jul2022 aug2022 sep2022 oct2022 nov2022 dec2022 jan2023"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatinine_`x'<15 & date("01`x'", "DMY")>index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen index_date_esrd = index_date

. gen esrd_date = egfr15_date
(5,835 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if esrd_date==.
(491 real changes made)

. gen esrd = 0

. replace esrd = 1 if esrd_date!=.
(492 real changes made)

. label var esrd "Kidney failure"

. gen esrd_time = (esrd_date - index_date_esrd)
(5,344 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(5,344 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/1096=8      ///
>                                                 1097/max=9
(492 changes made to esrd_time_cat)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"                      ///
>                                                         3 "1 to 28 days"        ///
>                                                         4 "20 to 90 days"       ///
>                                                         5 "91 to 180 days"      ///
>                                                         6 "181 to 365 days"     ///
>                                                         7 "366 to 730 days"     ///
>                                                         8 "731 to 1096 days"    ///
>                                                         9 ">1096 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 covid_severity  ///
>                                                                 covid_aki               {
  2.                                                                 by `exposure',sort: sum esrd_time, de
  3.                                                                 tab esrd_time_cat `exposure', m col chi
  4.                                                                 }

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Contemporary comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           20              1       Obs                 345
25%          132              1       Sum of wgt.         345

50%          272                      Mean           334.3826
                        Largest       Std. dev.      255.1228
75%          509            958
90%          706            961       Variance       65087.66
95%          816           1016       Skewness       .5937508
99%          958           1054       Kurtosis       2.503784

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = SARS-CoV-2

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           36              1       Obs                 147
25%          113              1       Sum of wgt.         147

50%          387                      Mean           386.0544
                        Largest       Std. dev.      276.0759
75%          621            878
90%          758            904       Variance       76217.93
95%          840            949       Skewness       .1913524
99%          949            989       Kurtosis       1.832028


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |         case
   esrd_time_cat | Contempor  SARS-CoV- |     Total
-----------------+----------------------+----------
    1 to 28 days |        43         14 |        57 
                 |      1.01       0.88 |      0.98 
-----------------+----------------------+----------
   20 to 90 days |        28         18 |        46 
                 |      0.66       1.13 |      0.79 
-----------------+----------------------+----------
  91 to 180 days |        42         14 |        56 
                 |      0.99       0.88 |      0.96 
-----------------+----------------------+----------
 181 to 365 days |        89         25 |       114 
                 |      2.10       1.57 |      1.95 
-----------------+----------------------+----------
 366 to 730 days |       113         59 |       172 
                 |      2.66       3.71 |      2.95 
-----------------+----------------------+----------
731 to 1096 days |        30         17 |        47 
                 |      0.71       1.07 |      0.81 
-----------------+----------------------+----------
               . |     3,901      1,443 |     5,344 
                 |     91.87      90.75 |     91.57 
-----------------+----------------------+----------
           Total |     4,246      1,590 |     5,836 
                 |    100.00     100.00 |    100.00 

          Pearson chi2(6) =  11.6220   Pr = 0.071

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Contemporary comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           20              1       Obs                 345
25%          132              1       Sum of wgt.         345

50%          272                      Mean           334.3826
                        Largest       Std. dev.      255.1228
75%          509            958
90%          706            961       Variance       65087.66
95%          816           1016       Skewness       .5937508
99%          958           1054       Kurtosis       2.503784

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           23              1       Obs                 119
25%          135              1       Sum of wgt.         119

50%          373                      Mean           386.7395
                        Largest       Std. dev.       277.563
75%          621            878
90%          776            904       Variance       77041.23
95%          848            949       Skewness       .2475735
99%          949            989       Kurtosis       1.876678

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1             37
10%           37             42       Obs                  12
25%        182.5            323       Sum of wgt.          12

50%        470.5                      Mean           442.0833
                        Largest       Std. dev.      294.1593
75%        683.5            666
90%          723            701       Variance       86529.72
95%          876            723       Skewness      -.3018391
99%          876            876       Kurtosis       1.855272

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Critical care COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1             43
10%           43             60       Obs                  16
25%           94             89       Sum of wgt.          16

50%          373                      Mean           338.9375
                        Largest       Std. dev.      259.7279
75%        578.5            579
90%          672            639       Variance        67458.6
95%          706            672       Skewness       .0338726
99%          706            706       Kurtosis       1.348155


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |             SARS-CoV-2 severity
   esrd_time_cat | Contempor  Non-hospi  Hospitali  Critical  |     Total
-----------------+--------------------------------------------+----------
    1 to 28 days |        43         12          1          1 |        57 
                 |      1.01       0.94       0.68       0.63 |      0.98 
-----------------+--------------------------------------------+----------
   20 to 90 days |        28         13          2          3 |        46 
                 |      0.66       1.01       1.36       1.88 |      0.79 
-----------------+--------------------------------------------+----------
  91 to 180 days |        42         11          0          3 |        56 
                 |      0.99       0.86       0.00       1.88 |      0.96 
-----------------+--------------------------------------------+----------
 181 to 365 days |        89         23          1          1 |       114 
                 |      2.10       1.79       0.68       0.63 |      1.95 
-----------------+--------------------------------------------+----------
 366 to 730 days |       113         44          7          8 |       172 
                 |      2.66       3.43       4.76       5.00 |      2.95 
-----------------+--------------------------------------------+----------
731 to 1096 days |        30         16          1          0 |        47 
                 |      0.71       1.25       0.68       0.00 |      0.81 
-----------------+--------------------------------------------+----------
               . |     3,901      1,164        135        144 |     5,344 
                 |     91.87      90.72      91.84      90.00 |     91.57 
-----------------+--------------------------------------------+----------
           Total |     4,246      1,283        147        160 |     5,836 
                 |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(18) =  22.6512   Pr = 0.204

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Contemporary comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           20              1       Obs                 345
25%          132              1       Sum of wgt.         345

50%          272                      Mean           334.3826
                        Largest       Std. dev.      255.1228
75%          509            958
90%          706            961       Variance       65087.66
95%          816           1016       Skewness       .5937508
99%          958           1054       Kurtosis       2.503784

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            5              1
10%           41              1       Obs                 123
25%          120              1       Sum of wgt.         123

50%          376                      Mean           379.5122
                        Largest       Std. dev.      265.9323
75%          605            848
90%          754            855       Variance       70719.99
95%          815            878       Skewness       .2033762
99%          878            949       Kurtosis       1.832062

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1             37
10%           37             42       Obs                  13
25%           60             60       Sum of wgt.          13

50%          436                      Mean           412.6923
                        Largest       Std. dev.      300.9132
75%          666            666
90%          723            701       Variance       90548.73
95%          876            723       Skewness      -.1291001
99%          876            876       Kurtosis       1.662314

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID-AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1             47       Obs                  11
25%           47             66       Sum of wgt.          11

50%          373                      Mean           427.7273
                        Largest       Std. dev.      371.4569
75%          701            686
90%          904            701       Variance       137980.2
95%          989            904       Skewness       .1446238
99%          989            989       Kurtosis       1.542377


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |        COVID-19 acute kidney injury
   esrd_time_cat | Contempor  Non-hospi  Hospitali  Hospitali |     Total
-----------------+--------------------------------------------+----------
    1 to 28 days |        43         11          1          2 |        57 
                 |      1.01       0.81       0.63       2.47 |      0.98 
-----------------+--------------------------------------------+----------
   20 to 90 days |        28         13          3          2 |        46 
                 |      0.66       0.96       1.89       2.47 |      0.79 
-----------------+--------------------------------------------+----------
  91 to 180 days |        42         14          0          0 |        56 
                 |      0.99       1.04       0.00       0.00 |      0.96 
-----------------+--------------------------------------------+----------
 181 to 365 days |        89         23          1          1 |       114 
                 |      2.10       1.70       0.63       1.23 |      1.95 
-----------------+--------------------------------------------+----------
 366 to 730 days |       113         48          7          4 |       172 
                 |      2.66       3.56       4.40       4.94 |      2.95 
-----------------+--------------------------------------------+----------
731 to 1096 days |        30         14          1          2 |        47 
                 |      0.71       1.04       0.63       2.47 |      0.81 
-----------------+--------------------------------------------+----------
               . |     3,901      1,227        146         70 |     5,344 
                 |     91.87      90.89      91.82      86.42 |     91.57 
-----------------+--------------------------------------------+----------
           Total |     4,246      1,350        159         81 |     5,836 
                 |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(18) =  23.8710   Pr = 0.159

. gen exit_date_esrd = esrd_date
(5,344 missing values generated)

. format exit_date_esrd %td

. gen end_date = date("2023-01-31", "YMD")

. format end_date %td

. replace exit_date_esrd = min(deregistered_date, death_date, end_date, covid_exit) if esrd_date==.
(5,344 real changes made)

. replace exit_date_esrd = covid_exit if covid_exit < esrd_date
(19 real changes made)

. replace esrd_date=. if covid_exit<esrd_date&case==0
(13 real changes made, 13 to missing)

. gen esrd_denominator = 1

. gen follow_up_time_esrd = (exit_date_esrd - index_date_esrd)

. label var follow_up_time_esrd "Follow-up time (Days)"

. gen follow_up_cat_esrd = follow_up_time_esrd

. recode follow_up_cat_esrd       min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0=3                     ///
>                                                 1/365=4         ///
>                                                 366/730=5       ///
>                                                 731/1096=6      ///                                     
>                                                 1097/max=7
(5,833 changes made to follow_up_cat_esrd)

. label define follow_up_cat_esrd         1 "<-29 days"   ///
>                                                         2 "-28 to -1 days"              ///
>                                                         3 "0 days"                              ///
>                                                         4 "1 to 365 days"               ///
>                                                         5 "366 to 730 days"     ///
>                                                         6 "731 to 1096 days"    ///
>                                                         7 ">1096 days"

. label values follow_up_cat_esrd follow_up_cat_esrd

. label var follow_up_cat_esrd "Follow_up time"

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Contemporary comparat |     1,617      1,415      1,214 |     4,246 
           SARS-CoV-2 |       566        538        486 |     1,590 
----------------------+---------------------------------+----------
                Total |     2,183      1,953      1,700 |     5,836 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |          Follow_up time
  replacement therapy | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Contemporary comparat |     1,617      1,415      1,214 |     4,246 
Non-hospitalised SARS |       457        434        389 |     1,280 
No KRT hospitalised C |        52         51         51 |       154 
KRT hospitalised COVI |        57         53         46 |       156 
----------------------+---------------------------------+----------
                Total |     2,183      1,953      1,700 |     5,836 

. drop if follow_up_time_esrd<1
(0 observations deleted)

. drop if follow_up_time_esrd>1096
(0 observations deleted)

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Contemporary comparat |     1,617      1,415      1,214 |     4,246 
           SARS-CoV-2 |       566        538        486 |     1,590 
----------------------+---------------------------------+----------
                Total |     2,183      1,953      1,700 |     5,836 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |          Follow_up time
  replacement therapy | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Contemporary comparat |     1,617      1,415      1,214 |     4,246 
Non-hospitalised SARS |       457        434        389 |     1,280 
No KRT hospitalised C |        52         51         51 |       154 
KRT hospitalised COVI |        57         53         46 |       156 
----------------------+---------------------------------+----------
                Total |     2,183      1,953      1,700 |     5,836 

. gen follow_up_years_esrd = follow_up_time_esrd/365.25

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(5,836 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 
> jul2022 aug2022 sep2022 oct2022 nov2022 dec2022 jan2023"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_half_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>index_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(14 real changes made)
(15 real changes made)
(16 real changes made)
(23 real changes made)
(28 real changes made)
(31 real changes made)
(39 real changes made)
(41 real changes made)
(35 real changes made)
(34 real changes made)
(30 real changes made)
(51 real changes made)
(49 real changes made)
(38 real changes made)
(36 real changes made)
(41 real changes made)
(42 real changes made)
(37 real changes made)
(38 real changes made)
(38 real changes made)
(44 real changes made)
(57 real changes made)
(56 real changes made)
(53 real changes made)
(37 real changes made)
(34 real changes made)
(41 real changes made)
(34 real changes made)
(43 real changes made)
(41 real changes made)
(37 real changes made)
(42 real changes made)
(56 real changes made)
(40 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(362 real changes made)

. gen egfr_half = 0

. replace egfr_half = 1 if egfr_half_date!=.
(1,653 real changes made)

. label var egfr_half "50% reduction in eGFR"

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(2,571 real changes made, 2,571 to missing)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(4,183 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date,covid_exit) if egfr_half_date==. & index_date_egfr_half!=.
(1,819 real changes made)

. replace exit_date_egfr_half = covid_exit if covid_exit < egfr_half_date
(104 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(2,571 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days)"

. replace egfr_half_date=. if covid_exit<egfr_half_date&case==0
(18 real changes made, 18 to missing)

. gen egfr_half_denominator = 0

. replace egfr_half_denominator = 1 if index_date_egfr_half!=.
(3,265 real changes made)

. gen follow_up_years_egfr_half = follow_up_time_egfr_half/365.25
(2,571 missing values generated)

. 
. * AKI (or ESRD)
. gen index_date_aki = index_date

. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(5,248 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(427 real changes made)

. gen aki = 0

. replace aki = 1 if aki_date!=.
(1,015 real changes made)

. label var aki "Acute kidney injury"

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(4,821 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date,covid_exit)  if aki_date==.
(4,821 real changes made)

. replace exit_date_aki = covid_exit if covid_exit < aki_date
(21 real changes made)

. replace aki_date=. if covid_exit<aki_date&case==0
(15 real changes made, 15 to missing)

. gen aki_denominator = 1

. gen follow_up_time_aki = (exit_date_aki - index_date_aki)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. gen follow_up_years_aki = follow_up_time_aki/365.25

. 
. * Exit date (death)
. gen index_date_death = index_date

. gen exit_date_death = death_date
(5,576 missing values generated)

. gen death = 0

. replace death = 1 if death_date!=.
(260 real changes made)

. label var death "Death"

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date,covid_exit)  if death_date==.
(5,576 real changes made)

. replace exit_date_death = covid_exit if covid_exit < death_date
(6 real changes made)

. replace death_date=. if covid_exit<death_date&case==0
(4 real changes made, 4 to missing)

. gen death_denominator = 1

. gen follow_up_time_death = (exit_date_death - index_date_death)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. gen follow_up_years_death = follow_up_time_death/365.25

. 
. *Outcomes stratified by time period
. 
. local outcome "esrd egfr_half aki death"

. foreach out of local outcome {
  2. *0-29 days
. gen `out'_date29 = `out'_date if `out'_date < (index_date_`out' + 30) 
  3. gen exit_date29_`out' = `out'_date29
  4. gen index_date29_`out' = index_date_`out'
  5. format exit_date29_`out' %td
  6. replace exit_date29_`out' = min(deregistered_date, death_date, end_date, (index_date_`out' + 29)) if `out'_date29==.
  7. *stset exit_date29_`out', fail(`out'_date29) origin(index_date29_`out') id(unique) scale(365.25)
. *30-89 days
. gen `out'_date89 = `out'_date if `out'_date < (index_date_`out' + 90) 
  8. gen exit_date89_`out' = `out'_date89
  9. gen index_date89_`out' = index_date_`out' + 30
 10. format exit_date89_`out' %td
 11. replace exit_date89_`out' = min(deregistered_date, death_date, end_date, (index_date_`out' + 89)) if `out'_date89==.
 12. *stset exit_date89_`out', fail(`out'_date89) origin(index_date89_`out') id(unique) scale(365.25)
. *90-179 days
. gen `out'_date179 = `out'_date if `out'_date < (index_date_`out' + 180) 
 13. gen exit_date179_`out' = `out'_date179
 14. gen index_date179_`out' = index_date_`out' + 90
 15. format exit_date179_`out' %td
 16. replace exit_date179_`out' = min(deregistered_date, death_date, end_date, (index_date_`out' + 179)) if `out'_date179==.
 17. *stset exit_date179_`out', fail(`out'_date179) origin(index_date179_`out') id(unique) scale(365.25)
. *180+ days
. gen index_datemax_`out' = index_date_`out' + 180
 18. gen exit_datemax_`out' = exit_date_`out'
 19. gen `out'_datemax = `out'_date
 20. *stset exit_date_`out', fail(`out'_date) origin(index_datemax_`out') id(unique) scale(365.25)
. }       
(5,779 missing values generated)
(5,779 missing values generated)
(5,779 real changes made)
(5,733 missing values generated)
(5,733 missing values generated)
(5,733 real changes made)
(5,678 missing values generated)
(5,678 missing values generated)
(5,678 real changes made)
(5,357 missing values generated)
(5,497 missing values generated)
(5,497 missing values generated)
(2,571 missing values generated)
(5,497 real changes made)
(5,171 missing values generated)
(5,171 missing values generated)
(2,571 missing values generated)
(5,171 real changes made)
(4,860 missing values generated)
(4,860 missing values generated)
(2,571 missing values generated)
(4,860 real changes made)
(2,571 missing values generated)
(2,278 missing values generated)
(4,201 missing values generated)
(5,494 missing values generated)
(5,494 missing values generated)
(5,494 real changes made)
(5,420 missing values generated)
(5,420 missing values generated)
(5,420 real changes made)
(5,337 missing values generated)
(5,337 missing values generated)
(5,337 real changes made)
(4,836 missing values generated)
(5,826 missing values generated)
(5,826 missing values generated)
(5,826 real changes made)
(5,798 missing values generated)
(5,798 missing values generated)
(5,798 real changes made)
(5,757 missing values generated)
(5,757 missing values generated)
(5,757 real changes made)
(5,580 missing values generated)

. 
. save ./output/analysis_2020.dta, replace
file ./output/analysis_2020.dta saved

. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_2020.log
  log type:  text
 closed on:  24 Apr 2024, 16:18:33
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
