------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_20174.log
  log type:  text
 opened on:   2 Dec 2022, 13:14:09

. 
. ** Analysis cohort selection
. capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-9)
(53 vars, 50,000 obs)

. di "Potential COVID-19 cases extracted from OpenSAFELY:"
Potential COVID-19 cases extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/input_2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(16 vars, 50,000 obs)

. di "Potential historical comparators extracted from OpenSAFELY:"
Potential historical comparators extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/covid_matching_2017.csv, clear
(encoding automatically selected: ISO-8859-2)
(11 vars, 16,020 obs)

. di "Potential COVID-19 cases after application of exclusion criteria:"
Potential COVID-19 cases after application of exclusion criteria:

. safecount
  16,020

. capture noisily import delimited ./output/2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(7 vars, 28,967 obs)

. di "Potential historical comparators after application of exclusion criteria:"
Potential historical comparators after application of exclusion criteria:

. safecount
  28,967

. * Import COVID-19 (December 2021 to October 2022) dataset comprising individuals matched with historical comparators (limited matching variables only)  
. capture noisily import delimited ./output/input_combined_stps_covid4_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(14 vars, 3,655 obs)

. * Drop age & covid_diagnosis_date
. keep patient_id death_date date_deregistered stp krt_outcome_date male covid_date covid_month set_id case match_counts

. tempfile covid4_2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `covid4_2017_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000001.tmp saved as .dta format

. * Number of matched COVID-19 cases
. count
  3,655

. * Import matched historical comparators (limited matching variables only)
. capture noisily import delimited ./output/input_combined_stps_matches4_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 11,294 obs)

. * Drop age
. keep patient_id death_date date_deregistered stp krt_outcome_date male set_id case covid_date

. tempfile 20174_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `20174_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000002.tmp saved as .dta format

. * Number of matched historical comparators
. count
  11,294

. * Merge limited COVID-19 dataset with additional variables
. capture noisily import delimited ./output/input_covid4_2017_additional.csv, clear
(encoding automatically selected: ISO-8859-9)
(106 vars, 3,655 obs)

. merge 1:1 patient_id using `covid4_2017_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             3,655  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile covid4_2017_complete

. save `covid4_2017_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000003.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000003.tmp saved as .dta format

. di "Matched COVID-19 cases:"
Matched COVID-19 cases:

. safecount
  3,655

. * Merge limited historical comparator dataset with additional variables
. capture noisily import delimited ./output/input_20174_additional.csv, clear
(encoding automatically selected: ISO-8859-9)
(95 vars, 11,294 obs)

. merge 1:1 patient_id using `20174_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            11,294  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile 20174_complete

. save `20174_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000004.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000004.tmp saved as .dta format

. di "Matched historical comparators:"
Matched historical comparators:

. safecount
  11,294

. * Append matched COVID-19 cases and historical comparators
. append using `covid4_2017_complete', force
(note: variable date_deregistered was byte in the using data, but will be str10 now)

. order patient_id set_id match_count case

. gsort set_id -case

. count if case==0
  11,294

. di "Matched COVID-19 cases and historical comparators:"
Matched COVID-19 cases and historical comparators:

. safecount
  14,949

. tab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,294       75.55       75.55
          1 |      3,655       24.45      100.00
------------+-----------------------------------
      Total |     14,949      100.00

. * Save list of matched COVID-19 cases
. preserve

.         keep if case==1
(11,294 observations deleted)

.         keep patient_id

.         tempfile covid4_2017_matched_list

.         save `covid4_2017_matched_list', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000006.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000006.tmp saved as .dta format

. restore

. * Generate list of unmatched COVID-19 cases
. preserve

.         capture noisily import delimited ./output/input_covid4_matching.csv, clear
file ./output/input_covid4_matching.csv not found

.         * For dummy data, should do nothing in the real data
.         duplicates drop patient_id, force

Duplicates in terms of patient_id

(79 observations deleted)

.         tempfile covid4_prematching

.         save `covid4_prematching', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000008.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000008.tmp saved as .dta format

.         use `covid4_2017_matched_list', clear

.         merge 1:1 patient_id using `covid4_prematching'

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,215
        from master                         0  (_merge==1)
        from using                     11,215  (_merge==2)

    Matched                             3,655  (_merge==3)
    -----------------------------------------

.         keep if _merge==2
(3,655 observations deleted)

.         safecount
  11,215

.         save output/covid4_unmatched_2017.dta, replace
file output/covid4_unmatched_2017.dta saved

.         di "Unmatched COVID-19 cases:"
Unmatched COVID-19 cases:

.         safecount
  11,215

. restore

. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |        720        4.82        4.82
 1 Most deprived |      2,764       18.49       23.31
               2 |      2,887       19.31       42.62
               3 |      2,780       18.60       61.21
               4 |      2,907       19.45       80.66
5 Least deprived |      2,891       19.34      100.00
-----------------+-----------------------------------
           Total |     14,949      100.00

. drop if imd==0
(720 observations deleted)

. safetab imd

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |      2,764       19.43       19.43
               2 |      2,887       20.29       39.71
               3 |      2,780       19.54       59.25
               4 |      2,907       20.43       79.68
5 Least deprived |      2,891       20.32      100.00
-----------------+-----------------------------------
           Total |     14,229      100.00

. 
. * STP missing
. drop stp

. tab stp_updated

stp_updated |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     14,229      100.00      100.00
------------+-----------------------------------
      Total |     14,229      100.00

. drop if stp_updated==""
(0 observations deleted)

. bysort stp_updated: gen stp = 1 if _n==1
(14,228 missing values generated)

. replace stp = sum(stp)
(14,228 real changes made)

. drop stp_updated

. label values stp stp

. label var stp "STP"

. safetab stp

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     14,229      100.00      100.00
------------+-----------------------------------
      Total |     14,229      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(12,821 missing values generated)

. replace region = 2 if region_string=="East"
(1,438 real changes made)

. replace region = 3 if region_string=="London"
(2,872 real changes made)

. replace region = 4 if region_string=="North East"
(1,411 real changes made)

. replace region = 5 if region_string=="North West"
(1,409 real changes made)

. replace region = 6 if region_string=="South East"
(1,424 real changes made)

. replace region = 7 if region_string=="South West"
(1,386 real changes made)

. replace region = 8 if region_string=="West Midlands"
(1,452 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(1,429 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      1,408        9.90        9.90
                    East |      1,438       10.11       20.00
                  London |      2,872       20.18       40.19
              North East |      1,411        9.92       50.10
              North West |      1,409        9.90       60.00
              South East |      1,424       10.01       70.01
              South West |      1,386        9.74       79.75
           West Midlands |      1,452       10.20       89.96
Yorkshire and The Humber |      1,429       10.04      100.00
-------------------------+-----------------------------------
                   Total |     14,229      100.00

. drop if region==10
(0 observations deleted)

. safetab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      1,408        9.90        9.90
                    East |      1,438       10.11       20.00
                  London |      2,872       20.18       40.19
              North East |      1,411        9.92       50.10
              North West |      1,409        9.90       60.00
              South East |      1,424       10.01       70.01
              South West |      1,386        9.74       79.75
           West Midlands |      1,452       10.20       89.96
Yorkshire and The Humber |      1,429       10.04      100.00
-------------------------+-----------------------------------
                   Total |     14,229      100.00

. 
. * Exclusions due to deregistration and kidney replacement therapy will be checked (should already have been applied from previous steps in workflow)
. gen index_date = date(case_index_date, "YMD")

. format index_date %td

. 
. * Deregistered before index_date
. gen deregistered_date = date(date_deregistered, "YMD")
(14,131 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date
(0 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(13,810 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(0 observations deleted)

. gen index_date_28 = index_date + 28

. format index_date_28 %td

. replace krt_date = index_date_28 if krt_date < index_date_28
(65 real changes made)

. 
. * Death before index_date + 28 days (i.e. only include people who survived 28 days after index_date)
. gen death_date1 = date(death_date, "YMD")
(14,012 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28
(28 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased within 28 days of index date"

. label values deceased deceased

. tab case deceased

           |       deceased
      case | Alive at   Deceased  |     Total
-----------+----------------------+----------
         0 |    10,721         24 |    10,745 
         1 |     3,480          4 |     3,484 
-----------+----------------------+----------
     Total |    14,201         28 |    14,229 

. drop if deceased==1
(28 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators only
. gen index_year = yofd(index_date)

. gen age = index_year - year_of_birth

. gen sex = 1 if male == "Male"
(7,204 missing values generated)

. replace sex = 0 if male == "Female"
(7,204 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 ///
>                                                                                                 baseline_creatinine_mar2017 ///
>                                                                                                 baseline_creatinine_apr2017 ///
>                                                                                                 baseline_creatinine_may2017 ///
>                                                                                                 baseline_creatinine_jun2017 ///
>                                                                                                 baseline_creatinine_jul2017 ///
>                                                                                                 baseline_creatinine_aug2017 ///
>                                                                                                 baseline_creatinine_sep2017 ///
>                                                                                                 baseline_creatinine_oct2017 ///
>                                                                                                 baseline_creatinine_nov2017 ///
>                                                                                                 baseline_creatinine_dec2017 ///
>                                                                                                 baseline_creatinine_jan2018 ///
>                                                                                                 baseline_creatinine_feb2018 ///
>                                                                                                 baseline_creatinine_mar2018 ///
>                                                                                                 baseline_creatinine_apr2018 ///
>                                                                                                 baseline_creatinine_may2018 ///
>                                                                                                 baseline_creatinine_jun2018 ///
>                                                                                                 baseline_creatinine_jul2018 ///
>                                                                                                 baseline_creatinine_aug2018 ///
>                                                                                                 baseline_creatinine_sep2018 ///
>                                                                                                 baseline_creatinine_oct2018 ///
>                                                                                                 baseline_creatinine_nov2018 ///
>                                                                                                 baseline_creatinine_dec2018 ///
>                                                                                                 baseline_creatinine_jan2019 ///
>                                                                                                 baseline_creatinine_feb2019 ///
>                                                                                                 baseline_creatinine_mar2019 ///
>                                                                                                 baseline_creatinine_apr2019 ///
>                                                                                                 baseline_creatinine_may2019 ///
>                                                                                                 baseline_creatinine_jun2019 ///
>                                                                                                 baseline_creatinine_jul2019 ///
>                                                                                                 baseline_creatinine_aug2019 ///
>                                                                                                 baseline_creatinine_sep2019 ///
>                                                                                                 baseline_creatinine_feb2020 ///
>                                                                                                 baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 ///
>                                                                                                 baseline_creatinine_feb2022 ///
>                                                                                                 baseline_creatinine_mar2022 ///
>                                                                                                 baseline_creatinine_apr2022 ///
>                                                                                                 baseline_creatinine_may2022 ///
>                                                                                                 baseline_creatinine_jun2022 ///
>                                                                                                 baseline_creatinine_jul2022 ///
>                                                                                                 baseline_creatinine_aug2022 ///
>                                                                                                 baseline_creatinine_sep2022 ///
>                                                                                                 baseline_creatinine_oct2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(4,710 real changes made, 4,710 to missing)
(8,190 missing values generated)
(14,201 missing values generated)
(3,079 real changes made)
(2,932 real changes made)
(3,079 real changes made)
(2,932 real changes made)
(3,767 real changes made)
(14,201 missing values generated)
(3,079 real changes made)
(2,932 real changes made)
(6,011 real changes made)
(10,434 real changes made)
(8,190 missing values generated)
(6,011 real changes made)
(3,079 real changes made)
(4,750 real changes made, 4,750 to missing)
(8,230 missing values generated)
(14,201 missing values generated)
(3,039 real changes made)
(2,932 real changes made)
(3,039 real changes made)
(2,932 real changes made)
(3,805 real changes made)
(14,201 missing values generated)
(3,039 real changes made)
(2,932 real changes made)
(5,971 real changes made)
(10,396 real changes made)
(8,230 missing values generated)
(5,971 real changes made)
(3,039 real changes made)
(4,684 real changes made, 4,684 to missing)
(8,164 missing values generated)
(14,201 missing values generated)
(3,023 real changes made)
(3,014 real changes made)
(3,023 real changes made)
(3,014 real changes made)
(3,877 real changes made)
(14,201 missing values generated)
(3,023 real changes made)
(3,014 real changes made)
(6,037 real changes made)
(10,324 real changes made)
(8,164 missing values generated)
(6,037 real changes made)
(3,023 real changes made)
(4,709 real changes made, 4,709 to missing)
(8,189 missing values generated)
(14,201 missing values generated)
(3,073 real changes made)
(2,939 real changes made)
(3,073 real changes made)
(2,939 real changes made)
(3,815 real changes made)
(14,201 missing values generated)
(3,073 real changes made)
(2,939 real changes made)
(6,012 real changes made)
(10,386 real changes made)
(8,189 missing values generated)
(6,012 real changes made)
(3,073 real changes made)
(4,690 real changes made, 4,690 to missing)
(8,170 missing values generated)
(14,201 missing values generated)
(3,016 real changes made)
(3,015 real changes made)
(3,016 real changes made)
(3,015 real changes made)
(3,764 real changes made)
(14,201 missing values generated)
(3,016 real changes made)
(3,015 real changes made)
(6,031 real changes made)
(10,437 real changes made)
(8,170 missing values generated)
(6,031 real changes made)
(3,016 real changes made)
(4,703 real changes made, 4,703 to missing)
(8,183 missing values generated)
(14,201 missing values generated)
(3,017 real changes made)
(3,001 real changes made)
(3,017 real changes made)
(3,001 real changes made)
(3,803 real changes made)
(14,201 missing values generated)
(3,017 real changes made)
(3,001 real changes made)
(6,018 real changes made)
(10,398 real changes made)
(8,183 missing values generated)
(6,018 real changes made)
(3,017 real changes made)
(4,700 real changes made, 4,700 to missing)
(8,180 missing values generated)
(14,201 missing values generated)
(3,106 real changes made)
(2,915 real changes made)
(3,106 real changes made)
(2,915 real changes made)
(3,789 real changes made)
(14,201 missing values generated)
(3,106 real changes made)
(2,915 real changes made)
(6,021 real changes made)
(10,412 real changes made)
(8,180 missing values generated)
(6,021 real changes made)
(3,106 real changes made)
(4,736 real changes made, 4,736 to missing)
(8,216 missing values generated)
(14,201 missing values generated)
(3,069 real changes made)
(2,916 real changes made)
(3,069 real changes made)
(2,916 real changes made)
(3,852 real changes made)
(14,201 missing values generated)
(3,069 real changes made)
(2,916 real changes made)
(5,985 real changes made)
(10,349 real changes made)
(8,216 missing values generated)
(5,985 real changes made)
(3,069 real changes made)
(4,703 real changes made, 4,703 to missing)
(8,183 missing values generated)
(14,201 missing values generated)
(3,050 real changes made)
(2,968 real changes made)
(3,050 real changes made)
(2,968 real changes made)
(3,811 real changes made)
(14,201 missing values generated)
(3,050 real changes made)
(2,968 real changes made)
(6,018 real changes made)
(10,390 real changes made)
(8,183 missing values generated)
(6,018 real changes made)
(3,050 real changes made)
(4,709 real changes made, 4,709 to missing)
(8,189 missing values generated)
(14,201 missing values generated)
(3,075 real changes made)
(2,937 real changes made)
(3,075 real changes made)
(2,937 real changes made)
(3,834 real changes made)
(14,201 missing values generated)
(3,075 real changes made)
(2,937 real changes made)
(6,012 real changes made)
(10,367 real changes made)
(8,189 missing values generated)
(6,012 real changes made)
(3,075 real changes made)
(4,683 real changes made, 4,683 to missing)
(8,163 missing values generated)
(14,201 missing values generated)
(3,071 real changes made)
(2,967 real changes made)
(3,071 real changes made)
(2,967 real changes made)
(3,795 real changes made)
(14,201 missing values generated)
(3,071 real changes made)
(2,967 real changes made)
(6,038 real changes made)
(10,406 real changes made)
(8,163 missing values generated)
(6,038 real changes made)
(3,071 real changes made)
(4,687 real changes made, 4,687 to missing)
(8,167 missing values generated)
(14,201 missing values generated)
(3,047 real changes made)
(2,987 real changes made)
(3,047 real changes made)
(2,987 real changes made)
(3,846 real changes made)
(14,201 missing values generated)
(3,047 real changes made)
(2,987 real changes made)
(6,034 real changes made)
(10,355 real changes made)
(8,167 missing values generated)
(6,034 real changes made)
(3,047 real changes made)
(4,717 real changes made, 4,717 to missing)
(8,197 missing values generated)
(14,201 missing values generated)
(3,013 real changes made)
(2,991 real changes made)
(3,013 real changes made)
(2,991 real changes made)
(3,825 real changes made)
(14,201 missing values generated)
(3,013 real changes made)
(2,991 real changes made)
(6,004 real changes made)
(10,376 real changes made)
(8,197 missing values generated)
(6,004 real changes made)
(3,013 real changes made)
(4,690 real changes made, 4,690 to missing)
(8,170 missing values generated)
(14,201 missing values generated)
(3,036 real changes made)
(2,995 real changes made)
(3,036 real changes made)
(2,995 real changes made)
(3,827 real changes made)
(14,201 missing values generated)
(3,036 real changes made)
(2,995 real changes made)
(6,031 real changes made)
(10,374 real changes made)
(8,170 missing values generated)
(6,031 real changes made)
(3,036 real changes made)
(4,711 real changes made, 4,711 to missing)
(8,191 missing values generated)
(14,201 missing values generated)
(3,040 real changes made)
(2,970 real changes made)
(3,040 real changes made)
(2,970 real changes made)
(3,872 real changes made)
(14,201 missing values generated)
(3,040 real changes made)
(2,970 real changes made)
(6,010 real changes made)
(10,329 real changes made)
(8,191 missing values generated)
(6,010 real changes made)
(3,040 real changes made)
(4,769 real changes made, 4,769 to missing)
(8,249 missing values generated)
(14,201 missing values generated)
(3,011 real changes made)
(2,941 real changes made)
(3,011 real changes made)
(2,941 real changes made)
(3,784 real changes made)
(14,201 missing values generated)
(3,011 real changes made)
(2,941 real changes made)
(5,952 real changes made)
(10,417 real changes made)
(8,249 missing values generated)
(5,952 real changes made)
(3,011 real changes made)
(4,705 real changes made, 4,705 to missing)
(8,185 missing values generated)
(14,201 missing values generated)
(2,963 real changes made)
(3,053 real changes made)
(2,963 real changes made)
(3,053 real changes made)
(3,726 real changes made)
(14,201 missing values generated)
(2,963 real changes made)
(3,053 real changes made)
(6,016 real changes made)
(10,475 real changes made)
(8,185 missing values generated)
(6,016 real changes made)
(2,963 real changes made)
(4,737 real changes made, 4,737 to missing)
(8,217 missing values generated)
(14,201 missing values generated)
(3,085 real changes made)
(2,899 real changes made)
(3,085 real changes made)
(2,899 real changes made)
(3,786 real changes made)
(14,201 missing values generated)
(3,085 real changes made)
(2,899 real changes made)
(5,984 real changes made)
(10,415 real changes made)
(8,217 missing values generated)
(5,984 real changes made)
(3,085 real changes made)
(4,755 real changes made, 4,755 to missing)
(8,235 missing values generated)
(14,201 missing values generated)
(2,979 real changes made)
(2,987 real changes made)
(2,979 real changes made)
(2,987 real changes made)
(3,756 real changes made)
(14,201 missing values generated)
(2,979 real changes made)
(2,987 real changes made)
(5,966 real changes made)
(10,445 real changes made)
(8,235 missing values generated)
(5,966 real changes made)
(2,979 real changes made)
(4,737 real changes made, 4,737 to missing)
(8,217 missing values generated)
(14,201 missing values generated)
(3,083 real changes made)
(2,901 real changes made)
(3,083 real changes made)
(2,901 real changes made)
(3,821 real changes made)
(14,201 missing values generated)
(3,083 real changes made)
(2,901 real changes made)
(5,984 real changes made)
(10,380 real changes made)
(8,217 missing values generated)
(5,984 real changes made)
(3,083 real changes made)
(4,747 real changes made, 4,747 to missing)
(8,227 missing values generated)
(14,201 missing values generated)
(3,046 real changes made)
(2,928 real changes made)
(3,046 real changes made)
(2,928 real changes made)
(3,816 real changes made)
(14,201 missing values generated)
(3,046 real changes made)
(2,928 real changes made)
(5,974 real changes made)
(10,385 real changes made)
(8,227 missing values generated)
(5,974 real changes made)
(3,046 real changes made)
(4,726 real changes made, 4,726 to missing)
(8,206 missing values generated)
(14,201 missing values generated)
(3,026 real changes made)
(2,969 real changes made)
(3,026 real changes made)
(2,969 real changes made)
(3,776 real changes made)
(14,201 missing values generated)
(3,026 real changes made)
(2,969 real changes made)
(5,995 real changes made)
(10,425 real changes made)
(8,206 missing values generated)
(5,995 real changes made)
(3,026 real changes made)
(4,726 real changes made, 4,726 to missing)
(8,206 missing values generated)
(14,201 missing values generated)
(3,064 real changes made)
(2,931 real changes made)
(3,064 real changes made)
(2,931 real changes made)
(3,759 real changes made)
(14,201 missing values generated)
(3,064 real changes made)
(2,931 real changes made)
(5,995 real changes made)
(10,442 real changes made)
(8,206 missing values generated)
(5,995 real changes made)
(3,064 real changes made)
(4,747 real changes made, 4,747 to missing)
(8,227 missing values generated)
(14,201 missing values generated)
(3,014 real changes made)
(2,960 real changes made)
(3,014 real changes made)
(2,960 real changes made)
(3,834 real changes made)
(14,201 missing values generated)
(3,014 real changes made)
(2,960 real changes made)
(5,974 real changes made)
(10,367 real changes made)
(8,227 missing values generated)
(5,974 real changes made)
(3,014 real changes made)
(4,735 real changes made, 4,735 to missing)
(8,215 missing values generated)
(14,201 missing values generated)
(3,027 real changes made)
(2,959 real changes made)
(3,027 real changes made)
(2,959 real changes made)
(3,741 real changes made)
(14,201 missing values generated)
(3,027 real changes made)
(2,959 real changes made)
(5,986 real changes made)
(10,460 real changes made)
(8,215 missing values generated)
(5,986 real changes made)
(3,027 real changes made)
(4,682 real changes made, 4,682 to missing)
(8,162 missing values generated)
(14,201 missing values generated)
(3,070 real changes made)
(2,969 real changes made)
(3,070 real changes made)
(2,969 real changes made)
(3,844 real changes made)
(14,201 missing values generated)
(3,070 real changes made)
(2,969 real changes made)
(6,039 real changes made)
(10,357 real changes made)
(8,162 missing values generated)
(6,039 real changes made)
(3,070 real changes made)
(4,724 real changes made, 4,724 to missing)
(8,204 missing values generated)
(14,201 missing values generated)
(3,043 real changes made)
(2,954 real changes made)
(3,043 real changes made)
(2,954 real changes made)
(3,786 real changes made)
(14,201 missing values generated)
(3,043 real changes made)
(2,954 real changes made)
(5,997 real changes made)
(10,415 real changes made)
(8,204 missing values generated)
(5,997 real changes made)
(3,043 real changes made)
(4,751 real changes made, 4,751 to missing)
(8,231 missing values generated)
(14,201 missing values generated)
(3,059 real changes made)
(2,911 real changes made)
(3,059 real changes made)
(2,911 real changes made)
(3,760 real changes made)
(14,201 missing values generated)
(3,059 real changes made)
(2,911 real changes made)
(5,970 real changes made)
(10,441 real changes made)
(8,231 missing values generated)
(5,970 real changes made)
(3,059 real changes made)
(4,747 real changes made, 4,747 to missing)
(8,227 missing values generated)
(14,201 missing values generated)
(2,974 real changes made)
(3,000 real changes made)
(2,974 real changes made)
(3,000 real changes made)
(3,730 real changes made)
(14,201 missing values generated)
(2,974 real changes made)
(3,000 real changes made)
(5,974 real changes made)
(10,471 real changes made)
(8,227 missing values generated)
(5,974 real changes made)
(2,974 real changes made)
(4,755 real changes made, 4,755 to missing)
(8,235 missing values generated)
(14,201 missing values generated)
(3,016 real changes made)
(2,950 real changes made)
(3,016 real changes made)
(2,950 real changes made)
(3,739 real changes made)
(14,201 missing values generated)
(3,016 real changes made)
(2,950 real changes made)
(5,966 real changes made)
(10,462 real changes made)
(8,235 missing values generated)
(5,966 real changes made)
(3,016 real changes made)
(4,761 real changes made, 4,761 to missing)
(8,241 missing values generated)
(14,201 missing values generated)
(2,995 real changes made)
(2,965 real changes made)
(2,995 real changes made)
(2,965 real changes made)
(3,705 real changes made)
(14,201 missing values generated)
(2,995 real changes made)
(2,965 real changes made)
(5,960 real changes made)
(10,496 real changes made)
(8,241 missing values generated)
(5,960 real changes made)
(2,995 real changes made)
(4,729 real changes made, 4,729 to missing)
(8,209 missing values generated)
(14,201 missing values generated)
(3,029 real changes made)
(2,963 real changes made)
(3,029 real changes made)
(2,963 real changes made)
(3,820 real changes made)
(14,201 missing values generated)
(3,029 real changes made)
(2,963 real changes made)
(5,992 real changes made)
(10,381 real changes made)
(8,209 missing values generated)
(5,992 real changes made)
(3,029 real changes made)
(1,526 real changes made, 1,526 to missing)
(12,247 missing values generated)
(14,201 missing values generated)
(985 real changes made)
(969 real changes made)
(985 real changes made)
(969 real changes made)
(1,225 real changes made)
(14,201 missing values generated)
(985 real changes made)
(969 real changes made)
(1,954 real changes made)
(12,976 real changes made)
(12,247 missing values generated)
(1,954 real changes made)
(985 real changes made)
(1,540 real changes made, 1,540 to missing)
(12,261 missing values generated)
(14,201 missing values generated)
(994 real changes made)
(946 real changes made)
(994 real changes made)
(946 real changes made)
(1,236 real changes made)
(14,201 missing values generated)
(994 real changes made)
(946 real changes made)
(1,940 real changes made)
(12,965 real changes made)
(12,261 missing values generated)
(1,940 real changes made)
(994 real changes made)
(1,537 real changes made, 1,537 to missing)
(12,258 missing values generated)
(14,201 missing values generated)
(981 real changes made)
(962 real changes made)
(981 real changes made)
(962 real changes made)
(1,274 real changes made)
(14,201 missing values generated)
(981 real changes made)
(962 real changes made)
(1,943 real changes made)
(12,927 real changes made)
(12,258 missing values generated)
(1,943 real changes made)
(981 real changes made)
(1,553 real changes made, 1,553 to missing)
(12,274 missing values generated)
(14,201 missing values generated)
(966 real changes made)
(961 real changes made)
(966 real changes made)
(961 real changes made)
(1,195 real changes made)
(14,201 missing values generated)
(966 real changes made)
(961 real changes made)
(1,927 real changes made)
(13,006 real changes made)
(12,274 missing values generated)
(1,927 real changes made)
(966 real changes made)
(1,531 real changes made, 1,531 to missing)
(12,252 missing values generated)
(14,201 missing values generated)
(994 real changes made)
(955 real changes made)
(994 real changes made)
(955 real changes made)
(1,205 real changes made)
(14,201 missing values generated)
(994 real changes made)
(955 real changes made)
(1,949 real changes made)
(12,996 real changes made)
(12,252 missing values generated)
(1,949 real changes made)
(994 real changes made)
(1,544 real changes made, 1,544 to missing)
(12,265 missing values generated)
(14,201 missing values generated)
(989 real changes made)
(947 real changes made)
(989 real changes made)
(947 real changes made)
(1,246 real changes made)
(14,201 missing values generated)
(989 real changes made)
(947 real changes made)
(1,936 real changes made)
(12,955 real changes made)
(12,265 missing values generated)
(1,936 real changes made)
(989 real changes made)
(1,538 real changes made, 1,538 to missing)
(12,259 missing values generated)
(14,201 missing values generated)
(987 real changes made)
(955 real changes made)
(987 real changes made)
(955 real changes made)
(1,209 real changes made)
(14,201 missing values generated)
(987 real changes made)
(955 real changes made)
(1,942 real changes made)
(12,992 real changes made)
(12,259 missing values generated)
(1,942 real changes made)
(987 real changes made)
(1,523 real changes made, 1,523 to missing)
(12,244 missing values generated)
(14,201 missing values generated)
(1,013 real changes made)
(944 real changes made)
(1,013 real changes made)
(944 real changes made)
(1,228 real changes made)
(14,201 missing values generated)
(1,013 real changes made)
(944 real changes made)
(1,957 real changes made)
(12,973 real changes made)
(12,244 missing values generated)
(1,957 real changes made)
(1,013 real changes made)
(1,535 real changes made, 1,535 to missing)
(12,256 missing values generated)
(14,201 missing values generated)
(989 real changes made)
(956 real changes made)
(989 real changes made)
(956 real changes made)
(1,231 real changes made)
(14,201 missing values generated)
(989 real changes made)
(956 real changes made)
(1,945 real changes made)
(12,970 real changes made)
(12,256 missing values generated)
(1,945 real changes made)
(989 real changes made)
(1,501 real changes made, 1,501 to missing)
(12,222 missing values generated)
(14,201 missing values generated)
(988 real changes made)
(991 real changes made)
(988 real changes made)
(991 real changes made)
(1,253 real changes made)
(14,201 missing values generated)
(988 real changes made)
(991 real changes made)
(1,979 real changes made)
(12,948 real changes made)
(12,222 missing values generated)
(1,979 real changes made)
(988 real changes made)
(1,516 real changes made, 1,516 to missing)
(12,237 missing values generated)
(14,201 missing values generated)
(982 real changes made)
(982 real changes made)
(982 real changes made)
(982 real changes made)
(1,246 real changes made)
(14,201 missing values generated)
(982 real changes made)
(982 real changes made)
(1,964 real changes made)
(12,955 real changes made)
(12,237 missing values generated)
(1,964 real changes made)
(982 real changes made)
(1,549 real changes made, 1,549 to missing)
(12,270 missing values generated)
(14,201 missing values generated)
(960 real changes made)
(971 real changes made)
(960 real changes made)
(971 real changes made)
(1,235 real changes made)
(14,201 missing values generated)
(960 real changes made)
(971 real changes made)
(1,931 real changes made)
(12,966 real changes made)
(12,270 missing values generated)
(1,931 real changes made)
(960 real changes made)
(1,549 real changes made, 1,549 to missing)
(12,270 missing values generated)
(14,201 missing values generated)
(966 real changes made)
(965 real changes made)
(966 real changes made)
(965 real changes made)
(1,255 real changes made)
(14,201 missing values generated)
(966 real changes made)
(965 real changes made)
(1,931 real changes made)
(12,946 real changes made)
(12,270 missing values generated)
(1,931 real changes made)
(966 real changes made)
(1,533 real changes made, 1,533 to missing)
(12,254 missing values generated)
(14,201 missing values generated)
(1,008 real changes made)
(939 real changes made)
(1,008 real changes made)
(939 real changes made)
(1,253 real changes made)
(14,201 missing values generated)
(1,008 real changes made)
(939 real changes made)
(1,947 real changes made)
(12,948 real changes made)
(12,254 missing values generated)
(1,947 real changes made)
(1,008 real changes made)
(1,542 real changes made, 1,542 to missing)
(12,263 missing values generated)
(14,201 missing values generated)
(976 real changes made)
(962 real changes made)
(976 real changes made)
(962 real changes made)
(1,245 real changes made)
(14,201 missing values generated)
(976 real changes made)
(962 real changes made)
(1,938 real changes made)
(12,956 real changes made)
(12,263 missing values generated)
(1,938 real changes made)
(976 real changes made)
(1,527 real changes made, 1,527 to missing)
(12,248 missing values generated)
(14,201 missing values generated)
(992 real changes made)
(961 real changes made)
(992 real changes made)
(961 real changes made)
(1,218 real changes made)
(14,201 missing values generated)
(992 real changes made)
(961 real changes made)
(1,953 real changes made)
(12,983 real changes made)
(12,248 missing values generated)
(1,953 real changes made)
(992 real changes made)
(1,529 real changes made, 1,529 to missing)
(12,250 missing values generated)
(14,201 missing values generated)
(1,024 real changes made)
(927 real changes made)
(1,024 real changes made)
(927 real changes made)
(1,248 real changes made)
(14,201 missing values generated)
(1,024 real changes made)
(927 real changes made)
(1,951 real changes made)
(12,953 real changes made)
(12,250 missing values generated)
(1,951 real changes made)
(1,024 real changes made)
(1,515 real changes made, 1,515 to missing)
(12,236 missing values generated)
(14,201 missing values generated)
(1,006 real changes made)
(959 real changes made)
(1,006 real changes made)
(959 real changes made)
(1,264 real changes made)
(14,201 missing values generated)
(1,006 real changes made)
(959 real changes made)
(1,965 real changes made)
(12,937 real changes made)
(12,236 missing values generated)
(1,965 real changes made)
(1,006 real changes made)
(1,528 real changes made, 1,528 to missing)
(12,249 missing values generated)
(14,201 missing values generated)
(981 real changes made)
(971 real changes made)
(981 real changes made)
(971 real changes made)
(1,247 real changes made)
(14,201 missing values generated)
(981 real changes made)
(971 real changes made)
(1,952 real changes made)
(12,954 real changes made)
(12,249 missing values generated)
(1,952 real changes made)
(981 real changes made)
(1,523 real changes made, 1,523 to missing)
(12,244 missing values generated)
(14,201 missing values generated)
(994 real changes made)
(963 real changes made)
(994 real changes made)
(963 real changes made)
(1,258 real changes made)
(14,201 missing values generated)
(994 real changes made)
(963 real changes made)
(1,957 real changes made)
(12,943 real changes made)
(12,244 missing values generated)
(1,957 real changes made)
(994 real changes made)
(1,522 real changes made, 1,522 to missing)
(12,243 missing values generated)
(14,201 missing values generated)
(1,011 real changes made)
(947 real changes made)
(1,011 real changes made)
(947 real changes made)
(1,254 real changes made)
(14,201 missing values generated)
(1,011 real changes made)
(947 real changes made)
(1,958 real changes made)
(12,947 real changes made)
(12,243 missing values generated)
(1,958 real changes made)
(1,011 real changes made)
(1,527 real changes made, 1,527 to missing)
(12,248 missing values generated)
(14,201 missing values generated)
(988 real changes made)
(965 real changes made)
(988 real changes made)
(965 real changes made)
(1,244 real changes made)
(14,201 missing values generated)
(988 real changes made)
(965 real changes made)
(1,953 real changes made)
(12,957 real changes made)
(12,248 missing values generated)
(1,953 real changes made)
(988 real changes made)
(1,533 real changes made, 1,533 to missing)
(12,254 missing values generated)
(14,201 missing values generated)
(980 real changes made)
(967 real changes made)
(980 real changes made)
(967 real changes made)
(1,237 real changes made)
(14,201 missing values generated)
(980 real changes made)
(967 real changes made)
(1,947 real changes made)
(12,964 real changes made)
(12,254 missing values generated)
(1,947 real changes made)
(980 real changes made)
(1,512 real changes made, 1,512 to missing)
(12,233 missing values generated)
(14,201 missing values generated)
(1,006 real changes made)
(962 real changes made)
(1,006 real changes made)
(962 real changes made)
(1,262 real changes made)
(14,201 missing values generated)
(1,006 real changes made)
(962 real changes made)
(1,968 real changes made)
(12,939 real changes made)
(12,233 missing values generated)
(1,968 real changes made)
(1,006 real changes made)
(1,545 real changes made, 1,545 to missing)
(12,266 missing values generated)
(14,201 missing values generated)
(982 real changes made)
(953 real changes made)
(982 real changes made)
(953 real changes made)
(1,212 real changes made)
(14,201 missing values generated)
(982 real changes made)
(953 real changes made)
(1,935 real changes made)
(12,989 real changes made)
(12,266 missing values generated)
(1,935 real changes made)
(982 real changes made)
(1,520 real changes made, 1,520 to missing)
(12,241 missing values generated)
(14,201 missing values generated)
(991 real changes made)
(969 real changes made)
(991 real changes made)
(969 real changes made)
(1,318 real changes made)
(14,201 missing values generated)
(991 real changes made)
(969 real changes made)
(1,960 real changes made)
(12,883 real changes made)
(12,241 missing values generated)
(1,960 real changes made)
(991 real changes made)
(1,522 real changes made, 1,522 to missing)
(12,243 missing values generated)
(14,201 missing values generated)
(984 real changes made)
(974 real changes made)
(984 real changes made)
(974 real changes made)
(1,271 real changes made)
(14,201 missing values generated)
(984 real changes made)
(974 real changes made)
(1,958 real changes made)
(12,930 real changes made)
(12,243 missing values generated)
(1,958 real changes made)
(984 real changes made)
(1,524 real changes made, 1,524 to missing)
(12,245 missing values generated)
(14,201 missing values generated)
(994 real changes made)
(962 real changes made)
(994 real changes made)
(962 real changes made)
(1,236 real changes made)
(14,201 missing values generated)
(994 real changes made)
(962 real changes made)
(1,956 real changes made)
(12,965 real changes made)
(12,245 missing values generated)
(1,956 real changes made)
(994 real changes made)
(1,526 real changes made, 1,526 to missing)
(12,247 missing values generated)
(14,201 missing values generated)
(979 real changes made)
(975 real changes made)
(979 real changes made)
(975 real changes made)
(1,232 real changes made)
(14,201 missing values generated)
(979 real changes made)
(975 real changes made)
(1,954 real changes made)
(12,969 real changes made)
(12,247 missing values generated)
(1,954 real changes made)
(979 real changes made)
(1,523 real changes made, 1,523 to missing)
(12,244 missing values generated)
(14,201 missing values generated)
(999 real changes made)
(958 real changes made)
(999 real changes made)
(958 real changes made)
(1,245 real changes made)
(14,201 missing values generated)
(999 real changes made)
(958 real changes made)
(1,957 real changes made)
(12,956 real changes made)
(12,244 missing values generated)
(1,957 real changes made)
(999 real changes made)
(1,526 real changes made, 1,526 to missing)
(12,247 missing values generated)
(14,201 missing values generated)
(988 real changes made)
(966 real changes made)
(988 real changes made)
(966 real changes made)
(1,236 real changes made)
(14,201 missing values generated)
(988 real changes made)
(966 real changes made)
(1,954 real changes made)
(12,965 real changes made)
(12,247 missing values generated)
(1,954 real changes made)
(988 real changes made)
(1,507 real changes made, 1,507 to missing)
(12,228 missing values generated)
(14,201 missing values generated)
(1,008 real changes made)
(965 real changes made)
(1,008 real changes made)
(965 real changes made)
(1,253 real changes made)
(14,201 missing values generated)
(1,008 real changes made)
(965 real changes made)
(1,973 real changes made)
(12,948 real changes made)
(12,228 missing values generated)
(1,973 real changes made)
(1,008 real changes made)
(1,516 real changes made, 1,516 to missing)
(12,237 missing values generated)
(14,201 missing values generated)
(991 real changes made)
(973 real changes made)
(991 real changes made)
(973 real changes made)
(1,249 real changes made)
(14,201 missing values generated)
(991 real changes made)
(973 real changes made)
(1,964 real changes made)
(12,952 real changes made)
(12,237 missing values generated)
(1,964 real changes made)
(991 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)

. gen baseline_egfr=.
(14,201 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(776 real changes made)
(706 real changes made)
(574 real changes made)
(662 real changes made)
(563 real changes made)
(575 real changes made)
(437 real changes made)
(449 real changes made)
(398 real changes made)
(383 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(193 real changes made)
(199 real changes made)
(156 real changes made)
(189 real changes made)
(189 real changes made)
(205 real changes made)
(170 real changes made)
(171 real changes made)
(171 real changes made)
(171 real changes made)
(176 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab case baseline_esrd

           | baseline_e
           |    srd
      case |   No ESRD |     Total
-----------+-----------+----------
         0 |    10,721 |    10,721 
         1 |     3,480 |     3,480 
-----------+-----------+----------
     Total |    14,201 |    14,201 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. * Drop COVID-19 cases without any matched historical comparators after further application of exclusion criteria
. generate match_counts1=.
(14,201 missing values generated)

. order patient_id set_id match_counts match_counts1

. bysort set_id: replace match_counts1=_N-1
(14,201 real changes made)

. replace match_counts1=. if case==0
(10,721 real changes made, 10,721 to missing)

. drop match_counts

. rename match_counts1 match_counts

. count if match_counts==0
  756

. drop if match_counts==0
(756 observations deleted)

. safetab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,721       79.74       79.74
          1 |      2,724       20.26      100.00
------------+-----------------------------------
      Total |     13,445      100.00

. tab match_counts

match_count |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        289       10.61       10.61
          2 |        299       10.98       21.59
          3 |        398       14.61       36.20
          4 |        616       22.61       58.81
          5 |      1,122       41.19      100.00
------------+-----------------------------------
      Total |      2,724      100.00

. 
. bysort set_id: egen set_case_mean = mean(case) // if mean of exposure var is 0 then only uncase in set, if 1 then only case in set

. gen valid_set = (set_case_mean>0 & set_case_mean<1) // ==1 is valid set containing both case and uncase

. tab valid_set, miss

  valid_set |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        566        4.21        4.21
          1 |     12,879       95.79      100.00
------------+-----------------------------------
      Total |     13,445      100.00

. tab valid_set case, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |         case
 valid_set |         0          1 |     Total
-----------+----------------------+----------
         0 |       566          0 |       566 
           |      5.28       0.00 |      4.21 
-----------+----------------------+----------
         1 |    10,155      2,724 |    12,879 
           |     94.72     100.00 |     95.79 
-----------+----------------------+----------
     Total |    10,721      2,724 |    13,445 
           |    100.00     100.00 |    100.00 

. keep if valid_set==1
(566 observations deleted)

. drop valid_set set_case_mean

. 
. ** Exposure
. label define case 0 "Comparator (historical)" ///
>                                   1 "COVID-19"

. label values case case

. safetab case 

                   case |      Freq.     Percent        Cum.
------------------------+-----------------------------------
Comparator (historical) |     10,155       78.85       78.85
               COVID-19 |      2,724       21.15      100.00
------------------------+-----------------------------------
                  Total |     12,879      100.00

. 
. * COVID-19 severity
. gen covid_severity = case

. replace covid_severity = 2 if covid_hospitalised==1
(263 real changes made)

. replace covid_severity = 3 if covid_critical_care==1
(134 real changes made)

. replace covid_severity = 3 if covid_critical_days==1
(111 real changes made)

. label define covid_severity_label       0 "Historical comparator"               ///
>                                                                         1 "Non-hospitalised SARS-CoV-2" ///
>                                                                         2 "Hospitalised COVID-19"               ///
>                                                                         3 "Critical care COVID-19"

. label values covid_severity covid_severity_label

. label var covid_severity "SARS-CoV-2 severity"

. drop covid_critical_care

. drop covid_critical_days

. safetab covid_severity, m

        SARS-CoV-2 severity |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
      Historical comparator |     10,155       78.85       78.85
Non-hospitalised SARS-CoV-2 |      2,231       17.32       96.17
      Hospitalised COVID-19 |        248        1.93       98.10
     Critical care COVID-19 |        245        1.90      100.00
----------------------------+-----------------------------------
                      Total |     12,879      100.00

. 
. * COVID-19 acute kidney injury
. gen covid_aki = case

. replace covid_aki = 2 if covid_hospitalised==1
(263 real changes made)

. replace covid_aki = 3 if covid_acute_kidney_injury==1
(133 real changes made)

. label define covid_aki  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised SARS-CoV-2"         ///
>                                                 2 "No AKI hospitalised COVID-19"        ///
>                                                 3 "AKI hospitalised COVID-19"

. label values covid_aki covid_aki

. label var covid_aki "COVID-19 acute kidney injury"

. drop covid_acute_kidney_injury

. safetab covid_aki, m

COVID-19 acute kidney injury |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
       Historical comparator |     10,155       78.85       78.85
 Non-hospitalised SARS-CoV-2 |      2,344       18.20       97.05
No AKI hospitalised COVID-19 |        247        1.92       98.97
   AKI hospitalised COVID-19 |        133        1.03      100.00
-----------------------------+-----------------------------------
                       Total |     12,879      100.00

. 
. * COVID-19 kidney replacement therapy
. gen covid_krt_combined = covid_krt_icd_10
(10,155 missing values generated)

. replace covid_krt_combined = covid_krt_opcs_4 if covid_krt_icd_10==0
(137 real changes made)

. gen covid_krt = case

. replace covid_krt = 2 if covid_hospitalised==1
(263 real changes made)

. replace covid_krt = 3 if covid_krt_combined==1
(274 real changes made)

. label define covid_krt  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised SARS-CoV-2"         ///
>                                                 2 "No KRT hospitalised COVID-19"        ///
>                                                 3 "KRT hospitalised COVID-19"

. label values covid_krt covid_krt

. label var covid_krt "COVID-19 kidney replacement therapy"

. drop covid_krt_icd_10

. drop covid_krt_opcs_4

. safetab covid_krt, m

 COVID-19 kidney replacement |
                     therapy |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
       Historical comparator |     10,155       78.85       78.85
 Non-hospitalised SARS-CoV-2 |      2,215       17.20       96.05
No KRT hospitalised COVID-19 |        235        1.82       97.87
   KRT hospitalised COVID-19 |        274        2.13      100.00
-----------------------------+-----------------------------------
                       Total |     12,879      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(12,338 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(12,333 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(12,337 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(12,325 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(554 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(426 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(341 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(274 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Historical comparator"       ///
>                                                 1 "Pre-vaccination"                     ///
>                                                 2 "1 vaccine dose"                      ///
>                                                 3 "2 vaccine doses"                     ///
>                                                 4 "3 vaccine doses"                     ///
>                                                 5 "4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "Vaccination status"

. safetab covid_vax, m

   Vaccination status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     10,155       78.85       78.85
      Pre-vaccination |      1,129        8.77       87.62
       1 vaccine dose |        274        2.13       89.74
      2 vaccine doses |        341        2.65       92.39
      3 vaccine doses |        426        3.31       95.70
      4 vaccine doses |        554        4.30      100.00
----------------------+-----------------------------------
                Total |     12,879      100.00

. 
. * Calendar period
. gen calendar_period = 1 if covid_month=="feb2020"
(12,879 missing values generated)

. replace calendar_period = 1 if covid_month=="mar2020"
(0 real changes made)

. replace calendar_period = 1 if covid_month=="apr2020"
(0 real changes made)

. replace calendar_period = 1 if covid_month=="may2020"
(0 real changes made)

. replace calendar_period = 1 if covid_month=="jun2020"
(0 real changes made)

. replace calendar_period = 2 if covid_month=="jul2020"
(0 real changes made)

. replace calendar_period = 2 if covid_month=="aug2020"
(0 real changes made)

. replace calendar_period = 3 if covid_month=="sep2020"
(0 real changes made)

. replace calendar_period = 3 if covid_month=="oct2020"
(0 real changes made)

. replace calendar_period = 3 if covid_month=="nov2020"
(0 real changes made)

. replace calendar_period = 4 if covid_month=="dec2020"
(0 real changes made)

. replace calendar_period = 4 if covid_month=="jan2021"
(0 real changes made)

. replace calendar_period = 4 if covid_month=="feb2021"
(0 real changes made)

. replace calendar_period = 5 if covid_month=="mar2021"
(0 real changes made)

. replace calendar_period = 5 if covid_month=="apr2021"
(0 real changes made)

. replace calendar_period = 5 if covid_month=="may2021"
(0 real changes made)

. replace calendar_period = 5 if covid_month=="jun2021"
(0 real changes made)

. replace calendar_period = 5 if covid_month=="jul2021"
(0 real changes made)

. replace calendar_period = 5 if covid_month=="aug2021"
(0 real changes made)

. replace calendar_period = 5 if covid_month=="sep2021"
(0 real changes made)

. replace calendar_period = 5 if covid_month=="oct2021"
(0 real changes made)

. replace calendar_period = 5 if covid_month=="nov2021"
(0 real changes made)

. replace calendar_period = 6 if covid_month=="dec2021"
(335 real changes made)

. replace calendar_period = 6 if covid_month=="jan2022"
(310 real changes made)

. replace calendar_period = 6 if covid_month=="feb2022"
(256 real changes made)

. replace calendar_period = 7 if covid_month=="mar2022"
(294 real changes made)

. replace calendar_period = 7 if covid_month=="apr2022"
(254 real changes made)

. replace calendar_period = 7 if covid_month=="may2022"
(272 real changes made)

. replace calendar_period = 7 if covid_month=="jun2022"
(231 real changes made)

. replace calendar_period = 7 if covid_month=="jul2022"
(220 real changes made)

. replace calendar_period = 7 if covid_month=="aug2022"
(201 real changes made)

. replace calendar_period = 7 if covid_month=="sep2022"
(179 real changes made)

. replace calendar_period = 7 if covid_month=="oct2022"
(172 real changes made)

. replace calendar_period = 0 if case==0
(10,155 real changes made)

. label define calendar_period    0 "Historical comparator"       ///
>                                                                 1 "Feb20-Jun20 SARS-CoV-2"      ///
>                                                                 2 "Jul20-Aug20 SARS-CoV-2"      ///
>                                                                 3 "Sep20-Nov20 SARS-CoV-2"      ///
>                                                                 4 "Dec20-Feb21 SARS-CoV-2"      ///
>                                                                 5 "Mar21-Nov21 SARS-CoV-2"      ///
>                                                                 6 "Dec21-Feb22 SARS-CoV-2"      ///
>                                                                 7 "Mar22-Oct22 SARS-CoV-2"

. label values calendar_period calendar_period

. label var calendar_period "Calendar period"

. safetab calendar_period, m

       Calendar period |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
 Historical comparator |     10,155       78.85       78.85
Dec21-Feb22 SARS-CoV-2 |        901        7.00       85.85
Mar22-Oct22 SARS-CoV-2 |      1,823       14.15      100.00
-----------------------+-----------------------------------
                 Total |     12,879      100.00

. 
. ** Covariates
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         19 |         19        0.15        0.15
         20 |        219        1.70        1.85
         21 |        198        1.54        3.39
         22 |        207        1.61        4.99
         23 |        241        1.87        6.86
         24 |        262        2.03        8.90
         25 |        233        1.81       10.71
         26 |        241        1.87       12.58
         27 |        264        2.05       14.63
         28 |        266        2.07       16.69
         29 |        279        2.17       18.86
         30 |        251        1.95       20.81
         31 |        251        1.95       22.76
         32 |        292        2.27       25.03
         33 |        294        2.28       27.31
         34 |        242        1.88       29.19
         35 |        209        1.62       30.81
         36 |        263        2.04       32.85
         37 |        275        2.14       34.99
         38 |        259        2.01       37.00
         39 |        242        1.88       38.88
         40 |        257        2.00       40.87
         41 |        257        2.00       42.87
         42 |        280        2.17       45.04
         43 |        279        2.17       47.21
         44 |        240        1.86       49.07
         45 |        249        1.93       51.01
         46 |        272        2.11       53.12
         47 |        267        2.07       55.19
         48 |        292        2.27       57.46
         49 |        236        1.83       59.29
         50 |        243        1.89       61.18
         51 |        264        2.05       63.23
         52 |        251        1.95       65.18
         53 |        291        2.26       67.44
         54 |        281        2.18       69.62
         55 |        232        1.80       71.42
         56 |        269        2.09       73.51
         57 |        250        1.94       75.45
         58 |        260        2.02       77.47
         59 |        238        1.85       79.32
         60 |        257        2.00       81.31
         61 |        252        1.96       83.27
         62 |        248        1.93       85.19
         63 |        252        1.96       87.15
         64 |        231        1.79       88.94
         65 |        261        2.03       90.97
         66 |        273        2.12       93.09
         67 |        267        2.07       95.16
         68 |        260        2.02       97.18
         69 |        233        1.81       98.99
         70 |         42        0.33       99.32
         71 |         38        0.30       99.61
         72 |         50        0.39      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. safecount
  12,879

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///                                     
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(12879 differences between age and agegroup)

. 
. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label values agegroup agegroup

. label var agegroup "Age group"

. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      6,522       50.64       50.64
       Male |      6,357       49.36      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. safecount
  12,879

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(490 real changes made)

. replace ethnicity=2 if ethnicity==3
(476 real changes made)

. replace ethnicity=3 if ethnicity==4
(446 real changes made)

. replace ethnicity=4 if ethnicity==6
(490 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///                                             
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                                                               

. label values ethnicity ethnicity

. safetab ethnicity, m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      7,773       60.35       60.35
South Asian |        476        3.70       64.05
      Black |        446        3.46       67.51
      Mixed |        490        3.80       71.32
      Other |        478        3.71       75.03
          . |      3,216       24.97      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(3,216 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(3,216 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. safetab ethnicity1, m

 ethnicity1 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |      7,773       60.35       60.35
South Asian |        476        3.70       64.05
      Black |        446        3.46       67.51
      Mixed |        490        3.80       71.32
      Other |        478        3.71       75.03
    Unknown |      3,216       24.97      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      1,317       10.23       10.23
                Urban minor conurbation |      1,269        9.85       20.08
                    Urban city and town |      1,300       10.09       30.17
Urban city and town in a sparse setting |      1,201        9.33       39.50
                  Rural town and fringe |      1,323       10.27       49.77
Rural town and fringe in a sparse setti |      1,336       10.37       60.14
            Rural village and dispersed |      2,527       19.62       79.77
Rural village and dispersed in a sparse |      2,606       20.23      100.00
----------------------------------------+-----------------------------------
                                  Total |     12,879      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(12,879 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(5,087 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(7,792 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                                       rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow  Rural tow  Rural vil  Rural vil |     Total
-----------+----------------------------------------------------------------------------------------+----------
     Rural |         0          0          0          0      1,323      1,336      2,527      2,606 |     7,792 
     Urban |     1,317      1,269      1,300      1,201          0          0          0          0 |     5,087 
-----------+----------------------------------------------------------------------------------------+----------
     Total |     1,317      1,269      1,300      1,201      1,323      1,336      2,527      2,606 |    12,879 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Comparator (historica |     6,122      4,033 |    10,155 
             COVID-19 |     1,670      1,054 |     2,724 
----------------------+----------------------+----------
                Total |     7,792      5,087 |    12,879 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(1,332 real changes made, 1,332 to missing)

. gen     bmi = .
(12,879 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(787 changes made to bmi)

. recode  bmi . = 2 if body_mass_index<25
(2865 changes made to bmi)

. recode  bmi . = 3 if body_mass_index<30
(3049 changes made to bmi)

. recode  bmi . = 4 if body_mass_index<35
(2584 changes made to bmi)

. recode  bmi . = 5 if body_mass_index<40
(1484 changes made to bmi)

. recode  bmi . = 6 if body_mass_index<.
(778 changes made to bmi)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                             

. label values bmi bmi

. safetab bmi, m

                 bmi |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        787        6.11        6.11
  Normal (18.5-24.9) |      2,865       22.25       28.36
Overweight (25-29.9) |      3,049       23.67       52.03
   Obese I (30-34.9) |      2,584       20.06       72.09
  Obese II (35-39.9) |      1,484       11.52       83.62
     Obese III (40+) |        778        6.04       89.66
                   . |      1,332       10.34      100.00
---------------------+-----------------------------------
               Total |     12,879      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(11,348 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(243 real changes made)

. replace smoking = 0 if smoking_status=="N"
(539 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |        539        4.19        4.19
Current/former smoker |      1,774       13.77       17.96
                    . |     10,566       82.04      100.00
----------------------+-----------------------------------
                Total |     12,879      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000)
(6,094 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(6785 changes made to egfr_group)

. label define egfr_group 1 "105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       105 |      2,086       16.20       16.20
     90-104 |        977        7.59       23.78
      75-89 |        919        7.14       30.92
      60-74 |      1,028        7.98       38.90
      45-59 |      1,111        8.63       47.53
      30-44 |        615        4.78       52.30
      15-29 |         49        0.38       52.68
          . |      6,094       47.32      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 15-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(6,094 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(10793 changes made to ckd_stage)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6 "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |      5,010       38.90       38.90
                      CKD 3A |      1,111        8.63       47.53
                      CKD 3B |        615        4.78       52.30
                       CKD 4 |         49        0.38       52.68
No baseline eGFR measurement |      6,094       47.32      100.00
-----------------------------+-----------------------------------
                       Total |     12,879      100.00

. 
. * Comorbidities
. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,254       95.15       95.15
          1 |        625        4.85      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,630       98.07       98.07
          1 |        249        1.93      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. safetab diabetes

   diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,285       79.86       79.86
          1 |      2,594       20.14      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,753       99.02       99.02
          1 |        126        0.98      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. safetab heart_failure

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,350       95.89       95.89
          1 |        529        4.11      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. safetab hiv

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,617       97.97       97.97
          1 |        262        2.03      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. safetab hypertension

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,342       80.30       80.30
          1 |      2,537       19.70      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. safetab non_haem_cancer

non_haem_ca |
       ncer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,616       97.96       97.96
          1 |        263        2.04      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. safetab myocardial_infarction

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,590       89.99       89.99
          1 |      1,289       10.01      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,613       97.93       97.93
          1 |        266        2.07      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,239       95.03       95.03
          1 |        640        4.97      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. safetab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,610       97.91       97.91
          1 |        269        2.09      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,628       98.05       98.05
          1 |        251        1.95      100.00
------------+-----------------------------------
      Total |     12,879      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                                 creatinine_mar2017 ///
>                                                                                 creatinine_apr2017 ///
>                                                                                 creatinine_may2017 ///
>                                                                                 creatinine_jun2017 ///
>                                                                                 creatinine_jul2017 ///
>                                                                                 creatinine_aug2017 ///
>                                                                                 creatinine_sep2017 ///
>                                                                                 creatinine_oct2017 ///
>                                                                                 creatinine_nov2017 ///
>                                                                                 creatinine_dec2017 ///
>                                                                                 creatinine_jan2018 ///
>                                                                                 creatinine_feb2018 ///
>                                                                                 creatinine_mar2018 ///
>                                                                                 creatinine_apr2018 ///
>                                                                                 creatinine_may2018 ///
>                                                                                 creatinine_jun2018 ///
>                                                                                 creatinine_jul2018 ///
>                                                                                 creatinine_aug2018 ///
>                                                                                 creatinine_sep2018 ///
>                                                                                 creatinine_oct2018 ///
>                                                                                 creatinine_nov2018 ///
>                                                                                 creatinine_dec2018 ///
>                                                                                 creatinine_jan2019 ///
>                                                                                 creatinine_feb2019 ///
>                                                                                 creatinine_mar2019 ///
>                                                                                 creatinine_apr2019 ///
>                                                                                 creatinine_may2019 ///
>                                                                                 creatinine_jun2019 ///
>                                                                                 creatinine_jul2019 ///
>                                                                                 creatinine_aug2019 ///
>                                                                                 creatinine_sep2019 ///
>                                                                                 creatinine_feb2020 ///
>                                                                                 creatinine_mar2020 ///
>                                                                                 creatinine_apr2020 ///
>                                                                                 creatinine_may2020 ///
>                                                                                 creatinine_jun2020 ///
>                                                                                 creatinine_jul2020 ///
>                                                                                 creatinine_aug2020 ///
>                                                                                 creatinine_sep2020 ///
>                                                                                 creatinine_oct2020 ///
>                                                                                 creatinine_nov2020 ///
>                                                                                 creatinine_dec2020 ///
>                                                                                 creatinine_jan2021 ///
>                                                                                 creatinine_feb2021 ///
>                                                                                 creatinine_mar2021 ///
>                                                                                 creatinine_apr2021 ///
>                                                                                 creatinine_may2021 ///
>                                                                                 creatinine_jun2021 ///
>                                                                                 creatinine_jul2021 ///
>                                                                                 creatinine_aug2021 ///
>                                                                                 creatinine_sep2021 ///
>                                                                                 creatinine_oct2021 ///
>                                                                                 creatinine_nov2021 ///
>                                                                                 creatinine_dec2021 ///
>                                                                                 creatinine_jan2022 ///
>                                                                                 creatinine_feb2022 ///
>                                                                                 creatinine_mar2022 ///
>                                                                                 creatinine_apr2022 ///
>                                                                                 creatinine_may2022 ///
>                                                                                 creatinine_jun2022 ///
>                                                                                 creatinine_jul2022 ///
>                                                                                 creatinine_aug2022 ///
>                                                                                 creatinine_sep2022 ///
>                                                                                 creatinine_oct2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 3000)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex==0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex==1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_monthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(4,474 real changes made, 4,474 to missing)
(7,198 missing values generated)
(12,879 missing values generated)
(2,850 real changes made)
(2,831 real changes made)
(2,850 real changes made)
(2,831 real changes made)
(3,544 real changes made)
(12,879 missing values generated)
(2,850 real changes made)
(2,831 real changes made)
(5,681 real changes made)
(9,335 real changes made)
(7,198 missing values generated)
(5,681 real changes made)
(2,850 real changes made)
(4,495 real changes made, 4,495 to missing)
(7,219 missing values generated)
(12,879 missing values generated)
(2,820 real changes made)
(2,840 real changes made)
(2,820 real changes made)
(2,840 real changes made)
(3,516 real changes made)
(12,879 missing values generated)
(2,820 real changes made)
(2,840 real changes made)
(5,660 real changes made)
(9,363 real changes made)
(7,219 missing values generated)
(5,660 real changes made)
(2,820 real changes made)
(4,470 real changes made, 4,470 to missing)
(7,194 missing values generated)
(12,879 missing values generated)
(2,900 real changes made)
(2,785 real changes made)
(2,900 real changes made)
(2,785 real changes made)
(3,603 real changes made)
(12,879 missing values generated)
(2,900 real changes made)
(2,785 real changes made)
(5,685 real changes made)
(9,276 real changes made)
(7,194 missing values generated)
(5,685 real changes made)
(2,900 real changes made)
(4,461 real changes made, 4,461 to missing)
(7,185 missing values generated)
(12,879 missing values generated)
(2,870 real changes made)
(2,824 real changes made)
(2,870 real changes made)
(2,824 real changes made)
(3,613 real changes made)
(12,879 missing values generated)
(2,870 real changes made)
(2,824 real changes made)
(5,694 real changes made)
(9,266 real changes made)
(7,185 missing values generated)
(5,694 real changes made)
(2,870 real changes made)
(4,443 real changes made, 4,443 to missing)
(7,167 missing values generated)
(12,879 missing values generated)
(2,920 real changes made)
(2,792 real changes made)
(2,920 real changes made)
(2,792 real changes made)
(3,523 real changes made)
(12,879 missing values generated)
(2,920 real changes made)
(2,792 real changes made)
(5,712 real changes made)
(9,356 real changes made)
(7,167 missing values generated)
(5,712 real changes made)
(2,920 real changes made)
(4,467 real changes made, 4,467 to missing)
(7,191 missing values generated)
(12,879 missing values generated)
(2,906 real changes made)
(2,782 real changes made)
(2,906 real changes made)
(2,782 real changes made)
(3,601 real changes made)
(12,879 missing values generated)
(2,906 real changes made)
(2,782 real changes made)
(5,688 real changes made)
(9,278 real changes made)
(7,191 missing values generated)
(5,688 real changes made)
(2,906 real changes made)
(4,482 real changes made, 4,482 to missing)
(7,206 missing values generated)
(12,879 missing values generated)
(2,896 real changes made)
(2,777 real changes made)
(2,896 real changes made)
(2,777 real changes made)
(3,667 real changes made)
(12,879 missing values generated)
(2,896 real changes made)
(2,777 real changes made)
(5,673 real changes made)
(9,212 real changes made)
(7,206 missing values generated)
(5,673 real changes made)
(2,896 real changes made)
(4,483 real changes made, 4,483 to missing)
(7,207 missing values generated)
(12,879 missing values generated)
(2,872 real changes made)
(2,800 real changes made)
(2,872 real changes made)
(2,800 real changes made)
(3,584 real changes made)
(12,879 missing values generated)
(2,872 real changes made)
(2,800 real changes made)
(5,672 real changes made)
(9,295 real changes made)
(7,207 missing values generated)
(5,672 real changes made)
(2,872 real changes made)
(4,459 real changes made, 4,459 to missing)
(7,183 missing values generated)
(12,879 missing values generated)
(2,877 real changes made)
(2,819 real changes made)
(2,877 real changes made)
(2,819 real changes made)
(3,647 real changes made)
(12,879 missing values generated)
(2,877 real changes made)
(2,819 real changes made)
(5,696 real changes made)
(9,232 real changes made)
(7,183 missing values generated)
(5,696 real changes made)
(2,877 real changes made)
(4,438 real changes made, 4,438 to missing)
(7,162 missing values generated)
(12,879 missing values generated)
(2,914 real changes made)
(2,803 real changes made)
(2,914 real changes made)
(2,803 real changes made)
(3,650 real changes made)
(12,879 missing values generated)
(2,914 real changes made)
(2,803 real changes made)
(5,717 real changes made)
(9,229 real changes made)
(7,162 missing values generated)
(5,717 real changes made)
(2,914 real changes made)
(4,509 real changes made, 4,509 to missing)
(7,233 missing values generated)
(12,879 missing values generated)
(2,880 real changes made)
(2,766 real changes made)
(2,880 real changes made)
(2,766 real changes made)
(3,546 real changes made)
(12,879 missing values generated)
(2,880 real changes made)
(2,766 real changes made)
(5,646 real changes made)
(9,333 real changes made)
(7,233 missing values generated)
(5,646 real changes made)
(2,880 real changes made)
(4,473 real changes made, 4,473 to missing)
(7,197 missing values generated)
(12,879 missing values generated)
(2,879 real changes made)
(2,803 real changes made)
(2,879 real changes made)
(2,803 real changes made)
(3,647 real changes made)
(12,879 missing values generated)
(2,879 real changes made)
(2,803 real changes made)
(5,682 real changes made)
(9,232 real changes made)
(7,197 missing values generated)
(5,682 real changes made)
(2,879 real changes made)
(4,450 real changes made, 4,450 to missing)
(7,174 missing values generated)
(12,879 missing values generated)
(2,900 real changes made)
(2,805 real changes made)
(2,900 real changes made)
(2,805 real changes made)
(3,628 real changes made)
(12,879 missing values generated)
(2,900 real changes made)
(2,805 real changes made)
(5,705 real changes made)
(9,251 real changes made)
(7,174 missing values generated)
(5,705 real changes made)
(2,900 real changes made)
(4,500 real changes made, 4,500 to missing)
(7,224 missing values generated)
(12,879 missing values generated)
(2,860 real changes made)
(2,795 real changes made)
(2,860 real changes made)
(2,795 real changes made)
(3,579 real changes made)
(12,879 missing values generated)
(2,860 real changes made)
(2,795 real changes made)
(5,655 real changes made)
(9,300 real changes made)
(7,224 missing values generated)
(5,655 real changes made)
(2,860 real changes made)
(4,431 real changes made, 4,431 to missing)
(7,155 missing values generated)
(12,879 missing values generated)
(2,933 real changes made)
(2,791 real changes made)
(2,933 real changes made)
(2,791 real changes made)
(3,608 real changes made)
(12,879 missing values generated)
(2,933 real changes made)
(2,791 real changes made)
(5,724 real changes made)
(9,271 real changes made)
(7,155 missing values generated)
(5,724 real changes made)
(2,933 real changes made)
(4,453 real changes made, 4,453 to missing)
(7,177 missing values generated)
(12,879 missing values generated)
(2,889 real changes made)
(2,813 real changes made)
(2,889 real changes made)
(2,813 real changes made)
(3,602 real changes made)
(12,879 missing values generated)
(2,889 real changes made)
(2,813 real changes made)
(5,702 real changes made)
(9,277 real changes made)
(7,177 missing values generated)
(5,702 real changes made)
(2,889 real changes made)
(4,460 real changes made, 4,460 to missing)
(7,184 missing values generated)
(12,879 missing values generated)
(2,885 real changes made)
(2,810 real changes made)
(2,885 real changes made)
(2,810 real changes made)
(3,552 real changes made)
(12,879 missing values generated)
(2,885 real changes made)
(2,810 real changes made)
(5,695 real changes made)
(9,327 real changes made)
(7,184 missing values generated)
(5,695 real changes made)
(2,885 real changes made)
(4,463 real changes made, 4,463 to missing)
(7,187 missing values generated)
(12,879 missing values generated)
(2,926 real changes made)
(2,766 real changes made)
(2,926 real changes made)
(2,766 real changes made)
(3,633 real changes made)
(12,879 missing values generated)
(2,926 real changes made)
(2,766 real changes made)
(5,692 real changes made)
(9,246 real changes made)
(7,187 missing values generated)
(5,692 real changes made)
(2,926 real changes made)
(4,481 real changes made, 4,481 to missing)
(7,205 missing values generated)
(12,879 missing values generated)
(2,884 real changes made)
(2,790 real changes made)
(2,884 real changes made)
(2,790 real changes made)
(3,611 real changes made)
(12,879 missing values generated)
(2,884 real changes made)
(2,790 real changes made)
(5,674 real changes made)
(9,268 real changes made)
(7,205 missing values generated)
(5,674 real changes made)
(2,884 real changes made)
(4,429 real changes made, 4,429 to missing)
(7,153 missing values generated)
(12,879 missing values generated)
(2,916 real changes made)
(2,810 real changes made)
(2,916 real changes made)
(2,810 real changes made)
(3,635 real changes made)
(12,879 missing values generated)
(2,916 real changes made)
(2,810 real changes made)
(5,726 real changes made)
(9,244 real changes made)
(7,153 missing values generated)
(5,726 real changes made)
(2,916 real changes made)
(4,437 real changes made, 4,437 to missing)
(7,161 missing values generated)
(12,879 missing values generated)
(2,903 real changes made)
(2,815 real changes made)
(2,903 real changes made)
(2,815 real changes made)
(3,622 real changes made)
(12,879 missing values generated)
(2,903 real changes made)
(2,815 real changes made)
(5,718 real changes made)
(9,257 real changes made)
(7,161 missing values generated)
(5,718 real changes made)
(2,903 real changes made)
(4,522 real changes made, 4,522 to missing)
(7,246 missing values generated)
(12,879 missing values generated)
(2,885 real changes made)
(2,748 real changes made)
(2,885 real changes made)
(2,748 real changes made)
(3,575 real changes made)
(12,879 missing values generated)
(2,885 real changes made)
(2,748 real changes made)
(5,633 real changes made)
(9,304 real changes made)
(7,246 missing values generated)
(5,633 real changes made)
(2,885 real changes made)
(4,480 real changes made, 4,480 to missing)
(7,204 missing values generated)
(12,879 missing values generated)
(2,915 real changes made)
(2,760 real changes made)
(2,915 real changes made)
(2,760 real changes made)
(3,598 real changes made)
(12,879 missing values generated)
(2,915 real changes made)
(2,760 real changes made)
(5,675 real changes made)
(9,281 real changes made)
(7,204 missing values generated)
(5,675 real changes made)
(2,915 real changes made)
(4,475 real changes made, 4,475 to missing)
(7,199 missing values generated)
(12,879 missing values generated)
(2,876 real changes made)
(2,804 real changes made)
(2,876 real changes made)
(2,804 real changes made)
(3,623 real changes made)
(12,879 missing values generated)
(2,876 real changes made)
(2,804 real changes made)
(5,680 real changes made)
(9,256 real changes made)
(7,199 missing values generated)
(5,680 real changes made)
(2,876 real changes made)
(4,471 real changes made, 4,471 to missing)
(7,195 missing values generated)
(12,879 missing values generated)
(2,919 real changes made)
(2,765 real changes made)
(2,919 real changes made)
(2,765 real changes made)
(3,579 real changes made)
(12,879 missing values generated)
(2,919 real changes made)
(2,765 real changes made)
(5,684 real changes made)
(9,300 real changes made)
(7,195 missing values generated)
(5,684 real changes made)
(2,919 real changes made)
(4,515 real changes made, 4,515 to missing)
(7,239 missing values generated)
(12,879 missing values generated)
(2,850 real changes made)
(2,790 real changes made)
(2,850 real changes made)
(2,790 real changes made)
(3,584 real changes made)
(12,879 missing values generated)
(2,850 real changes made)
(2,790 real changes made)
(5,640 real changes made)
(9,295 real changes made)
(7,239 missing values generated)
(5,640 real changes made)
(2,850 real changes made)
(4,478 real changes made, 4,478 to missing)
(7,202 missing values generated)
(12,879 missing values generated)
(2,880 real changes made)
(2,797 real changes made)
(2,880 real changes made)
(2,797 real changes made)
(3,600 real changes made)
(12,879 missing values generated)
(2,880 real changes made)
(2,797 real changes made)
(5,677 real changes made)
(9,279 real changes made)
(7,202 missing values generated)
(5,677 real changes made)
(2,880 real changes made)
(4,454 real changes made, 4,454 to missing)
(7,178 missing values generated)
(12,879 missing values generated)
(2,882 real changes made)
(2,819 real changes made)
(2,882 real changes made)
(2,819 real changes made)
(3,627 real changes made)
(12,879 missing values generated)
(2,882 real changes made)
(2,819 real changes made)
(5,701 real changes made)
(9,252 real changes made)
(7,178 missing values generated)
(5,701 real changes made)
(2,882 real changes made)
(4,439 real changes made, 4,439 to missing)
(7,163 missing values generated)
(12,879 missing values generated)
(2,879 real changes made)
(2,837 real changes made)
(2,879 real changes made)
(2,837 real changes made)
(3,562 real changes made)
(12,879 missing values generated)
(2,879 real changes made)
(2,837 real changes made)
(5,716 real changes made)
(9,317 real changes made)
(7,163 missing values generated)
(5,716 real changes made)
(2,879 real changes made)
(4,448 real changes made, 4,448 to missing)
(7,172 missing values generated)
(12,879 missing values generated)
(2,910 real changes made)
(2,797 real changes made)
(2,910 real changes made)
(2,797 real changes made)
(3,635 real changes made)
(12,879 missing values generated)
(2,910 real changes made)
(2,797 real changes made)
(5,707 real changes made)
(9,244 real changes made)
(7,172 missing values generated)
(5,707 real changes made)
(2,910 real changes made)
(4,445 real changes made, 4,445 to missing)
(7,169 missing values generated)
(12,879 missing values generated)
(2,885 real changes made)
(2,825 real changes made)
(2,885 real changes made)
(2,825 real changes made)
(3,612 real changes made)
(12,879 missing values generated)
(2,885 real changes made)
(2,825 real changes made)
(5,710 real changes made)
(9,267 real changes made)
(7,169 missing values generated)
(5,710 real changes made)
(2,885 real changes made)
(4,520 real changes made, 4,520 to missing)
(7,244 missing values generated)
(12,879 missing values generated)
(2,868 real changes made)
(2,767 real changes made)
(2,868 real changes made)
(2,767 real changes made)
(3,584 real changes made)
(12,879 missing values generated)
(2,868 real changes made)
(2,767 real changes made)
(5,635 real changes made)
(9,295 real changes made)
(7,244 missing values generated)
(5,635 real changes made)
(2,868 real changes made)
(1,195 real changes made, 1,195 to missing)
(11,350 missing values generated)
(12,879 missing values generated)
(766 real changes made)
(763 real changes made)
(766 real changes made)
(763 real changes made)
(962 real changes made)
(12,879 missing values generated)
(766 real changes made)
(763 real changes made)
(1,529 real changes made)
(11,917 real changes made)
(11,350 missing values generated)
(1,529 real changes made)
(766 real changes made)
(1,172 real changes made, 1,172 to missing)
(11,327 missing values generated)
(12,879 missing values generated)
(791 real changes made)
(761 real changes made)
(791 real changes made)
(761 real changes made)
(975 real changes made)
(12,879 missing values generated)
(791 real changes made)
(761 real changes made)
(1,552 real changes made)
(11,904 real changes made)
(11,327 missing values generated)
(1,552 real changes made)
(791 real changes made)
(1,175 real changes made, 1,175 to missing)
(11,330 missing values generated)
(12,879 missing values generated)
(785 real changes made)
(764 real changes made)
(785 real changes made)
(764 real changes made)
(930 real changes made)
(12,879 missing values generated)
(785 real changes made)
(764 real changes made)
(1,549 real changes made)
(11,949 real changes made)
(11,330 missing values generated)
(1,549 real changes made)
(785 real changes made)
(1,206 real changes made, 1,206 to missing)
(11,361 missing values generated)
(12,879 missing values generated)
(744 real changes made)
(774 real changes made)
(744 real changes made)
(774 real changes made)
(983 real changes made)
(12,879 missing values generated)
(744 real changes made)
(774 real changes made)
(1,518 real changes made)
(11,896 real changes made)
(11,361 missing values generated)
(1,518 real changes made)
(744 real changes made)
(1,172 real changes made, 1,172 to missing)
(11,327 missing values generated)
(12,879 missing values generated)
(789 real changes made)
(763 real changes made)
(789 real changes made)
(763 real changes made)
(982 real changes made)
(12,879 missing values generated)
(789 real changes made)
(763 real changes made)
(1,552 real changes made)
(11,897 real changes made)
(11,327 missing values generated)
(1,552 real changes made)
(789 real changes made)
(1,208 real changes made, 1,208 to missing)
(11,363 missing values generated)
(12,879 missing values generated)
(765 real changes made)
(751 real changes made)
(765 real changes made)
(751 real changes made)
(957 real changes made)
(12,879 missing values generated)
(765 real changes made)
(751 real changes made)
(1,516 real changes made)
(11,922 real changes made)
(11,363 missing values generated)
(1,516 real changes made)
(765 real changes made)
(1,173 real changes made, 1,173 to missing)
(11,328 missing values generated)
(12,879 missing values generated)
(810 real changes made)
(741 real changes made)
(810 real changes made)
(741 real changes made)
(979 real changes made)
(12,879 missing values generated)
(810 real changes made)
(741 real changes made)
(1,551 real changes made)
(11,900 real changes made)
(11,328 missing values generated)
(1,551 real changes made)
(810 real changes made)
(1,215 real changes made, 1,215 to missing)
(11,370 missing values generated)
(12,879 missing values generated)
(774 real changes made)
(735 real changes made)
(774 real changes made)
(735 real changes made)
(949 real changes made)
(12,879 missing values generated)
(774 real changes made)
(735 real changes made)
(1,509 real changes made)
(11,930 real changes made)
(11,370 missing values generated)
(1,509 real changes made)
(774 real changes made)
(1,202 real changes made, 1,202 to missing)
(11,357 missing values generated)
(12,879 missing values generated)
(772 real changes made)
(750 real changes made)
(772 real changes made)
(750 real changes made)
(942 real changes made)
(12,879 missing values generated)
(772 real changes made)
(750 real changes made)
(1,522 real changes made)
(11,937 real changes made)
(11,357 missing values generated)
(1,522 real changes made)
(772 real changes made)
(1,204 real changes made, 1,204 to missing)
(11,359 missing values generated)
(12,879 missing values generated)
(734 real changes made)
(786 real changes made)
(734 real changes made)
(786 real changes made)
(935 real changes made)
(12,879 missing values generated)
(734 real changes made)
(786 real changes made)
(1,520 real changes made)
(11,944 real changes made)
(11,359 missing values generated)
(1,520 real changes made)
(734 real changes made)
(1,184 real changes made, 1,184 to missing)
(11,339 missing values generated)
(12,879 missing values generated)
(795 real changes made)
(745 real changes made)
(795 real changes made)
(745 real changes made)
(995 real changes made)
(12,879 missing values generated)
(795 real changes made)
(745 real changes made)
(1,540 real changes made)
(11,884 real changes made)
(11,339 missing values generated)
(1,540 real changes made)
(795 real changes made)
(1,219 real changes made, 1,219 to missing)
(11,374 missing values generated)
(12,879 missing values generated)
(787 real changes made)
(718 real changes made)
(787 real changes made)
(718 real changes made)
(936 real changes made)
(12,879 missing values generated)
(787 real changes made)
(718 real changes made)
(1,505 real changes made)
(11,943 real changes made)
(11,374 missing values generated)
(1,505 real changes made)
(787 real changes made)
(1,180 real changes made, 1,180 to missing)
(11,335 missing values generated)
(12,879 missing values generated)
(791 real changes made)
(753 real changes made)
(791 real changes made)
(753 real changes made)
(977 real changes made)
(12,879 missing values generated)
(791 real changes made)
(753 real changes made)
(1,544 real changes made)
(11,902 real changes made)
(11,335 missing values generated)
(1,544 real changes made)
(791 real changes made)
(1,201 real changes made, 1,201 to missing)
(11,356 missing values generated)
(12,879 missing values generated)
(748 real changes made)
(775 real changes made)
(748 real changes made)
(775 real changes made)
(952 real changes made)
(12,879 missing values generated)
(748 real changes made)
(775 real changes made)
(1,523 real changes made)
(11,927 real changes made)
(11,356 missing values generated)
(1,523 real changes made)
(748 real changes made)
(1,181 real changes made, 1,181 to missing)
(11,336 missing values generated)
(12,879 missing values generated)
(755 real changes made)
(788 real changes made)
(755 real changes made)
(788 real changes made)
(983 real changes made)
(12,879 missing values generated)
(755 real changes made)
(788 real changes made)
(1,543 real changes made)
(11,896 real changes made)
(11,336 missing values generated)
(1,543 real changes made)
(755 real changes made)
(1,194 real changes made, 1,194 to missing)
(11,349 missing values generated)
(12,879 missing values generated)
(745 real changes made)
(785 real changes made)
(745 real changes made)
(785 real changes made)
(956 real changes made)
(12,879 missing values generated)
(745 real changes made)
(785 real changes made)
(1,530 real changes made)
(11,923 real changes made)
(11,349 missing values generated)
(1,530 real changes made)
(745 real changes made)
(1,212 real changes made, 1,212 to missing)
(11,367 missing values generated)
(12,879 missing values generated)
(770 real changes made)
(742 real changes made)
(770 real changes made)
(742 real changes made)
(963 real changes made)
(12,879 missing values generated)
(770 real changes made)
(742 real changes made)
(1,512 real changes made)
(11,916 real changes made)
(11,367 missing values generated)
(1,512 real changes made)
(770 real changes made)
(1,230 real changes made, 1,230 to missing)
(11,385 missing values generated)
(12,879 missing values generated)
(759 real changes made)
(735 real changes made)
(759 real changes made)
(735 real changes made)
(962 real changes made)
(12,879 missing values generated)
(759 real changes made)
(735 real changes made)
(1,494 real changes made)
(11,917 real changes made)
(11,385 missing values generated)
(1,494 real changes made)
(759 real changes made)
(1,210 real changes made, 1,210 to missing)
(11,365 missing values generated)
(12,879 missing values generated)
(770 real changes made)
(744 real changes made)
(770 real changes made)
(744 real changes made)
(963 real changes made)
(12,879 missing values generated)
(770 real changes made)
(744 real changes made)
(1,514 real changes made)
(11,916 real changes made)
(11,365 missing values generated)
(1,514 real changes made)
(770 real changes made)
(1,213 real changes made, 1,213 to missing)
(11,368 missing values generated)
(12,879 missing values generated)
(775 real changes made)
(736 real changes made)
(775 real changes made)
(736 real changes made)
(979 real changes made)
(12,879 missing values generated)
(775 real changes made)
(736 real changes made)
(1,511 real changes made)
(11,900 real changes made)
(11,368 missing values generated)
(1,511 real changes made)
(775 real changes made)
(1,204 real changes made, 1,204 to missing)
(11,359 missing values generated)
(12,879 missing values generated)
(773 real changes made)
(747 real changes made)
(773 real changes made)
(747 real changes made)
(972 real changes made)
(12,879 missing values generated)
(773 real changes made)
(747 real changes made)
(1,520 real changes made)
(11,907 real changes made)
(11,359 missing values generated)
(1,520 real changes made)
(773 real changes made)
(1,223 real changes made, 1,223 to missing)
(11,378 missing values generated)
(12,879 missing values generated)
(766 real changes made)
(735 real changes made)
(766 real changes made)
(735 real changes made)
(922 real changes made)
(12,879 missing values generated)
(766 real changes made)
(735 real changes made)
(1,501 real changes made)
(11,957 real changes made)
(11,378 missing values generated)
(1,501 real changes made)
(766 real changes made)
(1,218 real changes made, 1,218 to missing)
(11,373 missing values generated)
(12,879 missing values generated)
(745 real changes made)
(761 real changes made)
(745 real changes made)
(761 real changes made)
(983 real changes made)
(12,879 missing values generated)
(745 real changes made)
(761 real changes made)
(1,506 real changes made)
(11,896 real changes made)
(11,373 missing values generated)
(1,506 real changes made)
(745 real changes made)
(1,209 real changes made, 1,209 to missing)
(11,364 missing values generated)
(12,879 missing values generated)
(755 real changes made)
(760 real changes made)
(755 real changes made)
(760 real changes made)
(968 real changes made)
(12,879 missing values generated)
(755 real changes made)
(760 real changes made)
(1,515 real changes made)
(11,911 real changes made)
(11,364 missing values generated)
(1,515 real changes made)
(755 real changes made)
(1,213 real changes made, 1,213 to missing)
(11,368 missing values generated)
(12,879 missing values generated)
(767 real changes made)
(744 real changes made)
(767 real changes made)
(744 real changes made)
(949 real changes made)
(12,879 missing values generated)
(767 real changes made)
(744 real changes made)
(1,511 real changes made)
(11,930 real changes made)
(11,368 missing values generated)
(1,511 real changes made)
(767 real changes made)
(1,171 real changes made, 1,171 to missing)
(11,326 missing values generated)
(12,879 missing values generated)
(767 real changes made)
(786 real changes made)
(767 real changes made)
(786 real changes made)
(974 real changes made)
(12,879 missing values generated)
(767 real changes made)
(786 real changes made)
(1,553 real changes made)
(11,905 real changes made)
(11,326 missing values generated)
(1,553 real changes made)
(767 real changes made)
(1,226 real changes made, 1,226 to missing)
(11,381 missing values generated)
(12,879 missing values generated)
(777 real changes made)
(721 real changes made)
(777 real changes made)
(721 real changes made)
(948 real changes made)
(12,879 missing values generated)
(777 real changes made)
(721 real changes made)
(1,498 real changes made)
(11,931 real changes made)
(11,381 missing values generated)
(1,498 real changes made)
(777 real changes made)
(1,194 real changes made, 1,194 to missing)
(11,349 missing values generated)
(12,879 missing values generated)
(782 real changes made)
(748 real changes made)
(782 real changes made)
(748 real changes made)
(977 real changes made)
(12,879 missing values generated)
(782 real changes made)
(748 real changes made)
(1,530 real changes made)
(11,902 real changes made)
(11,349 missing values generated)
(1,530 real changes made)
(782 real changes made)
(1,195 real changes made, 1,195 to missing)
(11,350 missing values generated)
(12,879 missing values generated)
(750 real changes made)
(779 real changes made)
(750 real changes made)
(779 real changes made)
(967 real changes made)
(12,879 missing values generated)
(750 real changes made)
(779 real changes made)
(1,529 real changes made)
(11,912 real changes made)
(11,350 missing values generated)
(1,529 real changes made)
(750 real changes made)
(1,212 real changes made, 1,212 to missing)
(11,367 missing values generated)
(12,879 missing values generated)
(764 real changes made)
(748 real changes made)
(764 real changes made)
(748 real changes made)
(925 real changes made)
(12,879 missing values generated)
(764 real changes made)
(748 real changes made)
(1,512 real changes made)
(11,954 real changes made)
(11,367 missing values generated)
(1,512 real changes made)
(764 real changes made)
(1,201 real changes made, 1,201 to missing)
(11,356 missing values generated)
(12,879 missing values generated)
(773 real changes made)
(750 real changes made)
(773 real changes made)
(750 real changes made)
(958 real changes made)
(12,879 missing values generated)
(773 real changes made)
(750 real changes made)
(1,523 real changes made)
(11,921 real changes made)
(11,356 missing values generated)
(1,523 real changes made)
(773 real changes made)
(1,175 real changes made, 1,175 to missing)
(11,330 missing values generated)
(12,879 missing values generated)
(773 real changes made)
(776 real changes made)
(773 real changes made)
(776 real changes made)
(960 real changes made)
(12,879 missing values generated)
(773 real changes made)
(776 real changes made)
(1,549 real changes made)
(11,919 real changes made)
(11,330 missing values generated)
(1,549 real changes made)
(773 real changes made)
(1,204 real changes made, 1,204 to missing)
(11,359 missing values generated)
(12,879 missing values generated)
(751 real changes made)
(769 real changes made)
(751 real changes made)
(769 real changes made)
(963 real changes made)
(12,879 missing values generated)
(751 real changes made)
(769 real changes made)
(1,520 real changes made)
(11,916 real changes made)
(11,359 missing values generated)
(1,520 real changes made)
(751 real changes made)

. 
. replace index_date = index_date_28
(12,879 real changes made)

. drop index_date_28

. gen egfr15_date=.
(12,879 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatinine_`x'<15 & date("01`x'", "DMY")>=index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen esrd_date = egfr15_date
(12,879 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if esrd_date==.
(394 real changes made)

. gen esrd_time = (esrd_date - index_date)
(12,485 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(12,485 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(391 changes made to esrd_time_cat)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"                      ///
>                                                         3 "1 to 28 days"        ///
>                                                         4 "20 to 90 days"       ///
>                                                         5 "91 to 180 days"      ///
>                                                         6 "181 to 365 days"     ///
>                                                         7 "366 to 730 days"     ///
>                                                         8 "731 to 973 days"     ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 covid_severity  ///
>                                                                 covid_aki               {
  2.                                                                 by `exposure',sort: sum esrd_time, de
  3.                                                                 tab esrd_time_cat `exposure', m col chi
  4.                                                                 }

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Comparator (historical)

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 331
25%           17              0       Sum of wgt.         331

50%           86                      Mean           93.86707
                        Largest       Std. dev.      80.71537
75%          149            283
90%          215            288       Variance        6514.97
95%          247            289       Skewness       .5497961
99%          283            289       Kurtosis       2.298421

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  63
25%           20              0       Sum of wgt.          63

50%           65                      Mean           90.20635
                        Largest       Std. dev.      78.48734
75%          156            236
90%          204            246       Variance       6160.263
95%          236            251       Skewness       .5732964
99%          256            256       Kurtosis       2.076396


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Comparato   COVID-19 |     Total
----------------+----------------------+----------
         0 days |        56          8 |        64 
                |      0.55       0.29 |      0.50 
----------------+----------------------+----------
   1 to 28 days |        41         10 |        51 
                |      0.40       0.37 |      0.40 
----------------+----------------------+----------
  20 to 90 days |        77         19 |        96 
                |      0.76       0.70 |      0.75 
----------------+----------------------+----------
 91 to 180 days |       103         14 |       117 
                |      1.01       0.51 |      0.91 
----------------+----------------------+----------
181 to 365 days |        54         12 |        66 
                |      0.53       0.44 |      0.51 
----------------+----------------------+----------
              . |     9,824      2,661 |    12,485 
                |     96.74      97.69 |     96.94 
----------------+----------------------+----------
          Total |    10,155      2,724 |    12,879 
                |    100.00     100.00 |    100.00 

          Pearson chi2(5) =   9.5169   Pr = 0.090

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 331
25%           17              0       Sum of wgt.         331

50%           86                      Mean           93.86707
                        Largest       Std. dev.      80.71537
75%          149            283
90%          215            288       Variance        6514.97
95%          247            289       Skewness       .5497961
99%          283            289       Kurtosis       2.298421

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Non-hospitalised SARS-CoV-2

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                  48
25%           22              0       Sum of wgt.          48

50%           67                      Mean           92.39583
                        Largest       Std. dev.      80.39761
75%          158            236
90%          224            246       Variance       6463.776
95%          246            251       Skewness       .5835289
99%          256            256       Kurtosis       2.066424

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Hospitalised COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0             23       Obs                   7
25%            0             55       Sum of wgt.           7

50%           55                      Mean                 79
                        Largest       Std. dev.      89.59167
75%          202             55
90%          208             65       Variance       8026.667
95%          208            202       Skewness       .7082676
99%          208            208       Kurtosis       1.792458

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Critical care COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0             14
10%            0             42       Obs                   8
25%           28             91       Sum of wgt.           8

50%           99                      Mean             86.875
                        Largest       Std. dev.       64.1214
75%          127            107
90%          187            116       Variance       4111.554
95%          187            138       Skewness       .0215793
99%          187            187       Kurtosis       1.906827


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |             SARS-CoV-2 severity
  esrd_time_cat | Historica  Non-hospi  Hospitali  Critical  |     Total
----------------+--------------------------------------------+----------
         0 days |        56          5          2          1 |        64 
                |      0.55       0.22       0.81       0.41 |      0.50 
----------------+--------------------------------------------+----------
   1 to 28 days |        41          8          1          1 |        51 
                |      0.40       0.36       0.40       0.41 |      0.40 
----------------+--------------------------------------------+----------
  20 to 90 days |        77         16          2          1 |        96 
                |      0.76       0.72       0.81       0.41 |      0.75 
----------------+--------------------------------------------+----------
 91 to 180 days |       103         10          0          4 |       117 
                |      1.01       0.45       0.00       1.63 |      0.91 
----------------+--------------------------------------------+----------
181 to 365 days |        54          9          2          1 |        66 
                |      0.53       0.40       0.81       0.41 |      0.51 
----------------+--------------------------------------------+----------
              . |     9,824      2,183        241        237 |    12,485 
                |     96.74      97.85      97.18      96.73 |     96.94 
----------------+--------------------------------------------+----------
          Total |    10,155      2,231        248        245 |    12,879 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(15) =  16.4107   Pr = 0.355

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs                 331
25%           17              0       Sum of wgt.         331

50%           86                      Mean           93.86707
                        Largest       Std. dev.      80.71537
75%          149            283
90%          215            288       Variance        6514.97
95%          247            289       Skewness       .5497961
99%          283            289       Kurtosis       2.298421

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Non-hospitalised SARS-CoV-2

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs                  52
25%           22              0       Sum of wgt.          52

50%         77.5                      Mean           90.57692
                        Largest       Std. dev.      76.08312
75%          153            224
90%          195            236       Variance       5788.641
95%          236            246       Skewness       .5466253
99%          256            256       Kurtosis       2.114596

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = No AKI hospitalised COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0             23       Obs                   7
25%            0             55       Sum of wgt.           7

50%           55                      Mean                 79
                        Largest       Std. dev.      89.59167
75%          202             55
90%          208             65       Variance       8026.667
95%          208            202       Skewness       .7082676
99%          208            208       Kurtosis       1.792458

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = AKI hospitalised COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0             42
10%            0            127       Obs                   4
25%           21            251       Sum of wgt.           4

50%         84.5                      Mean                105
                        Largest       Std. dev.       110.746
75%          189              0
90%          251             42       Variance       12264.67
95%          251            127       Skewness       .4860232
99%          251            251       Kurtosis       1.748886


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |        COVID-19 acute kidney injury
  esrd_time_cat | Historica  Non-hospi  No AKI ho  AKI hospi |     Total
----------------+--------------------------------------------+----------
         0 days |        56          5          2          1 |        64 
                |      0.55       0.21       0.81       0.75 |      0.50 
----------------+--------------------------------------------+----------
   1 to 28 days |        41          9          1          0 |        51 
                |      0.40       0.38       0.40       0.00 |      0.40 
----------------+--------------------------------------------+----------
  20 to 90 days |        77         16          2          1 |        96 
                |      0.76       0.68       0.81       0.75 |      0.75 
----------------+--------------------------------------------+----------
 91 to 180 days |       103         13          0          1 |       117 
                |      1.01       0.55       0.00       0.75 |      0.91 
----------------+--------------------------------------------+----------
181 to 365 days |        54          9          2          1 |        66 
                |      0.53       0.38       0.81       0.75 |      0.51 
----------------+--------------------------------------------+----------
              . |     9,824      2,292        240        129 |    12,485 
                |     96.74      97.78      97.17      96.99 |     96.94 
----------------+--------------------------------------------+----------
          Total |    10,155      2,344        247        133 |    12,879 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(15) =  14.1537   Pr = 0.514

.         
. * Exit date
. gen exit_date = esrd_date
(12,485 missing values generated)

. format exit_date %td

. gen end_date = date("2022-09-30", "YMD") if case==1
(10,155 missing values generated)

. replace end_date = date("2019-09-30", "YMD") if case==0
(10,155 real changes made)

. format end_date %td

. replace exit_date = min(deregistered_date, death_date, end_date) if esrd_date==.
(12,485 real changes made)

. gen follow_up_time = (exit_date - index_date)

. label var follow_up_time "Follow-up time (Days)"

. gen follow_up_cat = follow_up_time

. recode follow_up_cat    min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0/365=3         ///
>                                                 366/730=4       ///
>                                                 731/973=5       ///                                     
>                                                 974/max=6
(12856 changes made to follow_up_cat)

. label define follow_up_cat      1 "<-29 days"           ///
>                                                         2 "-28 to -1 days"      ///
>                                                         3 "0 to 365 days"       ///
>                                                         4 "366 to 730 days" ///
>                                                         5 "731 to 973 days"     ///
>                                                         6 ">973 days"

. label values follow_up_cat follow_up_cat

. label var follow_up_cat "Follow_up time"

. tab case follow_up_cat

                      |          Follow_up time
                 case | <-29 days  -28 to -1  0 to 365  |     Total
----------------------+---------------------------------+----------
Comparator (historica |       574        581      9,000 |    10,155 
             COVID-19 |       171        169      2,384 |     2,724 
----------------------+---------------------------------+----------
                Total |       745        750     11,384 |    12,879 

. tab covid_krt follow_up_cat

      COVID-19 kidney |          Follow_up time
  replacement therapy | <-29 days  -28 to -1  0 to 365  |     Total
----------------------+---------------------------------+----------
Historical comparator |       574        581      9,000 |    10,155 
Non-hospitalised SARS |       135        134      1,946 |     2,215 
No KRT hospitalised C |        16         12        207 |       235 
KRT hospitalised COVI |        20         23        231 |       274 
----------------------+---------------------------------+----------
                Total |       745        750     11,384 |    12,879 

. drop if follow_up_time<0
(1,495 observations deleted)

. drop if follow_up_time>972
(0 observations deleted)

. tab case follow_up_cat

                      | Follow_up
                      |    time
                 case | 0 to 365  |     Total
----------------------+-----------+----------
Comparator (historica |     9,000 |     9,000 
             COVID-19 |     2,384 |     2,384 
----------------------+-----------+----------
                Total |    11,384 |    11,384 

. tab covid_krt follow_up_cat

                      | Follow_up
      COVID-19 kidney |    time
  replacement therapy | 0 to 365  |     Total
----------------------+-----------+----------
Historical comparator |     9,000 |     9,000 
Non-hospitalised SARS |     1,946 |     1,946 
No KRT hospitalised C |       207 |       207 
KRT hospitalised COVI |       231 |       231 
----------------------+-----------+----------
                Total |    11,384 |    11,384 

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(11,384 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_half_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>=index_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(6 real changes made)
(36 real changes made)
(84 real changes made)
(91 real changes made)
(97 real changes made)
(132 real changes made)
(146 real changes made)
(155 real changes made)
(149 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(12 real changes made)
(17 real changes made)
(27 real changes made)
(35 real changes made)
(35 real changes made)
(34 real changes made)
(44 real changes made)
(28 real changes made)
(35 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(353 real changes made)

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(5,136 real changes made, 5,136 to missing)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(9,866 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date) if egfr_half_date==. & index_date_egfr_half!=.
(4,917 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(5,136 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days)"

. 
. * AKI (or ESRD)
. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(10,223 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(358 real changes made)

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(9,865 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date)  if aki_date==.
(9,865 real changes made)

. gen follow_up_time_aki = (exit_date_aki - index_date)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. 
. * Exit date (death)
. gen exit_date_death = death_date
(11,215 missing values generated)

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(11,215 real changes made)

. gen follow_up_time_death = (exit_date_death - index_date)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. 
. save ./output/analysis_20174.dta, replace
file ./output/analysis_20174.dta saved

. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_20174.log
  log type:  text
 closed on:   2 Dec 2022, 13:14:29
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
