------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_2017.log
  log type:  text
 opened on:  26 Jan 2023, 21:19:37

. 
. ** Analysis cohort selection
. capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-9)
(53 vars, 50,000 obs)

. di "Potential COVID-19 cases extracted from OpenSAFELY:"
Potential COVID-19 cases extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/input_2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(16 vars, 50,000 obs)

. di "Potential historical comparators extracted from OpenSAFELY:"
Potential historical comparators extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/covid_matching_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 15,338 obs)

. di "Potential COVID-19 cases after application of exclusion criteria:"
Potential COVID-19 cases after application of exclusion criteria:

. safecount
  15,338

. capture noisily import delimited ./output/2017_matching.csv, clear
(encoding automatically selected: ISO-8859-2)
(7 vars, 28,939 obs)

. di "Potential historical comparators after application of exclusion criteria:"
Potential historical comparators after application of exclusion criteria:

. safecount
  28,939

. * Import COVID-19 dataset comprising individuals matched with historical comparators (limited matching variables only)  
. capture noisily import delimited ./output/input_combined_stps_covid_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(13 vars, 13,990 obs)

. * Drop age & covid_diagnosis_date
. keep patient_id death_date date_deregistered stp krt_outcome_date male covid_date covid_month set_id case match_counts

. tempfile covid_2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `covid_2017_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000001.tmp saved as .dta format

. * Number of matched COVID-19 cases
. count
  13,990

. * Import matched historical comparators (limited matching variables only)
. capture noisily import delimited ./output/input_combined_stps_matches_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 22,201 obs)

. * Drop age
. keep patient_id death_date date_deregistered stp krt_outcome_date male set_id case covid_date

. tempfile 2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `2017_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000002.tmp saved as .dta format

. * Number of matched historical comparators
. count
  22,201

. * Merge limited COVID-19 dataset with additional variables
. capture noisily import delimited ./output/input_covid_2017_additional.csv, clear
(encoding automatically selected: ISO-8859-9)
(106 vars, 13,990 obs)

. merge 1:1 patient_id using `covid_2017_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            13,990  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile covid_2017_complete

. save `covid_2017_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000003.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000003.tmp saved as .dta format

. di "Matched COVID-19 cases:"
Matched COVID-19 cases:

. safecount
  13,990

. * Merge limited historical comparator dataset with additional variables
. capture noisily import delimited ./output/input_2017_additional.csv, clear
(encoding automatically selected: ISO-8859-9)
(95 vars, 22,201 obs)

. merge 1:1 patient_id using `2017_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            22,201  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile 2017_complete

. save `2017_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000004.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000004.tmp saved as .dta format

. di "Matched historical comparators:"
Matched historical comparators:

. safecount
  22,201

. * Append matched COVID-19 cases and historical comparators
. append using `covid_2017_complete', force

. order patient_id set_id match_count case

. gsort set_id -case

. count if case==0
  22,201

. di "Matched COVID-19 cases and historical comparators:"
Matched COVID-19 cases and historical comparators:

. safecount
  36,191

. tab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,201       61.34       61.34
          1 |     13,990       38.66      100.00
------------+-----------------------------------
      Total |     36,191      100.00

. * Save list of matched COVID-19 cases
. preserve

.         keep if case==1
(22,201 observations deleted)

.         keep patient_id

.         tempfile covid_2017_matched_list

.         save `covid_2017_matched_list', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000006.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000006.tmp saved as .dta format

. restore

. * Generate list of unmatched COVID-19 cases
. preserve

.         capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-9)
(53 vars, 50,000 obs)

.         * For dummy data, should do nothing in the real data
.         duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

.         tempfile covid_prematching

.         save `covid_prematching', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000008.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000008.tmp saved as .dta format

.         use `covid_2017_matched_list', clear

.         merge 1:1 patient_id using `covid_prematching'

    Result                      Number of obs
    -----------------------------------------
    Not matched                        61,188
        from master                    12,589  (_merge==1)
        from using                     48,599  (_merge==2)

    Matched                             1,401  (_merge==3)
    -----------------------------------------

.         keep if _merge==2
(13,990 observations deleted)

.         safecount
  48,599

.         save output/covid_unmatched_2017.dta, replace
file output/covid_unmatched_2017.dta saved

.         di "Unmatched COVID-19 cases:"
Unmatched COVID-19 cases:

.         safecount
  48,599

. restore

. 
. **ID
. * Need to create unique identifiers as individuals may be in both covid_2017_matched and 2017_matched so will have the same patient_id
. gen unique = _n

. label var unique "Unique ID"

. 
. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label var imd "Index of multiple deprivation (IMD)"

. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      1,847        5.10        5.10
 1 Most deprived |      7,015       19.38       24.49
               2 |      6,900       19.07       43.55
               3 |      6,798       18.78       62.34
               4 |      6,791       18.76       81.10
5 Least deprived |      6,840       18.90      100.00
-----------------+-----------------------------------
           Total |     36,191      100.00

. drop if imd==0
(1,847 observations deleted)

. safetab imd

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |      7,015       20.43       20.43
               2 |      6,900       20.09       40.52
               3 |      6,798       19.79       60.31
               4 |      6,791       19.77       80.08
5 Least deprived |      6,840       19.92      100.00
-----------------+-----------------------------------
           Total |     34,344      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(34,313 missing values generated)

. replace stp1 = sum(stp1)
(34,343 real changes made)

. drop stp

. rename stp1 stp

. label define stp        1 "1"   ///
>                                         2 "2"   ///
>                                         3 "3"   ///
>                                         4 "4"   ///
>                                         5 "5"   ///
>                                         6 "6"   ///
>                                         7 "7"   ///
>                                         8 "8"   ///
>                                         9 "9"   ///
>                                         10 "10" ///
>                                         11 "11" ///                                     
>                                         12 "12" ///
>                                         13 "13" ///
>                                         14 "14" ///
>                                         15 "15" ///
>                                         16 "16" ///
>                                         17 "17" ///
>                                         18 "18" ///
>                                         19 "19" ///
>                                         20 "20" ///
>                                         21 "21" ///                                     
>                                         22 "22" ///
>                                         23 "23" ///
>                                         24 "24" ///
>                                         25 "25" ///
>                                         26 "26" ///
>                                         27 "27" ///
>                                         28 "28" ///
>                                         29 "29" ///
>                                         30 "30" ///
>                                         31 "31" 

. label values stp stp

. label var stp "STP"

. safetab stp

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,220        3.55        3.55
          2 |      1,121        3.26        6.82
          3 |      1,094        3.19       10.00
          4 |      1,070        3.12       13.12
          5 |      1,129        3.29       16.40
          6 |      1,081        3.15       19.55
          7 |      1,109        3.23       22.78
          8 |      1,128        3.28       26.07
          9 |      1,118        3.26       29.32
         10 |      1,089        3.17       32.49
         11 |      1,116        3.25       35.74
         12 |      1,104        3.21       38.96
         13 |      1,127        3.28       42.24
         14 |      1,070        3.12       45.35
         15 |      1,085        3.16       48.51
         16 |      1,115        3.25       51.76
         17 |      1,079        3.14       54.90
         18 |      1,099        3.20       58.10
         19 |      1,092        3.18       61.28
         20 |      1,097        3.19       64.47
         21 |      1,057        3.08       67.55
         22 |      1,105        3.22       70.77
         23 |      1,134        3.30       74.07
         24 |      1,086        3.16       77.23
         25 |      1,144        3.33       80.56
         26 |      1,123        3.27       83.83
         27 |      1,127        3.28       87.12
         28 |      1,116        3.25       90.37
         29 |      1,102        3.21       93.57
         30 |      1,102        3.21       96.78
         31 |      1,105        3.22      100.00
------------+-----------------------------------
      Total |     34,344      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(30,836 missing values generated)

. replace region = 2 if region_string=="East"
(3,450 real changes made)

. replace region = 3 if region_string=="London"
(6,972 real changes made)

. replace region = 4 if region_string=="North East"
(3,418 real changes made)

. replace region = 5 if region_string=="North West"
(3,389 real changes made)

. replace region = 6 if region_string=="South East"
(3,393 real changes made)

. replace region = 7 if region_string=="South West"
(3,468 real changes made)

. replace region = 8 if region_string=="West Midlands"
(3,401 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(3,345 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,508       10.21       10.21
                    East |      3,450       10.05       20.26
                  London |      6,972       20.30       40.56
              North East |      3,418        9.95       50.51
              North West |      3,389        9.87       60.38
              South East |      3,393        9.88       70.26
              South West |      3,468       10.10       80.36
           West Midlands |      3,401        9.90       90.26
Yorkshire and The Humber |      3,345        9.74      100.00
-------------------------+-----------------------------------
                   Total |     34,344      100.00

. drop if region==10
(0 observations deleted)

. safetab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,508       10.21       10.21
                    East |      3,450       10.05       20.26
                  London |      6,972       20.30       40.56
              North East |      3,418        9.95       50.51
              North West |      3,389        9.87       60.38
              South East |      3,393        9.88       70.26
              South West |      3,468       10.10       80.36
           West Midlands |      3,401        9.90       90.26
Yorkshire and The Humber |      3,345        9.74      100.00
-------------------------+-----------------------------------
                   Total |     34,344      100.00

. 
. * Create new index date variable 28 days after case_index_date (i.e. to exclude anyone who does not survive to start follow-up)
. gen index_date = date(case_index_date, "YMD")

. format index_date %td

. gen index_date_28 = index_date + 28

. format index_date_28 %td

. 
. * Deregistered before index_date + 29 days
. gen deregistered_date = date(date_deregistered, "YMD")
(33,267 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date_28 + 1
(45 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(31,095 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(0 observations deleted)

. replace krt_date = index_date_28 + 1 if krt_date < index_date_28 + 1
(161 real changes made)

. 
. * Death before index_date + 28 days (i.e. only include people who survived 28 days after index_date)
. gen death_date1 = date(death_date, "YMD")
(32,366 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28 + 1
(90 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased within 28 days of index date"

. label values deceased deceased

. tab case deceased

           |       deceased
      case | Alive at   Deceased  |     Total
-----------+----------------------+----------
         0 |    21,006         68 |    21,074 
         1 |    13,203         22 |    13,225 
-----------+----------------------+----------
     Total |    34,209         90 |    34,299 

. drop if deceased==1
(90 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators only
. gen index_year = yofd(index_date)

. gen age = index_year - year_of_birth

. gen sex = 1 if male == "Male"
(17,655 missing values generated)

. label var sex "Sex"

. replace sex = 0 if male == "Female"
(17,655 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 ///
>                                                                                                 baseline_creatinine_mar2017 ///
>                                                                                                 baseline_creatinine_apr2017 ///
>                                                                                                 baseline_creatinine_may2017 ///
>                                                                                                 baseline_creatinine_jun2017 ///
>                                                                                                 baseline_creatinine_jul2017 ///
>                                                                                                 baseline_creatinine_aug2017 ///
>                                                                                                 baseline_creatinine_sep2017 ///
>                                                                                                 baseline_creatinine_oct2017 ///
>                                                                                                 baseline_creatinine_nov2017 ///
>                                                                                                 baseline_creatinine_dec2017 ///
>                                                                                                 baseline_creatinine_jan2018 ///
>                                                                                                 baseline_creatinine_feb2018 ///
>                                                                                                 baseline_creatinine_mar2018 ///
>                                                                                                 baseline_creatinine_apr2018 ///
>                                                                                                 baseline_creatinine_may2018 ///
>                                                                                                 baseline_creatinine_jun2018 ///
>                                                                                                 baseline_creatinine_jul2018 ///
>                                                                                                 baseline_creatinine_aug2018 ///
>                                                                                                 baseline_creatinine_sep2018 ///
>                                                                                                 baseline_creatinine_oct2018 ///
>                                                                                                 baseline_creatinine_nov2018 ///
>                                                                                                 baseline_creatinine_dec2018 ///
>                                                                                                 baseline_creatinine_jan2019 ///
>                                                                                                 baseline_creatinine_feb2019 ///
>                                                                                                 baseline_creatinine_mar2019 ///
>                                                                                                 baseline_creatinine_apr2019 ///
>                                                                                                 baseline_creatinine_may2019 ///
>                                                                                                 baseline_creatinine_jun2019 ///
>                                                                                                 baseline_creatinine_jul2019 ///
>                                                                                                 baseline_creatinine_aug2019 ///
>                                                                                                 baseline_creatinine_sep2019 ///
>                                                                                                 baseline_creatinine_feb2020 ///
>                                                                                                 baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 ///
>                                                                                                 baseline_creatinine_feb2022 ///
>                                                                                                 baseline_creatinine_mar2022 ///
>                                                                                                 baseline_creatinine_apr2022 ///
>                                                                                                 baseline_creatinine_may2022 ///
>                                                                                                 baseline_creatinine_jun2022 ///
>                                                                                                 baseline_creatinine_jul2022 ///
>                                                                                                 baseline_creatinine_aug2022 ///
>                                                                                                 baseline_creatinine_sep2022 ///
>                                                                                                 baseline_creatinine_oct2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(9,239 real changes made, 9,239 to missing)
(22,442 missing values generated)
(34,209 missing values generated)
(6,078 real changes made)
(5,689 real changes made)
(6,078 real changes made)
(5,689 real changes made)
(7,421 real changes made)
(34,209 missing values generated)
(6,078 real changes made)
(5,689 real changes made)
(11,767 real changes made)
(26,788 real changes made)
(22,442 missing values generated)
(11,767 real changes made)
(6,078 real changes made)
(9,254 real changes made, 9,254 to missing)
(22,457 missing values generated)
(34,209 missing values generated)
(6,046 real changes made)
(5,706 real changes made)
(6,046 real changes made)
(5,706 real changes made)
(7,530 real changes made)
(34,209 missing values generated)
(6,046 real changes made)
(5,706 real changes made)
(11,752 real changes made)
(26,679 real changes made)
(22,457 missing values generated)
(11,752 real changes made)
(6,046 real changes made)
(9,211 real changes made, 9,211 to missing)
(22,414 missing values generated)
(34,209 missing values generated)
(6,048 real changes made)
(5,747 real changes made)
(6,048 real changes made)
(5,747 real changes made)
(7,401 real changes made)
(34,209 missing values generated)
(6,048 real changes made)
(5,747 real changes made)
(11,795 real changes made)
(26,808 real changes made)
(22,414 missing values generated)
(11,795 real changes made)
(6,048 real changes made)
(9,272 real changes made, 9,272 to missing)
(22,475 missing values generated)
(34,209 missing values generated)
(6,037 real changes made)
(5,697 real changes made)
(6,037 real changes made)
(5,697 real changes made)
(7,441 real changes made)
(34,209 missing values generated)
(6,037 real changes made)
(5,697 real changes made)
(11,734 real changes made)
(26,768 real changes made)
(22,475 missing values generated)
(11,734 real changes made)
(6,037 real changes made)
(9,210 real changes made, 9,210 to missing)
(22,413 missing values generated)
(34,209 missing values generated)
(6,118 real changes made)
(5,678 real changes made)
(6,118 real changes made)
(5,678 real changes made)
(7,508 real changes made)
(34,209 missing values generated)
(6,118 real changes made)
(5,678 real changes made)
(11,796 real changes made)
(26,701 real changes made)
(22,413 missing values generated)
(11,796 real changes made)
(6,118 real changes made)
(9,202 real changes made, 9,202 to missing)
(22,405 missing values generated)
(34,209 missing values generated)
(6,093 real changes made)
(5,711 real changes made)
(6,093 real changes made)
(5,711 real changes made)
(7,492 real changes made)
(34,209 missing values generated)
(6,093 real changes made)
(5,711 real changes made)
(11,804 real changes made)
(26,717 real changes made)
(22,405 missing values generated)
(11,804 real changes made)
(6,093 real changes made)
(9,230 real changes made, 9,230 to missing)
(22,433 missing values generated)
(34,209 missing values generated)
(6,060 real changes made)
(5,716 real changes made)
(6,060 real changes made)
(5,716 real changes made)
(7,451 real changes made)
(34,209 missing values generated)
(6,060 real changes made)
(5,716 real changes made)
(11,776 real changes made)
(26,758 real changes made)
(22,433 missing values generated)
(11,776 real changes made)
(6,060 real changes made)
(9,253 real changes made, 9,253 to missing)
(22,456 missing values generated)
(34,209 missing values generated)
(6,082 real changes made)
(5,671 real changes made)
(6,082 real changes made)
(5,671 real changes made)
(7,500 real changes made)
(34,209 missing values generated)
(6,082 real changes made)
(5,671 real changes made)
(11,753 real changes made)
(26,709 real changes made)
(22,456 missing values generated)
(11,753 real changes made)
(6,082 real changes made)
(9,205 real changes made, 9,205 to missing)
(22,408 missing values generated)
(34,209 missing values generated)
(6,094 real changes made)
(5,707 real changes made)
(6,094 real changes made)
(5,707 real changes made)
(7,503 real changes made)
(34,209 missing values generated)
(6,094 real changes made)
(5,707 real changes made)
(11,801 real changes made)
(26,706 real changes made)
(22,408 missing values generated)
(11,801 real changes made)
(6,094 real changes made)
(9,276 real changes made, 9,276 to missing)
(22,479 missing values generated)
(34,209 missing values generated)
(6,042 real changes made)
(5,688 real changes made)
(6,042 real changes made)
(5,688 real changes made)
(7,435 real changes made)
(34,209 missing values generated)
(6,042 real changes made)
(5,688 real changes made)
(11,730 real changes made)
(26,774 real changes made)
(22,479 missing values generated)
(11,730 real changes made)
(6,042 real changes made)
(9,249 real changes made, 9,249 to missing)
(22,452 missing values generated)
(34,209 missing values generated)
(6,015 real changes made)
(5,742 real changes made)
(6,015 real changes made)
(5,742 real changes made)
(7,417 real changes made)
(34,209 missing values generated)
(6,015 real changes made)
(5,742 real changes made)
(11,757 real changes made)
(26,792 real changes made)
(22,452 missing values generated)
(11,757 real changes made)
(6,015 real changes made)
(9,243 real changes made, 9,243 to missing)
(22,446 missing values generated)
(34,209 missing values generated)
(6,051 real changes made)
(5,712 real changes made)
(6,051 real changes made)
(5,712 real changes made)
(7,466 real changes made)
(34,209 missing values generated)
(6,051 real changes made)
(5,712 real changes made)
(11,763 real changes made)
(26,743 real changes made)
(22,446 missing values generated)
(11,763 real changes made)
(6,051 real changes made)
(9,188 real changes made, 9,188 to missing)
(22,391 missing values generated)
(34,209 missing values generated)
(6,104 real changes made)
(5,714 real changes made)
(6,104 real changes made)
(5,714 real changes made)
(7,538 real changes made)
(34,209 missing values generated)
(6,104 real changes made)
(5,714 real changes made)
(11,818 real changes made)
(26,671 real changes made)
(22,391 missing values generated)
(11,818 real changes made)
(6,104 real changes made)
(9,157 real changes made, 9,157 to missing)
(22,360 missing values generated)
(34,209 missing values generated)
(6,082 real changes made)
(5,767 real changes made)
(6,082 real changes made)
(5,767 real changes made)
(7,489 real changes made)
(34,209 missing values generated)
(6,082 real changes made)
(5,767 real changes made)
(11,849 real changes made)
(26,720 real changes made)
(22,360 missing values generated)
(11,849 real changes made)
(6,082 real changes made)
(9,269 real changes made, 9,269 to missing)
(22,472 missing values generated)
(34,209 missing values generated)
(6,032 real changes made)
(5,705 real changes made)
(6,032 real changes made)
(5,705 real changes made)
(7,482 real changes made)
(34,209 missing values generated)
(6,032 real changes made)
(5,705 real changes made)
(11,737 real changes made)
(26,727 real changes made)
(22,472 missing values generated)
(11,737 real changes made)
(6,032 real changes made)
(9,267 real changes made, 9,267 to missing)
(22,470 missing values generated)
(34,209 missing values generated)
(6,044 real changes made)
(5,695 real changes made)
(6,044 real changes made)
(5,695 real changes made)
(7,512 real changes made)
(34,209 missing values generated)
(6,044 real changes made)
(5,695 real changes made)
(11,739 real changes made)
(26,697 real changes made)
(22,470 missing values generated)
(11,739 real changes made)
(6,044 real changes made)
(9,268 real changes made, 9,268 to missing)
(22,471 missing values generated)
(34,209 missing values generated)
(6,079 real changes made)
(5,659 real changes made)
(6,079 real changes made)
(5,659 real changes made)
(7,461 real changes made)
(34,209 missing values generated)
(6,079 real changes made)
(5,659 real changes made)
(11,738 real changes made)
(26,748 real changes made)
(22,471 missing values generated)
(11,738 real changes made)
(6,079 real changes made)
(9,225 real changes made, 9,225 to missing)
(22,428 missing values generated)
(34,209 missing values generated)
(6,034 real changes made)
(5,747 real changes made)
(6,034 real changes made)
(5,747 real changes made)
(7,399 real changes made)
(34,209 missing values generated)
(6,034 real changes made)
(5,747 real changes made)
(11,781 real changes made)
(26,810 real changes made)
(22,428 missing values generated)
(11,781 real changes made)
(6,034 real changes made)
(9,243 real changes made, 9,243 to missing)
(22,446 missing values generated)
(34,209 missing values generated)
(6,101 real changes made)
(5,662 real changes made)
(6,101 real changes made)
(5,662 real changes made)
(7,555 real changes made)
(34,209 missing values generated)
(6,101 real changes made)
(5,662 real changes made)
(11,763 real changes made)
(26,654 real changes made)
(22,446 missing values generated)
(11,763 real changes made)
(6,101 real changes made)
(9,268 real changes made, 9,268 to missing)
(22,471 missing values generated)
(34,209 missing values generated)
(6,099 real changes made)
(5,639 real changes made)
(6,099 real changes made)
(5,639 real changes made)
(7,410 real changes made)
(34,209 missing values generated)
(6,099 real changes made)
(5,639 real changes made)
(11,738 real changes made)
(26,799 real changes made)
(22,471 missing values generated)
(11,738 real changes made)
(6,099 real changes made)
(9,223 real changes made, 9,223 to missing)
(22,426 missing values generated)
(34,209 missing values generated)
(6,018 real changes made)
(5,765 real changes made)
(6,018 real changes made)
(5,765 real changes made)
(7,436 real changes made)
(34,209 missing values generated)
(6,018 real changes made)
(5,765 real changes made)
(11,783 real changes made)
(26,773 real changes made)
(22,426 missing values generated)
(11,783 real changes made)
(6,018 real changes made)
(9,241 real changes made, 9,241 to missing)
(22,444 missing values generated)
(34,209 missing values generated)
(6,081 real changes made)
(5,684 real changes made)
(6,081 real changes made)
(5,684 real changes made)
(7,447 real changes made)
(34,209 missing values generated)
(6,081 real changes made)
(5,684 real changes made)
(11,765 real changes made)
(26,762 real changes made)
(22,444 missing values generated)
(11,765 real changes made)
(6,081 real changes made)
(9,264 real changes made, 9,264 to missing)
(22,467 missing values generated)
(34,209 missing values generated)
(6,073 real changes made)
(5,669 real changes made)
(6,073 real changes made)
(5,669 real changes made)
(7,445 real changes made)
(34,209 missing values generated)
(6,073 real changes made)
(5,669 real changes made)
(11,742 real changes made)
(26,764 real changes made)
(22,467 missing values generated)
(11,742 real changes made)
(6,073 real changes made)
(9,269 real changes made, 9,269 to missing)
(22,472 missing values generated)
(34,209 missing values generated)
(6,022 real changes made)
(5,715 real changes made)
(6,022 real changes made)
(5,715 real changes made)
(7,440 real changes made)
(34,209 missing values generated)
(6,022 real changes made)
(5,715 real changes made)
(11,737 real changes made)
(26,769 real changes made)
(22,472 missing values generated)
(11,737 real changes made)
(6,022 real changes made)
(9,258 real changes made, 9,258 to missing)
(22,461 missing values generated)
(34,209 missing values generated)
(6,039 real changes made)
(5,709 real changes made)
(6,039 real changes made)
(5,709 real changes made)
(7,506 real changes made)
(34,209 missing values generated)
(6,039 real changes made)
(5,709 real changes made)
(11,748 real changes made)
(26,703 real changes made)
(22,461 missing values generated)
(11,748 real changes made)
(6,039 real changes made)
(9,275 real changes made, 9,275 to missing)
(22,478 missing values generated)
(34,209 missing values generated)
(6,068 real changes made)
(5,663 real changes made)
(6,068 real changes made)
(5,663 real changes made)
(7,412 real changes made)
(34,209 missing values generated)
(6,068 real changes made)
(5,663 real changes made)
(11,731 real changes made)
(26,797 real changes made)
(22,478 missing values generated)
(11,731 real changes made)
(6,068 real changes made)
(9,157 real changes made, 9,157 to missing)
(22,360 missing values generated)
(34,209 missing values generated)
(6,117 real changes made)
(5,732 real changes made)
(6,117 real changes made)
(5,732 real changes made)
(7,515 real changes made)
(34,209 missing values generated)
(6,117 real changes made)
(5,732 real changes made)
(11,849 real changes made)
(26,694 real changes made)
(22,360 missing values generated)
(11,849 real changes made)
(6,117 real changes made)
(9,262 real changes made, 9,262 to missing)
(22,465 missing values generated)
(34,209 missing values generated)
(6,003 real changes made)
(5,741 real changes made)
(6,003 real changes made)
(5,741 real changes made)
(7,381 real changes made)
(34,209 missing values generated)
(6,003 real changes made)
(5,741 real changes made)
(11,744 real changes made)
(26,828 real changes made)
(22,465 missing values generated)
(11,744 real changes made)
(6,003 real changes made)
(9,234 real changes made, 9,234 to missing)
(22,437 missing values generated)
(34,209 missing values generated)
(6,100 real changes made)
(5,672 real changes made)
(6,100 real changes made)
(5,672 real changes made)
(7,452 real changes made)
(34,209 missing values generated)
(6,100 real changes made)
(5,672 real changes made)
(11,772 real changes made)
(26,757 real changes made)
(22,437 missing values generated)
(11,772 real changes made)
(6,100 real changes made)
(9,248 real changes made, 9,248 to missing)
(22,451 missing values generated)
(34,209 missing values generated)
(6,060 real changes made)
(5,698 real changes made)
(6,060 real changes made)
(5,698 real changes made)
(7,372 real changes made)
(34,209 missing values generated)
(6,060 real changes made)
(5,698 real changes made)
(11,758 real changes made)
(26,837 real changes made)
(22,451 missing values generated)
(11,758 real changes made)
(6,060 real changes made)
(9,203 real changes made, 9,203 to missing)
(22,406 missing values generated)
(34,209 missing values generated)
(6,076 real changes made)
(5,727 real changes made)
(6,076 real changes made)
(5,727 real changes made)
(7,509 real changes made)
(34,209 missing values generated)
(6,076 real changes made)
(5,727 real changes made)
(11,803 real changes made)
(26,700 real changes made)
(22,406 missing values generated)
(11,803 real changes made)
(6,076 real changes made)
(9,250 real changes made, 9,250 to missing)
(22,453 missing values generated)
(34,209 missing values generated)
(6,059 real changes made)
(5,697 real changes made)
(6,059 real changes made)
(5,697 real changes made)
(7,397 real changes made)
(34,209 missing values generated)
(6,059 real changes made)
(5,697 real changes made)
(11,756 real changes made)
(26,812 real changes made)
(22,453 missing values generated)
(11,756 real changes made)
(6,059 real changes made)
(5,825 real changes made, 5,825 to missing)
(26,831 missing values generated)
(34,209 missing values generated)
(3,840 real changes made)
(3,538 real changes made)
(3,840 real changes made)
(3,538 real changes made)
(4,732 real changes made)
(34,209 missing values generated)
(3,840 real changes made)
(3,538 real changes made)
(7,378 real changes made)
(29,477 real changes made)
(26,831 missing values generated)
(7,378 real changes made)
(3,840 real changes made)
(5,780 real changes made, 5,780 to missing)
(26,786 missing values generated)
(34,209 missing values generated)
(3,829 real changes made)
(3,594 real changes made)
(3,829 real changes made)
(3,594 real changes made)
(4,666 real changes made)
(34,209 missing values generated)
(3,829 real changes made)
(3,594 real changes made)
(7,423 real changes made)
(29,543 real changes made)
(26,786 missing values generated)
(7,423 real changes made)
(3,829 real changes made)
(5,806 real changes made, 5,806 to missing)
(26,812 missing values generated)
(34,209 missing values generated)
(3,843 real changes made)
(3,554 real changes made)
(3,843 real changes made)
(3,554 real changes made)
(4,681 real changes made)
(34,209 missing values generated)
(3,843 real changes made)
(3,554 real changes made)
(7,397 real changes made)
(29,528 real changes made)
(26,812 missing values generated)
(7,397 real changes made)
(3,843 real changes made)
(5,860 real changes made, 5,860 to missing)
(26,866 missing values generated)
(34,209 missing values generated)
(3,850 real changes made)
(3,493 real changes made)
(3,850 real changes made)
(3,493 real changes made)
(4,660 real changes made)
(34,209 missing values generated)
(3,850 real changes made)
(3,493 real changes made)
(7,343 real changes made)
(29,549 real changes made)
(26,866 missing values generated)
(7,343 real changes made)
(3,850 real changes made)
(5,793 real changes made, 5,793 to missing)
(26,799 missing values generated)
(34,209 missing values generated)
(3,825 real changes made)
(3,585 real changes made)
(3,825 real changes made)
(3,585 real changes made)
(4,700 real changes made)
(34,209 missing values generated)
(3,825 real changes made)
(3,585 real changes made)
(7,410 real changes made)
(29,509 real changes made)
(26,799 missing values generated)
(7,410 real changes made)
(3,825 real changes made)
(5,770 real changes made, 5,770 to missing)
(26,776 missing values generated)
(34,209 missing values generated)
(3,852 real changes made)
(3,581 real changes made)
(3,852 real changes made)
(3,581 real changes made)
(4,771 real changes made)
(34,209 missing values generated)
(3,852 real changes made)
(3,581 real changes made)
(7,433 real changes made)
(29,438 real changes made)
(26,776 missing values generated)
(7,433 real changes made)
(3,852 real changes made)
(5,776 real changes made, 5,776 to missing)
(26,782 missing values generated)
(34,209 missing values generated)
(3,829 real changes made)
(3,598 real changes made)
(3,829 real changes made)
(3,598 real changes made)
(4,649 real changes made)
(34,209 missing values generated)
(3,829 real changes made)
(3,598 real changes made)
(7,427 real changes made)
(29,560 real changes made)
(26,782 missing values generated)
(7,427 real changes made)
(3,829 real changes made)
(5,789 real changes made, 5,789 to missing)
(26,795 missing values generated)
(34,209 missing values generated)
(3,805 real changes made)
(3,609 real changes made)
(3,805 real changes made)
(3,609 real changes made)
(4,759 real changes made)
(34,209 missing values generated)
(3,805 real changes made)
(3,609 real changes made)
(7,414 real changes made)
(29,450 real changes made)
(26,795 missing values generated)
(7,414 real changes made)
(3,805 real changes made)
(5,789 real changes made, 5,789 to missing)
(26,795 missing values generated)
(34,209 missing values generated)
(3,844 real changes made)
(3,570 real changes made)
(3,844 real changes made)
(3,570 real changes made)
(4,705 real changes made)
(34,209 missing values generated)
(3,844 real changes made)
(3,570 real changes made)
(7,414 real changes made)
(29,504 real changes made)
(26,795 missing values generated)
(7,414 real changes made)
(3,844 real changes made)
(5,804 real changes made, 5,804 to missing)
(26,810 missing values generated)
(34,209 missing values generated)
(3,781 real changes made)
(3,618 real changes made)
(3,781 real changes made)
(3,618 real changes made)
(4,712 real changes made)
(34,209 missing values generated)
(3,781 real changes made)
(3,618 real changes made)
(7,399 real changes made)
(29,497 real changes made)
(26,810 missing values generated)
(7,399 real changes made)
(3,781 real changes made)
(5,793 real changes made, 5,793 to missing)
(26,799 missing values generated)
(34,209 missing values generated)
(3,851 real changes made)
(3,559 real changes made)
(3,851 real changes made)
(3,559 real changes made)
(4,653 real changes made)
(34,209 missing values generated)
(3,851 real changes made)
(3,559 real changes made)
(7,410 real changes made)
(29,556 real changes made)
(26,799 missing values generated)
(7,410 real changes made)
(3,851 real changes made)
(5,815 real changes made, 5,815 to missing)
(26,821 missing values generated)
(34,209 missing values generated)
(3,826 real changes made)
(3,562 real changes made)
(3,826 real changes made)
(3,562 real changes made)
(4,681 real changes made)
(34,209 missing values generated)
(3,826 real changes made)
(3,562 real changes made)
(7,388 real changes made)
(29,528 real changes made)
(26,821 missing values generated)
(7,388 real changes made)
(3,826 real changes made)
(5,841 real changes made, 5,841 to missing)
(26,847 missing values generated)
(34,209 missing values generated)
(3,814 real changes made)
(3,548 real changes made)
(3,814 real changes made)
(3,548 real changes made)
(4,601 real changes made)
(34,209 missing values generated)
(3,814 real changes made)
(3,548 real changes made)
(7,362 real changes made)
(29,608 real changes made)
(26,847 missing values generated)
(7,362 real changes made)
(3,814 real changes made)
(5,797 real changes made, 5,797 to missing)
(26,803 missing values generated)
(34,209 missing values generated)
(3,800 real changes made)
(3,606 real changes made)
(3,800 real changes made)
(3,606 real changes made)
(4,651 real changes made)
(34,209 missing values generated)
(3,800 real changes made)
(3,606 real changes made)
(7,406 real changes made)
(29,558 real changes made)
(26,803 missing values generated)
(7,406 real changes made)
(3,800 real changes made)
(5,800 real changes made, 5,800 to missing)
(26,806 missing values generated)
(34,209 missing values generated)
(3,880 real changes made)
(3,523 real changes made)
(3,880 real changes made)
(3,523 real changes made)
(4,716 real changes made)
(34,209 missing values generated)
(3,880 real changes made)
(3,523 real changes made)
(7,403 real changes made)
(29,493 real changes made)
(26,806 missing values generated)
(7,403 real changes made)
(3,880 real changes made)
(5,782 real changes made, 5,782 to missing)
(26,788 missing values generated)
(34,209 missing values generated)
(3,820 real changes made)
(3,601 real changes made)
(3,820 real changes made)
(3,601 real changes made)
(4,668 real changes made)
(34,209 missing values generated)
(3,820 real changes made)
(3,601 real changes made)
(7,421 real changes made)
(29,541 real changes made)
(26,788 missing values generated)
(7,421 real changes made)
(3,820 real changes made)
(5,812 real changes made, 5,812 to missing)
(26,818 missing values generated)
(34,209 missing values generated)
(3,851 real changes made)
(3,540 real changes made)
(3,851 real changes made)
(3,540 real changes made)
(4,761 real changes made)
(34,209 missing values generated)
(3,851 real changes made)
(3,540 real changes made)
(7,391 real changes made)
(29,448 real changes made)
(26,818 missing values generated)
(7,391 real changes made)
(3,851 real changes made)
(5,782 real changes made, 5,782 to missing)
(26,788 missing values generated)
(34,209 missing values generated)
(3,837 real changes made)
(3,584 real changes made)
(3,837 real changes made)
(3,584 real changes made)
(4,750 real changes made)
(34,209 missing values generated)
(3,837 real changes made)
(3,584 real changes made)
(7,421 real changes made)
(29,459 real changes made)
(26,788 missing values generated)
(7,421 real changes made)
(3,837 real changes made)
(5,839 real changes made, 5,839 to missing)
(26,845 missing values generated)
(34,209 missing values generated)
(3,742 real changes made)
(3,622 real changes made)
(3,742 real changes made)
(3,622 real changes made)
(4,615 real changes made)
(34,209 missing values generated)
(3,742 real changes made)
(3,622 real changes made)
(7,364 real changes made)
(29,594 real changes made)
(26,845 missing values generated)
(7,364 real changes made)
(3,742 real changes made)
(5,786 real changes made, 5,786 to missing)
(26,792 missing values generated)
(34,209 missing values generated)
(3,875 real changes made)
(3,542 real changes made)
(3,875 real changes made)
(3,542 real changes made)
(4,691 real changes made)
(34,209 missing values generated)
(3,875 real changes made)
(3,542 real changes made)
(7,417 real changes made)
(29,518 real changes made)
(26,792 missing values generated)
(7,417 real changes made)
(3,875 real changes made)
(5,799 real changes made, 5,799 to missing)
(26,805 missing values generated)
(34,209 missing values generated)
(3,853 real changes made)
(3,551 real changes made)
(3,853 real changes made)
(3,551 real changes made)
(4,720 real changes made)
(34,209 missing values generated)
(3,853 real changes made)
(3,551 real changes made)
(7,404 real changes made)
(29,489 real changes made)
(26,805 missing values generated)
(7,404 real changes made)
(3,853 real changes made)
(5,850 real changes made, 5,850 to missing)
(26,856 missing values generated)
(34,209 missing values generated)
(3,853 real changes made)
(3,500 real changes made)
(3,853 real changes made)
(3,500 real changes made)
(4,683 real changes made)
(34,209 missing values generated)
(3,853 real changes made)
(3,500 real changes made)
(7,353 real changes made)
(29,526 real changes made)
(26,856 missing values generated)
(7,353 real changes made)
(3,853 real changes made)
(5,804 real changes made, 5,804 to missing)
(26,810 missing values generated)
(34,209 missing values generated)
(3,828 real changes made)
(3,571 real changes made)
(3,828 real changes made)
(3,571 real changes made)
(4,686 real changes made)
(34,209 missing values generated)
(3,828 real changes made)
(3,571 real changes made)
(7,399 real changes made)
(29,523 real changes made)
(26,810 missing values generated)
(7,399 real changes made)
(3,828 real changes made)
(5,805 real changes made, 5,805 to missing)
(26,811 missing values generated)
(34,209 missing values generated)
(3,820 real changes made)
(3,578 real changes made)
(3,820 real changes made)
(3,578 real changes made)
(4,724 real changes made)
(34,209 missing values generated)
(3,820 real changes made)
(3,578 real changes made)
(7,398 real changes made)
(29,485 real changes made)
(26,811 missing values generated)
(7,398 real changes made)
(3,820 real changes made)
(5,794 real changes made, 5,794 to missing)
(26,800 missing values generated)
(34,209 missing values generated)
(3,807 real changes made)
(3,602 real changes made)
(3,807 real changes made)
(3,602 real changes made)
(4,745 real changes made)
(34,209 missing values generated)
(3,807 real changes made)
(3,602 real changes made)
(7,409 real changes made)
(29,464 real changes made)
(26,800 missing values generated)
(7,409 real changes made)
(3,807 real changes made)
(5,827 real changes made, 5,827 to missing)
(26,833 missing values generated)
(34,209 missing values generated)
(3,854 real changes made)
(3,522 real changes made)
(3,854 real changes made)
(3,522 real changes made)
(4,592 real changes made)
(34,209 missing values generated)
(3,854 real changes made)
(3,522 real changes made)
(7,376 real changes made)
(29,617 real changes made)
(26,833 missing values generated)
(7,376 real changes made)
(3,854 real changes made)
(5,772 real changes made, 5,772 to missing)
(26,778 missing values generated)
(34,209 missing values generated)
(3,860 real changes made)
(3,571 real changes made)
(3,860 real changes made)
(3,571 real changes made)
(4,747 real changes made)
(34,209 missing values generated)
(3,860 real changes made)
(3,571 real changes made)
(7,431 real changes made)
(29,462 real changes made)
(26,778 missing values generated)
(7,431 real changes made)
(3,860 real changes made)
(5,797 real changes made, 5,797 to missing)
(26,803 missing values generated)
(34,209 missing values generated)
(3,793 real changes made)
(3,613 real changes made)
(3,793 real changes made)
(3,613 real changes made)
(4,679 real changes made)
(34,209 missing values generated)
(3,793 real changes made)
(3,613 real changes made)
(7,406 real changes made)
(29,530 real changes made)
(26,803 missing values generated)
(7,406 real changes made)
(3,793 real changes made)
(5,806 real changes made, 5,806 to missing)
(26,812 missing values generated)
(34,209 missing values generated)
(3,823 real changes made)
(3,574 real changes made)
(3,823 real changes made)
(3,574 real changes made)
(4,646 real changes made)
(34,209 missing values generated)
(3,823 real changes made)
(3,574 real changes made)
(7,397 real changes made)
(29,563 real changes made)
(26,812 missing values generated)
(7,397 real changes made)
(3,823 real changes made)
(5,824 real changes made, 5,824 to missing)
(26,830 missing values generated)
(34,209 missing values generated)
(3,869 real changes made)
(3,510 real changes made)
(3,869 real changes made)
(3,510 real changes made)
(4,750 real changes made)
(34,209 missing values generated)
(3,869 real changes made)
(3,510 real changes made)
(7,379 real changes made)
(29,459 real changes made)
(26,830 missing values generated)
(7,379 real changes made)
(3,869 real changes made)
(5,814 real changes made, 5,814 to missing)
(26,820 missing values generated)
(34,209 missing values generated)
(3,794 real changes made)
(3,595 real changes made)
(3,794 real changes made)
(3,595 real changes made)
(4,664 real changes made)
(34,209 missing values generated)
(3,794 real changes made)
(3,595 real changes made)
(7,389 real changes made)
(29,545 real changes made)
(26,820 missing values generated)
(7,389 real changes made)
(3,794 real changes made)
(5,807 real changes made, 5,807 to missing)
(26,813 missing values generated)
(34,209 missing values generated)
(3,837 real changes made)
(3,559 real changes made)
(3,837 real changes made)
(3,559 real changes made)
(4,735 real changes made)
(34,209 missing values generated)
(3,837 real changes made)
(3,559 real changes made)
(7,396 real changes made)
(29,474 real changes made)
(26,813 missing values generated)
(7,396 real changes made)
(3,837 real changes made)
(5,817 real changes made, 5,817 to missing)
(26,823 missing values generated)
(34,209 missing values generated)
(3,744 real changes made)
(3,642 real changes made)
(3,744 real changes made)
(3,642 real changes made)
(4,657 real changes made)
(34,209 missing values generated)
(3,744 real changes made)
(3,642 real changes made)
(7,386 real changes made)
(29,552 real changes made)
(26,823 missing values generated)
(7,386 real changes made)
(3,744 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)

. gen baseline_egfr=.
(34,209 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(753 real changes made)
(872 real changes made)
(837 real changes made)
(760 real changes made)
(667 real changes made)
(659 real changes made)
(602 real changes made)
(540 real changes made)
(546 real changes made)
(483 real changes made)
(539 real changes made)
(416 real changes made)
(353 real changes made)
(423 real changes made)
(306 real changes made)
(326 real changes made)
(288 real changes made)
(243 real changes made)
(285 real changes made)
(206 real changes made)
(184 real changes made)
(194 real changes made)
(185 real changes made)
(153 real changes made)
(134 real changes made)
(128 real changes made)
(111 real changes made)
(131 real changes made)
(132 real changes made)
(68 real changes made)
(119 real changes made)
(60 real changes made)
(259 real changes made)
(321 real changes made)
(295 real changes made)
(292 real changes made)
(268 real changes made)
(263 real changes made)
(275 real changes made)
(239 real changes made)
(267 real changes made)
(253 real changes made)
(269 real changes made)
(241 real changes made)
(187 real changes made)
(245 real changes made)
(208 real changes made)
(242 real changes made)
(215 real changes made)
(210 real changes made)
(243 real changes made)
(206 real changes made)
(203 real changes made)
(188 real changes made)
(173 real changes made)
(210 real changes made)
(167 real changes made)
(198 real changes made)
(163 real changes made)
(200 real changes made)
(194 real changes made)
(150 real changes made)
(197 real changes made)
(147 real changes made)
(148 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab case baseline_esrd

           | baseline_e
           |    srd
      case |   No ESRD |     Total
-----------+-----------+----------
         0 |    21,006 |    21,006 
         1 |    13,203 |    13,203 
-----------+-----------+----------
     Total |    34,209 |    34,209 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. * Drop COVID-19 cases without any matched historical comparators after further application of exclusion criteria
. generate match_counts1=.
(34,209 missing values generated)

. order patient_id set_id match_counts match_counts1

. bysort set_id: replace match_counts1=_N-1
(34,209 real changes made)

. replace match_counts1=. if case==0
(21,006 real changes made, 21,006 to missing)

. drop match_counts

. rename match_counts1 match_counts

. count if match_counts==0
  5,244

. drop if match_counts==0
(5,244 observations deleted)

. safetab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,006       72.52       72.52
          1 |      7,959       27.48      100.00
------------+-----------------------------------
      Total |     28,965      100.00

. tab match_counts

match_count |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,139       14.31       14.31
          2 |      1,804       22.67       36.98
          3 |      5,016       63.02      100.00
------------+-----------------------------------
      Total |      7,959      100.00

. 
. bysort set_id: egen set_case_mean = mean(case) // if mean of exposure var is 0 then only uncase in set, if 1 then only case in set

. gen valid_set = (set_case_mean>0 & set_case_mean<1) // ==1 is valid set containing both case and uncase

. tab valid_set, miss

  valid_set |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,211        4.18        4.18
          1 |     27,754       95.82      100.00
------------+-----------------------------------
      Total |     28,965      100.00

. tab valid_set case, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |         case
 valid_set |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,211          0 |     1,211 
           |      5.77       0.00 |      4.18 
-----------+----------------------+----------
         1 |    19,795      7,959 |    27,754 
           |     94.23     100.00 |     95.82 
-----------+----------------------+----------
     Total |    21,006      7,959 |    28,965 
           |    100.00     100.00 |    100.00 

. keep if valid_set==1
(1,211 observations deleted)

. drop valid_set set_case_mean

. 
. ** Exposure
. label define case 0 "Historical comparator" ///
>                                   1 "SARS-CoV-2"

. label values case case

. safetab case 

                 case |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,795       71.32       71.32
           SARS-CoV-2 |      7,959       28.68      100.00
----------------------+-----------------------------------
                Total |     27,754      100.00

. 
. * COVID-19 severity
. gen covid_severity = case

. replace covid_severity = 2 if covid_hospitalised==1
(811 real changes made)

. replace covid_severity = 3 if covid_critical_care==1
(398 real changes made)

. replace covid_severity = 3 if covid_critical_days==1
(365 real changes made)

. label define covid_severity     0 "Historical comparator"               ///
>                                                         1 "Non-hospitalised COVID" ///
>                                                         2 "Hospitalised COVID"          ///
>                                                         3 "Critical care COVID"

. label values covid_severity covid_severity

. label var covid_severity "SARS-CoV-2 severity"

. drop covid_critical_care

. drop covid_critical_days

. safetab covid_severity, m

   SARS-CoV-2 severity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
 Historical comparator |     19,795       71.32       71.32
Non-hospitalised COVID |      6,455       23.26       94.58
    Hospitalised COVID |        741        2.67       97.25
   Critical care COVID |        763        2.75      100.00
-----------------------+-----------------------------------
                 Total |     27,754      100.00

. 
. * COVID-19 acute kidney injury
. gen covid_aki = case

. replace covid_aki = 2 if covid_hospitalised==1
(811 real changes made)

. replace covid_aki = 3 if covid_acute_kidney_injury==1
(411 real changes made)

. label define covid_aki  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised COVID"              ///
>                                                 2 "Hospitalised COVID"  ///
>                                                 3 "Hospitalised COVID-AKI"

. label values covid_aki covid_aki

. label var covid_aki "COVID-19 acute kidney injury"

. drop covid_acute_kidney_injury

. safetab covid_aki, m

 COVID-19 acute kidney |
                injury |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
 Historical comparator |     19,795       71.32       71.32
Non-hospitalised COVID |      6,785       24.45       95.77
    Hospitalised COVID |        763        2.75       98.52
Hospitalised COVID-AKI |        411        1.48      100.00
-----------------------+-----------------------------------
                 Total |     27,754      100.00

. 
. * COVID-19 kidney replacement therapy
. gen covid_krt_combined = covid_krt_icd_10
(19,795 missing values generated)

. replace covid_krt_combined = covid_krt_opcs_4 if covid_krt_icd_10==0
(361 real changes made)

. gen covid_krt = case

. replace covid_krt = 2 if covid_hospitalised==1
(811 real changes made)

. replace covid_krt = 3 if covid_krt_combined==1
(757 real changes made)

. label define covid_krt  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised SARS-CoV-2"         ///
>                                                 2 "No KRT hospitalised COVID-19"        ///
>                                                 3 "KRT hospitalised COVID-19"

. label values covid_krt covid_krt

. label var covid_krt "COVID-19 kidney replacement therapy"

. drop covid_krt_icd_10

. drop covid_krt_opcs_4

. safetab covid_krt, m

 COVID-19 kidney replacement |
                     therapy |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
       Historical comparator |     19,795       71.32       71.32
 Non-hospitalised SARS-CoV-2 |      6,463       23.29       94.61
No KRT hospitalised COVID-19 |        739        2.66       97.27
   KRT hospitalised COVID-19 |        757        2.73      100.00
-----------------------------+-----------------------------------
                       Total |     27,754      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(26,141 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(26,159 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(26,157 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(26,164 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(1,590 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(1,258 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(999 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(825 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Historical comparator"       ///
>                                                 1 "Pre-vaccination"                     ///
>                                                 2 "1 vaccine dose"                      ///
>                                                 3 "2 vaccine doses"                     ///
>                                                 4 "3 vaccine doses"                     ///
>                                                 5 "4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "Vaccination status"

. safetab covid_vax, m

   Vaccination status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,795       71.32       71.32
      Pre-vaccination |      3,287       11.84       83.17
       1 vaccine dose |        825        2.97       86.14
      2 vaccine doses |        999        3.60       89.74
      3 vaccine doses |      1,258        4.53       94.27
      4 vaccine doses |      1,590        5.73      100.00
----------------------+-----------------------------------
                Total |     27,754      100.00

. 
. * COVID-19 wave
. gen wave = case

. replace wave = 2 if index_month=="sep2020"
(352 real changes made)

. replace wave = 2 if index_month=="oct2020"
(368 real changes made)

. replace wave = 2 if index_month=="nov2020"
(327 real changes made)

. replace wave = 2 if index_month=="dec2020"
(349 real changes made)

. replace wave = 2 if index_month=="jan2021"
(280 real changes made)

. replace wave = 2 if index_month=="feb2021"
(229 real changes made)

. replace wave = 2 if index_month=="mar2021"
(279 real changes made)

. replace wave = 2 if index_month=="apr2021"
(205 real changes made)

. replace wave = 2 if index_month=="may2021"
(230 real changes made)

. replace wave = 2 if index_month=="jun2021"
(217 real changes made)

. replace wave = 3 if index_month=="jul2021"
(183 real changes made)

. replace wave = 3 if index_month=="aug2021"
(204 real changes made)

. replace wave = 3 if index_month=="sep2021"
(154 real changes made)

. replace wave = 3 if index_month=="oct2021"
(134 real changes made)

. replace wave = 3 if index_month=="nov2021"
(149 real changes made)

. replace wave = 4 if index_month=="dec2021"
(130 real changes made)

. replace wave = 4 if index_month=="jan2022"
(120 real changes made)

. replace wave = 4 if index_month=="feb2022"
(104 real changes made)

. replace wave = 4 if index_month=="mar2022"
(105 real changes made)

. replace wave = 4 if index_month=="apr2022"
(90 real changes made)

. replace wave = 4 if index_month=="may2022"
(99 real changes made)

. replace wave = 4 if index_month=="jun2022"
(102 real changes made)

. replace wave = 4 if index_month=="jul2022"
(67 real changes made)

. replace wave = 4 if index_month=="aug2022"
(84 real changes made)

. replace wave = 4 if index_month=="sep2022"
(49 real changes made)

. replace wave = 4 if index_month=="oct2022"
(70 real changes made)

. label define wave       0 "Historical comparator"       ///
>                                         1 "Febuary20-August20"  ///
>                                         2 "September20-June21"  ///
>                                         3 "July21-November21"   ///
>                                         4 "December21-October22"        

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m

        COVID-19 wave |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,795       71.32       71.32
   Febuary20-August20 |      3,279       11.81       83.14
   September20-June21 |      2,836       10.22       93.36
    July21-November21 |        824        2.97       96.32
 December21-October22 |      1,020        3.68      100.00
----------------------+-----------------------------------
                Total |     27,754      100.00

. 
. ** Covariates
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        246        0.89        0.89
         19 |        376        1.35        2.24
         20 |        389        1.40        3.64
         21 |        487        1.75        5.40
         22 |        533        1.92        7.32
         23 |        546        1.97        9.29
         24 |        577        2.08       11.36
         25 |        584        2.10       13.47
         26 |        569        2.05       15.52
         27 |        564        2.03       17.55
         28 |        549        1.98       19.53
         29 |        586        2.11       21.64
         30 |        552        1.99       23.63
         31 |        483        1.74       25.37
         32 |        559        2.01       27.38
         33 |        553        1.99       29.38
         34 |        549        1.98       31.35
         35 |        537        1.93       33.29
         36 |        548        1.97       35.26
         37 |        555        2.00       37.26
         38 |        572        2.06       39.32
         39 |        578        2.08       41.41
         40 |        579        2.09       43.49
         41 |        569        2.05       45.54
         42 |        517        1.86       47.41
         43 |        588        2.12       49.52
         44 |        543        1.96       51.48
         45 |        543        1.96       53.44
         46 |        553        1.99       55.43
         47 |        545        1.96       57.39
         48 |        533        1.92       59.31
         49 |        591        2.13       61.44
         50 |        574        2.07       63.51
         51 |        548        1.97       65.49
         52 |        558        2.01       67.50
         53 |        542        1.95       69.45
         54 |        524        1.89       71.34
         55 |        568        2.05       73.38
         56 |        525        1.89       75.28
         57 |        575        2.07       77.35
         58 |        575        2.07       79.42
         59 |        559        2.01       81.43
         60 |        534        1.92       83.36
         61 |        543        1.96       85.31
         62 |        559        2.01       87.33
         63 |        594        2.14       89.47
         64 |        564        2.03       91.50
         65 |        516        1.86       93.36
         66 |        530        1.91       95.27
         67 |        559        2.01       97.28
         68 |        298        1.07       98.36
         69 |        201        0.72       99.08
         70 |        167        0.60       99.68
         71 |         65        0.23       99.92
         72 |         23        0.08      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. safecount
  27,754

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///                                     
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(27754 differences between age and agegroup)

. 
. label var age "Age"

. label values age age

. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label var agegroup "Age group"

. label values agegroup agegroup

. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex

        Sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,300       51.52       51.52
       Male |     13,454       48.48      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. safecount
  27,754

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(1,087 real changes made)

. replace ethnicity=2 if ethnicity==3
(1,042 real changes made)

. replace ethnicity=3 if ethnicity==4
(1,047 real changes made)

. replace ethnicity=4 if ethnicity==6
(1,087 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///                                             
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                                                               

. label values ethnicity ethnicity

. safetab ethnicity, m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,619       59.88       59.88
South Asian |      1,042        3.75       63.63
      Black |      1,047        3.77       67.41
      Mixed |      1,087        3.92       71.32
      Other |      1,039        3.74       75.07
          . |      6,920       24.93      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(6,920 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(6,920 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. label var ethnicity1 "Ethnicity"

. safetab ethnicity1, m

  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,619       59.88       59.88
South Asian |      1,042        3.75       63.63
      Black |      1,047        3.77       67.41
      Mixed |      1,087        3.92       71.32
      Other |      1,039        3.74       75.07
    Unknown |      6,920       24.93      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,959       10.66       10.66
                Urban minor conurbation |      2,782       10.02       20.69
                    Urban city and town |      2,829       10.19       30.88
Urban city and town in a sparse setting |      2,745        9.89       40.77
                  Rural town and fringe |      2,772        9.99       50.76
Rural town and fringe in a sparse setti |      2,801       10.09       60.85
            Rural village and dispersed |      5,414       19.51       80.36
Rural village and dispersed in a sparse |      5,452       19.64      100.00
----------------------------------------+-----------------------------------
                                  Total |     27,754      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(27,754 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(11,315 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(16,439 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                                       rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow  Rural tow  Rural vil  Rural vil |     Total
-----------+----------------------------------------------------------------------------------------+----------
     Rural |         0          0          0          0      2,772      2,801      5,414      5,452 |    16,439 
     Urban |     2,959      2,782      2,829      2,745          0          0          0          0 |    11,315 
-----------+----------------------------------------------------------------------------------------+----------
     Total |     2,959      2,782      2,829      2,745      2,772      2,801      5,414      5,452 |    27,754 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Historical comparator |    11,675      8,120 |    19,795 
           SARS-CoV-2 |     4,764      3,195 |     7,959 
----------------------+----------------------+----------
                Total |    16,439     11,315 |    27,754 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,841 real changes made, 2,841 to missing)

. gen     bmi = .
(27,754 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(1698 changes made to bmi)

. recode  bmi . = 2 if body_mass_index<25
(6285 changes made to bmi)

. recode  bmi . = 3 if body_mass_index<30
(6510 changes made to bmi)

. recode  bmi . = 4 if body_mass_index<35
(5563 changes made to bmi)

. recode  bmi . = 5 if body_mass_index<40
(3183 changes made to bmi)

. recode  bmi . = 6 if body_mass_index<.
(1674 changes made to bmi)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                             

. label values bmi bmi

. label var bmi "Body mass index (BMI)"

. safetab bmi, m

     Body mass index |
               (BMI) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,698        6.12        6.12
  Normal (18.5-24.9) |      6,285       22.65       28.76
Overweight (25-29.9) |      6,510       23.46       52.22
   Obese I (30-34.9) |      5,563       20.04       72.26
  Obese II (35-39.9) |      3,183       11.47       83.73
     Obese III (40+) |      1,674        6.03       89.76
                   . |      2,841       10.24      100.00
---------------------+-----------------------------------
               Total |     27,754      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(24,429 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(619 real changes made)

. replace smoking = 0 if smoking_status=="N"
(1,113 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |      1,113        4.01        4.01
Current/former smoker |      3,944       14.21       18.22
                    . |     22,697       81.78      100.00
----------------------+-----------------------------------
                Total |     27,754      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000)
(12,321 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(15433 changes made to egfr_group)

. label define egfr_group 1 "≥105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       ≥105 |      4,945       17.82       17.82
     90-104 |      2,188        7.88       25.70
      75-89 |      2,040        7.35       33.05
      60-74 |      2,452        8.83       41.89
      45-59 |      2,457        8.85       50.74
      30-44 |      1,230        4.43       55.17
      15-29 |        121        0.44       55.61
          . |     12,321       44.39      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 15-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(12,321 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(22809 changes made to ckd_stage)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6 "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |     11,625       41.89       41.89
                      CKD 3A |      2,457        8.85       50.74
                      CKD 3B |      1,230        4.43       55.17
                       CKD 4 |        121        0.44       55.61
No baseline eGFR measurement |     12,321       44.39      100.00
-----------------------------+-----------------------------------
                       Total |     27,754      100.00

. 
. * Comorbidities
. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,336       94.89       94.89
          1 |      1,418        5.11      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,202       98.01       98.01
          1 |        552        1.99      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. label var diabetes "Diabetes"

. safetab diabetes

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,202       80.00       80.00
          1 |      5,552       20.00      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,480       99.01       99.01
          1 |        274        0.99      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. safetab heart_failure

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,672       96.10       96.10
          1 |      1,082        3.90      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. safetab hiv

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,188       97.96       97.96
          1 |        566        2.04      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. label var hypertension "Hypertension"

. safetab hypertension

Hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,203       80.00       80.00
          1 |      5,551       20.00      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. label var non_haem_cancer "Cancer (non-haematological)"

. safetab non_haem_cancer

     Cancer |
(non-haemat |
  ological) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,194       97.98       97.98
          1 |        560        2.02      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. safetab myocardial_infarction

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,985       90.02       90.02
          1 |      2,769        9.98      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,188       97.96       97.96
          1 |        566        2.04      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,364       94.99       94.99
          1 |      1,390        5.01      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. safetab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,215       98.06       98.06
          1 |        539        1.94      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,176       97.92       97.92
          1 |        578        2.08      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(1,041 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,518 real changes made)

. replace cardiovascular = 1 if pvd==1
(467 real changes made)

. replace cardiovascular = 1 if stroke==1
(427 real changes made)

. label var cardiovascular "Cardiovascular diseases"

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(559 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,334 real changes made)

. replace immunosuppressed = 1 if lupus==1
(536 real changes made)

. label var immunosuppressed "Immunosuppressive diseases"

. safetab cardiovascular

Cardiovascu |
        lar |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,883       78.85       78.85
          1 |      5,871       21.15      100.00
------------+-----------------------------------
      Total |     27,754      100.00

. safetab immunosuppressed

Immunosuppr |
     essive |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,051       90.26       90.26
          1 |      2,703        9.74      100.00
------------+-----------------------------------
      Total |     27,754      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                                 creatinine_mar2017 ///
>                                                                                 creatinine_apr2017 ///
>                                                                                 creatinine_may2017 ///
>                                                                                 creatinine_jun2017 ///
>                                                                                 creatinine_jul2017 ///
>                                                                                 creatinine_aug2017 ///
>                                                                                 creatinine_sep2017 ///
>                                                                                 creatinine_oct2017 ///
>                                                                                 creatinine_nov2017 ///
>                                                                                 creatinine_dec2017 ///
>                                                                                 creatinine_jan2018 ///
>                                                                                 creatinine_feb2018 ///
>                                                                                 creatinine_mar2018 ///
>                                                                                 creatinine_apr2018 ///
>                                                                                 creatinine_may2018 ///
>                                                                                 creatinine_jun2018 ///
>                                                                                 creatinine_jul2018 ///
>                                                                                 creatinine_aug2018 ///
>                                                                                 creatinine_sep2018 ///
>                                                                                 creatinine_oct2018 ///
>                                                                                 creatinine_nov2018 ///
>                                                                                 creatinine_dec2018 ///
>                                                                                 creatinine_jan2019 ///
>                                                                                 creatinine_feb2019 ///
>                                                                                 creatinine_mar2019 ///
>                                                                                 creatinine_apr2019 ///
>                                                                                 creatinine_may2019 ///
>                                                                                 creatinine_jun2019 ///
>                                                                                 creatinine_jul2019 ///
>                                                                                 creatinine_aug2019 ///
>                                                                                 creatinine_sep2019 ///
>                                                                                 creatinine_feb2020 ///
>                                                                                 creatinine_mar2020 ///
>                                                                                 creatinine_apr2020 ///
>                                                                                 creatinine_may2020 ///
>                                                                                 creatinine_jun2020 ///
>                                                                                 creatinine_jul2020 ///
>                                                                                 creatinine_aug2020 ///
>                                                                                 creatinine_sep2020 ///
>                                                                                 creatinine_oct2020 ///
>                                                                                 creatinine_nov2020 ///
>                                                                                 creatinine_dec2020 ///
>                                                                                 creatinine_jan2021 ///
>                                                                                 creatinine_feb2021 ///
>                                                                                 creatinine_mar2021 ///
>                                                                                 creatinine_apr2021 ///
>                                                                                 creatinine_may2021 ///
>                                                                                 creatinine_jun2021 ///
>                                                                                 creatinine_jul2021 ///
>                                                                                 creatinine_aug2021 ///
>                                                                                 creatinine_sep2021 ///
>                                                                                 creatinine_oct2021 ///
>                                                                                 creatinine_nov2021 ///
>                                                                                 creatinine_dec2021 ///
>                                                                                 creatinine_jan2022 ///
>                                                                                 creatinine_feb2022 ///
>                                                                                 creatinine_mar2022 ///
>                                                                                 creatinine_apr2022 ///
>                                                                                 creatinine_may2022 ///
>                                                                                 creatinine_jun2022 ///
>                                                                                 creatinine_jul2022 ///
>                                                                                 creatinine_aug2022 ///
>                                                                                 creatinine_sep2022 ///
>                                                                                 creatinine_oct2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 3000)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex==0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex==1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_monthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(8,673 real changes made, 8,673 to missing)
(16,632 missing values generated)
(27,754 missing values generated)
(5,676 real changes made)
(5,446 real changes made)
(5,676 real changes made)
(5,446 real changes made)
(7,007 real changes made)
(27,754 missing values generated)
(5,676 real changes made)
(5,446 real changes made)
(11,122 real changes made)
(20,747 real changes made)
(16,632 missing values generated)
(11,122 real changes made)
(5,676 real changes made)
(8,695 real changes made, 8,695 to missing)
(16,654 missing values generated)
(27,754 missing values generated)
(5,698 real changes made)
(5,402 real changes made)
(5,698 real changes made)
(5,402 real changes made)
(7,156 real changes made)
(27,754 missing values generated)
(5,698 real changes made)
(5,402 real changes made)
(11,100 real changes made)
(20,598 real changes made)
(16,654 missing values generated)
(11,100 real changes made)
(5,698 real changes made)
(8,703 real changes made, 8,703 to missing)
(16,662 missing values generated)
(27,754 missing values generated)
(5,747 real changes made)
(5,345 real changes made)
(5,747 real changes made)
(5,345 real changes made)
(7,025 real changes made)
(27,754 missing values generated)
(5,747 real changes made)
(5,345 real changes made)
(11,092 real changes made)
(20,729 real changes made)
(16,662 missing values generated)
(11,092 real changes made)
(5,747 real changes made)
(8,743 real changes made, 8,743 to missing)
(16,702 missing values generated)
(27,754 missing values generated)
(5,669 real changes made)
(5,383 real changes made)
(5,669 real changes made)
(5,383 real changes made)
(7,050 real changes made)
(27,754 missing values generated)
(5,669 real changes made)
(5,383 real changes made)
(11,052 real changes made)
(20,704 real changes made)
(16,702 missing values generated)
(11,052 real changes made)
(5,669 real changes made)
(8,720 real changes made, 8,720 to missing)
(16,679 missing values generated)
(27,754 missing values generated)
(5,705 real changes made)
(5,370 real changes made)
(5,705 real changes made)
(5,370 real changes made)
(6,991 real changes made)
(27,754 missing values generated)
(5,705 real changes made)
(5,370 real changes made)
(11,075 real changes made)
(20,763 real changes made)
(16,679 missing values generated)
(11,075 real changes made)
(5,705 real changes made)
(8,664 real changes made, 8,664 to missing)
(16,623 missing values generated)
(27,754 missing values generated)
(5,712 real changes made)
(5,419 real changes made)
(5,712 real changes made)
(5,419 real changes made)
(7,069 real changes made)
(27,754 missing values generated)
(5,712 real changes made)
(5,419 real changes made)
(11,131 real changes made)
(20,685 real changes made)
(16,623 missing values generated)
(11,131 real changes made)
(5,712 real changes made)
(8,755 real changes made, 8,755 to missing)
(16,714 missing values generated)
(27,754 missing values generated)
(5,642 real changes made)
(5,398 real changes made)
(5,642 real changes made)
(5,398 real changes made)
(7,014 real changes made)
(27,754 missing values generated)
(5,642 real changes made)
(5,398 real changes made)
(11,040 real changes made)
(20,740 real changes made)
(16,714 missing values generated)
(11,040 real changes made)
(5,642 real changes made)
(8,707 real changes made, 8,707 to missing)
(16,666 missing values generated)
(27,754 missing values generated)
(5,649 real changes made)
(5,439 real changes made)
(5,649 real changes made)
(5,439 real changes made)
(7,024 real changes made)
(27,754 missing values generated)
(5,649 real changes made)
(5,439 real changes made)
(11,088 real changes made)
(20,730 real changes made)
(16,666 missing values generated)
(11,088 real changes made)
(5,649 real changes made)
(8,693 real changes made, 8,693 to missing)
(16,652 missing values generated)
(27,754 missing values generated)
(5,713 real changes made)
(5,389 real changes made)
(5,713 real changes made)
(5,389 real changes made)
(6,984 real changes made)
(27,754 missing values generated)
(5,713 real changes made)
(5,389 real changes made)
(11,102 real changes made)
(20,770 real changes made)
(16,652 missing values generated)
(11,102 real changes made)
(5,713 real changes made)
(8,712 real changes made, 8,712 to missing)
(16,671 missing values generated)
(27,754 missing values generated)
(5,732 real changes made)
(5,351 real changes made)
(5,732 real changes made)
(5,351 real changes made)
(6,979 real changes made)
(27,754 missing values generated)
(5,732 real changes made)
(5,351 real changes made)
(11,083 real changes made)
(20,775 real changes made)
(16,671 missing values generated)
(11,083 real changes made)
(5,732 real changes made)
(8,758 real changes made, 8,758 to missing)
(16,717 missing values generated)
(27,754 missing values generated)
(5,741 real changes made)
(5,296 real changes made)
(5,741 real changes made)
(5,296 real changes made)
(7,045 real changes made)
(27,754 missing values generated)
(5,741 real changes made)
(5,296 real changes made)
(11,037 real changes made)
(20,709 real changes made)
(16,717 missing values generated)
(11,037 real changes made)
(5,741 real changes made)
(8,801 real changes made, 8,801 to missing)
(16,760 missing values generated)
(27,754 missing values generated)
(5,759 real changes made)
(5,235 real changes made)
(5,759 real changes made)
(5,235 real changes made)
(6,967 real changes made)
(27,754 missing values generated)
(5,759 real changes made)
(5,235 real changes made)
(10,994 real changes made)
(20,787 real changes made)
(16,760 missing values generated)
(10,994 real changes made)
(5,759 real changes made)
(8,707 real changes made, 8,707 to missing)
(16,666 missing values generated)
(27,754 missing values generated)
(5,792 real changes made)
(5,296 real changes made)
(5,792 real changes made)
(5,296 real changes made)
(7,009 real changes made)
(27,754 missing values generated)
(5,792 real changes made)
(5,296 real changes made)
(11,088 real changes made)
(20,745 real changes made)
(16,666 missing values generated)
(11,088 real changes made)
(5,792 real changes made)
(8,676 real changes made, 8,676 to missing)
(16,635 missing values generated)
(27,754 missing values generated)
(5,743 real changes made)
(5,376 real changes made)
(5,743 real changes made)
(5,376 real changes made)
(7,061 real changes made)
(27,754 missing values generated)
(5,743 real changes made)
(5,376 real changes made)
(11,119 real changes made)
(20,693 real changes made)
(16,635 missing values generated)
(11,119 real changes made)
(5,743 real changes made)
(8,647 real changes made, 8,647 to missing)
(16,606 missing values generated)
(27,754 missing values generated)
(5,770 real changes made)
(5,378 real changes made)
(5,770 real changes made)
(5,378 real changes made)
(7,030 real changes made)
(27,754 missing values generated)
(5,770 real changes made)
(5,378 real changes made)
(11,148 real changes made)
(20,724 real changes made)
(16,606 missing values generated)
(11,148 real changes made)
(5,770 real changes made)
(8,657 real changes made, 8,657 to missing)
(16,616 missing values generated)
(27,754 missing values generated)
(5,765 real changes made)
(5,373 real changes made)
(5,765 real changes made)
(5,373 real changes made)
(7,020 real changes made)
(27,754 missing values generated)
(5,765 real changes made)
(5,373 real changes made)
(11,138 real changes made)
(20,734 real changes made)
(16,616 missing values generated)
(11,138 real changes made)
(5,765 real changes made)
(8,732 real changes made, 8,732 to missing)
(16,691 missing values generated)
(27,754 missing values generated)
(5,755 real changes made)
(5,308 real changes made)
(5,755 real changes made)
(5,308 real changes made)
(6,987 real changes made)
(27,754 missing values generated)
(5,755 real changes made)
(5,308 real changes made)
(11,063 real changes made)
(20,767 real changes made)
(16,691 missing values generated)
(11,063 real changes made)
(5,755 real changes made)
(8,698 real changes made, 8,698 to missing)
(16,657 missing values generated)
(27,754 missing values generated)
(5,736 real changes made)
(5,361 real changes made)
(5,736 real changes made)
(5,361 real changes made)
(7,113 real changes made)
(27,754 missing values generated)
(5,736 real changes made)
(5,361 real changes made)
(11,097 real changes made)
(20,641 real changes made)
(16,657 missing values generated)
(11,097 real changes made)
(5,736 real changes made)
(8,723 real changes made, 8,723 to missing)
(16,682 missing values generated)
(27,754 missing values generated)
(5,734 real changes made)
(5,338 real changes made)
(5,734 real changes made)
(5,338 real changes made)
(7,017 real changes made)
(27,754 missing values generated)
(5,734 real changes made)
(5,338 real changes made)
(11,072 real changes made)
(20,737 real changes made)
(16,682 missing values generated)
(11,072 real changes made)
(5,734 real changes made)
(8,722 real changes made, 8,722 to missing)
(16,681 missing values generated)
(27,754 missing values generated)
(5,766 real changes made)
(5,307 real changes made)
(5,766 real changes made)
(5,307 real changes made)
(6,945 real changes made)
(27,754 missing values generated)
(5,766 real changes made)
(5,307 real changes made)
(11,073 real changes made)
(20,809 real changes made)
(16,681 missing values generated)
(11,073 real changes made)
(5,766 real changes made)
(8,675 real changes made, 8,675 to missing)
(16,634 missing values generated)
(27,754 missing values generated)
(5,680 real changes made)
(5,440 real changes made)
(5,680 real changes made)
(5,440 real changes made)
(6,996 real changes made)
(27,754 missing values generated)
(5,680 real changes made)
(5,440 real changes made)
(11,120 real changes made)
(20,758 real changes made)
(16,634 missing values generated)
(11,120 real changes made)
(5,680 real changes made)
(8,649 real changes made, 8,649 to missing)
(16,608 missing values generated)
(27,754 missing values generated)
(5,783 real changes made)
(5,363 real changes made)
(5,783 real changes made)
(5,363 real changes made)
(7,136 real changes made)
(27,754 missing values generated)
(5,783 real changes made)
(5,363 real changes made)
(11,146 real changes made)
(20,618 real changes made)
(16,608 missing values generated)
(11,146 real changes made)
(5,783 real changes made)
(8,726 real changes made, 8,726 to missing)
(16,685 missing values generated)
(27,754 missing values generated)
(5,663 real changes made)
(5,406 real changes made)
(5,663 real changes made)
(5,406 real changes made)
(7,022 real changes made)
(27,754 missing values generated)
(5,663 real changes made)
(5,406 real changes made)
(11,069 real changes made)
(20,732 real changes made)
(16,685 missing values generated)
(11,069 real changes made)
(5,663 real changes made)
(8,731 real changes made, 8,731 to missing)
(16,690 missing values generated)
(27,754 missing values generated)
(5,743 real changes made)
(5,321 real changes made)
(5,743 real changes made)
(5,321 real changes made)
(7,057 real changes made)
(27,754 missing values generated)
(5,743 real changes made)
(5,321 real changes made)
(11,064 real changes made)
(20,697 real changes made)
(16,690 missing values generated)
(11,064 real changes made)
(5,743 real changes made)
(8,689 real changes made, 8,689 to missing)
(16,648 missing values generated)
(27,754 missing values generated)
(5,776 real changes made)
(5,330 real changes made)
(5,776 real changes made)
(5,330 real changes made)
(7,129 real changes made)
(27,754 missing values generated)
(5,776 real changes made)
(5,330 real changes made)
(11,106 real changes made)
(20,625 real changes made)
(16,648 missing values generated)
(11,106 real changes made)
(5,776 real changes made)
(8,729 real changes made, 8,729 to missing)
(16,688 missing values generated)
(27,754 missing values generated)
(5,670 real changes made)
(5,396 real changes made)
(5,670 real changes made)
(5,396 real changes made)
(7,059 real changes made)
(27,754 missing values generated)
(5,670 real changes made)
(5,396 real changes made)
(11,066 real changes made)
(20,695 real changes made)
(16,688 missing values generated)
(11,066 real changes made)
(5,670 real changes made)
(8,660 real changes made, 8,660 to missing)
(16,619 missing values generated)
(27,754 missing values generated)
(5,722 real changes made)
(5,413 real changes made)
(5,722 real changes made)
(5,413 real changes made)
(7,056 real changes made)
(27,754 missing values generated)
(5,722 real changes made)
(5,413 real changes made)
(11,135 real changes made)
(20,698 real changes made)
(16,619 missing values generated)
(11,135 real changes made)
(5,722 real changes made)
(8,621 real changes made, 8,621 to missing)
(16,580 missing values generated)
(27,754 missing values generated)
(5,786 real changes made)
(5,388 real changes made)
(5,786 real changes made)
(5,388 real changes made)
(7,043 real changes made)
(27,754 missing values generated)
(5,786 real changes made)
(5,388 real changes made)
(11,174 real changes made)
(20,711 real changes made)
(16,580 missing values generated)
(11,174 real changes made)
(5,786 real changes made)
(8,699 real changes made, 8,699 to missing)
(16,658 missing values generated)
(27,754 missing values generated)
(5,682 real changes made)
(5,414 real changes made)
(5,682 real changes made)
(5,414 real changes made)
(7,042 real changes made)
(27,754 missing values generated)
(5,682 real changes made)
(5,414 real changes made)
(11,096 real changes made)
(20,712 real changes made)
(16,658 missing values generated)
(11,096 real changes made)
(5,682 real changes made)
(8,674 real changes made, 8,674 to missing)
(16,633 missing values generated)
(27,754 missing values generated)
(5,634 real changes made)
(5,487 real changes made)
(5,634 real changes made)
(5,487 real changes made)
(7,056 real changes made)
(27,754 missing values generated)
(5,634 real changes made)
(5,487 real changes made)
(11,121 real changes made)
(20,698 real changes made)
(16,633 missing values generated)
(11,121 real changes made)
(5,634 real changes made)
(8,750 real changes made, 8,750 to missing)
(16,709 missing values generated)
(27,754 missing values generated)
(5,747 real changes made)
(5,298 real changes made)
(5,747 real changes made)
(5,298 real changes made)
(7,030 real changes made)
(27,754 missing values generated)
(5,747 real changes made)
(5,298 real changes made)
(11,045 real changes made)
(20,724 real changes made)
(16,709 missing values generated)
(11,045 real changes made)
(5,747 real changes made)
(8,674 real changes made, 8,674 to missing)
(16,633 missing values generated)
(27,754 missing values generated)
(5,733 real changes made)
(5,388 real changes made)
(5,733 real changes made)
(5,388 real changes made)
(7,075 real changes made)
(27,754 missing values generated)
(5,733 real changes made)
(5,388 real changes made)
(11,121 real changes made)
(20,679 real changes made)
(16,633 missing values generated)
(11,121 real changes made)
(5,733 real changes made)
(3,487 real changes made, 3,487 to missing)
(23,282 missing values generated)
(27,754 missing values generated)
(2,278 real changes made)
(2,194 real changes made)
(2,278 real changes made)
(2,194 real changes made)
(2,807 real changes made)
(27,754 missing values generated)
(2,278 real changes made)
(2,194 real changes made)
(4,472 real changes made)
(24,947 real changes made)
(23,282 missing values generated)
(4,472 real changes made)
(2,278 real changes made)
(3,501 real changes made, 3,501 to missing)
(23,296 missing values generated)
(27,754 missing values generated)
(2,284 real changes made)
(2,174 real changes made)
(2,284 real changes made)
(2,174 real changes made)
(2,817 real changes made)
(27,754 missing values generated)
(2,284 real changes made)
(2,174 real changes made)
(4,458 real changes made)
(24,937 real changes made)
(23,296 missing values generated)
(4,458 real changes made)
(2,284 real changes made)
(3,495 real changes made, 3,495 to missing)
(23,290 missing values generated)
(27,754 missing values generated)
(2,273 real changes made)
(2,191 real changes made)
(2,273 real changes made)
(2,191 real changes made)
(2,828 real changes made)
(27,754 missing values generated)
(2,273 real changes made)
(2,191 real changes made)
(4,464 real changes made)
(24,926 real changes made)
(23,290 missing values generated)
(4,464 real changes made)
(2,273 real changes made)
(3,453 real changes made, 3,453 to missing)
(23,248 missing values generated)
(27,754 missing values generated)
(2,335 real changes made)
(2,171 real changes made)
(2,335 real changes made)
(2,171 real changes made)
(2,871 real changes made)
(27,754 missing values generated)
(2,335 real changes made)
(2,171 real changes made)
(4,506 real changes made)
(24,883 real changes made)
(23,248 missing values generated)
(4,506 real changes made)
(2,335 real changes made)
(3,490 real changes made, 3,490 to missing)
(23,285 missing values generated)
(27,754 missing values generated)
(2,314 real changes made)
(2,155 real changes made)
(2,314 real changes made)
(2,155 real changes made)
(2,883 real changes made)
(27,754 missing values generated)
(2,314 real changes made)
(2,155 real changes made)
(4,469 real changes made)
(24,871 real changes made)
(23,285 missing values generated)
(4,469 real changes made)
(2,314 real changes made)
(3,481 real changes made, 3,481 to missing)
(23,276 missing values generated)
(27,754 missing values generated)
(2,326 real changes made)
(2,152 real changes made)
(2,326 real changes made)
(2,152 real changes made)
(2,857 real changes made)
(27,754 missing values generated)
(2,326 real changes made)
(2,152 real changes made)
(4,478 real changes made)
(24,897 real changes made)
(23,276 missing values generated)
(4,478 real changes made)
(2,326 real changes made)
(3,536 real changes made, 3,536 to missing)
(23,331 missing values generated)
(27,754 missing values generated)
(2,246 real changes made)
(2,177 real changes made)
(2,246 real changes made)
(2,177 real changes made)
(2,805 real changes made)
(27,754 missing values generated)
(2,246 real changes made)
(2,177 real changes made)
(4,423 real changes made)
(24,949 real changes made)
(23,331 missing values generated)
(4,423 real changes made)
(2,246 real changes made)
(3,487 real changes made, 3,487 to missing)
(23,282 missing values generated)
(27,754 missing values generated)
(2,298 real changes made)
(2,174 real changes made)
(2,298 real changes made)
(2,174 real changes made)
(2,818 real changes made)
(27,754 missing values generated)
(2,298 real changes made)
(2,174 real changes made)
(4,472 real changes made)
(24,936 real changes made)
(23,282 missing values generated)
(4,472 real changes made)
(2,298 real changes made)
(3,515 real changes made, 3,515 to missing)
(23,310 missing values generated)
(27,754 missing values generated)
(2,299 real changes made)
(2,145 real changes made)
(2,299 real changes made)
(2,145 real changes made)
(2,836 real changes made)
(27,754 missing values generated)
(2,299 real changes made)
(2,145 real changes made)
(4,444 real changes made)
(24,918 real changes made)
(23,310 missing values generated)
(4,444 real changes made)
(2,299 real changes made)
(3,495 real changes made, 3,495 to missing)
(23,290 missing values generated)
(27,754 missing values generated)
(2,290 real changes made)
(2,174 real changes made)
(2,290 real changes made)
(2,174 real changes made)
(2,832 real changes made)
(27,754 missing values generated)
(2,290 real changes made)
(2,174 real changes made)
(4,464 real changes made)
(24,922 real changes made)
(23,290 missing values generated)
(4,464 real changes made)
(2,290 real changes made)
(3,523 real changes made, 3,523 to missing)
(23,318 missing values generated)
(27,754 missing values generated)
(2,276 real changes made)
(2,160 real changes made)
(2,276 real changes made)
(2,160 real changes made)
(2,797 real changes made)
(27,754 missing values generated)
(2,276 real changes made)
(2,160 real changes made)
(4,436 real changes made)
(24,957 real changes made)
(23,318 missing values generated)
(4,436 real changes made)
(2,276 real changes made)
(3,506 real changes made, 3,506 to missing)
(23,301 missing values generated)
(27,754 missing values generated)
(2,278 real changes made)
(2,175 real changes made)
(2,278 real changes made)
(2,175 real changes made)
(2,822 real changes made)
(27,754 missing values generated)
(2,278 real changes made)
(2,175 real changes made)
(4,453 real changes made)
(24,932 real changes made)
(23,301 missing values generated)
(4,453 real changes made)
(2,278 real changes made)
(3,517 real changes made, 3,517 to missing)
(23,312 missing values generated)
(27,754 missing values generated)
(2,290 real changes made)
(2,152 real changes made)
(2,290 real changes made)
(2,152 real changes made)
(2,809 real changes made)
(27,754 missing values generated)
(2,290 real changes made)
(2,152 real changes made)
(4,442 real changes made)
(24,945 real changes made)
(23,312 missing values generated)
(4,442 real changes made)
(2,290 real changes made)
(3,547 real changes made, 3,547 to missing)
(23,342 missing values generated)
(27,754 missing values generated)
(2,270 real changes made)
(2,142 real changes made)
(2,270 real changes made)
(2,142 real changes made)
(2,776 real changes made)
(27,754 missing values generated)
(2,270 real changes made)
(2,142 real changes made)
(4,412 real changes made)
(24,978 real changes made)
(23,342 missing values generated)
(4,412 real changes made)
(2,270 real changes made)
(3,487 real changes made, 3,487 to missing)
(23,282 missing values generated)
(27,754 missing values generated)
(2,289 real changes made)
(2,183 real changes made)
(2,289 real changes made)
(2,183 real changes made)
(2,879 real changes made)
(27,754 missing values generated)
(2,289 real changes made)
(2,183 real changes made)
(4,472 real changes made)
(24,875 real changes made)
(23,282 missing values generated)
(4,472 real changes made)
(2,289 real changes made)
(3,553 real changes made, 3,553 to missing)
(23,348 missing values generated)
(27,754 missing values generated)
(2,273 real changes made)
(2,133 real changes made)
(2,273 real changes made)
(2,133 real changes made)
(2,835 real changes made)
(27,754 missing values generated)
(2,273 real changes made)
(2,133 real changes made)
(4,406 real changes made)
(24,919 real changes made)
(23,348 missing values generated)
(4,406 real changes made)
(2,273 real changes made)
(3,547 real changes made, 3,547 to missing)
(23,342 missing values generated)
(27,754 missing values generated)
(2,234 real changes made)
(2,178 real changes made)
(2,234 real changes made)
(2,178 real changes made)
(2,779 real changes made)
(27,754 missing values generated)
(2,234 real changes made)
(2,178 real changes made)
(4,412 real changes made)
(24,975 real changes made)
(23,342 missing values generated)
(4,412 real changes made)
(2,234 real changes made)
(3,506 real changes made, 3,506 to missing)
(23,301 missing values generated)
(27,754 missing values generated)
(2,286 real changes made)
(2,167 real changes made)
(2,286 real changes made)
(2,167 real changes made)
(2,832 real changes made)
(27,754 missing values generated)
(2,286 real changes made)
(2,167 real changes made)
(4,453 real changes made)
(24,922 real changes made)
(23,301 missing values generated)
(4,453 real changes made)
(2,286 real changes made)
(3,527 real changes made, 3,527 to missing)
(23,322 missing values generated)
(27,754 missing values generated)
(2,280 real changes made)
(2,152 real changes made)
(2,280 real changes made)
(2,152 real changes made)
(2,781 real changes made)
(27,754 missing values generated)
(2,280 real changes made)
(2,152 real changes made)
(4,432 real changes made)
(24,973 real changes made)
(23,322 missing values generated)
(4,432 real changes made)
(2,280 real changes made)
(3,497 real changes made, 3,497 to missing)
(23,292 missing values generated)
(27,754 missing values generated)
(2,307 real changes made)
(2,155 real changes made)
(2,307 real changes made)
(2,155 real changes made)
(2,851 real changes made)
(27,754 missing values generated)
(2,307 real changes made)
(2,155 real changes made)
(4,462 real changes made)
(24,903 real changes made)
(23,292 missing values generated)
(4,462 real changes made)
(2,307 real changes made)
(3,501 real changes made, 3,501 to missing)
(23,296 missing values generated)
(27,754 missing values generated)
(2,306 real changes made)
(2,152 real changes made)
(2,306 real changes made)
(2,152 real changes made)
(2,808 real changes made)
(27,754 missing values generated)
(2,306 real changes made)
(2,152 real changes made)
(4,458 real changes made)
(24,946 real changes made)
(23,296 missing values generated)
(4,458 real changes made)
(2,306 real changes made)
(3,475 real changes made, 3,475 to missing)
(23,270 missing values generated)
(27,754 missing values generated)
(2,295 real changes made)
(2,189 real changes made)
(2,295 real changes made)
(2,189 real changes made)
(2,827 real changes made)
(27,754 missing values generated)
(2,295 real changes made)
(2,189 real changes made)
(4,484 real changes made)
(24,927 real changes made)
(23,270 missing values generated)
(4,484 real changes made)
(2,295 real changes made)
(3,543 real changes made, 3,543 to missing)
(23,338 missing values generated)
(27,754 missing values generated)
(2,279 real changes made)
(2,137 real changes made)
(2,279 real changes made)
(2,137 real changes made)
(2,822 real changes made)
(27,754 missing values generated)
(2,279 real changes made)
(2,137 real changes made)
(4,416 real changes made)
(24,932 real changes made)
(23,338 missing values generated)
(4,416 real changes made)
(2,279 real changes made)
(3,499 real changes made, 3,499 to missing)
(23,294 missing values generated)
(27,754 missing values generated)
(2,268 real changes made)
(2,192 real changes made)
(2,268 real changes made)
(2,192 real changes made)
(2,804 real changes made)
(27,754 missing values generated)
(2,268 real changes made)
(2,192 real changes made)
(4,460 real changes made)
(24,950 real changes made)
(23,294 missing values generated)
(4,460 real changes made)
(2,268 real changes made)
(3,501 real changes made, 3,501 to missing)
(23,296 missing values generated)
(27,754 missing values generated)
(2,243 real changes made)
(2,215 real changes made)
(2,243 real changes made)
(2,215 real changes made)
(2,825 real changes made)
(27,754 missing values generated)
(2,243 real changes made)
(2,215 real changes made)
(4,458 real changes made)
(24,929 real changes made)
(23,296 missing values generated)
(4,458 real changes made)
(2,243 real changes made)
(3,584 real changes made, 3,584 to missing)
(23,379 missing values generated)
(27,754 missing values generated)
(2,221 real changes made)
(2,154 real changes made)
(2,221 real changes made)
(2,154 real changes made)
(2,742 real changes made)
(27,754 missing values generated)
(2,221 real changes made)
(2,154 real changes made)
(4,375 real changes made)
(25,012 real changes made)
(23,379 missing values generated)
(4,375 real changes made)
(2,221 real changes made)
(3,563 real changes made, 3,563 to missing)
(23,358 missing values generated)
(27,754 missing values generated)
(2,252 real changes made)
(2,144 real changes made)
(2,252 real changes made)
(2,144 real changes made)
(2,813 real changes made)
(27,754 missing values generated)
(2,252 real changes made)
(2,144 real changes made)
(4,396 real changes made)
(24,941 real changes made)
(23,358 missing values generated)
(4,396 real changes made)
(2,252 real changes made)
(3,467 real changes made, 3,467 to missing)
(23,262 missing values generated)
(27,754 missing values generated)
(2,319 real changes made)
(2,173 real changes made)
(2,319 real changes made)
(2,173 real changes made)
(2,797 real changes made)
(27,754 missing values generated)
(2,319 real changes made)
(2,173 real changes made)
(4,492 real changes made)
(24,957 real changes made)
(23,262 missing values generated)
(4,492 real changes made)
(2,319 real changes made)
(3,514 real changes made, 3,514 to missing)
(23,309 missing values generated)
(27,754 missing values generated)
(2,254 real changes made)
(2,191 real changes made)
(2,254 real changes made)
(2,191 real changes made)
(2,854 real changes made)
(27,754 missing values generated)
(2,254 real changes made)
(2,191 real changes made)
(4,445 real changes made)
(24,900 real changes made)
(23,309 missing values generated)
(4,445 real changes made)
(2,254 real changes made)
(3,536 real changes made, 3,536 to missing)
(23,331 missing values generated)
(27,754 missing values generated)
(2,225 real changes made)
(2,198 real changes made)
(2,225 real changes made)
(2,198 real changes made)
(2,857 real changes made)
(27,754 missing values generated)
(2,225 real changes made)
(2,198 real changes made)
(4,423 real changes made)
(24,897 real changes made)
(23,331 missing values generated)
(4,423 real changes made)
(2,225 real changes made)
(3,488 real changes made, 3,488 to missing)
(23,283 missing values generated)
(27,754 missing values generated)
(2,273 real changes made)
(2,198 real changes made)
(2,273 real changes made)
(2,198 real changes made)
(2,820 real changes made)
(27,754 missing values generated)
(2,273 real changes made)
(2,198 real changes made)
(4,471 real changes made)
(24,934 real changes made)
(23,283 missing values generated)
(4,471 real changes made)
(2,273 real changes made)
(3,506 real changes made, 3,506 to missing)
(23,301 missing values generated)
(27,754 missing values generated)
(2,271 real changes made)
(2,182 real changes made)
(2,271 real changes made)
(2,182 real changes made)
(2,806 real changes made)
(27,754 missing values generated)
(2,271 real changes made)
(2,182 real changes made)
(4,453 real changes made)
(24,948 real changes made)
(23,301 missing values generated)
(4,453 real changes made)
(2,271 real changes made)
(3,527 real changes made, 3,527 to missing)
(23,322 missing values generated)
(27,754 missing values generated)
(2,303 real changes made)
(2,129 real changes made)
(2,303 real changes made)
(2,129 real changes made)
(2,838 real changes made)
(27,754 missing values generated)
(2,303 real changes made)
(2,129 real changes made)
(4,432 real changes made)
(24,916 real changes made)
(23,322 missing values generated)
(4,432 real changes made)
(2,303 real changes made)

. 
. replace index_date = index_date_28
(27,754 real changes made)

. drop index_date_28

. gen egfr15_date=.
(27,754 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatinine_`x'<15 & date("01`x'", "DMY")>index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen index_date_esrd = index_date

. gen esrd_date = egfr15_date
(27,754 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if esrd_date==.
(2,773 real changes made)

. gen esrd = 0

. replace esrd = 1 if esrd_date!=.
(2,773 real changes made)

. label var esrd "Kidney failure"

. gen esrd_time = (esrd_date - index_date)
(24,981 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(24,981 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(2769 changes made to esrd_time_cat)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"                      ///
>                                                         3 "1 to 28 days"        ///
>                                                         4 "20 to 90 days"       ///
>                                                         5 "91 to 180 days"      ///
>                                                         6 "181 to 365 days"     ///
>                                                         7 "366 to 730 days"     ///
>                                                         8 "731 to 973 days"     ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 covid_severity  ///
>                                                                 covid_aki               {
  2.                                                                 by `exposure',sort: sum esrd_time, de
  3.                                                                 tab esrd_time_cat `exposure', m col chi
  4.                                                                 }

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            4              1
10%           42              1       Obs               1,981
25%          160              1       Sum of wgt.       1,981

50%          351                      Mean           372.4977
                        Largest       Std. dev.      253.5744
75%          568            964
90%          743            966       Variance       64299.98
95%          825            976       Skewness       .3480139
99%          930            982       Kurtosis       2.151754

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = SARS-CoV-2

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            6              1
10%           35              1       Obs                 792
25%          135              1       Sum of wgt.         792

50%        320.5                      Mean           352.3889
                        Largest       Std. dev.      250.6838
75%          546            939
90%          720            942       Variance       62842.34
95%          799            949       Skewness       .3944673
99%          919            952       Kurtosis       2.131208


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Historica  SARS-CoV- |     Total
----------------+----------------------+----------
   1 to 28 days |       163         73 |       236 
                |      0.82       0.92 |      0.85 
----------------+----------------------+----------
  20 to 90 days |       149         74 |       223 
                |      0.75       0.93 |      0.80 
----------------+----------------------+----------
 91 to 180 days |       244         97 |       341 
                |      1.23       1.22 |      1.23 
----------------+----------------------+----------
181 to 365 days |       480        195 |       675 
                |      2.42       2.45 |      2.43 
----------------+----------------------+----------
366 to 730 days |       734        275 |     1,009 
                |      3.71       3.46 |      3.64 
----------------+----------------------+----------
731 to 973 days |       209         78 |       287 
                |      1.06       0.98 |      1.03 
----------------+----------------------+----------
      >973 days |         2          0 |         2 
                |      0.01       0.00 |      0.01 
----------------+----------------------+----------
              . |    17,814      7,167 |    24,981 
                |     89.99      90.05 |     90.01 
----------------+----------------------+----------
          Total |    19,795      7,959 |    27,754 
                |    100.00     100.00 |    100.00 

          Pearson chi2(7) =   4.9447   Pr = 0.667

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            4              1
10%           42              1       Obs               1,981
25%          160              1       Sum of wgt.       1,981

50%          351                      Mean           372.4977
                        Largest       Std. dev.      253.5744
75%          568            964
90%          743            966       Variance       64299.98
95%          825            976       Skewness       .3480139
99%          930            982       Kurtosis       2.151754

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           10              1
10%           40              1       Obs                 622
25%          134              1       Sum of wgt.         622

50%          311                      Mean            346.627
                        Largest       Std. dev.      248.4502
75%          537            939
90%          720            942       Variance       61727.53
95%          797            949       Skewness       .4581186
99%          923            952       Kurtosis       2.233195

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           21              1
10%           30              3       Obs                  78
25%          177             21       Sum of wgt.          78

50%          440                      Mean              396.5
                        Largest       Std. dev.        249.79
75%          578            807
90%          709            815       Variance       62395.03
95%          807            856       Skewness      -.0802401
99%          900            900       Kurtosis       1.909835

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Critical care COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            8              1       Obs                  92
25%          125              1       Sum of wgt.          92

50%        289.5                      Mean           353.9457
                        Largest       Std. dev.      265.1651
75%        570.5            842
90%          742            844       Variance       70312.51
95%          818            882       Skewness       .3786304
99%          895            895       Kurtosis        1.92687


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |             SARS-CoV-2 severity
  esrd_time_cat | Historica  Non-hospi  Hospitali  Critical  |     Total
----------------+--------------------------------------------+----------
   1 to 28 days |       163         54          6         13 |       236 
                |      0.82       0.84       0.81       1.70 |      0.85 
----------------+--------------------------------------------+----------
  20 to 90 days |       149         63         10          1 |       223 
                |      0.75       0.98       1.35       0.13 |      0.80 
----------------+--------------------------------------------+----------
 91 to 180 days |       244         78          4         15 |       341 
                |      1.23       1.21       0.54       1.97 |      1.23 
----------------+--------------------------------------------+----------
181 to 365 days |       480        160         13         22 |       675 
                |      2.42       2.48       1.75       2.88 |      2.43 
----------------+--------------------------------------------+----------
366 to 730 days |       734        206         38         31 |     1,009 
                |      3.71       3.19       5.13       4.06 |      3.64 
----------------+--------------------------------------------+----------
731 to 973 days |       209         61          7         10 |       287 
                |      1.06       0.95       0.94       1.31 |      1.03 
----------------+--------------------------------------------+----------
      >973 days |         2          0          0          0 |         2 
                |      0.01       0.00       0.00       0.00 |      0.01 
----------------+--------------------------------------------+----------
              . |    17,814      5,833        663        671 |    24,981 
                |     89.99      90.36      89.47      87.94 |     90.01 
----------------+--------------------------------------------+----------
          Total |    19,795      6,455        741        763 |    27,754 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(21) =  36.3661   Pr = 0.020

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            4              1
10%           42              1       Obs               1,981
25%          160              1       Sum of wgt.       1,981

50%          351                      Mean           372.4977
                        Largest       Std. dev.      253.5744
75%          568            964
90%          743            966       Variance       64299.98
95%          825            976       Skewness       .3480139
99%          930            982       Kurtosis       2.151754

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%           39              1       Obs                 671
25%          139              1       Sum of wgt.         671

50%          323                      Mean           353.3964
                        Largest       Std. dev.      250.7179
75%          546            939
90%          733            942       Variance       62859.45
95%          801            949       Skewness       .4203854
99%          923            952       Kurtosis        2.18695

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           11              1
10%           28              1       Obs                  80
25%          147              3       Sum of wgt.          80

50%          389                      Mean           373.4375
                        Largest       Std. dev.      250.6583
75%        567.5            807
90%          697            815       Variance       62829.59
95%          776            856       Skewness       .0515091
99%          900            900       Kurtosis       1.889019

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID-AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           25             23
10%           29             25       Obs                  41
25%           95             26       Sum of wgt.          41

50%          214                      Mean           294.8293
                        Largest       Std. dev.      247.8387
75%          542            717
90%          705            734       Variance       61424.05
95%          734            764       Skewness       .6711752
99%          768            768       Kurtosis       1.991264


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |        COVID-19 acute kidney injury
  esrd_time_cat | Historica  Non-hospi  Hospitali  Hospitali |     Total
----------------+--------------------------------------------+----------
   1 to 28 days |       163         61          8          4 |       236 
                |      0.82       0.90       1.05       0.97 |      0.85 
----------------+--------------------------------------------+----------
  20 to 90 days |       149         60          9          5 |       223 
                |      0.75       0.88       1.18       1.22 |      0.80 
----------------+--------------------------------------------+----------
 91 to 180 days |       244         82          6          9 |       341 
                |      1.23       1.21       0.79       2.19 |      1.23 
----------------+--------------------------------------------+----------
181 to 365 days |       480        170         15         10 |       675 
                |      2.42       2.51       1.97       2.43 |      2.43 
----------------+--------------------------------------------+----------
366 to 730 days |       734        229         36         10 |     1,009 
                |      3.71       3.38       4.72       2.43 |      3.64 
----------------+--------------------------------------------+----------
731 to 973 days |       209         69          6          3 |       287 
                |      1.06       1.02       0.79       0.73 |      1.03 
----------------+--------------------------------------------+----------
      >973 days |         2          0          0          0 |         2 
                |      0.01       0.00       0.00       0.00 |      0.01 
----------------+--------------------------------------------+----------
              . |    17,814      6,114        683        370 |    24,981 
                |     89.99      90.11      89.52      90.02 |     90.01 
----------------+--------------------------------------------+----------
          Total |    19,795      6,785        763        411 |    27,754 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(21) =  16.7616   Pr = 0.725

. gen exit_date_esrd = esrd_date
(24,981 missing values generated)

. format exit_date_esrd %td

. gen end_date = date("2022-11-30", "YMD") if case==1
(19,795 missing values generated)

. replace end_date = date("2019-11-30", "YMD") if case==0
(19,795 real changes made)

. format end_date %td

. replace exit_date_esrd = min(deregistered_date, death_date, end_date) if esrd_date==.
(24,981 real changes made)

. gen esrd_denominator = 1

. gen follow_up_time_esrd = (exit_date_esrd - index_date_esrd)

. label var follow_up_time_esrd "Follow-up time (Days)"

. gen follow_up_cat_esrd = follow_up_time_esrd

. recode follow_up_cat_esrd       min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0=3                     ///
>                                                 1/365=4         ///
>                                                 366/730=5       ///
>                                                 731/1040=6      ///                                     
>                                                 1041/max=7
(27731 changes made to follow_up_cat_esrd)

. label define follow_up_cat_esrd         1 "<-29 days"   ///
>                                                         2 "-28 to -1 days"              ///
>                                                         3 "0 days"                              ///
>                                                         4 "1 to 365 days"               ///
>                                                         5 "366 to 730 days"     ///
>                                                         6 "731 to 1040 days"    ///
>                                                         7 ">1040 days"

. label values follow_up_cat_esrd follow_up_cat_esrd

. label var follow_up_cat_esrd "Follow_up time"

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,320      6,924      8,551 |    19,795 
           SARS-CoV-2 |     1,817      2,834      3,308 |     7,959 
----------------------+---------------------------------+----------
                Total |     6,137      9,758     11,859 |    27,754 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |          Follow_up time
  replacement therapy | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,320      6,924      8,551 |    19,795 
Non-hospitalised SARS |     1,490      2,280      2,693 |     6,463 
No KRT hospitalised C |       170        286        283 |       739 
KRT hospitalised COVI |       157        268        332 |       757 
----------------------+---------------------------------+----------
                Total |     6,137      9,758     11,859 |    27,754 

. drop if follow_up_time_esrd<1
(0 observations deleted)

. drop if follow_up_time_esrd>1040
(0 observations deleted)

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,320      6,924      8,551 |    19,795 
           SARS-CoV-2 |     1,817      2,834      3,308 |     7,959 
----------------------+---------------------------------+----------
                Total |     6,137      9,758     11,859 |    27,754 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |          Follow_up time
  replacement therapy | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,320      6,924      8,551 |    19,795 
Non-hospitalised SARS |     1,490      2,280      2,693 |     6,463 
No KRT hospitalised C |       170        286        283 |       739 
KRT hospitalised COVI |       157        268        332 |       757 
----------------------+---------------------------------+----------
                Total |     6,137      9,758     11,859 |    27,754 

. gen follow_up_years_esrd = follow_up_time_esrd/365.25

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(27,754 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_half_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>index_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(61 real changes made)
(82 real changes made)
(107 real changes made)
(149 real changes made)
(163 real changes made)
(177 real changes made)
(188 real changes made)
(186 real changes made)
(192 real changes made)
(194 real changes made)
(193 real changes made)
(209 real changes made)
(199 real changes made)
(208 real changes made)
(198 real changes made)
(189 real changes made)
(185 real changes made)
(187 real changes made)
(175 real changes made)
(151 real changes made)
(175 real changes made)
(163 real changes made)
(171 real changes made)
(159 real changes made)
(128 real changes made)
(134 real changes made)
(145 real changes made)
(108 real changes made)
(82 real changes made)
(112 real changes made)
(0 real changes made)
(0 real changes made)
(17 real changes made)
(35 real changes made)
(49 real changes made)
(57 real changes made)
(52 real changes made)
(58 real changes made)
(60 real changes made)
(64 real changes made)
(74 real changes made)
(79 real changes made)
(69 real changes made)
(98 real changes made)
(79 real changes made)
(86 real changes made)
(68 real changes made)
(80 real changes made)
(73 real changes made)
(79 real changes made)
(66 real changes made)
(69 real changes made)
(63 real changes made)
(48 real changes made)
(63 real changes made)
(46 real changes made)
(55 real changes made)
(59 real changes made)
(48 real changes made)
(53 real changes made)
(51 real changes made)
(45 real changes made)
(48 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(2,067 real changes made)

. gen egfr_half = 0

. replace egfr_half = 1 if egfr_half_date!=.
(8,728 real changes made)

. label var egfr_half "50% reduction in eGFR"

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(12,321 real changes made, 12,321 to missing)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(19,026 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date) if egfr_half_date==. & index_date_egfr_half!=.
(7,920 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(12,321 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days)"

. gen egfr_half_denominator = 0

. replace egfr_half_denominator = 1 if index_date_egfr_half!=.
(15,433 real changes made)

. gen follow_up_years_egfr_half = follow_up_time_egfr_half/365.25
(12,321 missing values generated)

. 
. * AKI (or ESRD)
. gen index_date_aki = index_date

. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(25,025 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(2,487 real changes made)

. gen aki = 0

. replace aki = 1 if aki_date!=.
(5,216 real changes made)

. label var aki "Acute kidney injury"

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(22,538 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date)  if aki_date==.
(22,538 real changes made)

. gen aki_denominator = 1

. gen follow_up_time_aki = (exit_date_aki - index_date_aki)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. gen follow_up_years_aki = follow_up_time_aki/365.25

. 
. * Exit date (death)
. gen index_date_death = index_date

. gen exit_date_death = death_date
(26,106 missing values generated)

. gen death = 0

. replace death = 1 if death_date!=.
(1,648 real changes made)

. label var death "Death"

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(26,106 real changes made)

. gen death_denominator = 1

. gen follow_up_time_death = (exit_date_death - index_date_death)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. gen follow_up_years_death = follow_up_time_death/365.25

. 
. stset exit_date_esrd, fail(esrd_date) origin(index_date_esrd) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: esrd_date!=0 & esrd_date<.
Observed time interval: (exit_date_esrd[_n-1], exit_date_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_esrd

--------------------------------------------------------------------------
     27,754  total observations
          0  exclusions
--------------------------------------------------------------------------
     27,754  observations remaining, representing
     27,754  subjects
      2,773  failures in single-failure-per-subject data
 46,832.709  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.748802

. tab _st follow_up_cat_esrd

      1 if |
 record is |
     to be |
   used; 0 |          Follow_up time
 otherwise | 1 to 365   366 to 73  731 to 10 |     Total
-----------+---------------------------------+----------
         1 |     6,137      9,758     11,859 |    27,754 
-----------+---------------------------------+----------
     Total |     6,137      9,758     11,859 |    27,754 

. 
. foreach outcome of varlist esrd egfr_half aki death {
  2.         stset exit_date_`outcome', fail(`outcome'_date) origin(index_date_`outcome') id(unique) scale(365.25)
  3.         bysort case: egen total_follow_up_`outcome' = total(_t)
  4.         forvalues i=0/1 {
  5.         di "Denominator case=`i' `outcome':"
  6.         count if case==`i' & `outcome'_denominator==1
  7.         local denominator = r(N)
  8.         di "Denominator(_st=1) case=`i' `outcome':"
  9.         count if case==`i' & `outcome'_denominator==1 & _st==1
 10.         local st_denominator = r(N)
 11.         di "Events case=`i' `outcome':"
 12.         count if case==`i' & `outcome'==1
 13.         local event = r(N)
 14.         di "Events (_st=1) case=`i' `outcome':"
 15.         count if case==`i' & `outcome'==1 & _st==1
 16.         local st_event = r(N)
 17.         di "Total follow_up case=`i' `outcome':"
 18.         su total_follow_up_`outcome' if case==`i'
 19.         local person_year = r(mean)
 20.         local rate = 100000*(`event'/`person_year')
 21.         di "Rate case=`i' `outcome':"
 22.         di `rate'
 23.         local st_rate = 100000*(`st_event'/`person_year')
 24.         di "Rate (_st=1) case=`i' `outcome':"
 25.         di `st_rate'
 26.         }
 27.         drop total_follow_up_`outcome'
 28. }

Survival-time data settings

           ID variable: unique
         Failure event: esrd_date!=0 & esrd_date<.
Observed time interval: (exit_date_esrd[_n-1], exit_date_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_esrd

--------------------------------------------------------------------------
     27,754  total observations
          0  exclusions
--------------------------------------------------------------------------
     27,754  observations remaining, representing
     27,754  subjects
      2,773  failures in single-failure-per-subject data
 46,832.709  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.748802
Denominator case=0 esrd:
  19,795
Denominator(_st=1) case=0 esrd:
  19,795
Events case=0 esrd:
  1,981
Events (_st=1) case=0 esrd:
  1,981
Total follow_up case=0 esrd:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~d |     19,795       33566           0      33566      33566
Rate case=0 esrd:
5901.8054
Rate (_st=1) case=0 esrd:
5901.8054
Denominator case=1 esrd:
  7,959
Denominator(_st=1) case=1 esrd:
  7,959
Events case=1 esrd:
  792
Events (_st=1) case=1 esrd:
  792
Total follow_up case=1 esrd:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~d |      7,959    13266.71           0   13266.71   13266.71
Rate case=1 esrd:
5969.8306
Rate (_st=1) case=1 esrd:
5969.8306

Survival-time data settings

           ID variable: unique
         Failure event: egfr_half_date!=0 & egfr_half_date<.
Observed time interval: (exit_date_egfr_half[_n-1], exit_date_egfr_half]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_egfr_half

--------------------------------------------------------------------------
     27,754  total observations
     11,106  event time missing (exit_date_egfr_half>=.)    PROBABLE ERROR
      1,215  ignored because never entered
--------------------------------------------------------------------------
     15,433  observations remaining, representing
     15,433  subjects
      7,513  failures in single-failure-per-subject data
 18,072.613  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.748802
Denominator case=0 egfr_half:
  11,039
Denominator(_st=1) case=0 egfr_half:
  11,039
Events case=0 egfr_half:
  6,246
Events (_st=1) case=0 egfr_half:
  5,381
Total follow_up case=0 egfr_half:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~f |     19,795    13034.72           0   13034.72   13034.72
Rate case=0 egfr_half:
47918.169
Rate (_st=1) case=0 egfr_half:
41282.048
Denominator case=1 egfr_half:
  4,394
Denominator(_st=1) case=1 egfr_half:
  4,394
Events case=1 egfr_half:
  2,482
Events (_st=1) case=1 egfr_half:
  2,132
Total follow_up case=1 egfr_half:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~f |      7,959    5037.892           0   5037.892   5037.892
Rate case=1 egfr_half:
49266.637
Rate (_st=1) case=1 egfr_half:
42319.287

Survival-time data settings

           ID variable: unique
         Failure event: aki_date!=0 & aki_date<.
Observed time interval: (exit_date_aki[_n-1], exit_date_aki]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_aki

--------------------------------------------------------------------------
     27,754  total observations
        904  observations end on or before enter()
--------------------------------------------------------------------------
     26,850  observations remaining, representing
     26,850  subjects
      4,312  failures in single-failure-per-subject data
 44,001.081  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.748802
Denominator case=0 aki:
  19,795
Denominator(_st=1) case=0 aki:
  19,150
Events case=0 aki:
  3,731
Events (_st=1) case=0 aki:
  3,086
Total follow_up case=0 aki:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~i |     19,795     31539.8           0    31539.8    31539.8
Rate case=0 aki:
11829.497
Rate (_st=1) case=0 aki:
9784.462
Denominator case=1 aki:
  7,959
Denominator(_st=1) case=1 aki:
  7,700
Events case=1 aki:
  1,485
Events (_st=1) case=1 aki:
  1,226
Total follow_up case=1 aki:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~i |      7,959    12461.28           0   12461.28   12461.28
Rate case=1 aki:
11916.915
Rate (_st=1) case=1 aki:
9838.477

Survival-time data settings

           ID variable: unique
         Failure event: death_date!=0 & death_date<.
Observed time interval: (exit_date_death[_n-1], exit_date_death]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_death

--------------------------------------------------------------------------
     27,754  total observations
          0  exclusions
--------------------------------------------------------------------------
     27,754  observations remaining, representing
     27,754  subjects
      1,648  failures in single-failure-per-subject data
 49,582.489  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.748802
Denominator case=0 death:
  19,795
Denominator(_st=1) case=0 death:
  19,795
Events case=0 death:
  1,341
Events (_st=1) case=0 death:
  1,341
Total follow_up case=0 death:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~h |     19,795    35477.31           0   35477.31   35477.31
Rate case=0 death:
3779.8805
Rate (_st=1) case=0 death:
3779.8805
Denominator case=1 death:
  7,959
Denominator(_st=1) case=1 death:
  7,959
Events case=1 death:
  307
Events (_st=1) case=1 death:
  307
Total follow_up case=1 death:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~h |      7,959    14105.17           0   14105.17   14105.17
Rate case=1 death:
2176.5062
Rate (_st=1) case=1 death:
2176.5062

. 
. save ./output/analysis_2017.dta, replace
file ./output/analysis_2017.dta saved

. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_2017.log
  log type:  text
 closed on:  26 Jan 2023, 21:20:25
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
