-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_hospitalised.log
  log type:  text
 opened on:  25 Jul 2023, 17:04:54

. 
. capture noisily import delimited ./output/input_covid_hospitalised.csv, clear
(encoding automatically selected: ISO-8859-9)
(123 vars, 50,000 obs)

. tempfile covid_hospitalised

. save `covid_hospitalised', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_7234_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_7234_000001.tmp saved as .dta format

. di "COVID-19 hospitalised:"
COVID-19 hospitalised:

. safecount
  50,000

. 
. capture noisily import delimited ./output/input_pneumonia_hospitalised.csv, clear
(encoding automatically selected: ISO-8859-9)
(119 vars, 50,000 obs)

. tempfile pneumonia_hospitalised

. save `pneumonia_hospitalised', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_7234_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_7234_000002.tmp saved as .dta format

. di "Pneumonia hospitalised:"
Pneumonia hospitalised:

. safecount
  50,000

. 
. append using `covid_hospitalised', force

. 
. **ID
. * Need to create unique identifiers as individuals may be in both covid_hospitalised and pneumonia_hospitalised so will have the same patient_id
. gen unique = _n

. label var unique "Unique ID"

. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      5,087        5.09        5.09
 1 Most deprived |     19,061       19.06       24.15
               2 |     19,035       19.04       43.18
               3 |     18,889       18.89       62.07
               4 |     18,931       18.93       81.00
5 Least deprived |     18,997       19.00      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. drop if imd==0
(5,087 observations deleted)

. safetab imd

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |     19,061       20.08       20.08
               2 |     19,035       20.06       40.14
               3 |     18,889       19.90       60.04
               4 |     18,931       19.95       79.98
5 Least deprived |     18,997       20.02      100.00
-----------------+-----------------------------------
           Total |     94,913      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(94,912 missing values generated)

. replace stp1 = sum(stp1)
(94,912 real changes made)

. drop stp

. rename stp1 stp

. label define stp        1 "1"   ///
>                                         2 "2"   ///
>                                         3 "3"   ///
>                                         4 "4"   ///
>                                         5 "5"   ///
>                                         6 "6"   ///
>                                         7 "7"   ///
>                                         8 "8"   ///
>                                         9 "9"   ///
>                                         10 "10" ///
>                                         11 "11" ///                                     
>                                         12 "12" ///
>                                         13 "13" ///
>                                         14 "14" ///
>                                         15 "15" ///
>                                         16 "16" ///
>                                         17 "17" ///
>                                         18 "18" ///
>                                         19 "19" ///
>                                         20 "20" ///
>                                         21 "21" ///                                     
>                                         22 "22" ///
>                                         23 "23" ///
>                                         24 "24" ///
>                                         25 "25" ///
>                                         26 "26" ///
>                                         27 "27" ///
>                                         28 "28" ///
>                                         29 "29" ///
>                                         30 "30" ///
>                                         31 "31" 

. label values stp stp

. label var stp "STP"

. safetab stp

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     94,913      100.00      100.00
------------+-----------------------------------
      Total |     94,913      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(85,512 missing values generated)

. replace region = 2 if region_string=="East"
(9,778 real changes made)

. replace region = 3 if region_string=="London"
(18,841 real changes made)

. replace region = 4 if region_string=="North East"
(9,531 real changes made)

. replace region = 5 if region_string=="North West"
(9,422 real changes made)

. replace region = 6 if region_string=="South East"
(9,489 real changes made)

. replace region = 7 if region_string=="South West"
(9,465 real changes made)

. replace region = 8 if region_string=="West Midlands"
(9,450 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(9,536 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,401        9.90        9.90
                    East |      9,778       10.30       20.21
                  London |     18,841       19.85       40.06
              North East |      9,531       10.04       50.10
              North West |      9,422        9.93       60.03
              South East |      9,489       10.00       70.02
              South West |      9,465        9.97       80.00
           West Midlands |      9,450        9.96       89.95
Yorkshire and The Humber |      9,536       10.05      100.00
-------------------------+-----------------------------------
                   Total |     94,913      100.00

. drop if region==10
(0 observations deleted)

. safetab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,401        9.90        9.90
                    East |      9,778       10.30       20.21
                  London |     18,841       19.85       40.06
              North East |      9,531       10.04       50.10
              North West |      9,422        9.93       60.03
              South East |      9,489       10.00       70.02
              South West |      9,465        9.97       80.00
           West Midlands |      9,450        9.96       89.95
Yorkshire and The Humber |      9,536       10.05      100.00
-------------------------+-----------------------------------
                   Total |     94,913      100.00

. 
. * Create new index date variable 28 days after case_index_date (i.e. to exclude anyone who does not survive to start follow-up)
. gen index_date = date(patient_index_date, "YMD")
(7,733 missing values generated)

. format index_date %td

. gen index_date_28 = index_date + 28
(7,733 missing values generated)

. format index_date_28 %td

. 
. * Deregistered before index_date + 29 days
. gen deregistered_date = date(date_deregistered, "YMD")
(28,901 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date_28 + 1
(63,830 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(26,612 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(2,237 observations deleted)

. replace krt_date = index_date_28 + 1 if krt_date < index_date_28 + 1
(118 real changes made)

. 
. * Death before index_date + 29 days (i.e. only include people who survived beyond 28 days after admission)
. drop if deceased==1
(279 observations deleted)

. drop deceased

. gen death_date1 = date(death_date, "YMD")
(25,731 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28 + 1
(1,668 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased within 28 days of index date"

. label values deceased deceased

. tab covid deceased

           |       deceased
     covid | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,270      1,018 |    14,288 
-----------+----------------------+----------
     Total |    13,270      1,018 |    14,288 

. tab pneumonia deceased

           |       deceased
 pneumonia | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,629        650 |    14,279 
-----------+----------------------+----------
     Total |    13,629        650 |    14,279 

. drop if deceased==1
(1,668 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators only
. gen sex1 = 1 if sex=="M"
(13,769 missing values generated)

. replace sex1 = 0 if sex=="F"
(13,769 real changes made)

. drop sex

. rename sex1 sex

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 ///
>                                                                                                 baseline_creatinine_mar2017 ///
>                                                                                                 baseline_creatinine_apr2017 ///
>                                                                                                 baseline_creatinine_may2017 ///
>                                                                                                 baseline_creatinine_jun2017 ///
>                                                                                                 baseline_creatinine_jul2017 ///
>                                                                                                 baseline_creatinine_aug2017 ///
>                                                                                                 baseline_creatinine_sep2017 ///
>                                                                                                 baseline_creatinine_oct2017 ///
>                                                                                                 baseline_creatinine_nov2017 ///
>                                                                                                 baseline_creatinine_dec2017 ///
>                                                                                                 baseline_creatinine_jan2018 ///
>                                                                                                 baseline_creatinine_feb2018 ///
>                                                                                                 baseline_creatinine_mar2018 ///
>                                                                                                 baseline_creatinine_apr2018 ///
>                                                                                                 baseline_creatinine_may2018 ///
>                                                                                                 baseline_creatinine_jun2018 ///
>                                                                                                 baseline_creatinine_jul2018 ///
>                                                                                                 baseline_creatinine_aug2018 ///
>                                                                                                 baseline_creatinine_sep2018 ///
>                                                                                                 baseline_creatinine_oct2018 ///
>                                                                                                 baseline_creatinine_nov2018 ///
>                                                                                                 baseline_creatinine_dec2018 ///
>                                                                                                 baseline_creatinine_jan2019 ///
>                                                                                                 baseline_creatinine_feb2019 ///
>                                                                                                 baseline_creatinine_mar2019 ///
>                                                                                                 baseline_creatinine_apr2019 ///
>                                                                                                 baseline_creatinine_may2019 ///
>                                                                                                 baseline_creatinine_jun2019 ///
>                                                                                                 baseline_creatinine_jul2019 ///
>                                                                                                 baseline_creatinine_aug2019 ///
>                                                                                                 baseline_creatinine_sep2019 ///
>                                                                                                 baseline_creatinine_feb2020 ///
>                                                                                                 baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 ///
>                                                                                                 baseline_creatinine_feb2022 ///
>                                                                                                 baseline_creatinine_mar2022 ///
>                                                                                                 baseline_creatinine_apr2022 ///
>                                                                                                 baseline_creatinine_may2022 ///
>                                                                                                 baseline_creatinine_jun2022 ///
>                                                                                                 baseline_creatinine_jul2022 ///
>                                                                                                 baseline_creatinine_aug2022 ///
>                                                                                                 baseline_creatinine_sep2022 ///
>                                                                                                 baseline_creatinine_oct2022 ///
>                                                                                                 baseline_creatinine_nov2022 ///
>                                                                                                 baseline_creatinine_dec2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(6,041 real changes made, 6,041 to missing)
(19,311 missing values generated)
(26,899 missing values generated)
(3,856 real changes made)
(3,732 real changes made)
(3,856 real changes made)
(3,732 real changes made)
(4,817 real changes made)
(26,899 missing values generated)
(3,856 real changes made)
(3,732 real changes made)
(7,588 real changes made)
(22,082 real changes made)
(19,311 missing values generated)
(7,498 real changes made)
(3,856 real changes made)
(5,929 real changes made, 5,929 to missing)
(19,199 missing values generated)
(26,899 missing values generated)
(3,940 real changes made)
(3,760 real changes made)
(3,940 real changes made)
(3,760 real changes made)
(4,852 real changes made)
(26,899 missing values generated)
(3,940 real changes made)
(3,760 real changes made)
(7,700 real changes made)
(22,047 real changes made)
(19,199 missing values generated)
(7,620 real changes made)
(3,940 real changes made)
(6,020 real changes made, 6,020 to missing)
(19,290 missing values generated)
(26,899 missing values generated)
(3,887 real changes made)
(3,722 real changes made)
(3,887 real changes made)
(3,722 real changes made)
(4,840 real changes made)
(26,899 missing values generated)
(3,887 real changes made)
(3,722 real changes made)
(7,609 real changes made)
(22,059 real changes made)
(19,290 missing values generated)
(7,518 real changes made)
(3,887 real changes made)
(6,040 real changes made, 6,040 to missing)
(19,310 missing values generated)
(26,899 missing values generated)
(3,869 real changes made)
(3,720 real changes made)
(3,869 real changes made)
(3,720 real changes made)
(4,827 real changes made)
(26,899 missing values generated)
(3,869 real changes made)
(3,720 real changes made)
(7,589 real changes made)
(22,072 real changes made)
(19,310 missing values generated)
(7,502 real changes made)
(3,869 real changes made)
(5,966 real changes made, 5,966 to missing)
(19,236 missing values generated)
(26,899 missing values generated)
(3,956 real changes made)
(3,707 real changes made)
(3,956 real changes made)
(3,707 real changes made)
(4,894 real changes made)
(26,899 missing values generated)
(3,956 real changes made)
(3,707 real changes made)
(7,663 real changes made)
(22,005 real changes made)
(19,236 missing values generated)
(7,581 real changes made)
(3,956 real changes made)
(5,997 real changes made, 5,997 to missing)
(19,267 missing values generated)
(26,899 missing values generated)
(3,878 real changes made)
(3,754 real changes made)
(3,878 real changes made)
(3,754 real changes made)
(4,792 real changes made)
(26,899 missing values generated)
(3,878 real changes made)
(3,754 real changes made)
(7,632 real changes made)
(22,107 real changes made)
(19,267 missing values generated)
(7,558 real changes made)
(3,878 real changes made)
(6,101 real changes made, 6,101 to missing)
(19,371 missing values generated)
(26,899 missing values generated)
(3,861 real changes made)
(3,667 real changes made)
(3,861 real changes made)
(3,667 real changes made)
(4,762 real changes made)
(26,899 missing values generated)
(3,861 real changes made)
(3,667 real changes made)
(7,528 real changes made)
(22,137 real changes made)
(19,371 missing values generated)
(7,434 real changes made)
(3,861 real changes made)
(5,989 real changes made, 5,989 to missing)
(19,259 missing values generated)
(26,899 missing values generated)
(3,924 real changes made)
(3,716 real changes made)
(3,924 real changes made)
(3,716 real changes made)
(4,840 real changes made)
(26,899 missing values generated)
(3,924 real changes made)
(3,716 real changes made)
(7,640 real changes made)
(22,059 real changes made)
(19,259 missing values generated)
(7,550 real changes made)
(3,924 real changes made)
(5,973 real changes made, 5,973 to missing)
(19,243 missing values generated)
(26,899 missing values generated)
(3,937 real changes made)
(3,719 real changes made)
(3,937 real changes made)
(3,719 real changes made)
(4,857 real changes made)
(26,899 missing values generated)
(3,937 real changes made)
(3,719 real changes made)
(7,656 real changes made)
(22,042 real changes made)
(19,243 missing values generated)
(7,563 real changes made)
(3,937 real changes made)
(6,016 real changes made, 6,016 to missing)
(19,286 missing values generated)
(26,899 missing values generated)
(3,846 real changes made)
(3,767 real changes made)
(3,846 real changes made)
(3,767 real changes made)
(4,825 real changes made)
(26,899 missing values generated)
(3,846 real changes made)
(3,767 real changes made)
(7,613 real changes made)
(22,074 real changes made)
(19,286 missing values generated)
(7,527 real changes made)
(3,846 real changes made)
(5,958 real changes made, 5,958 to missing)
(19,228 missing values generated)
(26,899 missing values generated)
(3,950 real changes made)
(3,721 real changes made)
(3,950 real changes made)
(3,721 real changes made)
(4,864 real changes made)
(26,899 missing values generated)
(3,950 real changes made)
(3,721 real changes made)
(7,671 real changes made)
(22,035 real changes made)
(19,228 missing values generated)
(7,579 real changes made)
(3,950 real changes made)
(5,981 real changes made, 5,981 to missing)
(19,251 missing values generated)
(26,899 missing values generated)
(3,892 real changes made)
(3,756 real changes made)
(3,892 real changes made)
(3,756 real changes made)
(4,944 real changes made)
(26,899 missing values generated)
(3,892 real changes made)
(3,756 real changes made)
(7,648 real changes made)
(21,955 real changes made)
(19,251 missing values generated)
(7,557 real changes made)
(3,892 real changes made)
(6,023 real changes made, 6,023 to missing)
(19,293 missing values generated)
(26,899 missing values generated)
(3,873 real changes made)
(3,733 real changes made)
(3,873 real changes made)
(3,733 real changes made)
(4,841 real changes made)
(26,899 missing values generated)
(3,873 real changes made)
(3,733 real changes made)
(7,606 real changes made)
(22,058 real changes made)
(19,293 missing values generated)
(7,519 real changes made)
(3,873 real changes made)
(6,041 real changes made, 6,041 to missing)
(19,311 missing values generated)
(26,899 missing values generated)
(3,915 real changes made)
(3,673 real changes made)
(3,915 real changes made)
(3,673 real changes made)
(4,825 real changes made)
(26,899 missing values generated)
(3,915 real changes made)
(3,673 real changes made)
(7,588 real changes made)
(22,074 real changes made)
(19,311 missing values generated)
(7,497 real changes made)
(3,915 real changes made)
(5,980 real changes made, 5,980 to missing)
(19,250 missing values generated)
(26,899 missing values generated)
(3,913 real changes made)
(3,736 real changes made)
(3,913 real changes made)
(3,736 real changes made)
(4,848 real changes made)
(26,899 missing values generated)
(3,913 real changes made)
(3,736 real changes made)
(7,649 real changes made)
(22,051 real changes made)
(19,250 missing values generated)
(7,559 real changes made)
(3,913 real changes made)
(6,041 real changes made, 6,041 to missing)
(19,311 missing values generated)
(26,899 missing values generated)
(3,868 real changes made)
(3,720 real changes made)
(3,868 real changes made)
(3,720 real changes made)
(4,832 real changes made)
(26,899 missing values generated)
(3,868 real changes made)
(3,720 real changes made)
(7,588 real changes made)
(22,067 real changes made)
(19,311 missing values generated)
(7,497 real changes made)
(3,868 real changes made)
(6,003 real changes made, 6,003 to missing)
(19,273 missing values generated)
(26,899 missing values generated)
(3,910 real changes made)
(3,716 real changes made)
(3,910 real changes made)
(3,716 real changes made)
(4,813 real changes made)
(26,899 missing values generated)
(3,910 real changes made)
(3,716 real changes made)
(7,626 real changes made)
(22,086 real changes made)
(19,273 missing values generated)
(7,533 real changes made)
(3,910 real changes made)
(5,958 real changes made, 5,958 to missing)
(19,228 missing values generated)
(26,899 missing values generated)
(3,895 real changes made)
(3,776 real changes made)
(3,895 real changes made)
(3,776 real changes made)
(4,838 real changes made)
(26,899 missing values generated)
(3,895 real changes made)
(3,776 real changes made)
(7,671 real changes made)
(22,061 real changes made)
(19,228 missing values generated)
(7,577 real changes made)
(3,895 real changes made)
(5,997 real changes made, 5,997 to missing)
(19,267 missing values generated)
(26,899 missing values generated)
(3,905 real changes made)
(3,727 real changes made)
(3,905 real changes made)
(3,727 real changes made)
(4,863 real changes made)
(26,899 missing values generated)
(3,905 real changes made)
(3,727 real changes made)
(7,632 real changes made)
(22,036 real changes made)
(19,267 missing values generated)
(7,551 real changes made)
(3,905 real changes made)
(5,995 real changes made, 5,995 to missing)
(19,265 missing values generated)
(26,899 missing values generated)
(3,925 real changes made)
(3,709 real changes made)
(3,925 real changes made)
(3,709 real changes made)
(4,839 real changes made)
(26,899 missing values generated)
(3,925 real changes made)
(3,709 real changes made)
(7,634 real changes made)
(22,060 real changes made)
(19,265 missing values generated)
(7,544 real changes made)
(3,925 real changes made)
(5,949 real changes made, 5,949 to missing)
(19,219 missing values generated)
(26,899 missing values generated)
(3,951 real changes made)
(3,729 real changes made)
(3,951 real changes made)
(3,729 real changes made)
(4,899 real changes made)
(26,899 missing values generated)
(3,951 real changes made)
(3,729 real changes made)
(7,680 real changes made)
(22,000 real changes made)
(19,219 missing values generated)
(7,588 real changes made)
(3,951 real changes made)
(5,963 real changes made, 5,963 to missing)
(19,233 missing values generated)
(26,899 missing values generated)
(3,923 real changes made)
(3,743 real changes made)
(3,923 real changes made)
(3,743 real changes made)
(4,933 real changes made)
(26,899 missing values generated)
(3,923 real changes made)
(3,743 real changes made)
(7,666 real changes made)
(21,966 real changes made)
(19,233 missing values generated)
(7,569 real changes made)
(3,923 real changes made)
(6,024 real changes made, 6,024 to missing)
(19,294 missing values generated)
(26,899 missing values generated)
(3,849 real changes made)
(3,756 real changes made)
(3,849 real changes made)
(3,756 real changes made)
(4,782 real changes made)
(26,899 missing values generated)
(3,849 real changes made)
(3,756 real changes made)
(7,605 real changes made)
(22,117 real changes made)
(19,294 missing values generated)
(7,523 real changes made)
(3,849 real changes made)
(5,986 real changes made, 5,986 to missing)
(19,256 missing values generated)
(26,899 missing values generated)
(3,857 real changes made)
(3,786 real changes made)
(3,857 real changes made)
(3,786 real changes made)
(4,740 real changes made)
(26,899 missing values generated)
(3,857 real changes made)
(3,786 real changes made)
(7,643 real changes made)
(22,159 real changes made)
(19,256 missing values generated)
(7,556 real changes made)
(3,857 real changes made)
(6,030 real changes made, 6,030 to missing)
(19,300 missing values generated)
(26,899 missing values generated)
(3,892 real changes made)
(3,707 real changes made)
(3,892 real changes made)
(3,707 real changes made)
(4,841 real changes made)
(26,899 missing values generated)
(3,892 real changes made)
(3,707 real changes made)
(7,599 real changes made)
(22,058 real changes made)
(19,300 missing values generated)
(7,510 real changes made)
(3,892 real changes made)
(6,031 real changes made, 6,031 to missing)
(19,301 missing values generated)
(26,899 missing values generated)
(3,902 real changes made)
(3,696 real changes made)
(3,902 real changes made)
(3,696 real changes made)
(4,769 real changes made)
(26,899 missing values generated)
(3,902 real changes made)
(3,696 real changes made)
(7,598 real changes made)
(22,130 real changes made)
(19,301 missing values generated)
(7,506 real changes made)
(3,902 real changes made)
(6,069 real changes made, 6,069 to missing)
(19,339 missing values generated)
(26,899 missing values generated)
(3,855 real changes made)
(3,705 real changes made)
(3,855 real changes made)
(3,705 real changes made)
(4,786 real changes made)
(26,899 missing values generated)
(3,855 real changes made)
(3,705 real changes made)
(7,560 real changes made)
(22,113 real changes made)
(19,339 missing values generated)
(7,469 real changes made)
(3,855 real changes made)
(6,005 real changes made, 6,005 to missing)
(19,275 missing values generated)
(26,899 missing values generated)
(3,857 real changes made)
(3,767 real changes made)
(3,857 real changes made)
(3,767 real changes made)
(4,825 real changes made)
(26,899 missing values generated)
(3,857 real changes made)
(3,767 real changes made)
(7,624 real changes made)
(22,074 real changes made)
(19,275 missing values generated)
(7,535 real changes made)
(3,857 real changes made)
(6,040 real changes made, 6,040 to missing)
(19,310 missing values generated)
(26,899 missing values generated)
(3,837 real changes made)
(3,752 real changes made)
(3,837 real changes made)
(3,752 real changes made)
(4,781 real changes made)
(26,899 missing values generated)
(3,837 real changes made)
(3,752 real changes made)
(7,589 real changes made)
(22,118 real changes made)
(19,310 missing values generated)
(7,497 real changes made)
(3,837 real changes made)
(5,929 real changes made, 5,929 to missing)
(19,199 missing values generated)
(26,899 missing values generated)
(3,960 real changes made)
(3,740 real changes made)
(3,960 real changes made)
(3,740 real changes made)
(4,947 real changes made)
(26,899 missing values generated)
(3,960 real changes made)
(3,740 real changes made)
(7,700 real changes made)
(21,952 real changes made)
(19,199 missing values generated)
(7,608 real changes made)
(3,960 real changes made)
(6,034 real changes made, 6,034 to missing)
(19,304 missing values generated)
(26,899 missing values generated)
(3,855 real changes made)
(3,740 real changes made)
(3,855 real changes made)
(3,740 real changes made)
(4,822 real changes made)
(26,899 missing values generated)
(3,855 real changes made)
(3,740 real changes made)
(7,595 real changes made)
(22,077 real changes made)
(19,304 missing values generated)
(7,496 real changes made)
(3,855 real changes made)
(6,038 real changes made, 6,038 to missing)
(19,308 missing values generated)
(26,899 missing values generated)
(3,861 real changes made)
(3,730 real changes made)
(3,861 real changes made)
(3,730 real changes made)
(4,863 real changes made)
(26,899 missing values generated)
(3,861 real changes made)
(3,730 real changes made)
(7,591 real changes made)
(22,036 real changes made)
(19,308 missing values generated)
(7,512 real changes made)
(3,861 real changes made)
(5,836 real changes made, 5,836 to missing)
(19,465 missing values generated)
(26,899 missing values generated)
(3,785 real changes made)
(3,649 real changes made)
(3,785 real changes made)
(3,649 real changes made)
(4,734 real changes made)
(26,899 missing values generated)
(3,785 real changes made)
(3,649 real changes made)
(7,434 real changes made)
(22,165 real changes made)
(19,465 missing values generated)
(7,338 real changes made)
(3,785 real changes made)
(5,769 real changes made, 5,769 to missing)
(19,398 missing values generated)
(26,899 missing values generated)
(3,898 real changes made)
(3,603 real changes made)
(3,898 real changes made)
(3,603 real changes made)
(4,826 real changes made)
(26,899 missing values generated)
(3,898 real changes made)
(3,603 real changes made)
(7,501 real changes made)
(22,073 real changes made)
(19,398 missing values generated)
(7,415 real changes made)
(3,898 real changes made)
(5,808 real changes made, 5,808 to missing)
(19,437 missing values generated)
(26,899 missing values generated)
(3,782 real changes made)
(3,680 real changes made)
(3,782 real changes made)
(3,680 real changes made)
(4,709 real changes made)
(26,899 missing values generated)
(3,782 real changes made)
(3,680 real changes made)
(7,462 real changes made)
(22,190 real changes made)
(19,437 missing values generated)
(7,376 real changes made)
(3,782 real changes made)
(5,900 real changes made, 5,900 to missing)
(19,529 missing values generated)
(26,899 missing values generated)
(3,837 real changes made)
(3,533 real changes made)
(3,837 real changes made)
(3,533 real changes made)
(4,650 real changes made)
(26,899 missing values generated)
(3,837 real changes made)
(3,533 real changes made)
(7,370 real changes made)
(22,249 real changes made)
(19,529 missing values generated)
(7,287 real changes made)
(3,837 real changes made)
(5,847 real changes made, 5,847 to missing)
(19,476 missing values generated)
(26,899 missing values generated)
(3,861 real changes made)
(3,562 real changes made)
(3,861 real changes made)
(3,562 real changes made)
(4,742 real changes made)
(26,899 missing values generated)
(3,861 real changes made)
(3,562 real changes made)
(7,423 real changes made)
(22,157 real changes made)
(19,476 missing values generated)
(7,331 real changes made)
(3,861 real changes made)
(5,919 real changes made, 5,919 to missing)
(19,548 missing values generated)
(26,899 missing values generated)
(3,708 real changes made)
(3,643 real changes made)
(3,708 real changes made)
(3,643 real changes made)
(4,668 real changes made)
(26,899 missing values generated)
(3,708 real changes made)
(3,643 real changes made)
(7,351 real changes made)
(22,231 real changes made)
(19,548 missing values generated)
(7,271 real changes made)
(3,708 real changes made)
(5,861 real changes made, 5,861 to missing)
(19,490 missing values generated)
(26,899 missing values generated)
(3,781 real changes made)
(3,628 real changes made)
(3,781 real changes made)
(3,628 real changes made)
(4,700 real changes made)
(26,899 missing values generated)
(3,781 real changes made)
(3,628 real changes made)
(7,409 real changes made)
(22,199 real changes made)
(19,490 missing values generated)
(7,317 real changes made)
(3,781 real changes made)
(5,926 real changes made, 5,926 to missing)
(19,555 missing values generated)
(26,899 missing values generated)
(3,763 real changes made)
(3,581 real changes made)
(3,763 real changes made)
(3,581 real changes made)
(4,632 real changes made)
(26,899 missing values generated)
(3,763 real changes made)
(3,581 real changes made)
(7,344 real changes made)
(22,267 real changes made)
(19,555 missing values generated)
(7,265 real changes made)
(3,763 real changes made)
(5,840 real changes made, 5,840 to missing)
(19,469 missing values generated)
(26,899 missing values generated)
(3,795 real changes made)
(3,635 real changes made)
(3,795 real changes made)
(3,635 real changes made)
(4,727 real changes made)
(26,899 missing values generated)
(3,795 real changes made)
(3,635 real changes made)
(7,430 real changes made)
(22,172 real changes made)
(19,469 missing values generated)
(7,341 real changes made)
(3,795 real changes made)
(5,785 real changes made, 5,785 to missing)
(19,414 missing values generated)
(26,899 missing values generated)
(3,831 real changes made)
(3,654 real changes made)
(3,831 real changes made)
(3,654 real changes made)
(4,739 real changes made)
(26,899 missing values generated)
(3,831 real changes made)
(3,654 real changes made)
(7,485 real changes made)
(22,160 real changes made)
(19,414 missing values generated)
(7,396 real changes made)
(3,831 real changes made)
(5,803 real changes made, 5,803 to missing)
(19,432 missing values generated)
(26,899 missing values generated)
(3,849 real changes made)
(3,618 real changes made)
(3,849 real changes made)
(3,618 real changes made)
(4,683 real changes made)
(26,899 missing values generated)
(3,849 real changes made)
(3,618 real changes made)
(7,467 real changes made)
(22,216 real changes made)
(19,432 missing values generated)
(7,371 real changes made)
(3,849 real changes made)
(5,792 real changes made, 5,792 to missing)
(19,421 missing values generated)
(26,899 missing values generated)
(3,841 real changes made)
(3,637 real changes made)
(3,841 real changes made)
(3,637 real changes made)
(4,730 real changes made)
(26,899 missing values generated)
(3,841 real changes made)
(3,637 real changes made)
(7,478 real changes made)
(22,169 real changes made)
(19,421 missing values generated)
(7,391 real changes made)
(3,841 real changes made)
(5,835 real changes made, 5,835 to missing)
(19,464 missing values generated)
(26,899 missing values generated)
(3,785 real changes made)
(3,650 real changes made)
(3,785 real changes made)
(3,650 real changes made)
(4,623 real changes made)
(26,899 missing values generated)
(3,785 real changes made)
(3,650 real changes made)
(7,435 real changes made)
(22,276 real changes made)
(19,464 missing values generated)
(7,355 real changes made)
(3,785 real changes made)
(5,788 real changes made, 5,788 to missing)
(19,417 missing values generated)
(26,899 missing values generated)
(3,783 real changes made)
(3,699 real changes made)
(3,783 real changes made)
(3,699 real changes made)
(4,746 real changes made)
(26,899 missing values generated)
(3,783 real changes made)
(3,699 real changes made)
(7,482 real changes made)
(22,153 real changes made)
(19,417 missing values generated)
(7,392 real changes made)
(3,783 real changes made)
(5,853 real changes made, 5,853 to missing)
(19,482 missing values generated)
(26,899 missing values generated)
(3,751 real changes made)
(3,666 real changes made)
(3,751 real changes made)
(3,666 real changes made)
(4,692 real changes made)
(26,899 missing values generated)
(3,751 real changes made)
(3,666 real changes made)
(7,417 real changes made)
(22,207 real changes made)
(19,482 missing values generated)
(7,336 real changes made)
(3,751 real changes made)
(5,842 real changes made, 5,842 to missing)
(19,471 missing values generated)
(26,899 missing values generated)
(3,800 real changes made)
(3,628 real changes made)
(3,800 real changes made)
(3,628 real changes made)
(4,718 real changes made)
(26,899 missing values generated)
(3,800 real changes made)
(3,628 real changes made)
(7,428 real changes made)
(22,181 real changes made)
(19,471 missing values generated)
(7,341 real changes made)
(3,800 real changes made)
(5,805 real changes made, 5,805 to missing)
(19,434 missing values generated)
(26,899 missing values generated)
(3,852 real changes made)
(3,613 real changes made)
(3,852 real changes made)
(3,613 real changes made)
(4,711 real changes made)
(26,899 missing values generated)
(3,852 real changes made)
(3,613 real changes made)
(7,465 real changes made)
(22,188 real changes made)
(19,434 missing values generated)
(7,379 real changes made)
(3,852 real changes made)
(5,837 real changes made, 5,837 to missing)
(19,466 missing values generated)
(26,899 missing values generated)
(3,850 real changes made)
(3,583 real changes made)
(3,850 real changes made)
(3,583 real changes made)
(4,716 real changes made)
(26,899 missing values generated)
(3,850 real changes made)
(3,583 real changes made)
(7,433 real changes made)
(22,183 real changes made)
(19,466 missing values generated)
(7,339 real changes made)
(3,850 real changes made)
(5,896 real changes made, 5,896 to missing)
(19,525 missing values generated)
(26,899 missing values generated)
(3,798 real changes made)
(3,576 real changes made)
(3,798 real changes made)
(3,576 real changes made)
(4,620 real changes made)
(26,899 missing values generated)
(3,798 real changes made)
(3,576 real changes made)
(7,374 real changes made)
(22,279 real changes made)
(19,525 missing values generated)
(7,300 real changes made)
(3,798 real changes made)
(5,839 real changes made, 5,839 to missing)
(19,468 missing values generated)
(26,899 missing values generated)
(3,814 real changes made)
(3,617 real changes made)
(3,814 real changes made)
(3,617 real changes made)
(4,680 real changes made)
(26,899 missing values generated)
(3,814 real changes made)
(3,617 real changes made)
(7,431 real changes made)
(22,219 real changes made)
(19,468 missing values generated)
(7,339 real changes made)
(3,814 real changes made)
(5,852 real changes made, 5,852 to missing)
(19,481 missing values generated)
(26,899 missing values generated)
(3,803 real changes made)
(3,615 real changes made)
(3,803 real changes made)
(3,615 real changes made)
(4,780 real changes made)
(26,899 missing values generated)
(3,803 real changes made)
(3,615 real changes made)
(7,418 real changes made)
(22,119 real changes made)
(19,481 missing values generated)
(7,336 real changes made)
(3,803 real changes made)
(5,853 real changes made, 5,853 to missing)
(19,482 missing values generated)
(26,899 missing values generated)
(3,814 real changes made)
(3,603 real changes made)
(3,814 real changes made)
(3,603 real changes made)
(4,687 real changes made)
(26,899 missing values generated)
(3,814 real changes made)
(3,603 real changes made)
(7,417 real changes made)
(22,212 real changes made)
(19,482 missing values generated)
(7,336 real changes made)
(3,814 real changes made)
(5,858 real changes made, 5,858 to missing)
(19,487 missing values generated)
(26,899 missing values generated)
(3,811 real changes made)
(3,601 real changes made)
(3,811 real changes made)
(3,601 real changes made)
(4,717 real changes made)
(26,899 missing values generated)
(3,811 real changes made)
(3,601 real changes made)
(7,412 real changes made)
(22,182 real changes made)
(19,487 missing values generated)
(7,326 real changes made)
(3,811 real changes made)
(5,903 real changes made, 5,903 to missing)
(19,532 missing values generated)
(26,899 missing values generated)
(3,767 real changes made)
(3,600 real changes made)
(3,767 real changes made)
(3,600 real changes made)
(4,664 real changes made)
(26,899 missing values generated)
(3,767 real changes made)
(3,600 real changes made)
(7,367 real changes made)
(22,235 real changes made)
(19,532 missing values generated)
(7,280 real changes made)
(3,767 real changes made)
(5,829 real changes made, 5,829 to missing)
(19,458 missing values generated)
(26,899 missing values generated)
(3,810 real changes made)
(3,631 real changes made)
(3,810 real changes made)
(3,631 real changes made)
(4,690 real changes made)
(26,899 missing values generated)
(3,810 real changes made)
(3,631 real changes made)
(7,441 real changes made)
(22,209 real changes made)
(19,458 missing values generated)
(7,369 real changes made)
(3,810 real changes made)
(5,967 real changes made, 5,967 to missing)
(19,596 missing values generated)
(26,899 missing values generated)
(3,693 real changes made)
(3,610 real changes made)
(3,693 real changes made)
(3,610 real changes made)
(4,666 real changes made)
(26,899 missing values generated)
(3,693 real changes made)
(3,610 real changes made)
(7,303 real changes made)
(22,233 real changes made)
(19,596 missing values generated)
(7,223 real changes made)
(3,693 real changes made)
(5,898 real changes made, 5,898 to missing)
(19,527 missing values generated)
(26,899 missing values generated)
(3,780 real changes made)
(3,592 real changes made)
(3,780 real changes made)
(3,592 real changes made)
(4,671 real changes made)
(26,899 missing values generated)
(3,780 real changes made)
(3,592 real changes made)
(7,372 real changes made)
(22,228 real changes made)
(19,527 missing values generated)
(7,276 real changes made)
(3,780 real changes made)
(5,817 real changes made, 5,817 to missing)
(19,446 missing values generated)
(26,899 missing values generated)
(3,795 real changes made)
(3,658 real changes made)
(3,795 real changes made)
(3,658 real changes made)
(4,669 real changes made)
(26,899 missing values generated)
(3,795 real changes made)
(3,658 real changes made)
(7,453 real changes made)
(22,230 real changes made)
(19,446 missing values generated)
(7,361 real changes made)
(3,795 real changes made)
(5,879 real changes made, 5,879 to missing)
(19,508 missing values generated)
(26,899 missing values generated)
(3,784 real changes made)
(3,607 real changes made)
(3,784 real changes made)
(3,607 real changes made)
(4,649 real changes made)
(26,899 missing values generated)
(3,784 real changes made)
(3,607 real changes made)
(7,391 real changes made)
(22,250 real changes made)
(19,508 missing values generated)
(7,305 real changes made)
(3,784 real changes made)
(5,771 real changes made, 5,771 to missing)
(19,400 missing values generated)
(26,899 missing values generated)
(3,864 real changes made)
(3,635 real changes made)
(3,864 real changes made)
(3,635 real changes made)
(4,731 real changes made)
(26,899 missing values generated)
(3,864 real changes made)
(3,635 real changes made)
(7,499 real changes made)
(22,168 real changes made)
(19,400 missing values generated)
(7,417 real changes made)
(3,864 real changes made)
(5,935 real changes made, 5,935 to missing)
(19,564 missing values generated)
(26,899 missing values generated)
(3,769 real changes made)
(3,566 real changes made)
(3,769 real changes made)
(3,566 real changes made)
(4,655 real changes made)
(26,899 missing values generated)
(3,769 real changes made)
(3,566 real changes made)
(7,335 real changes made)
(22,244 real changes made)
(19,564 missing values generated)
(7,242 real changes made)
(3,769 real changes made)
(5,777 real changes made, 5,777 to missing)
(19,406 missing values generated)
(26,899 missing values generated)
(3,867 real changes made)
(3,626 real changes made)
(3,867 real changes made)
(3,626 real changes made)
(4,753 real changes made)
(26,899 missing values generated)
(3,867 real changes made)
(3,626 real changes made)
(7,493 real changes made)
(22,146 real changes made)
(19,406 missing values generated)
(7,402 real changes made)
(3,867 real changes made)
(5,984 real changes made, 5,984 to missing)
(19,613 missing values generated)
(26,899 missing values generated)
(3,725 real changes made)
(3,561 real changes made)
(3,725 real changes made)
(3,561 real changes made)
(4,613 real changes made)
(26,899 missing values generated)
(3,725 real changes made)
(3,561 real changes made)
(7,286 real changes made)
(22,286 real changes made)
(19,613 missing values generated)
(7,193 real changes made)
(3,725 real changes made)
(5,842 real changes made, 5,842 to missing)
(19,471 missing values generated)
(26,899 missing values generated)
(3,797 real changes made)
(3,631 real changes made)
(3,797 real changes made)
(3,631 real changes made)
(4,683 real changes made)
(26,899 missing values generated)
(3,797 real changes made)
(3,631 real changes made)
(7,428 real changes made)
(22,216 real changes made)
(19,471 missing values generated)
(7,348 real changes made)
(3,797 real changes made)
(5,865 real changes made, 5,865 to missing)
(19,494 missing values generated)
(26,899 missing values generated)
(3,794 real changes made)
(3,611 real changes made)
(3,794 real changes made)
(3,611 real changes made)
(4,708 real changes made)
(26,899 missing values generated)
(3,794 real changes made)
(3,611 real changes made)
(7,405 real changes made)
(22,191 real changes made)
(19,494 missing values generated)
(7,318 real changes made)
(3,794 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)
(1,790 missing values generated)

. gen baseline_egfr=.
(26,899 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan20
> 19 feb2019 mar2019 apr2019 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2
> 021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022 nov2022 dec2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(230 real changes made)
(320 real changes made)
(269 real changes made)
(272 real changes made)
(268 real changes made)
(289 real changes made)
(251 real changes made)
(237 real changes made)
(243 real changes made)
(249 real changes made)
(261 real changes made)
(253 real changes made)
(239 real changes made)
(245 real changes made)
(229 real changes made)
(211 real changes made)
(216 real changes made)
(206 real changes made)
(209 real changes made)
(220 real changes made)
(214 real changes made)
(224 real changes made)
(208 real changes made)
(197 real changes made)
(194 real changes made)
(218 real changes made)
(182 real changes made)
(216 real changes made)
(172 real changes made)
(198 real changes made)
(194 real changes made)
(158 real changes made)
(195 real changes made)
(242 real changes made)
(216 real changes made)
(238 real changes made)
(206 real changes made)
(191 real changes made)
(189 real changes made)
(217 real changes made)
(188 real changes made)
(175 real changes made)
(219 real changes made)
(187 real changes made)
(177 real changes made)
(176 real changes made)
(185 real changes made)
(197 real changes made)
(191 real changes made)
(176 real changes made)
(180 real changes made)
(171 real changes made)
(181 real changes made)
(197 real changes made)
(159 real changes made)
(189 real changes made)
(163 real changes made)
(168 real changes made)
(152 real changes made)
(179 real changes made)
(166 real changes made)
(178 real changes made)
(167 real changes made)
(145 real changes made)
(177 real changes made)
(142 real changes made)
(176 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab covid baseline_esrd

           | baseline_e
           |    srd
     covid |   No ESRD |     Total
-----------+-----------+----------
         1 |    13,270 |    13,270 
-----------+-----------+----------
     Total |    13,270 |    13,270 

. tab pneumonia baseline_esrd

           | baseline_e
           |    srd
 pneumonia |   No ESRD |     Total
-----------+-----------+----------
         1 |    13,629 |    13,629 
-----------+-----------+----------
     Total |    13,629 |    13,629 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. ** Exposure
. gen case = covid
(13,629 missing values generated)

. replace case = 0 if covid==.
(13,629 real changes made)

. label define case 0 "Pneumonia (pre-pandemic)" ///
>                                   1 "COVID-19"

. label values case case

. tab case covid

                      |   covid
                 case |         1 |     Total
----------------------+-----------+----------
             COVID-19 |    13,270 |    13,270 
----------------------+-----------+----------
                Total |    13,270 |    13,270 

. tab case pneumonia

                      | pneumonia
                 case |         1 |     Total
----------------------+-----------+----------
Pneumonia (pre-pandem |    13,629 |    13,629 
----------------------+-----------+----------
                Total |    13,629 |    13,629 

. drop covid

. drop pneumonia

. safetab case 

                    case |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,629       50.67       50.67
                COVID-19 |     13,270       49.33      100.00
-------------------------+-----------------------------------
                   Total |     26,899      100.00

. 
. * Critical care during index admission
. replace critical_care = 1 if critical_days==1
(1,289 real changes made)

. drop critical_days

. label define critical_care      0 "Ward-based"          ///
>                                                         1 "Critical care"

. label values critical_care critical_care

. label var critical_care "Critical care"

. safetab critical_care, m

Critical care |      Freq.     Percent        Cum.
--------------+-----------------------------------
   Ward-based |     24,292       90.31       90.31
Critical care |      2,607        9.69      100.00
--------------+-----------------------------------
        Total |     26,899      100.00

. gen case_critical_care = critical_care

. replace case_critical_care = 2 if case==1
(13,270 real changes made)

. replace case_critical_care = 3 if case==1 &critical_care==1
(1,265 real changes made)

. label define case_critical_care 0 "Ward-based pneumonia (pre-pandemic)"         ///
>                                                                 1 "Critical care pneumonia (pre-pandemic)"      ///
>                                                                 2 "Ward-based COVID-19"                                         ///
>                                                                 3 "Critical care COVID-19"

. label values case_critical_care case_critical_care

. safetab case_critical_care, m

                    case_critical_care |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
   Ward-based pneumonia (pre-pandemic) |     12,287       45.68       45.68
Critical care pneumonia (pre-pandemic) |      1,342        4.99       50.67
                   Ward-based COVID-19 |     12,005       44.63       95.30
                Critical care COVID-19 |      1,265        4.70      100.00
---------------------------------------+-----------------------------------
                                 Total |     26,899      100.00

. 
. * Acute kidney injury during index admission
. rename acute_kidney_injury adm_aki

. label define adm_aki    0 "No AKI"      ///
>                                                 1 "AKI"

. label values adm_aki adm_aki

. label var adm_aki "Acute kidney injury"

. safetab adm_aki, m

      Acute |
     kidney |
     injury |      Freq.     Percent        Cum.
------------+-----------------------------------
     No AKI |     16,172       60.12       60.12
        AKI |     10,727       39.88      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. gen case_adm_aki = adm_aki

. replace case_adm_aki = 2 if case==1
(13,270 real changes made)

. replace case_adm_aki = 3 if case==1 &adm_aki==1
(5,361 real changes made)

. label define case_adm_aki       0 "No AKI pneumonia (pre-pandemic)"     ///
>                                                                                 1 "AKI pneumonia (pre-pandemic)"        ///
>                                                                                 2 "No AKI COVID-19"                             ///
>                                                                                 3 "AKI COVID-19"

. label values case_adm_aki case_adm_aki

. safetab case_adm_aki, m

                   case_adm_aki |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
No AKI pneumonia (pre-pandemic) |      8,263       30.72       30.72
   AKI pneumonia (pre-pandemic) |      5,366       19.95       50.67
                No AKI COVID-19 |      7,909       29.40       80.07
                   AKI COVID-19 |      5,361       19.93      100.00
--------------------------------+-----------------------------------
                          Total |     26,899      100.00

. 
. * Kidney replacement therapy during index admission
. gen krt = adm_aki

. replace krt = 2 if krt_icd_10==1
(276 real changes made)

. drop krt_icd_10

. replace krt = 2 if krt_opcs_4==1
(259 real changes made)

. drop krt_opcs_4

. label define krt        0 "No AKI"                              ///
>                                         1 "AKI without KRT"             ///
>                                         2 "AKI requiring KRT"

. label values krt krt

. label var krt "Kidney replacement therapy"

. safetab krt, m

           Kidney |
      replacement |
          therapy |      Freq.     Percent        Cum.
------------------+-----------------------------------
           No AKI |     15,848       58.92       58.92
  AKI without KRT |     10,516       39.09       98.01
AKI requiring KRT |        535        1.99      100.00
------------------+-----------------------------------
            Total |     26,899      100.00

. gen case_krt = krt

. replace case_krt = 3 if case==1
(13,270 real changes made)

. replace case_krt = 4 if case==1 &krt==1
(5,254 real changes made)

. replace case_krt = 5 if case==1 &krt==2
(254 real changes made)

. label define case_krt   0 "No AKI pneumonia (pre-pandemic)"                     ///
>                                                 1 "AKI without KRT pneumonia (pre-pandemic)"    ///
>                                                 2 "AKI requiring KRT pneumonia (pre-pandemic)"  ///
>                                                 3 "No AKI COVID-19"                                                             ///
>                                                 4 "AKI without KRT COVID-19"                                    ///
>                                                 5 "AKI requiring KRT COVID-19"

. label values case_krt case_krt

. safetab case_krt, m

                               case_krt |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
        No AKI pneumonia (pre-pandemic) |      8,086       30.06       30.06
AKI without KRT pneumonia (pre-pandemic |      5,262       19.56       49.62
AKI requiring KRT pneumonia (pre-pandem |        281        1.04       50.67
                        No AKI COVID-19 |      7,762       28.86       79.52
               AKI without KRT COVID-19 |      5,254       19.53       99.06
             AKI requiring KRT COVID-19 |        254        0.94      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,899      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(17,585 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(17,607 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(17,521 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(17,598 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(9,301 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(2,804 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(828 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(250 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Pneumonia (pre-pandemic)"    ///
>                                                 1 "COVID pre-vaccination"                       ///
>                                                 2 "COVID 1 vaccine dose"                        ///
>                                                 3 "COVID 2 vaccine doses"                       ///
>                                                 4 "COVID 3 vaccine doses"                       ///
>                                                 5 "COVID 4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "COVID-19 vaccination status"

. safetab covid_vax, m

    COVID-19 vaccination |
                  status |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,629       50.67       50.67
   COVID pre-vaccination |         87        0.32       50.99
    COVID 1 vaccine dose |        250        0.93       51.92
   COVID 2 vaccine doses |        828        3.08       55.00
   COVID 3 vaccine doses |      2,804       10.42       65.42
   COVID 4 vaccine doses |      9,301       34.58      100.00
-------------------------+-----------------------------------
                   Total |     26,899      100.00

. 
. * COVID-19 wave
. gen wave = case

. replace wave = 2 if index_month=="sep2020"
(364 real changes made)

. replace wave = 2 if index_month=="oct2020"
(356 real changes made)

. replace wave = 2 if index_month=="nov2020"
(320 real changes made)

. replace wave = 2 if index_month=="dec2020"
(384 real changes made)

. replace wave = 2 if index_month=="jan2021"
(349 real changes made)

. replace wave = 2 if index_month=="feb2021"
(329 real changes made)

. replace wave = 2 if index_month=="mar2021"
(320 real changes made)

. replace wave = 2 if index_month=="apr2021"
(336 real changes made)

. replace wave = 2 if index_month=="may2021"
(352 real changes made)

. replace wave = 2 if index_month=="jun2021"
(318 real changes made)

. replace wave = 3 if index_month=="jul2021"
(317 real changes made)

. replace wave = 3 if index_month=="aug2021"
(326 real changes made)

. replace wave = 3 if index_month=="sep2021"
(324 real changes made)

. replace wave = 3 if index_month=="oct2021"
(315 real changes made)

. replace wave = 3 if index_month=="nov2021"
(318 real changes made)

. replace wave = 4 if index_month=="dec2021"
(298 real changes made)

. replace wave = 4 if index_month=="jan2022"
(327 real changes made)

. replace wave = 4 if index_month=="feb2022"
(306 real changes made)

. replace wave = 4 if index_month=="mar2022"
(304 real changes made)

. replace wave = 4 if index_month=="apr2022"
(255 real changes made)

. replace wave = 4 if index_month=="may2022"
(322 real changes made)

. replace wave = 4 if index_month=="jun2022"
(292 real changes made)

. replace wave = 4 if index_month=="jul2022"
(307 real changes made)

. replace wave = 4 if index_month=="aug2022"
(295 real changes made)

. replace wave = 4 if index_month=="sep2022"
(257 real changes made)

. replace wave = 4 if index_month=="oct2022"
(305 real changes made)

. replace wave = 4 if index_month=="nov2022"
(259 real changes made)

. replace wave = 4 if index_month=="dec2022"
(301 real changes made)

. label define wave       0 "Pneumonia (pre-pandemic)"    ///
>                                         1 "COVID Feb20-Aug20"   ///
>                                         2 "COVID Sep20-Jun21"   ///
>                                         3 "COVID Jul21-Nov21"   ///
>                                         4 "COVID Dec21-Dec22"   

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m

           COVID-19 wave |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,629       50.67       50.67
       COVID Feb20-Aug20 |      4,414       16.41       67.08
       COVID Sep20-Jun21 |      3,428       12.74       79.82
       COVID Jul21-Nov21 |      1,600        5.95       85.77
       COVID Dec21-Dec22 |      3,828       14.23      100.00
-------------------------+-----------------------------------
                   Total |     26,899      100.00

. 
. * Month
. gen month_string=substr(index_date_string ,3,3)
(1,790 missing values generated)

. gen month = 1 if month_string=="jan"
(25,407 missing values generated)

. replace month = 2 if month_string=="feb"
(2,187 real changes made)

. replace month = 3 if month_string=="mar"
(2,382 real changes made)

. replace month = 4 if month_string=="apr"
(2,118 real changes made)

. replace month = 5 if month_string=="may"
(2,341 real changes made)

. replace month = 6 if month_string=="jun"
(2,154 real changes made)

. replace month = 7 if month_string=="jul"
(2,185 real changes made)

. replace month = 8 if month_string=="aug"
(2,162 real changes made)

. replace month = 9 if month_string=="sep"
(2,062 real changes made)

. replace month = 10 if month_string=="oct"
(2,168 real changes made)

. replace month = 11 if month_string=="nov"
(2,007 real changes made)

. replace month = 12 if month_string=="dec"
(1,851 real changes made)

. drop month_string

. label define month      1 "January"             ///
>                                         2 "February"    ///
>                                         3 "March"               ///
>                                         4 "April"               ///
>                                         5 "May"                 ///
>                                         6 "June"                ///
>                                         7 "July"                ///
>                                         8 "August"              ///
>                                         9 "September"   ///
>                                         10 "October"    ///
>                                         11 "November"   ///
>                                         12 "December"

. label values month month

. safetab month case, m

           |         case
     month | Pneumonia   COVID-19 |     Total
-----------+----------------------+----------
   January |       816        676 |     1,492 
  February |     1,187      1,000 |     2,187 
     March |     1,345      1,037 |     2,382 
     April |     1,175        943 |     2,118 
       May |     1,285      1,056 |     2,341 
      June |     1,163        991 |     2,154 
      July |     1,206        979 |     2,185 
    August |     1,165        997 |     2,162 
 September |     1,117        945 |     2,062 
   October |     1,192        976 |     2,168 
  November |     1,110        897 |     2,007 
  December |       868        983 |     1,851 
         . |         0      1,790 |     1,790 
-----------+----------------------+----------
     Total |    13,629     13,270 |    26,899 

. 
. ** Covariates
. ** Covariates
. * Check of GP consultations over past year by groups
. sum gp_count, detail

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -7
 5%            0             -5
10%            0             -4       Obs              26,899
25%            0             -4       Sum of wgt.      26,899

50%            3                      Mean           3.330273
                        Largest       Std. dev.      3.550837
75%            6             16
90%            8             16       Variance       12.60844
95%           10             17       Skewness       .6235824
99%           12             19       Kurtosis       2.267044

. bysort case: sum gp_count, detail

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Pneumonia (pre-pandemic)

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -7
 5%            0             -5
10%            0             -4       Obs              13,629
25%            0             -4       Sum of wgt.      13,629

50%            3                      Mean           3.333553
                        Largest       Std. dev.      3.562306
75%            6             15
90%            8             15       Variance       12.69003
95%           10             15       Skewness       .6260916
99%           12             17       Kurtosis       2.265065

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = COVID-19

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -4
 5%            0             -3
10%            0             -3       Obs              13,270
25%            0             -3       Sum of wgt.      13,270

50%            3                      Mean           3.326903
                        Largest       Std. dev.      3.539149
75%            6             16
90%            8             16       Variance       12.52558
95%           10             16       Skewness       .6208982
99%           12             19       Kurtosis       2.268862


. egen gp_consults = cut(gp_count), at(0, 1, 3, 10, 1500)
(151 missing values generated)

. recode gp_consults 3=2 10=3
(13,673 changes made to gp_consults)

. label define gp_consults 0 "0" 1 "1-2" 2 "3-9" 3 ">9"

. label values gp_consults gp_consults

. label var gp_consults "GP interactions"

. tab case gp_consults

                      |               GP interactions
                 case |         0        1-2        3-9         >9 |     Total
----------------------+--------------------------------------------+----------
Pneumonia (pre-pandem |     5,784        858      6,150        768 |    13,560 
             COVID-19 |     5,571        862      6,049        706 |    13,188 
----------------------+--------------------------------------------+----------
                Total |    11,355      1,720     12,199      1,474 |    26,748 

. 
. * Check of hospital admissions in preceding 5 years
. sum hosp_count, detail

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs              26,899
25%            0             -2       Sum of wgt.      26,899

50%            0                      Mean           .3920964
                        Largest       Std. dev.      .7185434
75%            1              4
90%            1              4       Variance       .5163045
95%            2              4       Skewness        1.47733
99%            3              4       Kurtosis       5.075648

. bysort case: sum hosp_count, detail

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Pneumonia (pre-pandemic)

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs              13,629
25%            0             -2       Sum of wgt.      13,629

50%            0                      Mean           .3946731
                        Largest       Std. dev.      .7207791
75%            1              4
90%            1              4       Variance       .5195225
95%            2              4       Skewness       1.449394
99%            3              4       Kurtosis       4.952436

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = COVID-19

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs              13,270
25%            0             -2       Sum of wgt.      13,270

50%            0                      Mean           .3894499
                        Largest       Std. dev.      .7162573
75%            1              4
90%            1              4       Variance       .5130246
95%            2              4       Skewness       1.506443
99%            3              4       Kurtosis       5.205555


. egen admissions = cut(hosp_count), at(0, 1, 2, 1000)
(388 missing values generated)

. label define admissions 0 "0" 1 "1" 2 ">1"

. label values admissions admissions

. label var admissions "Hospital admissions"

. tab case admissions

                      |       Hospital admissions
                 case |         0          1         >1 |     Total
----------------------+---------------------------------+----------
Pneumonia (pre-pandem |     9,335      2,762      1,328 |    13,425 
             COVID-19 |     9,150      2,695      1,241 |    13,086 
----------------------+---------------------------------+----------
                Total |    18,485      5,457      2,569 |    26,511 

. 
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        316        1.17        1.17
          1 |        334        1.24        2.42
          2 |        319        1.19        3.60
          3 |        303        1.13        4.73
          4 |        319        1.19        5.91
          5 |        323        1.20        7.12
          6 |        314        1.17        8.28
          7 |        334        1.24        9.52
          8 |        329        1.22       10.75
          9 |        346        1.29       12.03
         10 |        312        1.16       13.19
         11 |        322        1.20       14.39
         12 |        283        1.05       15.44
         13 |        319        1.19       16.63
         14 |        318        1.18       17.81
         15 |        338        1.26       19.07
         16 |        303        1.13       20.19
         17 |        353        1.31       21.51
         18 |        300        1.12       22.62
         19 |        320        1.19       23.81
         20 |        318        1.18       24.99
         21 |        312        1.16       26.15
         22 |        327        1.22       27.37
         23 |        320        1.19       28.56
         24 |        315        1.17       29.73
         25 |        352        1.31       31.04
         26 |        369        1.37       32.41
         27 |        385        1.43       33.84
         28 |        364        1.35       35.19
         29 |        380        1.41       36.61
         30 |        367        1.36       37.97
         31 |        373        1.39       39.36
         32 |        359        1.33       40.69
         33 |        416        1.55       42.24
         34 |        383        1.42       43.66
         35 |        341        1.27       44.93
         36 |        342        1.27       46.20
         37 |        299        1.11       47.31
         38 |        332        1.23       48.55
         39 |        332        1.23       49.78
         40 |        348        1.29       51.08
         41 |        287        1.07       52.14
         42 |        329        1.22       53.37
         43 |        336        1.25       54.62
         44 |        288        1.07       55.69
         45 |        391        1.45       57.14
         46 |        387        1.44       58.58
         47 |        333        1.24       59.82
         48 |        342        1.27       61.09
         49 |        353        1.31       62.40
         50 |        362        1.35       63.75
         51 |        355        1.32       65.07
         52 |        385        1.43       66.50
         53 |        391        1.45       67.95
         54 |        390        1.45       69.40
         55 |        367        1.36       70.76
         56 |        348        1.29       72.06
         57 |        329        1.22       73.28
         58 |        329        1.22       74.50
         59 |        324        1.20       75.71
         60 |        314        1.17       76.88
         61 |        298        1.11       77.98
         62 |        314        1.17       79.15
         63 |        278        1.03       80.19
         64 |        309        1.15       81.33
         65 |        281        1.04       82.38
         66 |        280        1.04       83.42
         67 |        275        1.02       84.44
         68 |        289        1.07       85.52
         69 |        276        1.03       86.54
         70 |        254        0.94       87.49
         71 |        317        1.18       88.67
         72 |        303        1.13       89.79
         73 |        237        0.88       90.67
         74 |        269        1.00       91.67
         75 |        210        0.78       92.45
         76 |        172        0.64       93.09
         77 |        166        0.62       93.71
         78 |        176        0.65       94.36
         79 |        173        0.64       95.01
         80 |        139        0.52       95.52
         81 |        104        0.39       95.91
         82 |        153        0.57       96.48
         83 |        139        0.52       97.00
         84 |        110        0.41       97.41
         85 |         94        0.35       97.75
         86 |         85        0.32       98.07
         87 |        101        0.38       98.45
         88 |         87        0.32       98.77
         89 |         87        0.32       99.09
         90 |         39        0.14       99.24
         91 |         25        0.09       99.33
         92 |         37        0.14       99.47
         93 |         35        0.13       99.60
         94 |         30        0.11       99.71
         95 |         12        0.04       99.75
         96 |         19        0.07       99.83
         97 |          8        0.03       99.86
         98 |         11        0.04       99.90
         99 |         16        0.06       99.96
        100 |          1        0.00       99.96
        101 |          1        0.00       99.96
        102 |          1        0.00       99.97
        104 |          3        0.01       99.98
        106 |          2        0.01       99.99
        107 |          2        0.01       99.99
        108 |          2        0.01      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. safecount
  26,899

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///                                     
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(26,565 differences between age and agegroup)

. 
. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label values agegroup agegroup

. label var agegroup "Age group"

. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     13,769       51.19       51.19
       Male |     13,130       48.81      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. safecount
  26,899

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(1,011 real changes made)

. replace ethnicity=2 if ethnicity==3
(1,003 real changes made)

. replace ethnicity=3 if ethnicity==4
(1,027 real changes made)

. replace ethnicity=4 if ethnicity==6
(1,011 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///                                             
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                                                               

. label values ethnicity ethnicity

. safetab ethnicity, m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,093       59.83       59.83
South Asian |      1,003        3.73       63.56
      Black |      1,027        3.82       67.37
      Mixed |      1,011        3.76       71.13
      Other |      1,011        3.76       74.89
          . |      6,754       25.11      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(6,754 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(6,754 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. safetab ethnicity1, m

 ethnicity1 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,093       59.83       59.83
South Asian |      1,003        3.73       63.56
      Black |      1,027        3.82       67.37
      Mixed |      1,011        3.76       71.13
      Other |      1,011        3.76       74.89
    Unknown |      6,754       25.11      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,786       10.36       10.36
                Urban minor conurbation |      2,640        9.81       20.17
                    Urban city and town |      2,654        9.87       30.04
Urban city and town in a sparse setting |      2,699       10.03       40.07
                  Rural town and fringe |      2,619        9.74       49.81
Rural town and fringe in a sparse setti |      2,705       10.06       59.86
            Rural village and dispersed |      5,398       20.07       79.93
Rural village and dispersed in a sparse |      5,398       20.07      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,899      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(26,899 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(10,779 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(16,120 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                                       rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow  Rural tow  Rural vil  Rural vil |     Total
-----------+----------------------------------------------------------------------------------------+----------
     Rural |         0          0          0          0      2,619      2,705      5,398      5,398 |    16,120 
     Urban |     2,786      2,640      2,654      2,699          0          0          0          0 |    10,779 
-----------+----------------------------------------------------------------------------------------+----------
     Total |     2,786      2,640      2,654      2,699      2,619      2,705      5,398      5,398 |    26,899 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Pneumonia (pre-pandem |     8,149      5,480 |    13,629 
             COVID-19 |     7,971      5,299 |    13,270 
----------------------+----------------------+----------
                Total |    16,120     10,779 |    26,899 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,670 real changes made, 2,670 to missing)

. gen     bmi = .
(26,899 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(1,785 changes made to bmi)

. recode  bmi . = 2 if body_mass_index<25
(6,047 changes made to bmi)

. recode  bmi . = 3 if body_mass_index<30
(6,336 changes made to bmi)

. recode  bmi . = 4 if body_mass_index<35
(5,315 changes made to bmi)

. recode  bmi . = 5 if body_mass_index<40
(3,126 changes made to bmi)

. recode  bmi . = 6 if body_mass_index<.
(1,620 changes made to bmi)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                             

. label values bmi bmi

. safetab bmi, m

                 bmi |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,785        6.64        6.64
  Normal (18.5-24.9) |      6,047       22.48       29.12
Overweight (25-29.9) |      6,336       23.55       52.67
   Obese I (30-34.9) |      5,315       19.76       72.43
  Obese II (35-39.9) |      3,126       11.62       84.05
     Obese III (40+) |      1,620        6.02       90.07
                   . |      2,670        9.93      100.00
---------------------+-----------------------------------
               Total |     26,899      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(15,678 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(1,925 real changes made)

. replace smoking = 0 if smoking_status=="N"
(3,781 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |      3,781       14.06       14.06
Current/former smoker |     13,146       48.87       62.93
                    . |      9,972       37.07      100.00
----------------------+-----------------------------------
                Total |     26,899      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000)
(13,152 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(13,747 changes made to egfr_group)

. label define egfr_group 1 "≥105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       ≥105 |      4,628       17.21       17.21
     90-104 |      1,833        6.81       24.02
      75-89 |      1,925        7.16       31.18
      60-74 |      2,083        7.74       38.92
      45-59 |      2,060        7.66       46.58
      30-44 |      1,084        4.03       50.61
      15-29 |        134        0.50       51.11
          . |     13,152       48.89      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 15-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(13,152 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(22,271 changes made to ckd_stage)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6 "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |     10,469       38.92       38.92
                      CKD 3A |      2,060        7.66       46.58
                      CKD 3B |      1,084        4.03       50.61
                       CKD 4 |        134        0.50       51.11
No baseline eGFR measurement |     13,152       48.89      100.00
-----------------------------+-----------------------------------
                       Total |     26,899      100.00

. 
. * Comorbidities
. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,535       94.93       94.93
          1 |      1,364        5.07      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,357       97.99       97.99
          1 |        542        2.01      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. label var diabetes "Diabetes"

. safetab diabetes

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,367       79.43       79.43
          1 |      5,532       20.57      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,611       98.93       98.93
          1 |        288        1.07      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. safetab heart_failure

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,882       96.22       96.22
          1 |      1,017        3.78      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. safetab hiv

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,357       97.99       97.99
          1 |        542        2.01      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. label var hypertension "Hypertension"

. safetab hypertension

Hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,562       80.16       80.16
          1 |      5,337       19.84      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. label var non_haem_cancer "Cancer (non-haematological)"

. safetab non_haem_cancer

     Cancer |
(non-haemat |
  ological) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,371       98.04       98.04
          1 |        528        1.96      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. safetab myocardial_infarction

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,198       89.96       89.96
          1 |      2,701       10.04      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,344       97.94       97.94
          1 |        555        2.06      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,517       94.86       94.86
          1 |      1,382        5.14      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. safetab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,353       97.97       97.97
          1 |        546        2.03      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,356       97.98       97.98
          1 |        543        2.02      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(958 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,482 real changes made)

. replace cardiovascular = 1 if pvd==1
(458 real changes made)

. replace cardiovascular = 1 if stroke==1
(446 real changes made)

. label var cardiovascular "Cardiovascular diseases"

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(539 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,331 real changes made)

. replace immunosuppressed = 1 if lupus==1
(494 real changes made)

. label var immunosuppressed "Immunosuppressive diseases"

. safetab cardiovascular

Cardiovascu |
        lar |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,191       78.78       78.78
          1 |      5,708       21.22      100.00
------------+-----------------------------------
      Total |     26,899      100.00

. safetab immunosuppressed

Immunosuppr |
     essive |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,247       90.14       90.14
          1 |      2,652        9.86      100.00
------------+-----------------------------------
      Total |     26,899      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                                 creatinine_mar2017 ///
>                                                                                 creatinine_apr2017 ///
>                                                                                 creatinine_may2017 ///
>                                                                                 creatinine_jun2017 ///
>                                                                                 creatinine_jul2017 ///
>                                                                                 creatinine_aug2017 ///
>                                                                                 creatinine_sep2017 ///
>                                                                                 creatinine_oct2017 ///
>                                                                                 creatinine_nov2017 ///
>                                                                                 creatinine_dec2017 ///
>                                                                                 creatinine_jan2018 ///
>                                                                                 creatinine_feb2018 ///
>                                                                                 creatinine_mar2018 ///
>                                                                                 creatinine_apr2018 ///
>                                                                                 creatinine_may2018 ///
>                                                                                 creatinine_jun2018 ///
>                                                                                 creatinine_jul2018 ///
>                                                                                 creatinine_aug2018 ///
>                                                                                 creatinine_sep2018 ///
>                                                                                 creatinine_oct2018 ///
>                                                                                 creatinine_nov2018 ///
>                                                                                 creatinine_dec2018 ///
>                                                                                 creatinine_jan2019 ///
>                                                                                 creatinine_feb2019 ///
>                                                                                 creatinine_mar2019 ///
>                                                                                 creatinine_apr2019 ///
>                                                                                 creatinine_may2019 ///
>                                                                                 creatinine_jun2019 ///
>                                                                                 creatinine_jul2019 ///
>                                                                                 creatinine_aug2019 ///
>                                                                                 creatinine_sep2019 ///
>                                                                                 creatinine_feb2020 ///
>                                                                                 creatinine_mar2020 ///
>                                                                                 creatinine_apr2020 ///
>                                                                                 creatinine_may2020 ///
>                                                                                 creatinine_jun2020 ///
>                                                                                 creatinine_jul2020 ///
>                                                                                 creatinine_aug2020 ///
>                                                                                 creatinine_sep2020 ///
>                                                                                 creatinine_oct2020 ///
>                                                                                 creatinine_nov2020 ///
>                                                                                 creatinine_dec2020 ///
>                                                                                 creatinine_jan2021 ///
>                                                                                 creatinine_feb2021 ///
>                                                                                 creatinine_mar2021 ///
>                                                                                 creatinine_apr2021 ///
>                                                                                 creatinine_may2021 ///
>                                                                                 creatinine_jun2021 ///
>                                                                                 creatinine_jul2021 ///
>                                                                                 creatinine_aug2021 ///
>                                                                                 creatinine_sep2021 ///
>                                                                                 creatinine_oct2021 ///
>                                                                                 creatinine_nov2021 ///
>                                                                                 creatinine_dec2021 ///
>                                                                                 creatinine_jan2022 ///
>                                                                                 creatinine_feb2022 ///
>                                                                                 creatinine_mar2022 ///
>                                                                                 creatinine_apr2022 ///
>                                                                                 creatinine_may2022 ///
>                                                                                 creatinine_jun2022 ///
>                                                                                 creatinine_jul2022 ///
>                                                                                 creatinine_aug2022 ///
>                                                                                 creatinine_sep2022 ///
>                                                                                 creatinine_oct2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 3000)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex==0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex==1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_monthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(5,979 real changes made, 5,979 to missing)
(19,249 missing values generated)
(26,899 missing values generated)
(3,896 real changes made)
(3,754 real changes made)
(3,896 real changes made)
(3,754 real changes made)
(4,873 real changes made)
(26,899 missing values generated)
(3,896 real changes made)
(3,754 real changes made)
(7,650 real changes made)
(22,026 real changes made)
(19,249 missing values generated)
(7,578 real changes made)
(3,896 real changes made)
(6,053 real changes made, 6,053 to missing)
(19,323 missing values generated)
(26,899 missing values generated)
(3,853 real changes made)
(3,723 real changes made)
(3,853 real changes made)
(3,723 real changes made)
(4,830 real changes made)
(26,899 missing values generated)
(3,853 real changes made)
(3,723 real changes made)
(7,576 real changes made)
(22,069 real changes made)
(19,323 missing values generated)
(7,490 real changes made)
(3,853 real changes made)
(5,937 real changes made, 5,937 to missing)
(19,207 missing values generated)
(26,899 missing values generated)
(3,938 real changes made)
(3,754 real changes made)
(3,938 real changes made)
(3,754 real changes made)
(4,889 real changes made)
(26,899 missing values generated)
(3,938 real changes made)
(3,754 real changes made)
(7,692 real changes made)
(22,010 real changes made)
(19,207 missing values generated)
(7,602 real changes made)
(3,938 real changes made)
(6,065 real changes made, 6,065 to missing)
(19,335 missing values generated)
(26,899 missing values generated)
(3,846 real changes made)
(3,718 real changes made)
(3,846 real changes made)
(3,718 real changes made)
(4,785 real changes made)
(26,899 missing values generated)
(3,846 real changes made)
(3,718 real changes made)
(7,564 real changes made)
(22,114 real changes made)
(19,335 missing values generated)
(7,469 real changes made)
(3,846 real changes made)
(5,988 real changes made, 5,988 to missing)
(19,258 missing values generated)
(26,899 missing values generated)
(3,864 real changes made)
(3,777 real changes made)
(3,864 real changes made)
(3,777 real changes made)
(4,839 real changes made)
(26,899 missing values generated)
(3,864 real changes made)
(3,777 real changes made)
(7,641 real changes made)
(22,060 real changes made)
(19,258 missing values generated)
(7,557 real changes made)
(3,864 real changes made)
(6,042 real changes made, 6,042 to missing)
(19,312 missing values generated)
(26,899 missing values generated)
(3,920 real changes made)
(3,667 real changes made)
(3,920 real changes made)
(3,667 real changes made)
(4,762 real changes made)
(26,899 missing values generated)
(3,920 real changes made)
(3,667 real changes made)
(7,587 real changes made)
(22,137 real changes made)
(19,312 missing values generated)
(7,499 real changes made)
(3,920 real changes made)
(5,972 real changes made, 5,972 to missing)
(19,242 missing values generated)
(26,899 missing values generated)
(3,977 real changes made)
(3,680 real changes made)
(3,977 real changes made)
(3,680 real changes made)
(4,871 real changes made)
(26,899 missing values generated)
(3,977 real changes made)
(3,680 real changes made)
(7,657 real changes made)
(22,028 real changes made)
(19,242 missing values generated)
(7,566 real changes made)
(3,977 real changes made)
(6,029 real changes made, 6,029 to missing)
(19,299 missing values generated)
(26,899 missing values generated)
(3,917 real changes made)
(3,683 real changes made)
(3,917 real changes made)
(3,683 real changes made)
(4,830 real changes made)
(26,899 missing values generated)
(3,917 real changes made)
(3,683 real changes made)
(7,600 real changes made)
(22,069 real changes made)
(19,299 missing values generated)
(7,513 real changes made)
(3,917 real changes made)
(5,924 real changes made, 5,924 to missing)
(19,194 missing values generated)
(26,899 missing values generated)
(3,949 real changes made)
(3,756 real changes made)
(3,949 real changes made)
(3,756 real changes made)
(4,875 real changes made)
(26,899 missing values generated)
(3,949 real changes made)
(3,756 real changes made)
(7,705 real changes made)
(22,024 real changes made)
(19,194 missing values generated)
(7,612 real changes made)
(3,949 real changes made)
(5,933 real changes made, 5,933 to missing)
(19,203 missing values generated)
(26,899 missing values generated)
(3,855 real changes made)
(3,841 real changes made)
(3,855 real changes made)
(3,841 real changes made)
(4,910 real changes made)
(26,899 missing values generated)
(3,855 real changes made)
(3,841 real changes made)
(7,696 real changes made)
(21,989 real changes made)
(19,203 missing values generated)
(7,597 real changes made)
(3,855 real changes made)
(6,094 real changes made, 6,094 to missing)
(19,364 missing values generated)
(26,899 missing values generated)
(3,821 real changes made)
(3,714 real changes made)
(3,821 real changes made)
(3,714 real changes made)
(4,791 real changes made)
(26,899 missing values generated)
(3,821 real changes made)
(3,714 real changes made)
(7,535 real changes made)
(22,108 real changes made)
(19,364 missing values generated)
(7,439 real changes made)
(3,821 real changes made)
(6,089 real changes made, 6,089 to missing)
(19,359 missing values generated)
(26,899 missing values generated)
(3,769 real changes made)
(3,771 real changes made)
(3,769 real changes made)
(3,771 real changes made)
(4,746 real changes made)
(26,899 missing values generated)
(3,769 real changes made)
(3,771 real changes made)
(7,540 real changes made)
(22,153 real changes made)
(19,359 missing values generated)
(7,454 real changes made)
(3,769 real changes made)
(5,959 real changes made, 5,959 to missing)
(19,229 missing values generated)
(26,899 missing values generated)
(3,931 real changes made)
(3,739 real changes made)
(3,931 real changes made)
(3,739 real changes made)
(4,773 real changes made)
(26,899 missing values generated)
(3,931 real changes made)
(3,739 real changes made)
(7,670 real changes made)
(22,126 real changes made)
(19,229 missing values generated)
(7,589 real changes made)
(3,931 real changes made)
(6,015 real changes made, 6,015 to missing)
(19,285 missing values generated)
(26,899 missing values generated)
(3,880 real changes made)
(3,734 real changes made)
(3,880 real changes made)
(3,734 real changes made)
(4,857 real changes made)
(26,899 missing values generated)
(3,880 real changes made)
(3,734 real changes made)
(7,614 real changes made)
(22,042 real changes made)
(19,285 missing values generated)
(7,522 real changes made)
(3,880 real changes made)
(5,954 real changes made, 5,954 to missing)
(19,224 missing values generated)
(26,899 missing values generated)
(3,926 real changes made)
(3,749 real changes made)
(3,926 real changes made)
(3,749 real changes made)
(4,849 real changes made)
(26,899 missing values generated)
(3,926 real changes made)
(3,749 real changes made)
(7,675 real changes made)
(22,050 real changes made)
(19,224 missing values generated)
(7,578 real changes made)
(3,926 real changes made)
(5,990 real changes made, 5,990 to missing)
(19,260 missing values generated)
(26,899 missing values generated)
(3,895 real changes made)
(3,744 real changes made)
(3,895 real changes made)
(3,744 real changes made)
(4,808 real changes made)
(26,899 missing values generated)
(3,895 real changes made)
(3,744 real changes made)
(7,639 real changes made)
(22,091 real changes made)
(19,260 missing values generated)
(7,534 real changes made)
(3,895 real changes made)
(6,037 real changes made, 6,037 to missing)
(19,307 missing values generated)
(26,899 missing values generated)
(3,898 real changes made)
(3,694 real changes made)
(3,898 real changes made)
(3,694 real changes made)
(4,802 real changes made)
(26,899 missing values generated)
(3,898 real changes made)
(3,694 real changes made)
(7,592 real changes made)
(22,097 real changes made)
(19,307 missing values generated)
(7,509 real changes made)
(3,898 real changes made)
(6,029 real changes made, 6,029 to missing)
(19,299 missing values generated)
(26,899 missing values generated)
(3,888 real changes made)
(3,712 real changes made)
(3,888 real changes made)
(3,712 real changes made)
(4,823 real changes made)
(26,899 missing values generated)
(3,888 real changes made)
(3,712 real changes made)
(7,600 real changes made)
(22,076 real changes made)
(19,299 missing values generated)
(7,519 real changes made)
(3,888 real changes made)
(6,077 real changes made, 6,077 to missing)
(19,347 missing values generated)
(26,899 missing values generated)
(3,871 real changes made)
(3,681 real changes made)
(3,871 real changes made)
(3,681 real changes made)
(4,819 real changes made)
(26,899 missing values generated)
(3,871 real changes made)
(3,681 real changes made)
(7,552 real changes made)
(22,080 real changes made)
(19,347 missing values generated)
(7,454 real changes made)
(3,871 real changes made)
(5,964 real changes made, 5,964 to missing)
(19,234 missing values generated)
(26,899 missing values generated)
(3,944 real changes made)
(3,721 real changes made)
(3,944 real changes made)
(3,721 real changes made)
(4,906 real changes made)
(26,899 missing values generated)
(3,944 real changes made)
(3,721 real changes made)
(7,665 real changes made)
(21,993 real changes made)
(19,234 missing values generated)
(7,583 real changes made)
(3,944 real changes made)
(6,048 real changes made, 6,048 to missing)
(19,318 missing values generated)
(26,899 missing values generated)
(3,866 real changes made)
(3,715 real changes made)
(3,866 real changes made)
(3,715 real changes made)
(4,833 real changes made)
(26,899 missing values generated)
(3,866 real changes made)
(3,715 real changes made)
(7,581 real changes made)
(22,066 real changes made)
(19,318 missing values generated)
(7,496 real changes made)
(3,866 real changes made)
(6,028 real changes made, 6,028 to missing)
(19,298 missing values generated)
(26,899 missing values generated)
(3,870 real changes made)
(3,731 real changes made)
(3,870 real changes made)
(3,731 real changes made)
(4,780 real changes made)
(26,899 missing values generated)
(3,870 real changes made)
(3,731 real changes made)
(7,601 real changes made)
(22,119 real changes made)
(19,298 missing values generated)
(7,521 real changes made)
(3,870 real changes made)
(5,888 real changes made, 5,888 to missing)
(19,158 missing values generated)
(26,899 missing values generated)
(3,952 real changes made)
(3,789 real changes made)
(3,952 real changes made)
(3,789 real changes made)
(4,955 real changes made)
(26,899 missing values generated)
(3,952 real changes made)
(3,789 real changes made)
(7,741 real changes made)
(21,944 real changes made)
(19,158 missing values generated)
(7,650 real changes made)
(3,952 real changes made)
(5,926 real changes made, 5,926 to missing)
(19,196 missing values generated)
(26,899 missing values generated)
(3,959 real changes made)
(3,744 real changes made)
(3,959 real changes made)
(3,744 real changes made)
(4,838 real changes made)
(26,899 missing values generated)
(3,959 real changes made)
(3,744 real changes made)
(7,703 real changes made)
(22,061 real changes made)
(19,196 missing values generated)
(7,613 real changes made)
(3,959 real changes made)
(5,991 real changes made, 5,991 to missing)
(19,261 missing values generated)
(26,899 missing values generated)
(3,900 real changes made)
(3,738 real changes made)
(3,900 real changes made)
(3,738 real changes made)
(4,724 real changes made)
(26,899 missing values generated)
(3,900 real changes made)
(3,738 real changes made)
(7,638 real changes made)
(22,175 real changes made)
(19,261 missing values generated)
(7,550 real changes made)
(3,900 real changes made)
(6,041 real changes made, 6,041 to missing)
(19,311 missing values generated)
(26,899 missing values generated)
(3,911 real changes made)
(3,677 real changes made)
(3,911 real changes made)
(3,677 real changes made)
(4,791 real changes made)
(26,899 missing values generated)
(3,911 real changes made)
(3,677 real changes made)
(7,588 real changes made)
(22,108 real changes made)
(19,311 missing values generated)
(7,506 real changes made)
(3,911 real changes made)
(6,061 real changes made, 6,061 to missing)
(19,331 missing values generated)
(26,899 missing values generated)
(3,863 real changes made)
(3,705 real changes made)
(3,863 real changes made)
(3,705 real changes made)
(4,807 real changes made)
(26,899 missing values generated)
(3,863 real changes made)
(3,705 real changes made)
(7,568 real changes made)
(22,092 real changes made)
(19,331 missing values generated)
(7,473 real changes made)
(3,863 real changes made)
(5,989 real changes made, 5,989 to missing)
(19,259 missing values generated)
(26,899 missing values generated)
(3,920 real changes made)
(3,720 real changes made)
(3,920 real changes made)
(3,720 real changes made)
(4,908 real changes made)
(26,899 missing values generated)
(3,920 real changes made)
(3,720 real changes made)
(7,640 real changes made)
(21,991 real changes made)
(19,259 missing values generated)
(7,547 real changes made)
(3,920 real changes made)
(5,921 real changes made, 5,921 to missing)
(19,191 missing values generated)
(26,899 missing values generated)
(3,917 real changes made)
(3,791 real changes made)
(3,917 real changes made)
(3,791 real changes made)
(4,873 real changes made)
(26,899 missing values generated)
(3,917 real changes made)
(3,791 real changes made)
(7,708 real changes made)
(22,026 real changes made)
(19,191 missing values generated)
(7,611 real changes made)
(3,917 real changes made)
(6,015 real changes made, 6,015 to missing)
(19,285 missing values generated)
(26,899 missing values generated)
(3,926 real changes made)
(3,688 real changes made)
(3,926 real changes made)
(3,688 real changes made)
(4,808 real changes made)
(26,899 missing values generated)
(3,926 real changes made)
(3,688 real changes made)
(7,614 real changes made)
(22,091 real changes made)
(19,285 missing values generated)
(7,527 real changes made)
(3,926 real changes made)
(6,101 real changes made, 6,101 to missing)
(19,371 missing values generated)
(26,899 missing values generated)
(3,793 real changes made)
(3,735 real changes made)
(3,793 real changes made)
(3,735 real changes made)
(4,728 real changes made)
(26,899 missing values generated)
(3,793 real changes made)
(3,735 real changes made)
(7,528 real changes made)
(22,171 real changes made)
(19,371 missing values generated)
(7,449 real changes made)
(3,793 real changes made)
(5,956 real changes made, 5,956 to missing)
(19,226 missing values generated)
(26,899 missing values generated)
(3,927 real changes made)
(3,746 real changes made)
(3,927 real changes made)
(3,746 real changes made)
(4,833 real changes made)
(26,899 missing values generated)
(3,927 real changes made)
(3,746 real changes made)
(7,673 real changes made)
(22,066 real changes made)
(19,226 missing values generated)
(7,583 real changes made)
(3,927 real changes made)
(5,812 real changes made, 5,812 to missing)
(19,441 missing values generated)
(26,899 missing values generated)
(3,821 real changes made)
(3,637 real changes made)
(3,821 real changes made)
(3,637 real changes made)
(4,766 real changes made)
(26,899 missing values generated)
(3,821 real changes made)
(3,637 real changes made)
(7,458 real changes made)
(22,133 real changes made)
(19,441 missing values generated)
(7,363 real changes made)
(3,821 real changes made)
(5,821 real changes made, 5,821 to missing)
(19,450 missing values generated)
(26,899 missing values generated)
(3,871 real changes made)
(3,578 real changes made)
(3,871 real changes made)
(3,578 real changes made)
(4,770 real changes made)
(26,899 missing values generated)
(3,871 real changes made)
(3,578 real changes made)
(7,449 real changes made)
(22,129 real changes made)
(19,450 missing values generated)
(7,365 real changes made)
(3,871 real changes made)
(5,804 real changes made, 5,804 to missing)
(19,433 missing values generated)
(26,899 missing values generated)
(3,770 real changes made)
(3,696 real changes made)
(3,770 real changes made)
(3,696 real changes made)
(4,689 real changes made)
(26,899 missing values generated)
(3,770 real changes made)
(3,696 real changes made)
(7,466 real changes made)
(22,210 real changes made)
(19,433 missing values generated)
(7,381 real changes made)
(3,770 real changes made)
(5,875 real changes made, 5,875 to missing)
(19,504 missing values generated)
(26,899 missing values generated)
(3,786 real changes made)
(3,609 real changes made)
(3,786 real changes made)
(3,609 real changes made)
(4,692 real changes made)
(26,899 missing values generated)
(3,786 real changes made)
(3,609 real changes made)
(7,395 real changes made)
(22,207 real changes made)
(19,504 missing values generated)
(7,306 real changes made)
(3,786 real changes made)
(5,945 real changes made, 5,945 to missing)
(19,574 missing values generated)
(26,899 missing values generated)
(3,738 real changes made)
(3,587 real changes made)
(3,738 real changes made)
(3,587 real changes made)
(4,646 real changes made)
(26,899 missing values generated)
(3,738 real changes made)
(3,587 real changes made)
(7,325 real changes made)
(22,253 real changes made)
(19,574 missing values generated)
(7,233 real changes made)
(3,738 real changes made)
(5,846 real changes made, 5,846 to missing)
(19,475 missing values generated)
(26,899 missing values generated)
(3,818 real changes made)
(3,606 real changes made)
(3,818 real changes made)
(3,606 real changes made)
(4,766 real changes made)
(26,899 missing values generated)
(3,818 real changes made)
(3,606 real changes made)
(7,424 real changes made)
(22,133 real changes made)
(19,475 missing values generated)
(7,328 real changes made)
(3,818 real changes made)
(5,810 real changes made, 5,810 to missing)
(19,439 missing values generated)
(26,899 missing values generated)
(3,834 real changes made)
(3,626 real changes made)
(3,834 real changes made)
(3,626 real changes made)
(4,713 real changes made)
(26,899 missing values generated)
(3,834 real changes made)
(3,626 real changes made)
(7,460 real changes made)
(22,186 real changes made)
(19,439 missing values generated)
(7,363 real changes made)
(3,834 real changes made)
(5,752 real changes made, 5,752 to missing)
(19,381 missing values generated)
(26,899 missing values generated)
(3,895 real changes made)
(3,623 real changes made)
(3,895 real changes made)
(3,623 real changes made)
(4,743 real changes made)
(26,899 missing values generated)
(3,895 real changes made)
(3,623 real changes made)
(7,518 real changes made)
(22,156 real changes made)
(19,381 missing values generated)
(7,427 real changes made)
(3,895 real changes made)
(5,793 real changes made, 5,793 to missing)
(19,422 missing values generated)
(26,899 missing values generated)
(3,803 real changes made)
(3,674 real changes made)
(3,803 real changes made)
(3,674 real changes made)
(4,765 real changes made)
(26,899 missing values generated)
(3,803 real changes made)
(3,674 real changes made)
(7,477 real changes made)
(22,134 real changes made)
(19,422 missing values generated)
(7,382 real changes made)
(3,803 real changes made)
(5,917 real changes made, 5,917 to missing)
(19,546 missing values generated)
(26,899 missing values generated)
(3,732 real changes made)
(3,621 real changes made)
(3,732 real changes made)
(3,621 real changes made)
(4,575 real changes made)
(26,899 missing values generated)
(3,732 real changes made)
(3,621 real changes made)
(7,353 real changes made)
(22,324 real changes made)
(19,546 missing values generated)
(7,279 real changes made)
(3,732 real changes made)
(5,884 real changes made, 5,884 to missing)
(19,513 missing values generated)
(26,899 missing values generated)
(3,771 real changes made)
(3,615 real changes made)
(3,771 real changes made)
(3,615 real changes made)
(4,702 real changes made)
(26,899 missing values generated)
(3,771 real changes made)
(3,615 real changes made)
(7,386 real changes made)
(22,197 real changes made)
(19,513 missing values generated)
(7,298 real changes made)
(3,771 real changes made)
(5,779 real changes made, 5,779 to missing)
(19,408 missing values generated)
(26,899 missing values generated)
(3,893 real changes made)
(3,598 real changes made)
(3,893 real changes made)
(3,598 real changes made)
(4,778 real changes made)
(26,899 missing values generated)
(3,893 real changes made)
(3,598 real changes made)
(7,491 real changes made)
(22,121 real changes made)
(19,408 missing values generated)
(7,414 real changes made)
(3,893 real changes made)
(5,817 real changes made, 5,817 to missing)
(19,446 missing values generated)
(26,899 missing values generated)
(3,848 real changes made)
(3,605 real changes made)
(3,848 real changes made)
(3,605 real changes made)
(4,697 real changes made)
(26,899 missing values generated)
(3,848 real changes made)
(3,605 real changes made)
(7,453 real changes made)
(22,202 real changes made)
(19,446 missing values generated)
(7,363 real changes made)
(3,848 real changes made)
(5,764 real changes made, 5,764 to missing)
(19,393 missing values generated)
(26,899 missing values generated)
(3,795 real changes made)
(3,711 real changes made)
(3,795 real changes made)
(3,711 real changes made)
(4,726 real changes made)
(26,899 missing values generated)
(3,795 real changes made)
(3,711 real changes made)
(7,506 real changes made)
(22,173 real changes made)
(19,393 missing values generated)
(7,418 real changes made)
(3,795 real changes made)
(5,830 real changes made, 5,830 to missing)
(19,459 missing values generated)
(26,899 missing values generated)
(3,846 real changes made)
(3,594 real changes made)
(3,846 real changes made)
(3,594 real changes made)
(4,668 real changes made)
(26,899 missing values generated)
(3,846 real changes made)
(3,594 real changes made)
(7,440 real changes made)
(22,231 real changes made)
(19,459 missing values generated)
(7,344 real changes made)
(3,846 real changes made)
(5,854 real changes made, 5,854 to missing)
(19,483 missing values generated)
(26,899 missing values generated)
(3,833 real changes made)
(3,583 real changes made)
(3,833 real changes made)
(3,583 real changes made)
(4,705 real changes made)
(26,899 missing values generated)
(3,833 real changes made)
(3,583 real changes made)
(7,416 real changes made)
(22,194 real changes made)
(19,483 missing values generated)
(7,319 real changes made)
(3,833 real changes made)
(5,829 real changes made, 5,829 to missing)
(19,458 missing values generated)
(26,899 missing values generated)
(3,804 real changes made)
(3,637 real changes made)
(3,804 real changes made)
(3,637 real changes made)
(4,702 real changes made)
(26,899 missing values generated)
(3,804 real changes made)
(3,637 real changes made)
(7,441 real changes made)
(22,197 real changes made)
(19,458 missing values generated)
(7,356 real changes made)
(3,804 real changes made)
(5,838 real changes made, 5,838 to missing)
(19,467 missing values generated)
(26,899 missing values generated)
(3,820 real changes made)
(3,612 real changes made)
(3,820 real changes made)
(3,612 real changes made)
(4,667 real changes made)
(26,899 missing values generated)
(3,820 real changes made)
(3,612 real changes made)
(7,432 real changes made)
(22,232 real changes made)
(19,467 missing values generated)
(7,342 real changes made)
(3,820 real changes made)
(5,873 real changes made, 5,873 to missing)
(19,502 missing values generated)
(26,899 missing values generated)
(3,819 real changes made)
(3,578 real changes made)
(3,819 real changes made)
(3,578 real changes made)
(4,683 real changes made)
(26,899 missing values generated)
(3,819 real changes made)
(3,578 real changes made)
(7,397 real changes made)
(22,216 real changes made)
(19,502 missing values generated)
(7,296 real changes made)
(3,819 real changes made)
(5,848 real changes made, 5,848 to missing)
(19,477 missing values generated)
(26,899 missing values generated)
(3,835 real changes made)
(3,587 real changes made)
(3,835 real changes made)
(3,587 real changes made)
(4,675 real changes made)
(26,899 missing values generated)
(3,835 real changes made)
(3,587 real changes made)
(7,422 real changes made)
(22,224 real changes made)
(19,477 missing values generated)
(7,334 real changes made)
(3,835 real changes made)
(5,857 real changes made, 5,857 to missing)
(19,486 missing values generated)
(26,899 missing values generated)
(3,775 real changes made)
(3,638 real changes made)
(3,775 real changes made)
(3,638 real changes made)
(4,707 real changes made)
(26,899 missing values generated)
(3,775 real changes made)
(3,638 real changes made)
(7,413 real changes made)
(22,192 real changes made)
(19,486 missing values generated)
(7,313 real changes made)
(3,775 real changes made)
(5,801 real changes made, 5,801 to missing)
(19,430 missing values generated)
(26,899 missing values generated)
(3,771 real changes made)
(3,698 real changes made)
(3,771 real changes made)
(3,698 real changes made)
(4,721 real changes made)
(26,899 missing values generated)
(3,771 real changes made)
(3,698 real changes made)
(7,469 real changes made)
(22,178 real changes made)
(19,430 missing values generated)
(7,381 real changes made)
(3,771 real changes made)
(5,837 real changes made, 5,837 to missing)
(19,466 missing values generated)
(26,899 missing values generated)
(3,808 real changes made)
(3,625 real changes made)
(3,808 real changes made)
(3,625 real changes made)
(4,713 real changes made)
(26,899 missing values generated)
(3,808 real changes made)
(3,625 real changes made)
(7,433 real changes made)
(22,186 real changes made)
(19,466 missing values generated)
(7,346 real changes made)
(3,808 real changes made)
(5,858 real changes made, 5,858 to missing)
(19,487 missing values generated)
(26,899 missing values generated)
(3,809 real changes made)
(3,603 real changes made)
(3,809 real changes made)
(3,603 real changes made)
(4,701 real changes made)
(26,899 missing values generated)
(3,809 real changes made)
(3,603 real changes made)
(7,412 real changes made)
(22,198 real changes made)
(19,487 missing values generated)
(7,323 real changes made)
(3,809 real changes made)
(5,859 real changes made, 5,859 to missing)
(19,488 missing values generated)
(26,899 missing values generated)
(3,805 real changes made)
(3,606 real changes made)
(3,805 real changes made)
(3,606 real changes made)
(4,643 real changes made)
(26,899 missing values generated)
(3,805 real changes made)
(3,606 real changes made)
(7,411 real changes made)
(22,256 real changes made)
(19,488 missing values generated)
(7,317 real changes made)
(3,805 real changes made)
(5,756 real changes made, 5,756 to missing)
(19,385 missing values generated)
(26,899 missing values generated)
(3,870 real changes made)
(3,644 real changes made)
(3,870 real changes made)
(3,644 real changes made)
(4,774 real changes made)
(26,899 missing values generated)
(3,870 real changes made)
(3,644 real changes made)
(7,514 real changes made)
(22,125 real changes made)
(19,385 missing values generated)
(7,430 real changes made)
(3,870 real changes made)
(5,852 real changes made, 5,852 to missing)
(19,481 missing values generated)
(26,899 missing values generated)
(3,830 real changes made)
(3,588 real changes made)
(3,830 real changes made)
(3,588 real changes made)
(4,606 real changes made)
(26,899 missing values generated)
(3,830 real changes made)
(3,588 real changes made)
(7,418 real changes made)
(22,293 real changes made)
(19,481 missing values generated)
(7,337 real changes made)
(3,830 real changes made)
(5,825 real changes made, 5,825 to missing)
(19,454 missing values generated)
(26,899 missing values generated)
(3,777 real changes made)
(3,668 real changes made)
(3,777 real changes made)
(3,668 real changes made)
(4,678 real changes made)
(26,899 missing values generated)
(3,777 real changes made)
(3,668 real changes made)
(7,445 real changes made)
(22,221 real changes made)
(19,454 missing values generated)
(7,357 real changes made)
(3,777 real changes made)
(5,893 real changes made, 5,893 to missing)
(19,522 missing values generated)
(26,899 missing values generated)
(3,796 real changes made)
(3,581 real changes made)
(3,796 real changes made)
(3,581 real changes made)
(4,699 real changes made)
(26,899 missing values generated)
(3,796 real changes made)
(3,581 real changes made)
(7,377 real changes made)
(22,200 real changes made)
(19,522 missing values generated)
(7,292 real changes made)
(3,796 real changes made)
(5,941 real changes made, 5,941 to missing)
(19,570 missing values generated)
(26,899 missing values generated)
(3,723 real changes made)
(3,606 real changes made)
(3,723 real changes made)
(3,606 real changes made)
(4,625 real changes made)
(26,899 missing values generated)
(3,723 real changes made)
(3,606 real changes made)
(7,329 real changes made)
(22,274 real changes made)
(19,570 missing values generated)
(7,253 real changes made)
(3,723 real changes made)
(5,679 real changes made, 5,679 to missing)
(19,308 missing values generated)
(26,899 missing values generated)
(3,858 real changes made)
(3,733 real changes made)
(3,858 real changes made)
(3,733 real changes made)
(4,818 real changes made)
(26,899 missing values generated)
(3,858 real changes made)
(3,733 real changes made)
(7,591 real changes made)
(22,081 real changes made)
(19,308 missing values generated)
(7,491 real changes made)
(3,858 real changes made)
(5,905 real changes made, 5,905 to missing)
(19,534 missing values generated)
(26,899 missing values generated)
(3,779 real changes made)
(3,586 real changes made)
(3,779 real changes made)
(3,586 real changes made)
(4,702 real changes made)
(26,899 missing values generated)
(3,779 real changes made)
(3,586 real changes made)
(7,365 real changes made)
(22,197 real changes made)
(19,534 missing values generated)
(7,282 real changes made)
(3,779 real changes made)
(5,812 real changes made, 5,812 to missing)
(19,441 missing values generated)
(26,899 missing values generated)
(3,865 real changes made)
(3,593 real changes made)
(3,865 real changes made)
(3,593 real changes made)
(4,721 real changes made)
(26,899 missing values generated)
(3,865 real changes made)
(3,593 real changes made)
(7,458 real changes made)
(22,178 real changes made)
(19,441 missing values generated)
(7,364 real changes made)
(3,865 real changes made)

. 
. replace index_date = index_date_28
(25,109 real changes made)

. drop index_date_28

. gen egfr15_date=.
(26,899 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan20
> 19 feb2019 mar2019 apr2019 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2
> 021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatinine_`x'<15 & date("01`x'", "DMY")>index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen index_date_esrd = index_date
(1,790 missing values generated)

. gen esrd_date = egfr15_date
(26,898 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if krt_date < egfr15_date
(2,119 real changes made)

. replace esrd_date = krt_date if esrd_date==.
(0 real changes made)

. gen esrd = 0

. replace esrd = 1 if esrd_date!=.
(2,120 real changes made)

. label var esrd "Kidney failure"

. gen esrd_time = (esrd_date - index_date_esrd)
(24,779 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(24,779 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(2,117 changes made to esrd_time_cat)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"                      ///
>                                                         3 "1 to 28 days"        ///
>                                                         4 "20 to 90 days"       ///
>                                                         5 "91 to 180 days"      ///
>                                                         6 "181 to 365 days"     ///
>                                                         7 "366 to 730 days"     ///
>                                                         8 "731 to 973 days"     ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 critical_care   ///
>                                                                 krt             {
  2.                                                                 by `exposure',sort: sum esrd_time, de
  3.                                                                 tab esrd_time_cat `exposure', m col chi
  4.                                                                 }

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Pneumonia (pre-pandemic)

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            4              1
10%           34              1       Obs               1,145
25%          127              1       Sum of wgt.       1,145

50%          311                      Mean           348.6699
                        Largest       Std. dev.       259.756
75%          542            999
90%          738           1001       Variance       67473.19
95%          830           1007       Skewness       .5108991
99%          959           1019       Kurtosis       2.281311

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           32              1       Obs                 975
25%          140              1       Sum of wgt.         975

50%          312                      Mean           358.3241
                        Largest       Std. dev.      263.6389
75%          562           1018
90%          740           1020       Variance       69505.45
95%          838           1022       Skewness       .4624043
99%          970           1051       Kurtosis       2.188163


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Pneumonia   COVID-19 |     Total
----------------+----------------------+----------
   1 to 28 days |       107         95 |       202 
                |      0.79       0.72 |      0.75 
----------------+----------------------+----------
  20 to 90 days |       121         92 |       213 
                |      0.89       0.69 |      0.79 
----------------+----------------------+----------
 91 to 180 days |       152        128 |       280 
                |      1.12       0.96 |      1.04 
----------------+----------------------+----------
181 to 365 days |       276        233 |       509 
                |      2.03       1.76 |      1.89 
----------------+----------------------+----------
366 to 730 days |       369        321 |       690 
                |      2.71       2.42 |      2.57 
----------------+----------------------+----------
731 to 973 days |       110         97 |       207 
                |      0.81       0.73 |      0.77 
----------------+----------------------+----------
      >973 days |        10          9 |        19 
                |      0.07       0.07 |      0.07 
----------------+----------------------+----------
              . |    12,484     12,295 |    24,779 
                |     91.60      92.65 |     92.12 
----------------+----------------------+----------
          Total |    13,629     13,270 |    26,899 
                |    100.00     100.00 |    100.00 

          Pearson chi2(7) =  11.2115   Pr = 0.130

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> critical_care = Ward-based

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           35              1       Obs               1,915
25%          136              1       Sum of wgt.       1,915

50%          316                      Mean           355.7551
                        Largest       Std. dev.      261.1561
75%          551           1019
90%          739           1020       Variance        68202.5
95%          833           1022       Skewness       .4741846
99%          963           1051       Kurtosis       2.229677

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> critical_care = Critical care

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           15              1       Obs                 205
25%          112              1       Sum of wgt.         205

50%          260                      Mean              328.4
                        Largest       Std. dev.      264.3765
75%          513            914
90%          742            929       Variance       69894.93
95%          831           1005       Skewness       .6333457
99%          929           1018       Kurtosis       2.352478


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |     Critical care
  esrd_time_cat | Ward-base  Critical  |     Total
----------------+----------------------+----------
   1 to 28 days |       177         25 |       202 
                |      0.73       0.96 |      0.75 
----------------+----------------------+----------
  20 to 90 days |       191         22 |       213 
                |      0.79       0.84 |      0.79 
----------------+----------------------+----------
 91 to 180 days |       249         31 |       280 
                |      1.03       1.19 |      1.04 
----------------+----------------------+----------
181 to 365 days |       462         47 |       509 
                |      1.90       1.80 |      1.89 
----------------+----------------------+----------
366 to 730 days |       633         57 |       690 
                |      2.61       2.19 |      2.57 
----------------+----------------------+----------
731 to 973 days |       186         21 |       207 
                |      0.77       0.81 |      0.77 
----------------+----------------------+----------
      >973 days |        17          2 |        19 
                |      0.07       0.08 |      0.07 
----------------+----------------------+----------
              . |    22,377      2,402 |    24,779 
                |     92.12      92.14 |     92.12 
----------------+----------------------+----------
          Total |    24,292      2,607 |    26,899 
                |    100.00     100.00 |    100.00 

          Pearson chi2(7) =   4.1707   Pr = 0.760

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = No AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           30              1       Obs               1,246
25%          135              1       Sum of wgt.       1,246

50%          320                      Mean           358.7793
                        Largest       Std. dev.      265.3831
75%          554           1019
90%          755           1020       Variance        70428.2
95%          838           1022       Skewness       .4717408
99%          975           1051       Kurtosis        2.21498

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = AKI without KRT

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           37              1       Obs                 830
25%          130              1       Sum of wgt.         830

50%        304.5                      Mean           347.1349
                        Largest       Std. dev.      255.5648
75%          548            987
90%        718.5            993       Variance       65313.38
95%          822            995       Skewness       .4883637
99%          932           1018       Kurtosis       2.235745

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = AKI requiring KRT

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            4              3
10%           22              4       Obs                  44
25%          101             16       Sum of wgt.          44

50%          207                      Mean           305.2727
                        Largest       Std. dev.      261.4113
75%          459            778
90%          745            876       Variance       68335.88
95%          876            894       Skewness       .9192012
99%          959            959       Kurtosis        2.95542


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |    Kidney replacement therapy
  esrd_time_cat |    No AKI  AKI witho  AKI requi |     Total
----------------+---------------------------------+----------
   1 to 28 days |       124         73          5 |       202 
                |      0.78       0.69       0.93 |      0.75 
----------------+---------------------------------+----------
  20 to 90 days |       120         87          6 |       213 
                |      0.76       0.83       1.12 |      0.79 
----------------+---------------------------------+----------
 91 to 180 days |       158        114          8 |       280 
                |      1.00       1.08       1.50 |      1.04 
----------------+---------------------------------+----------
181 to 365 days |       295        206          8 |       509 
                |      1.86       1.96       1.50 |      1.89 
----------------+---------------------------------+----------
366 to 730 days |       407        271         12 |       690 
                |      2.57       2.58       2.24 |      2.57 
----------------+---------------------------------+----------
731 to 973 days |       129         73          5 |       207 
                |      0.81       0.69       0.93 |      0.77 
----------------+---------------------------------+----------
      >973 days |        13          6          0 |        19 
                |      0.08       0.06       0.00 |      0.07 
----------------+---------------------------------+----------
              . |    14,602      9,686        491 |    24,779 
                |     92.14      92.11      91.78 |     92.12 
----------------+---------------------------------+----------
          Total |    15,848     10,516        535 |    26,899 
                |    100.00     100.00     100.00 |    100.00 

         Pearson chi2(14) =   6.9039   Pr = 0.938

.         
. * Exit date
. gen exit_date_esrd = esrd_date
(24,779 missing values generated)

. format exit_date_esrd %td

. gen end_date = date("2022-11-30", "YMD") if case==1
(13,629 missing values generated)

. replace end_date = date("2019-11-30", "YMD") if case==0
(13,629 real changes made)

. format end_date %td

. replace exit_date_esrd = min(deregistered_date, death_date, end_date) if esrd_date==.
(24,779 real changes made)

. gen esrd_denominator = 1

. gen follow_up_time_esrd = (exit_date_esrd - index_date_esrd)
(1,790 missing values generated)

. label var follow_up_time_esrd "Follow-up time (ESRD) (Days)"

. gen follow_up_cat_esrd = follow_up_time_esrd
(1,790 missing values generated)

. recode follow_up_cat_esrd       min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0=3                     ///
>                                                 1/365=4         ///
>                                                 366/730=5       ///
>                                                 731/1040=6      ///                                     
>                                                 1041/max=7
(25,077 changes made to follow_up_cat_esrd)

. label define follow_up_cat_esrd         1 "<-29 days"   ///
>                                                         2 "-28 to -1 days"              ///
>                                                         3 "0 days"                              ///
>                                                         4 "1 to 365 days"               ///
>                                                         5 "366 to 730 days"     ///
>                                                         6 "731 to 1040 days"    ///
>                                                         7 ">1040 days"

. label values follow_up_cat_esrd follow_up_cat_esrd

. label var follow_up_cat_esrd "Follow_up time"

. tab case follow_up_cat_esrd

                      |                                Follow_up time
                 case | <-29 days  -28 to -1     0 days  1 to 365   366 to 73  731 to 10  >1040 day |     Total
----------------------+-----------------------------------------------------------------------------+----------
Pneumonia (pre-pandem |         0        290          9      5,426      4,804      3,100          0 |    13,629 
             COVID-19 |       299        245          8      4,422      3,925      2,580          1 |    11,480 
----------------------+-----------------------------------------------------------------------------+----------
                Total |       299        535         17      9,848      8,729      5,680          1 |    25,109 

. drop if follow_up_time_esrd<1
(851 observations deleted)

. drop if follow_up_time_esrd>1040
(1,791 observations deleted)

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Pneumonia (pre-pandem |     5,426      4,804      3,100 |    13,330 
             COVID-19 |     4,422      3,925      2,580 |    10,927 
----------------------+---------------------------------+----------
                Total |     9,848      8,729      5,680 |    24,257 

. * Time zero variable to account for differences in length of follow-up
. gen time_zero_esrd = date("2000-01-01", "YMD")

. gen time_end_esrd = time_zero_esrd + follow_up_time_esrd

. gen time_esrd = time_zero_esrd + esrd_time
(22,138 missing values generated)

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(24,257 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan20
> 19 feb2019 mar2019 apr2019 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2
> 021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_half_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>index_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(9 real changes made)
(30 real changes made)
(54 real changes made)
(58 real changes made)
(62 real changes made)
(66 real changes made)
(64 real changes made)
(62 real changes made)
(92 real changes made)
(97 real changes made)
(86 real changes made)
(85 real changes made)
(90 real changes made)
(88 real changes made)
(101 real changes made)
(82 real changes made)
(98 real changes made)
(129 real changes made)
(102 real changes made)
(97 real changes made)
(121 real changes made)
(123 real changes made)
(99 real changes made)
(100 real changes made)
(130 real changes made)
(111 real changes made)
(104 real changes made)
(115 real changes made)
(101 real changes made)
(109 real changes made)
(0 real changes made)
(0 real changes made)
(17 real changes made)
(24 real changes made)
(36 real changes made)
(46 real changes made)
(47 real changes made)
(45 real changes made)
(52 real changes made)
(60 real changes made)
(64 real changes made)
(70 real changes made)
(55 real changes made)
(66 real changes made)
(72 real changes made)
(67 real changes made)
(72 real changes made)
(71 real changes made)
(73 real changes made)
(86 real changes made)
(75 real changes made)
(95 real changes made)
(98 real changes made)
(75 real changes made)
(76 real changes made)
(88 real changes made)
(108 real changes made)
(88 real changes made)
(93 real changes made)
(99 real changes made)
(109 real changes made)
(100 real changes made)
(78 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(1,620 real changes made)

. gen egfr_half = 0

. replace egfr_half = 1 if egfr_half_date!=.
(6,490 real changes made)

. label var egfr_half "50% reduction in eGFR"

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(10,824 real changes made, 10,824 to missing)

. gen egfr_half_time = (egfr_half_date - index_date_egfr_half)
(18,704 missing values generated)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(17,767 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date) if egfr_half_date==. & index_date_egfr_half!=.
(7,880 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(10,824 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days)"

. gen egfr_half_denominator = 0

. replace egfr_half_denominator = 1 if index_date_egfr_half!=.
(13,433 real changes made)

. gen time_zero_egfr_half = date("2000-01-01", "YMD")

. gen time_end_egfr_half = time_zero_egfr_half + follow_up_time_egfr_half
(10,824 missing values generated)

. gen time_egfr_half = time_zero_egfr_half + egfr_half_time
(18,704 missing values generated)

. 
. * AKI (or ESRD)
. gen index_date_aki = index_date

. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(21,840 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(1,912 real changes made)

. gen aki = 0

. replace aki = 1 if aki_date!=.
(4,329 real changes made)

. label var aki "Acute kidney injury"

. gen aki_time = (aki_date - index_date_aki)
(19,928 missing values generated)

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(19,928 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date)  if aki_date==.
(19,928 real changes made)

. gen aki_denominator = 1

. gen follow_up_time_aki = (exit_date_aki - index_date_aki)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. gen time_zero_aki = date("2000-01-01", "YMD")

. gen time_end_aki = time_zero_aki + follow_up_time_aki

. gen time_aki = time_zero_aki + aki_time
(19,928 missing values generated)

. 
. * Exit date (death)
. gen index_date_death = index_date

. gen exit_date_death = death_date
(23,089 missing values generated)

. gen death = 0

. replace death = 1 if death_date!=.
(1,168 real changes made)

. label var death "Death"

. gen death_time = (death_date - index_date_death)
(23,089 missing values generated)

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(23,089 real changes made)

. gen death_denominator = 1

. gen follow_up_time_death = (exit_date_death - index_date_death)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. gen time_zero_death = date("2000-01-01", "YMD")

. gen time_end_death = time_zero_death + follow_up_time_death

. gen time_death = time_zero_death + death_time
(23,089 missing values generated)

. 
. save ./output/analysis_hospitalised.dta, replace
file ./output/analysis_hospitalised.dta saved

. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_hospitalised.log
  log type:  text
 closed on:  25 Jul 2023, 17:05:09
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
