-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/analysis_hospitalised.log
  log type:  text
 opened on:   5 Apr 2023, 00:37:03

. 
. capture noisily import delimited ./output/input_covid_hospitalised.csv, clear
(118 vars, 50,000 obs)

. tempfile covid_hospitalised

. save `covid_hospitalised', replace
(note: file /tmp/St00016.000001 not found)
file /tmp/St00016.000001 saved

. di "COVID-19 hospitalised:"
COVID-19 hospitalised:

. safecount
  50,000

. 
. capture noisily import delimited ./output/input_pneumonia_hospitalised.csv, c
> lear
(114 vars, 50,000 obs)

. tempfile pneumonia_hospitalised

. save `pneumonia_hospitalised', replace
(note: file /tmp/St00016.000002 not found)
file /tmp/St00016.000002 saved

. di "Pneumonia hospitalised:"
Pneumonia hospitalised:

. safecount
  50,000

. 
. append using `covid_hospitalised', force

. 
. **ID
. * Need to create unique identifiers as individuals may be in both covid_hospi
> talised and pneumonia_hospitalised so will have the same patient_id
. gen unique = _n

. label var unique "Unique ID"

. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      4,922        4.92        4.92
 1 Most deprived |     18,988       18.99       23.91
               2 |     19,125       19.12       43.03
               3 |     19,020       19.02       62.05
               4 |     18,822       18.82       80.88
5 Least deprived |     19,123       19.12      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. drop if imd==0
(4,922 observations deleted)

. safetab imd
0

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |     18,988       19.97       19.97
               2 |     19,125       20.12       40.09
               3 |     19,020       20.00       60.09
               4 |     18,822       19.80       79.89
5 Least deprived |     19,123       20.11      100.00
-----------------+-----------------------------------
           Total |     95,078      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(95,077 missing values generated)

. replace stp1 = sum(stp1)
(95,077 real changes made)

. drop stp

. rename stp1 stp

. label define stp        1 "1"   ///
>                                         2 "2"   ///
>                                         3 "3"   ///
>                                         4 "4"   ///
>                                         5 "5"   ///
>                                         6 "6"   ///
>                                         7 "7"   ///
>                                         8 "8"   ///
>                                         9 "9"   ///
>                                         10 "10" ///
>                                         11 "11" ///                          
>            
>                                         12 "12" ///
>                                         13 "13" ///
>                                         14 "14" ///
>                                         15 "15" ///
>                                         16 "16" ///
>                                         17 "17" ///
>                                         18 "18" ///
>                                         19 "19" ///
>                                         20 "20" ///
>                                         21 "21" ///                          
>            
>                                         22 "22" ///
>                                         23 "23" ///
>                                         24 "24" ///
>                                         25 "25" ///
>                                         26 "26" ///
>                                         27 "27" ///
>                                         28 "28" ///
>                                         29 "29" ///
>                                         30 "30" ///
>                                         31 "31" 

. label values stp stp

. label var stp "STP"

. safetab stp
0

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     95,078      100.00      100.00
------------+-----------------------------------
      Total |     95,078      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(85,577 missing values generated)

. replace region = 2 if region_string=="East"
(9,364 real changes made)

. replace region = 3 if region_string=="London"
(19,232 real changes made)

. replace region = 4 if region_string=="North East"
(9,443 real changes made)

. replace region = 5 if region_string=="North West"
(9,603 real changes made)

. replace region = 6 if region_string=="South East"
(9,388 real changes made)

. replace region = 7 if region_string=="South West"
(9,434 real changes made)

. replace region = 8 if region_string=="West Midlands"
(9,506 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(9,607 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,501        9.99        9.99
                    East |      9,364        9.85       19.84
                  London |     19,232       20.23       40.07
              North East |      9,443        9.93       50.00
              North West |      9,603       10.10       60.10
              South East |      9,388        9.87       69.98
              South West |      9,434        9.92       79.90
           West Midlands |      9,506       10.00       89.90
Yorkshire and The Humber |      9,607       10.10      100.00
-------------------------+-----------------------------------
                   Total |     95,078      100.00

. drop if region==10
(0 observations deleted)

. safetab region
0

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,501        9.99        9.99
                    East |      9,364        9.85       19.84
                  London |     19,232       20.23       40.07
              North East |      9,443        9.93       50.00
              North West |      9,603       10.10       60.10
              South East |      9,388        9.87       69.98
              South West |      9,434        9.92       79.90
           West Midlands |      9,506       10.00       89.90
Yorkshire and The Humber |      9,607       10.10      100.00
-------------------------+-----------------------------------
                   Total |     95,078      100.00

. 
. * Create new index date variable 28 days after case_index_date (i.e. to exclu
> de anyone who does not survive to start follow-up)
. gen index_date = date(patient_index_date, "YMD")
(7,667 missing values generated)

. format index_date %td

. gen index_date_28 = index_date + 28
(7,667 missing values generated)

. format index_date_28 %td

. 
. * Deregistered before index_date + 29 days
. gen deregistered_date = date(date_deregistered, "YMD")
(28,775 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date_28 + 1
(64,240 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(26,424 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(2,324 observations deleted)

. replace krt_date = index_date_28 + 1 if krt_date < index_date_28 + 1
(99 real changes made)

. 
. * Death before index_date + 29 days (i.e. only include people who survived be
> yond 28 days after admission)
. drop if deceased==1
(280 observations deleted)

. drop deceased

. gen death_date1 = date(death_date, "YMD")
(25,446 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28 + 1
(1,748 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased withi
> n 28 days of index date"

. label values deceased deceased

. tab covid deceased

           |       deceased
     covid | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,064      1,052 |    14,116 
-----------+----------------------+----------
     Total |    13,064      1,052 |    14,116 

. tab pneumonia deceased

           |       deceased
 pneumonia | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,422        696 |    14,118 
-----------+----------------------+----------
     Total |    13,422        696 |    14,118 

. drop if deceased==1
(1,748 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators
>  only
. gen sex1 = 1 if sex=="M"
(13,425 missing values generated)

. replace sex1 = 0 if sex=="F"
(13,425 real changes made)

. drop sex

. rename sex1 sex

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 /
> //
>                                                                              
>                    baseline_creatinine_mar2017 ///
>                                                                              
>                    baseline_creatinine_apr2017 ///
>                                                                              
>                    baseline_creatinine_may2017 ///
>                                                                              
>                    baseline_creatinine_jun2017 ///
>                                                                              
>                    baseline_creatinine_jul2017 ///
>                                                                              
>                    baseline_creatinine_aug2017 ///
>                                                                              
>                    baseline_creatinine_sep2017 ///
>                                                                              
>                    baseline_creatinine_oct2017 ///
>                                                                              
>                    baseline_creatinine_nov2017 ///
>                                                                              
>                    baseline_creatinine_dec2017 ///
>                                                                              
>                    baseline_creatinine_jan2018 ///
>                                                                              
>                    baseline_creatinine_feb2018 ///
>                                                                              
>                    baseline_creatinine_mar2018 ///
>                                                                              
>                    baseline_creatinine_apr2018 ///
>                                                                              
>                    baseline_creatinine_may2018 ///
>                                                                              
>                    baseline_creatinine_jun2018 ///
>                                                                              
>                    baseline_creatinine_jul2018 ///
>                                                                              
>                    baseline_creatinine_aug2018 ///
>                                                                              
>                    baseline_creatinine_sep2018 ///
>                                                                              
>                    baseline_creatinine_oct2018 ///
>                                                                              
>                    baseline_creatinine_nov2018 ///
>                                                                              
>                    baseline_creatinine_dec2018 ///
>                                                                              
>                    baseline_creatinine_jan2019 ///
>                                                                              
>                    baseline_creatinine_feb2019 ///
>                                                                              
>                    baseline_creatinine_mar2019 ///
>                                                                              
>                    baseline_creatinine_apr2019 ///
>                                                                              
>                    baseline_creatinine_may2019 ///
>                                                                              
>                    baseline_creatinine_jun2019 ///
>                                                                              
>                    baseline_creatinine_jul2019 ///
>                                                                              
>                    baseline_creatinine_aug2019 ///
>                                                                              
>                    baseline_creatinine_sep2019 ///
>                                                                              
>                    baseline_creatinine_feb2020 ///
>                                                                              
>                    baseline_creatinine_mar2020 ///
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 ///
>                                                                              
>                    baseline_creatinine_oct2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(5,906 real changes made, 5,906 to missing)
(18,970 missing values generated)
(26,486 missing values generated)
(3,810 real changes made)
(3,706 real changes made)
(3,810 real changes made)
(3,706 real changes made)
(4,797 real changes made)
(26,486 missing values generated)
(3,810 real changes made)
(3,706 real changes made)
(7,516 real changes made)
(21,689 real changes made)
(18,970 missing values generated)
(7,434 real changes made)
(3,810 real changes made)
(5,943 real changes made, 5,943 to missing)
(19,007 missing values generated)
(26,486 missing values generated)
(3,804 real changes made)
(3,675 real changes made)
(3,804 real changes made)
(3,675 real changes made)
(4,795 real changes made)
(26,486 missing values generated)
(3,804 real changes made)
(3,675 real changes made)
(7,479 real changes made)
(21,691 real changes made)
(19,007 missing values generated)
(7,412 real changes made)
(3,804 real changes made)
(5,896 real changes made, 5,896 to missing)
(18,960 missing values generated)
(26,486 missing values generated)
(3,843 real changes made)
(3,683 real changes made)
(3,843 real changes made)
(3,683 real changes made)
(4,726 real changes made)
(26,486 missing values generated)
(3,843 real changes made)
(3,683 real changes made)
(7,526 real changes made)
(21,760 real changes made)
(18,960 missing values generated)
(7,445 real changes made)
(3,843 real changes made)
(5,815 real changes made, 5,815 to missing)
(18,879 missing values generated)
(26,486 missing values generated)
(3,856 real changes made)
(3,751 real changes made)
(3,856 real changes made)
(3,751 real changes made)
(4,834 real changes made)
(26,486 missing values generated)
(3,856 real changes made)
(3,751 real changes made)
(7,607 real changes made)
(21,652 real changes made)
(18,879 missing values generated)
(7,533 real changes made)
(3,856 real changes made)
(5,909 real changes made, 5,909 to missing)
(18,973 missing values generated)
(26,486 missing values generated)
(3,845 real changes made)
(3,668 real changes made)
(3,845 real changes made)
(3,668 real changes made)
(4,765 real changes made)
(26,486 missing values generated)
(3,845 real changes made)
(3,668 real changes made)
(7,513 real changes made)
(21,721 real changes made)
(18,973 missing values generated)
(7,427 real changes made)
(3,845 real changes made)
(5,954 real changes made, 5,954 to missing)
(19,018 missing values generated)
(26,486 missing values generated)
(3,842 real changes made)
(3,626 real changes made)
(3,842 real changes made)
(3,626 real changes made)
(4,688 real changes made)
(26,486 missing values generated)
(3,842 real changes made)
(3,626 real changes made)
(7,468 real changes made)
(21,798 real changes made)
(19,018 missing values generated)
(7,387 real changes made)
(3,842 real changes made)
(5,839 real changes made, 5,839 to missing)
(18,903 missing values generated)
(26,486 missing values generated)
(3,844 real changes made)
(3,739 real changes made)
(3,844 real changes made)
(3,739 real changes made)
(4,788 real changes made)
(26,486 missing values generated)
(3,844 real changes made)
(3,739 real changes made)
(7,583 real changes made)
(21,698 real changes made)
(18,903 missing values generated)
(7,505 real changes made)
(3,844 real changes made)
(5,876 real changes made, 5,876 to missing)
(18,940 missing values generated)
(26,486 missing values generated)
(3,829 real changes made)
(3,717 real changes made)
(3,829 real changes made)
(3,717 real changes made)
(4,800 real changes made)
(26,486 missing values generated)
(3,829 real changes made)
(3,717 real changes made)
(7,546 real changes made)
(21,686 real changes made)
(18,940 missing values generated)
(7,467 real changes made)
(3,829 real changes made)
(5,864 real changes made, 5,864 to missing)
(18,928 missing values generated)
(26,486 missing values generated)
(3,834 real changes made)
(3,724 real changes made)
(3,834 real changes made)
(3,724 real changes made)
(4,787 real changes made)
(26,486 missing values generated)
(3,834 real changes made)
(3,724 real changes made)
(7,558 real changes made)
(21,699 real changes made)
(18,928 missing values generated)
(7,490 real changes made)
(3,834 real changes made)
(5,988 real changes made, 5,988 to missing)
(19,052 missing values generated)
(26,486 missing values generated)
(3,800 real changes made)
(3,634 real changes made)
(3,800 real changes made)
(3,634 real changes made)
(4,772 real changes made)
(26,486 missing values generated)
(3,800 real changes made)
(3,634 real changes made)
(7,434 real changes made)
(21,714 real changes made)
(19,052 missing values generated)
(7,354 real changes made)
(3,800 real changes made)
(5,893 real changes made, 5,893 to missing)
(18,957 missing values generated)
(26,486 missing values generated)
(3,837 real changes made)
(3,692 real changes made)
(3,837 real changes made)
(3,692 real changes made)
(4,784 real changes made)
(26,486 missing values generated)
(3,837 real changes made)
(3,692 real changes made)
(7,529 real changes made)
(21,702 real changes made)
(18,957 missing values generated)
(7,460 real changes made)
(3,837 real changes made)
(5,892 real changes made, 5,892 to missing)
(18,956 missing values generated)
(26,486 missing values generated)
(3,846 real changes made)
(3,684 real changes made)
(3,846 real changes made)
(3,684 real changes made)
(4,740 real changes made)
(26,486 missing values generated)
(3,846 real changes made)
(3,684 real changes made)
(7,530 real changes made)
(21,746 real changes made)
(18,956 missing values generated)
(7,445 real changes made)
(3,846 real changes made)
(5,923 real changes made, 5,923 to missing)
(18,987 missing values generated)
(26,486 missing values generated)
(3,860 real changes made)
(3,639 real changes made)
(3,860 real changes made)
(3,639 real changes made)
(4,806 real changes made)
(26,486 missing values generated)
(3,860 real changes made)
(3,639 real changes made)
(7,499 real changes made)
(21,680 real changes made)
(18,987 missing values generated)
(7,423 real changes made)
(3,860 real changes made)
(5,841 real changes made, 5,841 to missing)
(18,905 missing values generated)
(26,486 missing values generated)
(3,849 real changes made)
(3,732 real changes made)
(3,849 real changes made)
(3,732 real changes made)
(4,832 real changes made)
(26,486 missing values generated)
(3,849 real changes made)
(3,732 real changes made)
(7,581 real changes made)
(21,654 real changes made)
(18,905 missing values generated)
(7,508 real changes made)
(3,849 real changes made)
(5,889 real changes made, 5,889 to missing)
(18,953 missing values generated)
(26,486 missing values generated)
(3,839 real changes made)
(3,694 real changes made)
(3,839 real changes made)
(3,694 real changes made)
(4,763 real changes made)
(26,486 missing values generated)
(3,839 real changes made)
(3,694 real changes made)
(7,533 real changes made)
(21,723 real changes made)
(18,953 missing values generated)
(7,460 real changes made)
(3,839 real changes made)
(5,818 real changes made, 5,818 to missing)
(18,882 missing values generated)
(26,486 missing values generated)
(3,852 real changes made)
(3,752 real changes made)
(3,852 real changes made)
(3,752 real changes made)
(4,768 real changes made)
(26,486 missing values generated)
(3,852 real changes made)
(3,752 real changes made)
(7,604 real changes made)
(21,718 real changes made)
(18,882 missing values generated)
(7,518 real changes made)
(3,852 real changes made)
(5,991 real changes made, 5,991 to missing)
(19,055 missing values generated)
(26,486 missing values generated)
(3,761 real changes made)
(3,670 real changes made)
(3,761 real changes made)
(3,670 real changes made)
(4,719 real changes made)
(26,486 missing values generated)
(3,761 real changes made)
(3,670 real changes made)
(7,431 real changes made)
(21,767 real changes made)
(19,055 missing values generated)
(7,364 real changes made)
(3,761 real changes made)
(6,004 real changes made, 6,004 to missing)
(19,068 missing values generated)
(26,486 missing values generated)
(3,740 real changes made)
(3,678 real changes made)
(3,740 real changes made)
(3,678 real changes made)
(4,740 real changes made)
(26,486 missing values generated)
(3,740 real changes made)
(3,678 real changes made)
(7,418 real changes made)
(21,746 real changes made)
(19,068 missing values generated)
(7,335 real changes made)
(3,740 real changes made)
(5,909 real changes made, 5,909 to missing)
(18,973 missing values generated)
(26,486 missing values generated)
(3,750 real changes made)
(3,763 real changes made)
(3,750 real changes made)
(3,763 real changes made)
(4,769 real changes made)
(26,486 missing values generated)
(3,750 real changes made)
(3,763 real changes made)
(7,513 real changes made)
(21,717 real changes made)
(18,973 missing values generated)
(7,436 real changes made)
(3,750 real changes made)
(5,983 real changes made, 5,983 to missing)
(19,047 missing values generated)
(26,486 missing values generated)
(3,824 real changes made)
(3,615 real changes made)
(3,824 real changes made)
(3,615 real changes made)
(4,807 real changes made)
(26,486 missing values generated)
(3,824 real changes made)
(3,615 real changes made)
(7,439 real changes made)
(21,679 real changes made)
(19,047 missing values generated)
(7,358 real changes made)
(3,824 real changes made)
(5,888 real changes made, 5,888 to missing)
(18,952 missing values generated)
(26,486 missing values generated)
(3,831 real changes made)
(3,703 real changes made)
(3,831 real changes made)
(3,703 real changes made)
(4,775 real changes made)
(26,486 missing values generated)
(3,831 real changes made)
(3,703 real changes made)
(7,534 real changes made)
(21,711 real changes made)
(18,952 missing values generated)
(7,463 real changes made)
(3,831 real changes made)
(5,978 real changes made, 5,978 to missing)
(19,042 missing values generated)
(26,486 missing values generated)
(3,783 real changes made)
(3,661 real changes made)
(3,783 real changes made)
(3,661 real changes made)
(4,681 real changes made)
(26,486 missing values generated)
(3,783 real changes made)
(3,661 real changes made)
(7,444 real changes made)
(21,805 real changes made)
(19,042 missing values generated)
(7,367 real changes made)
(3,783 real changes made)
(5,938 real changes made, 5,938 to missing)
(19,002 missing values generated)
(26,486 missing values generated)
(3,807 real changes made)
(3,677 real changes made)
(3,807 real changes made)
(3,677 real changes made)
(4,750 real changes made)
(26,486 missing values generated)
(3,807 real changes made)
(3,677 real changes made)
(7,484 real changes made)
(21,736 real changes made)
(19,002 missing values generated)
(7,401 real changes made)
(3,807 real changes made)
(5,844 real changes made, 5,844 to missing)
(18,908 missing values generated)
(26,486 missing values generated)
(3,868 real changes made)
(3,710 real changes made)
(3,868 real changes made)
(3,710 real changes made)
(4,822 real changes made)
(26,486 missing values generated)
(3,868 real changes made)
(3,710 real changes made)
(7,578 real changes made)
(21,664 real changes made)
(18,908 missing values generated)
(7,494 real changes made)
(3,868 real changes made)
(5,892 real changes made, 5,892 to missing)
(18,956 missing values generated)
(26,486 missing values generated)
(3,832 real changes made)
(3,698 real changes made)
(3,832 real changes made)
(3,698 real changes made)
(4,788 real changes made)
(26,486 missing values generated)
(3,832 real changes made)
(3,698 real changes made)
(7,530 real changes made)
(21,698 real changes made)
(18,956 missing values generated)
(7,450 real changes made)
(3,832 real changes made)
(5,925 real changes made, 5,925 to missing)
(18,989 missing values generated)
(26,486 missing values generated)
(3,828 real changes made)
(3,669 real changes made)
(3,828 real changes made)
(3,669 real changes made)
(4,703 real changes made)
(26,486 missing values generated)
(3,828 real changes made)
(3,669 real changes made)
(7,497 real changes made)
(21,783 real changes made)
(18,989 missing values generated)
(7,422 real changes made)
(3,828 real changes made)
(5,887 real changes made, 5,887 to missing)
(18,951 missing values generated)
(26,486 missing values generated)
(3,869 real changes made)
(3,666 real changes made)
(3,869 real changes made)
(3,666 real changes made)
(4,800 real changes made)
(26,486 missing values generated)
(3,869 real changes made)
(3,666 real changes made)
(7,535 real changes made)
(21,686 real changes made)
(18,951 missing values generated)
(7,450 real changes made)
(3,869 real changes made)
(6,027 real changes made, 6,027 to missing)
(19,091 missing values generated)
(26,486 missing values generated)
(3,729 real changes made)
(3,666 real changes made)
(3,729 real changes made)
(3,666 real changes made)
(4,640 real changes made)
(26,486 missing values generated)
(3,729 real changes made)
(3,666 real changes made)
(7,395 real changes made)
(21,846 real changes made)
(19,091 missing values generated)
(7,305 real changes made)
(3,729 real changes made)
(5,885 real changes made, 5,885 to missing)
(18,949 missing values generated)
(26,486 missing values generated)
(3,838 real changes made)
(3,699 real changes made)
(3,838 real changes made)
(3,699 real changes made)
(4,761 real changes made)
(26,486 missing values generated)
(3,838 real changes made)
(3,699 real changes made)
(7,537 real changes made)
(21,725 real changes made)
(18,949 missing values generated)
(7,461 real changes made)
(3,838 real changes made)
(5,875 real changes made, 5,875 to missing)
(18,939 missing values generated)
(26,486 missing values generated)
(3,803 real changes made)
(3,744 real changes made)
(3,803 real changes made)
(3,744 real changes made)
(4,785 real changes made)
(26,486 missing values generated)
(3,803 real changes made)
(3,744 real changes made)
(7,547 real changes made)
(21,701 real changes made)
(18,939 missing values generated)
(7,471 real changes made)
(3,803 real changes made)
(5,973 real changes made, 5,973 to missing)
(19,037 missing values generated)
(26,486 missing values generated)
(3,796 real changes made)
(3,653 real changes made)
(3,796 real changes made)
(3,653 real changes made)
(4,739 real changes made)
(26,486 missing values generated)
(3,796 real changes made)
(3,653 real changes made)
(7,449 real changes made)
(21,747 real changes made)
(19,037 missing values generated)
(7,372 real changes made)
(3,796 real changes made)
(5,968 real changes made, 5,968 to missing)
(19,032 missing values generated)
(26,486 missing values generated)
(3,764 real changes made)
(3,690 real changes made)
(3,764 real changes made)
(3,690 real changes made)
(4,681 real changes made)
(26,486 missing values generated)
(3,764 real changes made)
(3,690 real changes made)
(7,454 real changes made)
(21,805 real changes made)
(19,032 missing values generated)
(7,372 real changes made)
(3,764 real changes made)
(5,738 real changes made, 5,738 to missing)
(19,160 missing values generated)
(26,486 missing values generated)
(3,715 real changes made)
(3,611 real changes made)
(3,715 real changes made)
(3,611 real changes made)
(4,616 real changes made)
(26,486 missing values generated)
(3,715 real changes made)
(3,611 real changes made)
(7,326 real changes made)
(21,870 real changes made)
(19,160 missing values generated)
(7,232 real changes made)
(3,715 real changes made)
(5,713 real changes made, 5,713 to missing)
(19,135 missing values generated)
(26,486 missing values generated)
(3,747 real changes made)
(3,604 real changes made)
(3,747 real changes made)
(3,604 real changes made)
(4,693 real changes made)
(26,486 missing values generated)
(3,747 real changes made)
(3,604 real changes made)
(7,351 real changes made)
(21,793 real changes made)
(19,135 missing values generated)
(7,255 real changes made)
(3,747 real changes made)
(5,729 real changes made, 5,729 to missing)
(19,151 missing values generated)
(26,486 missing values generated)
(3,721 real changes made)
(3,614 real changes made)
(3,721 real changes made)
(3,614 real changes made)
(4,709 real changes made)
(26,486 missing values generated)
(3,721 real changes made)
(3,614 real changes made)
(7,335 real changes made)
(21,777 real changes made)
(19,151 missing values generated)
(7,242 real changes made)
(3,721 real changes made)
(5,842 real changes made, 5,842 to missing)
(19,264 missing values generated)
(26,486 missing values generated)
(3,634 real changes made)
(3,588 real changes made)
(3,634 real changes made)
(3,588 real changes made)
(4,570 real changes made)
(26,486 missing values generated)
(3,634 real changes made)
(3,588 real changes made)
(7,222 real changes made)
(21,916 real changes made)
(19,264 missing values generated)
(7,130 real changes made)
(3,634 real changes made)
(5,752 real changes made, 5,752 to missing)
(19,174 missing values generated)
(26,486 missing values generated)
(3,710 real changes made)
(3,602 real changes made)
(3,710 real changes made)
(3,602 real changes made)
(4,641 real changes made)
(26,486 missing values generated)
(3,710 real changes made)
(3,602 real changes made)
(7,312 real changes made)
(21,845 real changes made)
(19,174 missing values generated)
(7,221 real changes made)
(3,710 real changes made)
(5,671 real changes made, 5,671 to missing)
(19,093 missing values generated)
(26,486 missing values generated)
(3,686 real changes made)
(3,707 real changes made)
(3,686 real changes made)
(3,707 real changes made)
(4,717 real changes made)
(26,486 missing values generated)
(3,686 real changes made)
(3,707 real changes made)
(7,393 real changes made)
(21,769 real changes made)
(19,093 missing values generated)
(7,302 real changes made)
(3,686 real changes made)
(5,772 real changes made, 5,772 to missing)
(19,194 missing values generated)
(26,486 missing values generated)
(3,687 real changes made)
(3,605 real changes made)
(3,687 real changes made)
(3,605 real changes made)
(4,646 real changes made)
(26,486 missing values generated)
(3,687 real changes made)
(3,605 real changes made)
(7,292 real changes made)
(21,840 real changes made)
(19,194 missing values generated)
(7,202 real changes made)
(3,687 real changes made)
(5,843 real changes made, 5,843 to missing)
(19,265 missing values generated)
(26,486 missing values generated)
(3,683 real changes made)
(3,538 real changes made)
(3,683 real changes made)
(3,538 real changes made)
(4,482 real changes made)
(26,486 missing values generated)
(3,683 real changes made)
(3,538 real changes made)
(7,221 real changes made)
(22,004 real changes made)
(19,265 missing values generated)
(7,134 real changes made)
(3,683 real changes made)
(5,785 real changes made, 5,785 to missing)
(19,207 missing values generated)
(26,486 missing values generated)
(3,606 real changes made)
(3,673 real changes made)
(3,606 real changes made)
(3,673 real changes made)
(4,628 real changes made)
(26,486 missing values generated)
(3,606 real changes made)
(3,673 real changes made)
(7,279 real changes made)
(21,858 real changes made)
(19,207 missing values generated)
(7,192 real changes made)
(3,606 real changes made)
(5,748 real changes made, 5,748 to missing)
(19,170 missing values generated)
(26,486 missing values generated)
(3,724 real changes made)
(3,592 real changes made)
(3,724 real changes made)
(3,592 real changes made)
(4,634 real changes made)
(26,486 missing values generated)
(3,724 real changes made)
(3,592 real changes made)
(7,316 real changes made)
(21,852 real changes made)
(19,170 missing values generated)
(7,221 real changes made)
(3,724 real changes made)
(5,762 real changes made, 5,762 to missing)
(19,184 missing values generated)
(26,486 missing values generated)
(3,665 real changes made)
(3,637 real changes made)
(3,665 real changes made)
(3,637 real changes made)
(4,600 real changes made)
(26,486 missing values generated)
(3,665 real changes made)
(3,637 real changes made)
(7,302 real changes made)
(21,886 real changes made)
(19,184 missing values generated)
(7,213 real changes made)
(3,665 real changes made)
(5,709 real changes made, 5,709 to missing)
(19,131 missing values generated)
(26,486 missing values generated)
(3,741 real changes made)
(3,614 real changes made)
(3,741 real changes made)
(3,614 real changes made)
(4,625 real changes made)
(26,486 missing values generated)
(3,741 real changes made)
(3,614 real changes made)
(7,355 real changes made)
(21,861 real changes made)
(19,131 missing values generated)
(7,267 real changes made)
(3,741 real changes made)
(5,741 real changes made, 5,741 to missing)
(19,163 missing values generated)
(26,486 missing values generated)
(3,639 real changes made)
(3,684 real changes made)
(3,639 real changes made)
(3,684 real changes made)
(4,693 real changes made)
(26,486 missing values generated)
(3,639 real changes made)
(3,684 real changes made)
(7,323 real changes made)
(21,793 real changes made)
(19,163 missing values generated)
(7,230 real changes made)
(3,639 real changes made)
(5,716 real changes made, 5,716 to missing)
(19,138 missing values generated)
(26,486 missing values generated)
(3,754 real changes made)
(3,594 real changes made)
(3,754 real changes made)
(3,594 real changes made)
(4,640 real changes made)
(26,486 missing values generated)
(3,754 real changes made)
(3,594 real changes made)
(7,348 real changes made)
(21,846 real changes made)
(19,138 missing values generated)
(7,253 real changes made)
(3,754 real changes made)
(5,723 real changes made, 5,723 to missing)
(19,145 missing values generated)
(26,486 missing values generated)
(3,711 real changes made)
(3,630 real changes made)
(3,711 real changes made)
(3,630 real changes made)
(4,622 real changes made)
(26,486 missing values generated)
(3,711 real changes made)
(3,630 real changes made)
(7,341 real changes made)
(21,864 real changes made)
(19,145 missing values generated)
(7,251 real changes made)
(3,711 real changes made)
(5,672 real changes made, 5,672 to missing)
(19,094 missing values generated)
(26,486 missing values generated)
(3,751 real changes made)
(3,641 real changes made)
(3,751 real changes made)
(3,641 real changes made)
(4,701 real changes made)
(26,486 missing values generated)
(3,751 real changes made)
(3,641 real changes made)
(7,392 real changes made)
(21,785 real changes made)
(19,094 missing values generated)
(7,289 real changes made)
(3,751 real changes made)
(5,781 real changes made, 5,781 to missing)
(19,203 missing values generated)
(26,486 missing values generated)
(3,650 real changes made)
(3,633 real changes made)
(3,650 real changes made)
(3,633 real changes made)
(4,567 real changes made)
(26,486 missing values generated)
(3,650 real changes made)
(3,633 real changes made)
(7,283 real changes made)
(21,919 real changes made)
(19,203 missing values generated)
(7,201 real changes made)
(3,650 real changes made)
(5,778 real changes made, 5,778 to missing)
(19,200 missing values generated)
(26,486 missing values generated)
(3,691 real changes made)
(3,595 real changes made)
(3,691 real changes made)
(3,595 real changes made)
(4,659 real changes made)
(26,486 missing values generated)
(3,691 real changes made)
(3,595 real changes made)
(7,286 real changes made)
(21,827 real changes made)
(19,200 missing values generated)
(7,193 real changes made)
(3,691 real changes made)
(5,755 real changes made, 5,755 to missing)
(19,177 missing values generated)
(26,486 missing values generated)
(3,662 real changes made)
(3,647 real changes made)
(3,662 real changes made)
(3,647 real changes made)
(4,628 real changes made)
(26,486 missing values generated)
(3,662 real changes made)
(3,647 real changes made)
(7,309 real changes made)
(21,858 real changes made)
(19,177 missing values generated)
(7,221 real changes made)
(3,662 real changes made)
(5,709 real changes made, 5,709 to missing)
(19,131 missing values generated)
(26,486 missing values generated)
(3,710 real changes made)
(3,645 real changes made)
(3,710 real changes made)
(3,645 real changes made)
(4,589 real changes made)
(26,486 missing values generated)
(3,710 real changes made)
(3,645 real changes made)
(7,355 real changes made)
(21,897 real changes made)
(19,131 missing values generated)
(7,271 real changes made)
(3,710 real changes made)
(5,816 real changes made, 5,816 to missing)
(19,238 missing values generated)
(26,486 missing values generated)
(3,712 real changes made)
(3,536 real changes made)
(3,712 real changes made)
(3,536 real changes made)
(4,620 real changes made)
(26,486 missing values generated)
(3,712 real changes made)
(3,536 real changes made)
(7,248 real changes made)
(21,866 real changes made)
(19,238 missing values generated)
(7,147 real changes made)
(3,712 real changes made)
(5,787 real changes made, 5,787 to missing)
(19,209 missing values generated)
(26,486 missing values generated)
(3,664 real changes made)
(3,613 real changes made)
(3,664 real changes made)
(3,613 real changes made)
(4,629 real changes made)
(26,486 missing values generated)
(3,664 real changes made)
(3,613 real changes made)
(7,277 real changes made)
(21,857 real changes made)
(19,209 missing values generated)
(7,187 real changes made)
(3,664 real changes made)
(5,778 real changes made, 5,778 to missing)
(19,200 missing values generated)
(26,486 missing values generated)
(3,688 real changes made)
(3,598 real changes made)
(3,688 real changes made)
(3,598 real changes made)
(4,627 real changes made)
(26,486 missing values generated)
(3,688 real changes made)
(3,598 real changes made)
(7,286 real changes made)
(21,859 real changes made)
(19,200 missing values generated)
(7,197 real changes made)
(3,688 real changes made)
(5,670 real changes made, 5,670 to missing)
(19,092 missing values generated)
(26,486 missing values generated)
(3,744 real changes made)
(3,650 real changes made)
(3,744 real changes made)
(3,650 real changes made)
(4,679 real changes made)
(26,486 missing values generated)
(3,744 real changes made)
(3,650 real changes made)
(7,394 real changes made)
(21,807 real changes made)
(19,092 missing values generated)
(7,300 real changes made)
(3,744 real changes made)
(5,749 real changes made, 5,749 to missing)
(19,171 missing values generated)
(26,486 missing values generated)
(3,685 real changes made)
(3,630 real changes made)
(3,685 real changes made)
(3,630 real changes made)
(4,637 real changes made)
(26,486 missing values generated)
(3,685 real changes made)
(3,630 real changes made)
(7,315 real changes made)
(21,849 real changes made)
(19,171 missing values generated)
(7,217 real changes made)
(3,685 real changes made)
(5,756 real changes made, 5,756 to missing)
(19,178 missing values generated)
(26,486 missing values generated)
(3,724 real changes made)
(3,584 real changes made)
(3,724 real changes made)
(3,584 real changes made)
(4,662 real changes made)
(26,486 missing values generated)
(3,724 real changes made)
(3,584 real changes made)
(7,308 real changes made)
(21,824 real changes made)
(19,178 missing values generated)
(7,219 real changes made)
(3,724 real changes made)
(5,822 real changes made, 5,822 to missing)
(19,244 missing values generated)
(26,486 missing values generated)
(3,639 real changes made)
(3,603 real changes made)
(3,639 real changes made)
(3,603 real changes made)
(4,631 real changes made)
(26,486 missing values generated)
(3,639 real changes made)
(3,603 real changes made)
(7,242 real changes made)
(21,855 real changes made)
(19,244 missing values generated)
(7,146 real changes made)
(3,639 real changes made)
(5,704 real changes made, 5,704 to missing)
(19,126 missing values generated)
(26,486 missing values generated)
(3,723 real changes made)
(3,637 real changes made)
(3,723 real changes made)
(3,637 real changes made)
(4,653 real changes made)
(26,486 missing values generated)
(3,723 real changes made)
(3,637 real changes made)
(7,360 real changes made)
(21,833 real changes made)
(19,126 missing values generated)
(7,259 real changes made)
(3,723 real changes made)
(5,819 real changes made, 5,819 to missing)
(19,241 missing values generated)
(26,486 missing values generated)
(3,658 real changes made)
(3,587 real changes made)
(3,658 real changes made)
(3,587 real changes made)
(4,618 real changes made)
(26,486 missing values generated)
(3,658 real changes made)
(3,587 real changes made)
(7,245 real changes made)
(21,868 real changes made)
(19,241 missing values generated)
(7,154 real changes made)
(3,658 real changes made)
(5,709 real changes made, 5,709 to missing)
(19,131 missing values generated)
(26,486 missing values generated)
(3,721 real changes made)
(3,634 real changes made)
(3,721 real changes made)
(3,634 real changes made)
(4,681 real changes made)
(26,486 missing values generated)
(3,721 real changes made)
(3,634 real changes made)
(7,355 real changes made)
(21,805 real changes made)
(19,131 missing values generated)
(7,273 real changes made)
(3,721 real changes made)
(5,838 real changes made, 5,838 to missing)
(19,260 missing values generated)
(26,486 missing values generated)
(3,641 real changes made)
(3,585 real changes made)
(3,641 real changes made)
(3,585 real changes made)
(4,569 real changes made)
(26,486 missing values generated)
(3,641 real changes made)
(3,585 real changes made)
(7,226 real changes made)
(21,917 real changes made)
(19,260 missing values generated)
(7,137 real changes made)
(3,641 real changes made)
(5,787 real changes made, 5,787 to missing)
(19,209 missing values generated)
(26,486 missing values generated)
(3,657 real changes made)
(3,620 real changes made)
(3,657 real changes made)
(3,620 real changes made)
(4,556 real changes made)
(26,486 missing values generated)
(3,657 real changes made)
(3,620 real changes made)
(7,277 real changes made)
(21,930 real changes made)
(19,209 missing values generated)
(7,189 real changes made)
(3,657 real changes made)
(5,690 real changes made, 5,690 to missing)
(19,112 missing values generated)
(26,486 missing values generated)
(3,748 real changes made)
(3,626 real changes made)
(3,748 real changes made)
(3,626 real changes made)
(4,660 real changes made)
(26,486 missing values generated)
(3,748 real changes made)
(3,626 real changes made)
(7,374 real changes made)
(21,826 real changes made)
(19,112 missing values generated)
(7,294 real changes made)
(3,748 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)
(1,765 missing values generated)

. gen baseline_egfr=.
(26,486 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(237 real changes made)
(300 real changes made)
(267 real changes made)
(275 real changes made)
(248 real changes made)
(258 real changes made)
(260 real changes made)
(260 real changes made)
(231 real changes made)
(218 real changes made)
(240 real changes made)
(277 real changes made)
(215 real changes made)
(226 real changes made)
(235 real changes made)
(205 real changes made)
(235 real changes made)
(218 real changes made)
(195 real changes made)
(183 real changes made)
(226 real changes made)
(198 real changes made)
(222 real changes made)
(219 real changes made)
(179 real changes made)
(194 real changes made)
(184 real changes made)
(174 real changes made)
(188 real changes made)
(188 real changes made)
(187 real changes made)
(180 real changes made)
(215 real changes made)
(254 real changes made)
(224 real changes made)
(227 real changes made)
(250 real changes made)
(204 real changes made)
(218 real changes made)
(206 real changes made)
(232 real changes made)
(186 real changes made)
(227 real changes made)
(207 real changes made)
(190 real changes made)
(200 real changes made)
(184 real changes made)
(194 real changes made)
(196 real changes made)
(228 real changes made)
(192 real changes made)
(199 real changes made)
(169 real changes made)
(189 real changes made)
(185 real changes made)
(203 real changes made)
(155 real changes made)
(164 real changes made)
(154 real changes made)
(179 real changes made)
(159 real changes made)
(185 real changes made)
(161 real changes made)
(157 real changes made)
(202 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab covid baseline_esrd

           | baseline_e
           |    srd
     covid |   No ESRD |     Total
-----------+-----------+----------
         1 |    13,064 |    13,064 
-----------+-----------+----------
     Total |    13,064 |    13,064 

. tab pneumonia baseline_esrd

           | baseline_e
           |    srd
 pneumonia |   No ESRD |     Total
-----------+-----------+----------
         1 |    13,422 |    13,422 
-----------+-----------+----------
     Total |    13,422 |    13,422 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. ** Exposure
. gen case = covid
(13,422 missing values generated)

. replace case = 0 if covid==.
(13,422 real changes made)

. label define case 0 "Pneumonia (pre-pandemic)" ///
>                                   1 "COVID-19"

. label values case case

. tab case covid

                      |   covid
                 case |         1 |     Total
----------------------+-----------+----------
             COVID-19 |    13,064 |    13,064 
----------------------+-----------+----------
                Total |    13,064 |    13,064 

. tab case pneumonia

                      | pneumonia
                 case |         1 |     Total
----------------------+-----------+----------
Pneumonia (pre-pandem |    13,422 |    13,422 
----------------------+-----------+----------
                Total |    13,422 |    13,422 

. drop covid

. drop pneumonia

. safetab case 
0

                    case |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,422       50.68       50.68
                COVID-19 |     13,064       49.32      100.00
-------------------------+-----------------------------------
                   Total |     26,486      100.00

. 
. * Critical care during index admission
. replace critical_care = 1 if critical_days==1
(1,243 real changes made)

. drop critical_days

. label define critical_care      0 "Ward-based"          ///
>                                                         1 "Critical care"

. label values critical_care critical_care

. label var critical_care "Critical care"

. safetab critical_care, m
14

Critical care |      Freq.     Percent        Cum.
--------------+-----------------------------------
   Ward-based |     23,897       90.23       90.23
Critical care |      2,589        9.77      100.00
--------------+-----------------------------------
        Total |     26,486      100.00

. gen case_critical_care = critical_care

. replace case_critical_care = 2 if case==1
(13,064 real changes made)

. replace case_critical_care = 3 if case==1 &critical_care==1
(1,295 real changes made)

. label define case_critical_care 0 "Ward-based pneumonia (pre-pandemic)"      
>    ///
>                                                                 1 "Critical c
> are pneumonia (pre-pandemic)"      ///
>                                                                 2 "Ward-based
>  COVID-19"                                         ///
>                                                                 3 "Critical c
> are COVID-19"

. label values case_critical_care case_critical_care

. safetab case_critical_care, m
19

                    case_critical_care |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
   Ward-based pneumonia (pre-pandemic) |     12,128       45.79       45.79
Critical care pneumonia (pre-pandemic) |      1,294        4.89       50.68
                   Ward-based COVID-19 |     11,769       44.43       95.11
                Critical care COVID-19 |      1,295        4.89      100.00
---------------------------------------+-----------------------------------
                                 Total |     26,486      100.00

. 
. * Acute kidney injury during index admission
. rename acute_kidney_injury adm_aki

. label define adm_aki    0 "No AKI"      ///
>                                                 1 "AKI"

. label values adm_aki adm_aki

. label var adm_aki "Acute kidney injury"

. safetab adm_aki, m
8

      Acute |
     kidney |
     injury |      Freq.     Percent        Cum.
------------+-----------------------------------
     No AKI |     15,864       59.90       59.90
        AKI |     10,622       40.10      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. gen case_adm_aki = adm_aki

. replace case_adm_aki = 2 if case==1
(13,064 real changes made)

. replace case_adm_aki = 3 if case==1 &adm_aki==1
(5,217 real changes made)

. label define case_adm_aki       0 "No AKI pneumonia (pre-pandemic)"     ///
>                                                                              
>    1 "AKI pneumonia (pre-pandemic)"        ///
>                                                                              
>    2 "No AKI COVID-19"                             ///
>                                                                              
>    3 "AKI COVID-19"

. label values case_adm_aki case_adm_aki

. safetab case_adm_aki, m
13

                   case_adm_aki |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
No AKI pneumonia (pre-pandemic) |      8,017       30.27       30.27
   AKI pneumonia (pre-pandemic) |      5,405       20.41       50.68
                No AKI COVID-19 |      7,847       29.63       80.30
                   AKI COVID-19 |      5,217       19.70      100.00
--------------------------------+-----------------------------------
                          Total |     26,486      100.00

. 
. * Kidney replacement therapy during index admission
. gen krt = adm_aki

. replace krt = 2 if krt_icd_10==1
(235 real changes made)

. drop krt_icd_10

. replace krt = 2 if krt_opcs_4==1
(257 real changes made)

. drop krt_opcs_4

. label define krt        0 "No AKI"                              ///
>                                         1 "AKI without KRT"             ///
>                                         2 "AKI requiring KRT"

. label values krt krt

. label var krt "Kidney replacement therapy"

. safetab krt, m
4

           Kidney |
      replacement |
          therapy |      Freq.     Percent        Cum.
------------------+-----------------------------------
           No AKI |     15,562       58.76       58.76
  AKI without KRT |     10,432       39.39       98.14
AKI requiring KRT |        492        1.86      100.00
------------------+-----------------------------------
            Total |     26,486      100.00

. gen case_krt = krt

. replace case_krt = 3 if case==1
(13,064 real changes made)

. replace case_krt = 4 if case==1 &krt==1
(5,129 real changes made)

. replace case_krt = 5 if case==1 &krt==2
(230 real changes made)

. label define case_krt   0 "No AKI pneumonia (pre-pandemic)"                  
>    ///
>                                                 1 "AKI without KRT pneumonia 
> (pre-pandemic)"    ///
>                                                 2 "AKI requiring KRT pneumoni
> a (pre-pandemic)"  ///
>                                                 3 "No AKI COVID-19"          
>                                                    ///
>                                                 4 "AKI without KRT COVID-19" 
>                                    ///
>                                                 5 "AKI requiring KRT COVID-19
> "

. label values case_krt case_krt

. safetab case_krt, m
9

                               case_krt |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
        No AKI pneumonia (pre-pandemic) |      7,857       29.66       29.66
AKI without KRT pneumonia (pre-pandemic |      5,303       20.02       49.69
AKI requiring KRT pneumonia (pre-pandem |        262        0.99       50.68
                        No AKI COVID-19 |      7,705       29.09       79.77
               AKI without KRT COVID-19 |      5,129       19.36       99.13
             AKI requiring KRT COVID-19 |        230        0.87      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,486      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(17,378 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(17,335 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(17,334 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(17,403 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(9,083 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(2,783 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(844 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(242 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Pneumonia (pre-pandemic)"    ///
>                                                 1 "COVID pre-vaccination"    
>                    ///
>                                                 2 "COVID 1 vaccine dose"     
>                    ///
>                                                 3 "COVID 2 vaccine doses"    
>                    ///
>                                                 4 "COVID 3 vaccine doses"    
>                    ///
>                                                 5 "COVID 4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "COVID-19 vaccination status"

. safetab covid_vax, m
10

    COVID-19 vaccination |
                  status |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,422       50.68       50.68
   COVID pre-vaccination |        112        0.42       51.10
    COVID 1 vaccine dose |        242        0.91       52.01
   COVID 2 vaccine doses |        844        3.19       55.20
   COVID 3 vaccine doses |      2,783       10.51       65.71
   COVID 4 vaccine doses |      9,083       34.29      100.00
-------------------------+-----------------------------------
                   Total |     26,486      100.00

. 
. * COVID-19 wave
. gen wave = case

. replace wave = 2 if index_month=="sep2020"
(373 real changes made)

. replace wave = 2 if index_month=="oct2020"
(401 real changes made)

. replace wave = 2 if index_month=="nov2020"
(348 real changes made)

. replace wave = 2 if index_month=="dec2020"
(394 real changes made)

. replace wave = 2 if index_month=="jan2021"
(352 real changes made)

. replace wave = 2 if index_month=="feb2021"
(330 real changes made)

. replace wave = 2 if index_month=="mar2021"
(365 real changes made)

. replace wave = 2 if index_month=="apr2021"
(342 real changes made)

. replace wave = 2 if index_month=="may2021"
(339 real changes made)

. replace wave = 2 if index_month=="jun2021"
(362 real changes made)

. replace wave = 3 if index_month=="jul2021"
(407 real changes made)

. replace wave = 3 if index_month=="aug2021"
(350 real changes made)

. replace wave = 3 if index_month=="sep2021"
(336 real changes made)

. replace wave = 3 if index_month=="oct2021"
(295 real changes made)

. replace wave = 3 if index_month=="nov2021"
(343 real changes made)

. replace wave = 4 if index_month=="dec2021"
(326 real changes made)

. replace wave = 4 if index_month=="jan2022"
(331 real changes made)

. replace wave = 4 if index_month=="feb2022"
(311 real changes made)

. replace wave = 4 if index_month=="mar2022"
(315 real changes made)

. replace wave = 4 if index_month=="apr2022"
(282 real changes made)

. replace wave = 4 if index_month=="may2022"
(312 real changes made)

. replace wave = 4 if index_month=="jun2022"
(304 real changes made)

. replace wave = 4 if index_month=="jul2022"
(321 real changes made)

. replace wave = 4 if index_month=="aug2022"
(311 real changes made)

. replace wave = 4 if index_month=="sep2022"
(307 real changes made)

. replace wave = 4 if index_month=="oct2022"
(337 real changes made)

. label define wave       0 "Pneumonia (pre-pandemic)"    ///
>                                         1 "COVID Feb20-Aug20"   ///
>                                         2 "COVID Sep20-Jun21"   ///
>                                         3 "COVID Jul21-Nov21"   ///
>                                         4 "COVID Dec21-Oct22"   

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m
5

           COVID-19 wave |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,422       50.68       50.68
       COVID Feb20-Aug20 |      4,270       16.12       66.80
       COVID Sep20-Jun21 |      3,606       13.61       80.41
       COVID Jul21-Nov21 |      1,731        6.54       86.95
       COVID Dec21-Oct22 |      3,457       13.05      100.00
-------------------------+-----------------------------------
                   Total |     26,486      100.00

. 
. * Month
. gen month_string=substr(index_date_string ,3,3)
(1,765 missing values generated)

. gen month = 1 if month_string=="jan"
(24,943 missing values generated)

. replace month = 2 if month_string=="feb"
(2,151 real changes made)

. replace month = 3 if month_string=="mar"
(2,413 real changes made)

. replace month = 4 if month_string=="apr"
(2,275 real changes made)

. replace month = 5 if month_string=="may"
(2,253 real changes made)

. replace month = 6 if month_string=="jun"
(2,281 real changes made)

. replace month = 7 if month_string=="jul"
(2,306 real changes made)

. replace month = 8 if month_string=="aug"
(2,235 real changes made)

. replace month = 9 if month_string=="sep"
(2,145 real changes made)

. replace month = 10 if month_string=="oct"
(2,149 real changes made)

. replace month = 11 if month_string=="nov"
(1,446 real changes made)

. replace month = 12 if month_string=="dec"
(1,524 real changes made)

. drop month_string

. label define month      1 "January"             ///
>                                         2 "February"    ///
>                                         3 "March"               ///
>                                         4 "April"               ///
>                                         5 "May"                 ///
>                                         6 "June"                ///
>                                         7 "July"                ///
>                                         8 "August"              ///
>                                         9 "September"   ///
>                                         10 "October"    ///
>                                         11 "November"   ///
>                                         12 "December"

. label values month month

. safetab month case, m
11

           |         case
     month | Pneumonia   COVID-19 |     Total
-----------+----------------------+----------
   January |       860        683 |     1,543 
  February |     1,133      1,018 |     2,151 
     March |     1,309      1,104 |     2,413 
     April |     1,250      1,025 |     2,275 
       May |     1,185      1,068 |     2,253 
      June |     1,189      1,092 |     2,281 
      July |     1,198      1,108 |     2,306 
    August |     1,193      1,042 |     2,235 
 September |     1,129      1,016 |     2,145 
   October |     1,116      1,033 |     2,149 
  November |       755        691 |     1,446 
  December |       804        720 |     1,524 
         . |       301      1,464 |     1,765 
-----------+----------------------+----------
     Total |    13,422     13,064 |    26,486 

. 
. ** Covariates
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        306        1.16        1.16
          1 |        303        1.14        2.30
          2 |        330        1.25        3.55
          3 |        315        1.19        4.73
          4 |        319        1.20        5.94
          5 |        313        1.18        7.12
          6 |        342        1.29        8.41
          7 |        351        1.33        9.74
          8 |        328        1.24       10.98
          9 |        309        1.17       12.14
         10 |        312        1.18       13.32
         11 |        310        1.17       14.49
         12 |        303        1.14       15.63
         13 |        310        1.17       16.81
         14 |        279        1.05       17.86
         15 |        312        1.18       19.04
         16 |        310        1.17       20.21
         17 |        303        1.14       21.35
         18 |        287        1.08       22.43
         19 |        306        1.16       23.59
         20 |        347        1.31       24.90
         21 |        348        1.31       26.21
         22 |        329        1.24       27.46
         23 |        327        1.23       28.69
         24 |        314        1.19       29.88
         25 |        347        1.31       31.19
         26 |        391        1.48       32.66
         27 |        374        1.41       34.07
         28 |        372        1.40       35.48
         29 |        341        1.29       36.77
         30 |        321        1.21       37.98
         31 |        330        1.25       39.22
         32 |        338        1.28       40.50
         33 |        337        1.27       41.77
         34 |        336        1.27       43.04
         35 |        310        1.17       44.21
         36 |        340        1.28       45.50
         37 |        329        1.24       46.74
         38 |        368        1.39       48.13
         39 |        373        1.41       49.54
         40 |        294        1.11       50.65
         41 |        299        1.13       51.77
         42 |        343        1.30       53.07
         43 |        332        1.25       54.32
         44 |        339        1.28       55.60
         45 |        370        1.40       57.00
         46 |        333        1.26       58.26
         47 |        384        1.45       59.71
         48 |        376        1.42       61.13
         49 |        353        1.33       62.46
         50 |        356        1.34       63.80
         51 |        378        1.43       65.23
         52 |        390        1.47       66.70
         53 |        373        1.41       68.11
         54 |        396        1.50       69.61
         55 |        358        1.35       70.96
         56 |        346        1.31       72.26
         57 |        352        1.33       73.59
         58 |        337        1.27       74.87
         59 |        347        1.31       76.18
         60 |        305        1.15       77.33
         61 |        286        1.08       78.41
         62 |        319        1.20       79.61
         63 |        277        1.05       80.66
         64 |        298        1.13       81.78
         65 |        253        0.96       82.74
         66 |        289        1.09       83.83
         67 |        253        0.96       84.78
         68 |        278        1.05       85.83
         69 |        257        0.97       86.80
         70 |        256        0.97       87.77
         71 |        277        1.05       88.82
         72 |        260        0.98       89.80
         73 |        252        0.95       90.75
         74 |        288        1.09       91.84
         75 |        195        0.74       92.57
         76 |        162        0.61       93.19
         77 |        177        0.67       93.85
         78 |        185        0.70       94.55
         79 |        189        0.71       95.27
         80 |        136        0.51       95.78
         81 |        152        0.57       96.35
         82 |        117        0.44       96.79
         83 |        116        0.44       97.23
         84 |        113        0.43       97.66
         85 |         84        0.32       97.98
         86 |         85        0.32       98.30
         87 |         78        0.29       98.59
         88 |         83        0.31       98.91
         89 |         75        0.28       99.19
         90 |         42        0.16       99.35
         91 |         31        0.12       99.46
         92 |         30        0.11       99.58
         93 |         35        0.13       99.71
         94 |         29        0.11       99.82
         95 |          6        0.02       99.84
         96 |         11        0.04       99.88
         97 |         12        0.05       99.93
         98 |          6        0.02       99.95
         99 |          9        0.03       99.98
        101 |          3        0.01      100.00
        106 |          1        0.00      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. safecount
  26,486

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///          
>                            
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(26183 differences between age and agegroup)

. 
. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label values agegroup agegroup

. label var agegroup "Age group"

. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex
0

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     13,425       50.69       50.69
       Male |     13,061       49.31      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. safecount
  26,486

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(943 real changes made)

. replace ethnicity=2 if ethnicity==3
(1,011 real changes made)

. replace ethnicity=3 if ethnicity==4
(1,041 real changes made)

. replace ethnicity=4 if ethnicity==6
(943 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///          
>                                    
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                    
>                                            

. label values ethnicity ethnicity

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     15,879       59.95       59.95
South Asian |      1,011        3.82       63.77
      Black |      1,041        3.93       67.70
      Mixed |        943        3.56       71.26
      Other |        973        3.67       74.93
          . |      6,639       25.07      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(6,639 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(6,639 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. safetab ethnicity1, m
11

 ethnicity1 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     15,879       59.95       59.95
South Asian |      1,011        3.82       63.77
      Black |      1,041        3.93       67.70
      Mixed |        943        3.56       71.26
      Other |        973        3.67       74.93
    Unknown |      6,639       25.07      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,600        9.82        9.82
                Urban minor conurbation |      2,709       10.23       20.04
                    Urban city and town |      2,655       10.02       30.07
Urban city and town in a sparse setting |      2,684       10.13       40.20
                  Rural town and fringe |      2,575        9.72       49.92
Rural town and fringe in a sparse setti |      2,667       10.07       59.99
            Rural village and dispersed |      5,388       20.34       80.34
Rural village and dispersed in a sparse |      5,208       19.66      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,486      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(26,486 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(10,648 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(15,838 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                      rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0      2,575 |    15,838 
     Urban |     2,600      2,709      2,655      2,684          0 |    10,648 
-----------+-------------------------------------------------------+----------
     Total |     2,600      2,709      2,655      2,684      2,575 |    26,486 


Urban/rura |           rural_urban
         l | Rural tow  Rural vil  Rural vil |     Total
-----------+---------------------------------+----------
     Rural |     2,667      5,388      5,208 |    15,838 
     Urban |         0          0          0 |    10,648 
-----------+---------------------------------+----------
     Total |     2,667      5,388      5,208 |    26,486 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Pneumonia (pre-pandem |     8,065      5,357 |    13,422 
             COVID-19 |     7,773      5,291 |    13,064 
----------------------+----------------------+----------
                Total |    15,838     10,648 |    26,486 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,663 real changes made, 2,663 to missing)

. gen     bmi = .
(26,486 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(bmi: 1549 changes made)

. recode  bmi . = 2 if body_mass_index<25
(bmi: 6031 changes made)

. recode  bmi . = 3 if body_mass_index<30
(bmi: 6189 changes made)

. recode  bmi . = 4 if body_mass_index<35
(bmi: 5343 changes made)

. recode  bmi . = 5 if body_mass_index<40
(bmi: 3083 changes made)

. recode  bmi . = 6 if body_mass_index<.
(bmi: 1628 changes made)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>            

. label values bmi bmi

. safetab bmi, m
4

                 bmi |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,549        5.85        5.85
  Normal (18.5-24.9) |      6,031       22.77       28.62
Overweight (25-29.9) |      6,189       23.37       51.99
   Obese I (30-34.9) |      5,343       20.17       72.16
  Obese II (35-39.9) |      3,083       11.64       83.80
     Obese III (40+) |      1,628        6.15       89.95
                   . |      2,663       10.05      100.00
---------------------+-----------------------------------
               Total |     26,486      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(15,441 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(1,904 real changes made)

. replace smoking = 0 if smoking_status=="N"
(3,783 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m
8

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |      3,783       14.28       14.28
Current/former smoker |     12,949       48.89       63.17
                    . |      9,754       36.83      100.00
----------------------+-----------------------------------
                Total |     26,486      100.00

. 
. * Check of GP consultations by groups
. sum gp_count, detail

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -6
 5%            0             -6
10%            0             -5       Obs              26,486
25%            0             -4       Sum of Wgt.      26,486

50%            3                      Mean           3.292683
                        Largest       Std. Dev.      3.542142
75%            6             16
90%            8             16       Variance       12.54677
95%           10             17       Skewness       .6459409
99%           12             17       Kurtosis       2.292401

. bysort case: sum gp_count, detail

-------------------------------------------------------------------------------
-> case = Pneumonia (pre-pandemic)

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -5
 5%            0             -4
10%            0             -3       Obs              13,422
25%            0             -3       Sum of Wgt.      13,422

50%            3                      Mean           3.301147
                        Largest       Std. Dev.      3.529546
75%            6             16
90%            8             16       Variance        12.4577
95%           10             17       Skewness       .6361817
99%           12             17       Kurtosis       2.297791

-------------------------------------------------------------------------------
-> case = COVID-19

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -6
 5%            0             -6
10%            0             -4       Obs              13,064
25%            0             -3       Sum of Wgt.      13,064

50%            2                      Mean           3.283987
                        Largest       Std. Dev.       3.55515
75%            6             15
90%            8             15       Variance       12.63909
95%           10             15       Skewness       .6558439
99%           12             16       Kurtosis       2.287091


. egen gp_consults = cut(gp_count), at(0, 1, 5, 10, 20, 40, 5000)
(169 missing values generated)

. recode gp_consults 5=2 10=3 20=4 40=5
(gp_consults: 9884 changes made)

. label define gp_consults 0 "0" 1 "1-4" 2 "5-9" 3 "10-19" 4 "20-39" 5 "≥40"

. label values gp_consults gp_consults

. label var gp_consults "GP interactions"

. tab case gp_consults

                      |               GP interactions
                 case |         0        1-4        5-9      10-19 |     Total
----------------------+--------------------------------------------+----------
Pneumonia (pre-pandem |     5,663      2,601      4,352        716 |    13,332 
             COVID-19 |     5,570      2,599      4,090        726 |    12,985 
----------------------+--------------------------------------------+----------
                Total |    11,233      5,200      8,442      1,442 |    26,317 

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000
> )
(12869 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(egfr_group: 13617 changes made)

. label define egfr_group 1 "≥105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "
> 30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m
11

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       ≥105 |      4,630       17.48       17.48
     90-104 |      1,895        7.15       24.64
      75-89 |      1,923        7.26       31.90
      60-74 |      2,032        7.67       39.57
      45-59 |      1,987        7.50       47.07
      30-44 |      1,040        3.93       51.00
      15-29 |        110        0.42       51.41
          . |     12,869       48.59      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 1
> 5-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(12,869 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(ckd_stage: 21856 changes made)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6
>  "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m
10

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |     10,480       39.57       39.57
                      CKD 3A |      1,987        7.50       47.07
                      CKD 3B |      1,040        3.93       51.00
                       CKD 4 |        110        0.42       51.41
No baseline eGFR measurement |     12,869       48.59      100.00
-----------------------------+-----------------------------------
                       Total |     26,486      100.00

. 
. * Comorbidities
. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib
0

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,177       95.06       95.06
          1 |      1,309        4.94      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver
0

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,959       98.01       98.01
          1 |        527        1.99      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. label var diabetes "Diabetes"

. safetab diabetes
0

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,202       80.05       80.05
          1 |      5,284       19.95      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer
0

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,217       98.98       98.98
          1 |        269        1.02      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. safetab heart_failure
0

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,464       96.14       96.14
          1 |      1,022        3.86      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. safetab hiv
0

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,946       97.96       97.96
          1 |        540        2.04      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. label var hypertension "Hypertension"

. safetab hypertension
0

Hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,155       79.87       79.87
          1 |      5,331       20.13      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. label var non_haem_cancer "Cancer (non-haematological)"

. safetab non_haem_cancer
0

     Cancer |
(non-haemat |
  ological) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,983       98.10       98.10
          1 |        503        1.90      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. safetab myocardial_infarction
0

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,818       89.93       89.93
          1 |      2,668       10.07      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd
0

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,969       98.05       98.05
          1 |        517        1.95      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid
0

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,164       95.01       95.01
          1 |      1,322        4.99      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. safetab stroke
0

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,946       97.96       97.96
          1 |        540        2.04      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus
0

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,985       98.11       98.11
          1 |        501        1.89      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(967 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,461 real changes made)

. replace cardiovascular = 1 if pvd==1
(416 real changes made)

. replace cardiovascular = 1 if stroke==1
(435 real changes made)

. label var cardiovascular "Cardiovascular diseases"

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(535 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,288 real changes made)

. replace immunosuppressed = 1 if lupus==1
(460 real changes made)

. label var immunosuppressed "Immunosuppressive diseases"

. safetab cardiovascular
0

Cardiovascu |
        lar |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,898       78.90       78.90
          1 |      5,588       21.10      100.00
------------+-----------------------------------
      Total |     26,486      100.00

. safetab immunosuppressed
0

Immunosuppr |
     essive |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,934       90.36       90.36
          1 |      2,552        9.64      100.00
------------+-----------------------------------
      Total |     26,486      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                              
>    creatinine_mar2017 ///
>                                                                              
>    creatinine_apr2017 ///
>                                                                              
>    creatinine_may2017 ///
>                                                                              
>    creatinine_jun2017 ///
>                                                                              
>    creatinine_jul2017 ///
>                                                                              
>    creatinine_aug2017 ///
>                                                                              
>    creatinine_sep2017 ///
>                                                                              
>    creatinine_oct2017 ///
>                                                                              
>    creatinine_nov2017 ///
>                                                                              
>    creatinine_dec2017 ///
>                                                                              
>    creatinine_jan2018 ///
>                                                                              
>    creatinine_feb2018 ///
>                                                                              
>    creatinine_mar2018 ///
>                                                                              
>    creatinine_apr2018 ///
>                                                                              
>    creatinine_may2018 ///
>                                                                              
>    creatinine_jun2018 ///
>                                                                              
>    creatinine_jul2018 ///
>                                                                              
>    creatinine_aug2018 ///
>                                                                              
>    creatinine_sep2018 ///
>                                                                              
>    creatinine_oct2018 ///
>                                                                              
>    creatinine_nov2018 ///
>                                                                              
>    creatinine_dec2018 ///
>                                                                              
>    creatinine_jan2019 ///
>                                                                              
>    creatinine_feb2019 ///
>                                                                              
>    creatinine_mar2019 ///
>                                                                              
>    creatinine_apr2019 ///
>                                                                              
>    creatinine_may2019 ///
>                                                                              
>    creatinine_jun2019 ///
>                                                                              
>    creatinine_jul2019 ///
>                                                                              
>    creatinine_aug2019 ///
>                                                                              
>    creatinine_sep2019 ///
>                                                                              
>    creatinine_feb2020 ///
>                                                                              
>    creatinine_mar2020 ///
>                                                                              
>    creatinine_apr2020 ///
>                                                                              
>    creatinine_may2020 ///
>                                                                              
>    creatinine_jun2020 ///
>                                                                              
>    creatinine_jul2020 ///
>                                                                              
>    creatinine_aug2020 ///
>                                                                              
>    creatinine_sep2020 ///
>                                                                              
>    creatinine_oct2020 ///
>                                                                              
>    creatinine_nov2020 ///
>                                                                              
>    creatinine_dec2020 ///
>                                                                              
>    creatinine_jan2021 ///
>                                                                              
>    creatinine_feb2021 ///
>                                                                              
>    creatinine_mar2021 ///
>                                                                              
>    creatinine_apr2021 ///
>                                                                              
>    creatinine_may2021 ///
>                                                                              
>    creatinine_jun2021 ///
>                                                                              
>    creatinine_jul2021 ///
>                                                                              
>    creatinine_aug2021 ///
>                                                                              
>    creatinine_sep2021 ///
>                                                                              
>    creatinine_oct2021 ///
>                                                                              
>    creatinine_nov2021 ///
>                                                                              
>    creatinine_dec2021 ///
>                                                                              
>    creatinine_jan2022 ///
>                                                                              
>    creatinine_feb2022 ///
>                                                                              
>    creatinine_mar2022 ///
>                                                                              
>    creatinine_apr2022 ///
>                                                                              
>    creatinine_may2022 ///
>                                                                              
>    creatinine_jun2022 ///
>                                                                              
>    creatinine_jul2022 ///
>                                                                              
>    creatinine_aug2022 ///
>                                                                              
>    creatinine_sep2022 ///
>                                                                              
>    creatinine_oct2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 300
> 0)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex=
> =0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex=
> =1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_m
> onthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex
> ==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(6,000 real changes made, 6,000 to missing)
(19,064 missing values generated)
(26,486 missing values generated)
(3,728 real changes made)
(3,694 real changes made)
(3,728 real changes made)
(3,694 real changes made)
(4,664 real changes made)
(26,486 missing values generated)
(3,728 real changes made)
(3,694 real changes made)
(7,422 real changes made)
(21,822 real changes made)
(19,064 missing values generated)
(7,357 real changes made)
(3,728 real changes made)
(5,995 real changes made, 5,995 to missing)
(19,059 missing values generated)
(26,486 missing values generated)
(3,808 real changes made)
(3,619 real changes made)
(3,808 real changes made)
(3,619 real changes made)
(4,726 real changes made)
(26,486 missing values generated)
(3,808 real changes made)
(3,619 real changes made)
(7,427 real changes made)
(21,760 real changes made)
(19,059 missing values generated)
(7,354 real changes made)
(3,808 real changes made)
(5,986 real changes made, 5,986 to missing)
(19,050 missing values generated)
(26,486 missing values generated)
(3,787 real changes made)
(3,649 real changes made)
(3,787 real changes made)
(3,649 real changes made)
(4,715 real changes made)
(26,486 missing values generated)
(3,787 real changes made)
(3,649 real changes made)
(7,436 real changes made)
(21,771 real changes made)
(19,050 missing values generated)
(7,360 real changes made)
(3,787 real changes made)
(5,941 real changes made, 5,941 to missing)
(19,005 missing values generated)
(26,486 missing values generated)
(3,724 real changes made)
(3,757 real changes made)
(3,724 real changes made)
(3,757 real changes made)
(4,782 real changes made)
(26,486 missing values generated)
(3,724 real changes made)
(3,757 real changes made)
(7,481 real changes made)
(21,704 real changes made)
(19,005 missing values generated)
(7,400 real changes made)
(3,724 real changes made)
(5,883 real changes made, 5,883 to missing)
(18,947 missing values generated)
(26,486 missing values generated)
(3,832 real changes made)
(3,707 real changes made)
(3,832 real changes made)
(3,707 real changes made)
(4,756 real changes made)
(26,486 missing values generated)
(3,832 real changes made)
(3,707 real changes made)
(7,539 real changes made)
(21,730 real changes made)
(18,947 missing values generated)
(7,457 real changes made)
(3,832 real changes made)
(5,897 real changes made, 5,897 to missing)
(18,961 missing values generated)
(26,486 missing values generated)
(3,761 real changes made)
(3,764 real changes made)
(3,761 real changes made)
(3,764 real changes made)
(4,741 real changes made)
(26,486 missing values generated)
(3,761 real changes made)
(3,764 real changes made)
(7,525 real changes made)
(21,745 real changes made)
(18,961 missing values generated)
(7,444 real changes made)
(3,761 real changes made)
(5,994 real changes made, 5,994 to missing)
(19,058 missing values generated)
(26,486 missing values generated)
(3,738 real changes made)
(3,690 real changes made)
(3,738 real changes made)
(3,690 real changes made)
(4,686 real changes made)
(26,486 missing values generated)
(3,738 real changes made)
(3,690 real changes made)
(7,428 real changes made)
(21,800 real changes made)
(19,058 missing values generated)
(7,350 real changes made)
(3,738 real changes made)
(5,886 real changes made, 5,886 to missing)
(18,950 missing values generated)
(26,486 missing values generated)
(3,807 real changes made)
(3,729 real changes made)
(3,807 real changes made)
(3,729 real changes made)
(4,750 real changes made)
(26,486 missing values generated)
(3,807 real changes made)
(3,729 real changes made)
(7,536 real changes made)
(21,736 real changes made)
(18,950 missing values generated)
(7,455 real changes made)
(3,807 real changes made)
(5,988 real changes made, 5,988 to missing)
(19,052 missing values generated)
(26,486 missing values generated)
(3,752 real changes made)
(3,682 real changes made)
(3,752 real changes made)
(3,682 real changes made)
(4,726 real changes made)
(26,486 missing values generated)
(3,752 real changes made)
(3,682 real changes made)
(7,434 real changes made)
(21,760 real changes made)
(19,052 missing values generated)
(7,352 real changes made)
(3,752 real changes made)
(5,908 real changes made, 5,908 to missing)
(18,972 missing values generated)
(26,486 missing values generated)
(3,806 real changes made)
(3,708 real changes made)
(3,806 real changes made)
(3,708 real changes made)
(4,810 real changes made)
(26,486 missing values generated)
(3,806 real changes made)
(3,708 real changes made)
(7,514 real changes made)
(21,676 real changes made)
(18,972 missing values generated)
(7,436 real changes made)
(3,806 real changes made)
(5,944 real changes made, 5,944 to missing)
(19,008 missing values generated)
(26,486 missing values generated)
(3,805 real changes made)
(3,673 real changes made)
(3,805 real changes made)
(3,673 real changes made)
(4,742 real changes made)
(26,486 missing values generated)
(3,805 real changes made)
(3,673 real changes made)
(7,478 real changes made)
(21,744 real changes made)
(19,008 missing values generated)
(7,392 real changes made)
(3,805 real changes made)
(5,917 real changes made, 5,917 to missing)
(18,981 missing values generated)
(26,486 missing values generated)
(3,868 real changes made)
(3,637 real changes made)
(3,868 real changes made)
(3,637 real changes made)
(4,766 real changes made)
(26,486 missing values generated)
(3,868 real changes made)
(3,637 real changes made)
(7,505 real changes made)
(21,720 real changes made)
(18,981 missing values generated)
(7,420 real changes made)
(3,868 real changes made)
(5,988 real changes made, 5,988 to missing)
(19,052 missing values generated)
(26,486 missing values generated)
(3,774 real changes made)
(3,660 real changes made)
(3,774 real changes made)
(3,660 real changes made)
(4,697 real changes made)
(26,486 missing values generated)
(3,774 real changes made)
(3,660 real changes made)
(7,434 real changes made)
(21,789 real changes made)
(19,052 missing values generated)
(7,361 real changes made)
(3,774 real changes made)
(5,841 real changes made, 5,841 to missing)
(18,905 missing values generated)
(26,486 missing values generated)
(3,885 real changes made)
(3,696 real changes made)
(3,885 real changes made)
(3,696 real changes made)
(4,837 real changes made)
(26,486 missing values generated)
(3,885 real changes made)
(3,696 real changes made)
(7,581 real changes made)
(21,649 real changes made)
(18,905 missing values generated)
(7,492 real changes made)
(3,885 real changes made)
(5,947 real changes made, 5,947 to missing)
(19,011 missing values generated)
(26,486 missing values generated)
(3,762 real changes made)
(3,713 real changes made)
(3,762 real changes made)
(3,713 real changes made)
(4,655 real changes made)
(26,486 missing values generated)
(3,762 real changes made)
(3,713 real changes made)
(7,475 real changes made)
(21,831 real changes made)
(19,011 missing values generated)
(7,404 real changes made)
(3,762 real changes made)
(5,878 real changes made, 5,878 to missing)
(18,942 missing values generated)
(26,486 missing values generated)
(3,846 real changes made)
(3,698 real changes made)
(3,846 real changes made)
(3,698 real changes made)
(4,735 real changes made)
(26,486 missing values generated)
(3,846 real changes made)
(3,698 real changes made)
(7,544 real changes made)
(21,751 real changes made)
(18,942 missing values generated)
(7,469 real changes made)
(3,846 real changes made)
(5,893 real changes made, 5,893 to missing)
(18,957 missing values generated)
(26,486 missing values generated)
(3,825 real changes made)
(3,704 real changes made)
(3,825 real changes made)
(3,704 real changes made)
(4,821 real changes made)
(26,486 missing values generated)
(3,825 real changes made)
(3,704 real changes made)
(7,529 real changes made)
(21,665 real changes made)
(18,957 missing values generated)
(7,458 real changes made)
(3,825 real changes made)
(5,868 real changes made, 5,868 to missing)
(18,932 missing values generated)
(26,486 missing values generated)
(3,802 real changes made)
(3,752 real changes made)
(3,802 real changes made)
(3,752 real changes made)
(4,795 real changes made)
(26,486 missing values generated)
(3,802 real changes made)
(3,752 real changes made)
(7,554 real changes made)
(21,691 real changes made)
(18,932 missing values generated)
(7,475 real changes made)
(3,802 real changes made)
(5,885 real changes made, 5,885 to missing)
(18,949 missing values generated)
(26,486 missing values generated)
(3,823 real changes made)
(3,714 real changes made)
(3,823 real changes made)
(3,714 real changes made)
(4,786 real changes made)
(26,486 missing values generated)
(3,823 real changes made)
(3,714 real changes made)
(7,537 real changes made)
(21,700 real changes made)
(18,949 missing values generated)
(7,463 real changes made)
(3,823 real changes made)
(5,886 real changes made, 5,886 to missing)
(18,950 missing values generated)
(26,486 missing values generated)
(3,858 real changes made)
(3,678 real changes made)
(3,858 real changes made)
(3,678 real changes made)
(4,842 real changes made)
(26,486 missing values generated)
(3,858 real changes made)
(3,678 real changes made)
(7,536 real changes made)
(21,644 real changes made)
(18,950 missing values generated)
(7,453 real changes made)
(3,858 real changes made)
(5,856 real changes made, 5,856 to missing)
(18,920 missing values generated)
(26,486 missing values generated)
(3,891 real changes made)
(3,675 real changes made)
(3,891 real changes made)
(3,675 real changes made)
(4,809 real changes made)
(26,486 missing values generated)
(3,891 real changes made)
(3,675 real changes made)
(7,566 real changes made)
(21,677 real changes made)
(18,920 missing values generated)
(7,476 real changes made)
(3,891 real changes made)
(5,923 real changes made, 5,923 to missing)
(18,987 missing values generated)
(26,486 missing values generated)
(3,806 real changes made)
(3,693 real changes made)
(3,806 real changes made)
(3,693 real changes made)
(4,779 real changes made)
(26,486 missing values generated)
(3,806 real changes made)
(3,693 real changes made)
(7,499 real changes made)
(21,707 real changes made)
(18,987 missing values generated)
(7,416 real changes made)
(3,806 real changes made)
(5,911 real changes made, 5,911 to missing)
(18,975 missing values generated)
(26,486 missing values generated)
(3,824 real changes made)
(3,687 real changes made)
(3,824 real changes made)
(3,687 real changes made)
(4,803 real changes made)
(26,486 missing values generated)
(3,824 real changes made)
(3,687 real changes made)
(7,511 real changes made)
(21,683 real changes made)
(18,975 missing values generated)
(7,437 real changes made)
(3,824 real changes made)
(5,935 real changes made, 5,935 to missing)
(18,999 missing values generated)
(26,486 missing values generated)
(3,837 real changes made)
(3,650 real changes made)
(3,837 real changes made)
(3,650 real changes made)
(4,763 real changes made)
(26,486 missing values generated)
(3,837 real changes made)
(3,650 real changes made)
(7,487 real changes made)
(21,723 real changes made)
(18,999 missing values generated)
(7,412 real changes made)
(3,837 real changes made)
(5,946 real changes made, 5,946 to missing)
(19,010 missing values generated)
(26,486 missing values generated)
(3,801 real changes made)
(3,675 real changes made)
(3,801 real changes made)
(3,675 real changes made)
(4,705 real changes made)
(26,486 missing values generated)
(3,801 real changes made)
(3,675 real changes made)
(7,476 real changes made)
(21,781 real changes made)
(19,010 missing values generated)
(7,402 real changes made)
(3,801 real changes made)
(5,849 real changes made, 5,849 to missing)
(18,913 missing values generated)
(26,486 missing values generated)
(3,847 real changes made)
(3,726 real changes made)
(3,847 real changes made)
(3,726 real changes made)
(4,819 real changes made)
(26,486 missing values generated)
(3,847 real changes made)
(3,726 real changes made)
(7,573 real changes made)
(21,667 real changes made)
(18,913 missing values generated)
(7,496 real changes made)
(3,847 real changes made)
(5,943 real changes made, 5,943 to missing)
(19,007 missing values generated)
(26,486 missing values generated)
(3,759 real changes made)
(3,720 real changes made)
(3,759 real changes made)
(3,720 real changes made)
(4,693 real changes made)
(26,486 missing values generated)
(3,759 real changes made)
(3,720 real changes made)
(7,479 real changes made)
(21,793 real changes made)
(19,007 missing values generated)
(7,406 real changes made)
(3,759 real changes made)
(5,906 real changes made, 5,906 to missing)
(18,970 missing values generated)
(26,486 missing values generated)
(3,786 real changes made)
(3,730 real changes made)
(3,786 real changes made)
(3,730 real changes made)
(4,791 real changes made)
(26,486 missing values generated)
(3,786 real changes made)
(3,730 real changes made)
(7,516 real changes made)
(21,695 real changes made)
(18,970 missing values generated)
(7,435 real changes made)
(3,786 real changes made)
(5,960 real changes made, 5,960 to missing)
(19,024 missing values generated)
(26,486 missing values generated)
(3,790 real changes made)
(3,672 real changes made)
(3,790 real changes made)
(3,672 real changes made)
(4,716 real changes made)
(26,486 missing values generated)
(3,790 real changes made)
(3,672 real changes made)
(7,462 real changes made)
(21,770 real changes made)
(19,024 missing values generated)
(7,378 real changes made)
(3,790 real changes made)
(5,986 real changes made, 5,986 to missing)
(19,050 missing values generated)
(26,486 missing values generated)
(3,732 real changes made)
(3,704 real changes made)
(3,732 real changes made)
(3,704 real changes made)
(4,737 real changes made)
(26,486 missing values generated)
(3,732 real changes made)
(3,704 real changes made)
(7,436 real changes made)
(21,749 real changes made)
(19,050 missing values generated)
(7,349 real changes made)
(3,732 real changes made)
(5,884 real changes made, 5,884 to missing)
(18,948 missing values generated)
(26,486 missing values generated)
(3,838 real changes made)
(3,700 real changes made)
(3,838 real changes made)
(3,700 real changes made)
(4,711 real changes made)
(26,486 missing values generated)
(3,838 real changes made)
(3,700 real changes made)
(7,538 real changes made)
(21,775 real changes made)
(18,948 missing values generated)
(7,457 real changes made)
(3,838 real changes made)
(5,865 real changes made, 5,865 to missing)
(18,929 missing values generated)
(26,486 missing values generated)
(3,842 real changes made)
(3,715 real changes made)
(3,842 real changes made)
(3,715 real changes made)
(4,789 real changes made)
(26,486 missing values generated)
(3,842 real changes made)
(3,715 real changes made)
(7,557 real changes made)
(21,697 real changes made)
(18,929 missing values generated)
(7,473 real changes made)
(3,842 real changes made)
(5,800 real changes made, 5,800 to missing)
(19,222 missing values generated)
(26,486 missing values generated)
(3,733 real changes made)
(3,531 real changes made)
(3,733 real changes made)
(3,531 real changes made)
(4,598 real changes made)
(26,486 missing values generated)
(3,733 real changes made)
(3,531 real changes made)
(7,264 real changes made)
(21,888 real changes made)
(19,222 missing values generated)
(7,169 real changes made)
(3,733 real changes made)
(5,674 real changes made, 5,674 to missing)
(19,096 missing values generated)
(26,486 missing values generated)
(3,814 real changes made)
(3,576 real changes made)
(3,814 real changes made)
(3,576 real changes made)
(4,636 real changes made)
(26,486 missing values generated)
(3,814 real changes made)
(3,576 real changes made)
(7,390 real changes made)
(21,850 real changes made)
(19,096 missing values generated)
(7,303 real changes made)
(3,814 real changes made)
(5,721 real changes made, 5,721 to missing)
(19,143 missing values generated)
(26,486 missing values generated)
(3,675 real changes made)
(3,668 real changes made)
(3,675 real changes made)
(3,668 real changes made)
(4,593 real changes made)
(26,486 missing values generated)
(3,675 real changes made)
(3,668 real changes made)
(7,343 real changes made)
(21,893 real changes made)
(19,143 missing values generated)
(7,250 real changes made)
(3,675 real changes made)
(5,766 real changes made, 5,766 to missing)
(19,188 missing values generated)
(26,486 missing values generated)
(3,685 real changes made)
(3,613 real changes made)
(3,685 real changes made)
(3,613 real changes made)
(4,655 real changes made)
(26,486 missing values generated)
(3,685 real changes made)
(3,613 real changes made)
(7,298 real changes made)
(21,831 real changes made)
(19,188 missing values generated)
(7,216 real changes made)
(3,685 real changes made)
(5,807 real changes made, 5,807 to missing)
(19,229 missing values generated)
(26,486 missing values generated)
(3,696 real changes made)
(3,561 real changes made)
(3,696 real changes made)
(3,561 real changes made)
(4,658 real changes made)
(26,486 missing values generated)
(3,696 real changes made)
(3,561 real changes made)
(7,257 real changes made)
(21,828 real changes made)
(19,229 missing values generated)
(7,172 real changes made)
(3,696 real changes made)
(5,747 real changes made, 5,747 to missing)
(19,169 missing values generated)
(26,486 missing values generated)
(3,712 real changes made)
(3,605 real changes made)
(3,712 real changes made)
(3,605 real changes made)
(4,685 real changes made)
(26,486 missing values generated)
(3,712 real changes made)
(3,605 real changes made)
(7,317 real changes made)
(21,801 real changes made)
(19,169 missing values generated)
(7,231 real changes made)
(3,712 real changes made)
(5,760 real changes made, 5,760 to missing)
(19,182 missing values generated)
(26,486 missing values generated)
(3,711 real changes made)
(3,593 real changes made)
(3,711 real changes made)
(3,593 real changes made)
(4,634 real changes made)
(26,486 missing values generated)
(3,711 real changes made)
(3,593 real changes made)
(7,304 real changes made)
(21,852 real changes made)
(19,182 missing values generated)
(7,227 real changes made)
(3,711 real changes made)
(5,650 real changes made, 5,650 to missing)
(19,072 missing values generated)
(26,486 missing values generated)
(3,758 real changes made)
(3,656 real changes made)
(3,758 real changes made)
(3,656 real changes made)
(4,635 real changes made)
(26,486 missing values generated)
(3,758 real changes made)
(3,656 real changes made)
(7,414 real changes made)
(21,851 real changes made)
(19,072 missing values generated)
(7,320 real changes made)
(3,758 real changes made)
(5,848 real changes made, 5,848 to missing)
(19,270 missing values generated)
(26,486 missing values generated)
(3,692 real changes made)
(3,524 real changes made)
(3,692 real changes made)
(3,524 real changes made)
(4,602 real changes made)
(26,486 missing values generated)
(3,692 real changes made)
(3,524 real changes made)
(7,216 real changes made)
(21,884 real changes made)
(19,270 missing values generated)
(7,123 real changes made)
(3,692 real changes made)
(5,775 real changes made, 5,775 to missing)
(19,197 missing values generated)
(26,486 missing values generated)
(3,715 real changes made)
(3,574 real changes made)
(3,715 real changes made)
(3,574 real changes made)
(4,642 real changes made)
(26,486 missing values generated)
(3,715 real changes made)
(3,574 real changes made)
(7,289 real changes made)
(21,844 real changes made)
(19,197 missing values generated)
(7,190 real changes made)
(3,715 real changes made)
(5,706 real changes made, 5,706 to missing)
(19,128 missing values generated)
(26,486 missing values generated)
(3,701 real changes made)
(3,657 real changes made)
(3,701 real changes made)
(3,657 real changes made)
(4,703 real changes made)
(26,486 missing values generated)
(3,701 real changes made)
(3,657 real changes made)
(7,358 real changes made)
(21,783 real changes made)
(19,128 missing values generated)
(7,273 real changes made)
(3,701 real changes made)
(5,741 real changes made, 5,741 to missing)
(19,163 missing values generated)
(26,486 missing values generated)
(3,738 real changes made)
(3,585 real changes made)
(3,738 real changes made)
(3,585 real changes made)
(4,684 real changes made)
(26,486 missing values generated)
(3,738 real changes made)
(3,585 real changes made)
(7,323 real changes made)
(21,802 real changes made)
(19,163 missing values generated)
(7,226 real changes made)
(3,738 real changes made)
(5,776 real changes made, 5,776 to missing)
(19,198 missing values generated)
(26,486 missing values generated)
(3,708 real changes made)
(3,580 real changes made)
(3,708 real changes made)
(3,580 real changes made)
(4,645 real changes made)
(26,486 missing values generated)
(3,708 real changes made)
(3,580 real changes made)
(7,288 real changes made)
(21,841 real changes made)
(19,198 missing values generated)
(7,206 real changes made)
(3,708 real changes made)
(5,746 real changes made, 5,746 to missing)
(19,168 missing values generated)
(26,486 missing values generated)
(3,705 real changes made)
(3,613 real changes made)
(3,705 real changes made)
(3,613 real changes made)
(4,568 real changes made)
(26,486 missing values generated)
(3,705 real changes made)
(3,613 real changes made)
(7,318 real changes made)
(21,918 real changes made)
(19,168 missing values generated)
(7,211 real changes made)
(3,705 real changes made)
(5,765 real changes made, 5,765 to missing)
(19,187 missing values generated)
(26,486 missing values generated)
(3,683 real changes made)
(3,616 real changes made)
(3,683 real changes made)
(3,616 real changes made)
(4,631 real changes made)
(26,486 missing values generated)
(3,683 real changes made)
(3,616 real changes made)
(7,299 real changes made)
(21,855 real changes made)
(19,187 missing values generated)
(7,215 real changes made)
(3,683 real changes made)
(5,858 real changes made, 5,858 to missing)
(19,280 missing values generated)
(26,486 missing values generated)
(3,655 real changes made)
(3,551 real changes made)
(3,655 real changes made)
(3,551 real changes made)
(4,580 real changes made)
(26,486 missing values generated)
(3,655 real changes made)
(3,551 real changes made)
(7,206 real changes made)
(21,906 real changes made)
(19,280 missing values generated)
(7,125 real changes made)
(3,655 real changes made)
(5,717 real changes made, 5,717 to missing)
(19,139 missing values generated)
(26,486 missing values generated)
(3,682 real changes made)
(3,665 real changes made)
(3,682 real changes made)
(3,665 real changes made)
(4,670 real changes made)
(26,486 missing values generated)
(3,682 real changes made)
(3,665 real changes made)
(7,347 real changes made)
(21,816 real changes made)
(19,139 missing values generated)
(7,255 real changes made)
(3,682 real changes made)
(5,758 real changes made, 5,758 to missing)
(19,180 missing values generated)
(26,486 missing values generated)
(3,691 real changes made)
(3,615 real changes made)
(3,691 real changes made)
(3,615 real changes made)
(4,688 real changes made)
(26,486 missing values generated)
(3,691 real changes made)
(3,615 real changes made)
(7,306 real changes made)
(21,798 real changes made)
(19,180 missing values generated)
(7,217 real changes made)
(3,691 real changes made)
(5,703 real changes made, 5,703 to missing)
(19,125 missing values generated)
(26,486 missing values generated)
(3,718 real changes made)
(3,643 real changes made)
(3,718 real changes made)
(3,643 real changes made)
(4,668 real changes made)
(26,486 missing values generated)
(3,718 real changes made)
(3,643 real changes made)
(7,361 real changes made)
(21,818 real changes made)
(19,125 missing values generated)
(7,263 real changes made)
(3,718 real changes made)
(5,784 real changes made, 5,784 to missing)
(19,206 missing values generated)
(26,486 missing values generated)
(3,702 real changes made)
(3,578 real changes made)
(3,702 real changes made)
(3,578 real changes made)
(4,726 real changes made)
(26,486 missing values generated)
(3,702 real changes made)
(3,578 real changes made)
(7,280 real changes made)
(21,760 real changes made)
(19,206 missing values generated)
(7,202 real changes made)
(3,702 real changes made)
(5,835 real changes made, 5,835 to missing)
(19,257 missing values generated)
(26,486 missing values generated)
(3,661 real changes made)
(3,568 real changes made)
(3,661 real changes made)
(3,568 real changes made)
(4,608 real changes made)
(26,486 missing values generated)
(3,661 real changes made)
(3,568 real changes made)
(7,229 real changes made)
(21,878 real changes made)
(19,257 missing values generated)
(7,149 real changes made)
(3,661 real changes made)
(5,808 real changes made, 5,808 to missing)
(19,230 missing values generated)
(26,486 missing values generated)
(3,698 real changes made)
(3,558 real changes made)
(3,698 real changes made)
(3,558 real changes made)
(4,655 real changes made)
(26,486 missing values generated)
(3,698 real changes made)
(3,558 real changes made)
(7,256 real changes made)
(21,831 real changes made)
(19,230 missing values generated)
(7,163 real changes made)
(3,698 real changes made)
(5,787 real changes made, 5,787 to missing)
(19,209 missing values generated)
(26,486 missing values generated)
(3,678 real changes made)
(3,599 real changes made)
(3,678 real changes made)
(3,599 real changes made)
(4,647 real changes made)
(26,486 missing values generated)
(3,678 real changes made)
(3,599 real changes made)
(7,277 real changes made)
(21,839 real changes made)
(19,209 missing values generated)
(7,204 real changes made)
(3,678 real changes made)
(5,711 real changes made, 5,711 to missing)
(19,133 missing values generated)
(26,486 missing values generated)
(3,780 real changes made)
(3,573 real changes made)
(3,780 real changes made)
(3,573 real changes made)
(4,629 real changes made)
(26,486 missing values generated)
(3,780 real changes made)
(3,573 real changes made)
(7,353 real changes made)
(21,857 real changes made)
(19,133 missing values generated)
(7,261 real changes made)
(3,780 real changes made)
(5,688 real changes made, 5,688 to missing)
(19,110 missing values generated)
(26,486 missing values generated)
(3,769 real changes made)
(3,607 real changes made)
(3,769 real changes made)
(3,607 real changes made)
(4,729 real changes made)
(26,486 missing values generated)
(3,769 real changes made)
(3,607 real changes made)
(7,376 real changes made)
(21,757 real changes made)
(19,110 missing values generated)
(7,285 real changes made)
(3,769 real changes made)
(5,763 real changes made, 5,763 to missing)
(19,185 missing values generated)
(26,486 missing values generated)
(3,698 real changes made)
(3,603 real changes made)
(3,698 real changes made)
(3,603 real changes made)
(4,664 real changes made)
(26,486 missing values generated)
(3,698 real changes made)
(3,603 real changes made)
(7,301 real changes made)
(21,822 real changes made)
(19,185 missing values generated)
(7,222 real changes made)
(3,698 real changes made)
(5,670 real changes made, 5,670 to missing)
(19,092 missing values generated)
(26,486 missing values generated)
(3,692 real changes made)
(3,702 real changes made)
(3,692 real changes made)
(3,702 real changes made)
(4,618 real changes made)
(26,486 missing values generated)
(3,692 real changes made)
(3,702 real changes made)
(7,394 real changes made)
(21,868 real changes made)
(19,092 missing values generated)
(7,306 real changes made)
(3,692 real changes made)
(5,848 real changes made, 5,848 to missing)
(19,270 missing values generated)
(26,486 missing values generated)
(3,633 real changes made)
(3,583 real changes made)
(3,633 real changes made)
(3,583 real changes made)
(4,558 real changes made)
(26,486 missing values generated)
(3,633 real changes made)
(3,583 real changes made)
(7,216 real changes made)
(21,928 real changes made)
(19,270 missing values generated)
(7,126 real changes made)
(3,633 real changes made)
(5,700 real changes made, 5,700 to missing)
(19,122 missing values generated)
(26,486 missing values generated)
(3,686 real changes made)
(3,678 real changes made)
(3,686 real changes made)
(3,678 real changes made)
(4,662 real changes made)
(26,486 missing values generated)
(3,686 real changes made)
(3,678 real changes made)
(7,364 real changes made)
(21,824 real changes made)
(19,122 missing values generated)
(7,266 real changes made)
(3,686 real changes made)
(5,739 real changes made, 5,739 to missing)
(19,161 missing values generated)
(26,486 missing values generated)
(3,689 real changes made)
(3,636 real changes made)
(3,689 real changes made)
(3,636 real changes made)
(4,616 real changes made)
(26,486 missing values generated)
(3,689 real changes made)
(3,636 real changes made)
(7,325 real changes made)
(21,870 real changes made)
(19,161 missing values generated)
(7,235 real changes made)
(3,689 real changes made)
(5,726 real changes made, 5,726 to missing)
(19,148 missing values generated)
(26,486 missing values generated)
(3,707 real changes made)
(3,631 real changes made)
(3,707 real changes made)
(3,631 real changes made)
(4,612 real changes made)
(26,486 missing values generated)
(3,707 real changes made)
(3,631 real changes made)
(7,338 real changes made)
(21,874 real changes made)
(19,148 missing values generated)
(7,247 real changes made)
(3,707 real changes made)
(5,731 real changes made, 5,731 to missing)
(19,153 missing values generated)
(26,486 missing values generated)
(3,723 real changes made)
(3,610 real changes made)
(3,723 real changes made)
(3,610 real changes made)
(4,598 real changes made)
(26,486 missing values generated)
(3,723 real changes made)
(3,610 real changes made)
(7,333 real changes made)
(21,888 real changes made)
(19,153 missing values generated)
(7,248 real changes made)
(3,723 real changes made)
(5,766 real changes made, 5,766 to missing)
(19,188 missing values generated)
(26,486 missing values generated)
(3,674 real changes made)
(3,624 real changes made)
(3,674 real changes made)
(3,624 real changes made)
(4,581 real changes made)
(26,486 missing values generated)
(3,674 real changes made)
(3,624 real changes made)
(7,298 real changes made)
(21,905 real changes made)
(19,188 missing values generated)
(7,210 real changes made)
(3,674 real changes made)

. 
. replace index_date = index_date_28
(24,721 real changes made)

. drop index_date_28

. gen egfr15_date=.
(26,486 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatin
> ine_`x'<15 & date("01`x'", "DMY")>index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen index_date_esrd = index_date
(1,765 missing values generated)

. gen esrd_date = egfr15_date
(26,486 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if krt_date < egfr15_date
(1,983 real changes made)

. replace esrd_date = krt_date if esrd_date==.
(0 real changes made)

. gen esrd = 0

. replace esrd = 1 if esrd_date!=.
(1,983 real changes made)

. label var esrd "Kidney failure"

. gen esrd_time = (esrd_date - index_date_esrd)
(24,503 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(24,503 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(esrd_time_cat: 1979 changes made)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"           
>            ///
>                                                         3 "1 to 28 days"     
>    ///
>                                                         4 "20 to 90 days"    
>    ///
>                                                         5 "91 to 180 days"   
>    ///
>                                                         6 "181 to 365 days"  
>    ///
>                                                         7 "366 to 730 days"  
>    ///
>                                                         8 "731 to 973 days"  
>    ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 critical_care
>    ///
>                                                                 krt          
>    {
  2.                                                                 by `exposu
> re',sort: sum esrd_time, de
  3.                                                                 tab esrd_t
> ime_cat `exposure', m col chi
  4.                                                                 }

-------------------------------------------------------------------------------
-> case = Pneumonia (pre-pandemic)

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            7              1
10%           42              1       Obs               1,050
25%          124              1       Sum of Wgt.       1,050

50%          273                      Mean           318.2933
                        Largest       Std. Dev.       233.616
75%          483            912
90%          671            944       Variance       54576.41
95%          751            947       Skewness       .5830332
99%          902            984       Kurtosis       2.446406

-------------------------------------------------------------------------------
-> case = COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           20              1       Obs                 933
25%           95              1       Sum of Wgt.         933

50%          251                      Mean           302.2133
                        Largest       Std. Dev.      240.3716
75%          473            928
90%          671            931       Variance       57778.52
95%          758            935       Skewness       .6353054
99%          908            938       Kurtosis       2.452888


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Pneumonia   COVID-19 |     Total
----------------+----------------------+----------
   1 to 28 days |        85        114 |       199 
                |      0.63       0.87 |      0.75 
----------------+----------------------+----------
  20 to 90 days |       119        112 |       231 
                |      0.89       0.86 |      0.87 
----------------+----------------------+----------
 91 to 180 days |       161        140 |       301 
                |      1.20       1.07 |      1.14 
----------------+----------------------+----------
181 to 365 days |       284        233 |       517 
                |      2.12       1.78 |      1.95 
----------------+----------------------+----------
366 to 730 days |       335        279 |       614 
                |      2.50       2.14 |      2.32 
----------------+----------------------+----------
731 to 973 days |        65         55 |       120 
                |      0.48       0.42 |      0.45 
----------------+----------------------+----------
      >973 days |         1          0 |         1 
                |      0.01       0.00 |      0.00 
----------------+----------------------+----------
              . |    12,372     12,131 |    24,503 
                |     92.18      92.86 |     92.51 
----------------+----------------------+----------
          Total |    13,422     13,064 |    26,486 
                |    100.00     100.00 |    100.00 

          Pearson chi2(7) =  15.4094   Pr = 0.031

-------------------------------------------------------------------------------
-> critical_care = Ward-based

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            4              1
10%           31              1       Obs               1,787
25%          118              1       Sum of Wgt.       1,787

50%          273                      Mean           316.6503
                        Largest       Std. Dev.      237.8711
75%          486            938
90%          676            944       Variance       56582.64
95%          759            947       Skewness       .5888287
99%          906            984       Kurtosis        2.43079

-------------------------------------------------------------------------------
-> critical_care = Critical care

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            8              1       Obs                 196
25%           75              1       Sum of Wgt.         196

50%          212                      Mean           256.7296
                        Largest       Std. Dev.      221.1532
75%        413.5            758
90%          603            764       Variance       48908.72
95%          690            844       Skewness       .7444872
99%          844            858       Kurtosis       2.544738


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |     Critical care
  esrd_time_cat | Ward-base  Critical  |     Total
----------------+----------------------+----------
   1 to 28 days |       170         29 |       199 
                |      0.71       1.12 |      0.75 
----------------+----------------------+----------
  20 to 90 days |       200         31 |       231 
                |      0.84       1.20 |      0.87 
----------------+----------------------+----------
 91 to 180 days |       267         34 |       301 
                |      1.12       1.31 |      1.14 
----------------+----------------------+----------
181 to 365 days |       471         46 |       517 
                |      1.97       1.78 |      1.95 
----------------+----------------------+----------
366 to 730 days |       563         51 |       614 
                |      2.36       1.97 |      2.32 
----------------+----------------------+----------
731 to 973 days |       115          5 |       120 
                |      0.48       0.19 |      0.45 
----------------+----------------------+----------
      >973 days |         1          0 |         1 
                |      0.00       0.00 |      0.00 
----------------+----------------------+----------
              . |    22,110      2,393 |    24,503 
                |     92.52      92.43 |     92.51 
----------------+----------------------+----------
          Total |    23,897      2,589 |    26,486 
                |    100.00     100.00 |    100.00 

          Pearson chi2(7) =  15.8065   Pr = 0.027

-------------------------------------------------------------------------------
-> krt = No AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           27              1       Obs               1,168
25%        105.5              1       Sum of Wgt.       1,168

50%        262.5                      Mean           310.1301
                        Largest       Std. Dev.      241.2766
75%        483.5            928
90%          683            944       Variance       58214.41
95%          765            947       Skewness       .6242457
99%          902            984       Kurtosis       2.431091

-------------------------------------------------------------------------------
-> krt = AKI without KRT

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            5              1
10%           29              1       Obs                 781
25%          119              1       Sum of Wgt.         781

50%          276                      Mean           311.6146
                        Largest       Std. Dev.      231.3627
75%          472            915
90%          659            931       Variance       53528.72
95%          728            935       Skewness       .5825607
99%          907            938       Kurtosis       2.471188

-------------------------------------------------------------------------------
-> krt = AKI requiring KRT

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           30             30       Obs                  34
25%          146             30       Sum of Wgt.          34

50%        268.5                      Mean           310.8824
                        Largest       Std. Dev.      215.9075
75%          492            577
90%          577            696       Variance       46616.05
95%          703            703       Skewness        .290561
99%          728            728       Kurtosis       2.026216


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |    Kidney replacement therapy
  esrd_time_cat |    No AKI  AKI witho  AKI requi |     Total
----------------+---------------------------------+----------
   1 to 28 days |       119         78          2 |       199 
                |      0.76       0.75       0.41 |      0.75 
----------------+---------------------------------+----------
  20 to 90 days |       142         84          5 |       231 
                |      0.91       0.81       1.02 |      0.87 
----------------+---------------------------------+----------
 91 to 180 days |       186        112          3 |       301 
                |      1.20       1.07       0.61 |      1.14 
----------------+---------------------------------+----------
181 to 365 days |       287        219         11 |       517 
                |      1.84       2.10       2.24 |      1.95 
----------------+---------------------------------+----------
366 to 730 days |       352        249         13 |       614 
                |      2.26       2.39       2.64 |      2.32 
----------------+---------------------------------+----------
731 to 973 days |        81         39          0 |       120 
                |      0.52       0.37       0.00 |      0.45 
----------------+---------------------------------+----------
      >973 days |         1          0          0 |         1 
                |      0.01       0.00       0.00 |      0.00 
----------------+---------------------------------+----------
              . |    14,394      9,651        458 |    24,503 
                |     92.49      92.51      93.09 |     92.51 
----------------+---------------------------------+----------
          Total |    15,562     10,432        492 |    26,486 
                |    100.00     100.00     100.00 |    100.00 

         Pearson chi2(14) =  12.6893   Pr = 0.551

.         
. * Exit date
. gen exit_date_esrd = esrd_date
(24,503 missing values generated)

. format exit_date_esrd %td

. gen end_date = date("2022-11-30", "YMD") if case==1
(13,422 missing values generated)

. replace end_date = date("2019-11-30", "YMD") if case==0
(13,422 real changes made)

. format end_date %td

. replace exit_date_esrd = min(deregistered_date, death_date, end_date) if esrd
> _date==.
(24,503 real changes made)

. gen esrd_denominator = 1

. gen follow_up_time_esrd = (exit_date_esrd - index_date_esrd)
(1,765 missing values generated)

. label var follow_up_time_esrd "Follow-up time (ESRD) (Days)"

. gen follow_up_cat_esrd = follow_up_time_esrd
(1,765 missing values generated)

. recode follow_up_cat_esrd       min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0=3                     ///
>                                                 1/365=4         ///
>                                                 366/730=5       ///
>                                                 731/1040=6      ///          
>                            
>                                                 1041/max=7
(follow_up_cat_esrd: 24687 changes made)

. label define follow_up_cat_esrd         1 "<-29 days"   ///
>                                                         2 "-28 to -1 days"   
>            ///
>                                                         3 "0 days"           
>                    ///
>                                                         4 "1 to 365 days"    
>            ///
>                                                         5 "366 to 730 days"  
>    ///
>                                                         6 "731 to 1040 days" 
>    ///
>                                                         7 ">1040 days"

. label values follow_up_cat_esrd follow_up_cat_esrd

. label var follow_up_cat_esrd "Follow_up time"

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Pneumonia (pre-pandem |     5,372      4,667      3,082 |    13,121 
             COVID-19 |     4,758      4,103      2,739 |    11,600 
----------------------+---------------------------------+----------
                Total |    10,130      8,770      5,821 |    24,721 

. drop if follow_up_time_esrd<1
(0 observations deleted)

. drop if follow_up_time_esrd>1040
(1,765 observations deleted)

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Pneumonia (pre-pandem |     5,372      4,667      3,082 |    13,121 
             COVID-19 |     4,758      4,103      2,739 |    11,600 
----------------------+---------------------------------+----------
                Total |    10,130      8,770      5,821 |    24,721 

. * Time zero variable to account for differences in length of follow-up
. gen time_zero_esrd = date("2000-01-01", "YMD")

. gen time_end_esrd = time_zero_esrd + follow_up_time_esrd

. gen time_esrd = time_zero_esrd + esrd_time
(22,738 missing values generated)

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(24,721 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_h
> alf_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>ind
> ex_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(15 real changes made)
(33 real changes made)
(42 real changes made)
(58 real changes made)
(62 real changes made)
(80 real changes made)
(79 real changes made)
(74 real changes made)
(75 real changes made)
(86 real changes made)
(67 real changes made)
(104 real changes made)
(88 real changes made)
(99 real changes made)
(101 real changes made)
(92 real changes made)
(98 real changes made)
(124 real changes made)
(106 real changes made)
(109 real changes made)
(92 real changes made)
(98 real changes made)
(83 real changes made)
(98 real changes made)
(75 real changes made)
(120 real changes made)
(94 real changes made)
(105 real changes made)
(95 real changes made)
(106 real changes made)
(0 real changes made)
(0 real changes made)
(17 real changes made)
(25 real changes made)
(24 real changes made)
(40 real changes made)
(57 real changes made)
(53 real changes made)
(59 real changes made)
(84 real changes made)
(75 real changes made)
(76 real changes made)
(94 real changes made)
(77 real changes made)
(85 real changes made)
(83 real changes made)
(90 real changes made)
(82 real changes made)
(95 real changes made)
(109 real changes made)
(83 real changes made)
(90 real changes made)
(107 real changes made)
(100 real changes made)
(94 real changes made)
(99 real changes made)
(71 real changes made)
(96 real changes made)
(92 real changes made)
(101 real changes made)
(88 real changes made)
(95 real changes made)
(97 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(1,516 real changes made)

. gen egfr_half = 0

. replace egfr_half = 1 if egfr_half_date!=.
(6,512 real changes made)

. label var egfr_half "50% reduction in eGFR"

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(11,104 real changes made, 11,104 to missing)

. gen egfr_half_time = (egfr_half_date - index_date_egfr_half)
(19,106 missing values generated)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(18,209 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date) if e
> gfr_half_date==. & index_date_egfr_half!=.
(8,002 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(11,104 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days
> )"

. gen egfr_half_denominator = 0

. replace egfr_half_denominator = 1 if index_date_egfr_half!=.
(13,617 real changes made)

. gen time_zero_egfr_half = date("2000-01-01", "YMD")

. gen time_end_egfr_half = time_zero_egfr_half + follow_up_time_egfr_half
(11,104 missing values generated)

. gen time_egfr_half = time_zero_egfr_half + egfr_half_time
(19,106 missing values generated)

. 
. * AKI (or ESRD)
. gen index_date_aki = index_date

. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(22,178 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(1,768 real changes made)

. gen aki = 0

. replace aki = 1 if aki_date!=.
(4,311 real changes made)

. label var aki "Acute kidney injury"

. gen aki_time = (aki_date - index_date_aki)
(20,410 missing values generated)

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(20,410 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date)  if aki_da
> te==.
(20,410 real changes made)

. gen aki_denominator = 1

. gen follow_up_time_aki = (exit_date_aki - index_date_aki)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. gen time_zero_aki = date("2000-01-01", "YMD")

. gen time_end_aki = time_zero_aki + follow_up_time_aki

. gen time_aki = time_zero_aki + aki_time
(20,410 missing values generated)

. 
. * Exit date (death)
. gen index_date_death = index_date

. gen exit_date_death = death_date
(23,681 missing values generated)

. gen death = 0

. replace death = 1 if death_date!=.
(1,040 real changes made)

. label var death "Death"

. gen death_time = (death_date - index_date_death)
(23,681 missing values generated)

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(23,681 real changes made)

. gen death_denominator = 1

. gen follow_up_time_death = (exit_date_death - index_date_death)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. gen time_zero_death = date("2000-01-01", "YMD")

. gen time_end_death = time_zero_death + follow_up_time_death

. gen time_death = time_zero_death + death_time
(23,681 missing values generated)

. 
. save ./output/analysis_hospitalised.dta, replace
(note: file ./output/analysis_hospitalised.dta not found)
file ./output/analysis_hospitalised.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/analysis_hospitalised.log
  log type:  text
 closed on:   5 Apr 2023, 00:37:15
-------------------------------------------------------------------------------
