------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_2020.log
  log type:  text
 opened on:  28 Jul 2023, 11:42:06

. 
. ** Analysis cohort selection
. capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-9)
(55 vars, 50,000 obs)

. di "Potential COVID-19 cases extracted from OpenSAFELY:"
Potential COVID-19 cases extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/input_2020_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(20 vars, 50,000 obs)

. di "Potential contemporary comparators extracted from OpenSAFELY:"
Potential contemporary comparators extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/covid_matching_2020.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 14,597 obs)

. di "Potential COVID-19 cases after application of exclusion criteria:"
Potential COVID-19 cases after application of exclusion criteria:

. safecount
  14,597

. capture noisily import delimited ./output/2020_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(8 vars, 28,833 obs)

. di "Potential contemporary comparators after application of exclusion criteria:"
Potential contemporary comparators after application of exclusion criteria:

. safecount
  28,833

. * Import COVID-19 dataset comprising individuals matched with contemporary comparators (limited matching variables only)        
. capture noisily import delimited ./output/input_combined_stps_covid_2020.csv, clear
(encoding automatically selected: ISO-8859-1)
(13 vars, 12,972 obs)

. * Drop age & covid_diagnosis_date
. keep patient_id death_date date_deregistered stp krt_outcome_date male covid_date covid_month set_id case match_counts

. tempfile covid_2020_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `covid_2020_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5600_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5600_000001.tmp saved as .dta format

. * Number of matched COVID-19 cases
. count
  12,972

. * Import matched contemporary comparators (limited matching variables only)
. capture noisily import delimited ./output/input_combined_stps_matches_2020.csv, clear
(encoding automatically selected: ISO-8859-1)
(11 vars, 18,081 obs)

. * Drop age
. * NB covid_date = date at which COVID case matched to a contemporary comparator
. * covid_diagnosis_date = date at which contemporary comparator first diagnosed with COVID
. keep patient_id death_date date_deregistered stp krt_outcome_date male set_id case covid_date covid_diagnosis_date

. tempfile 2020_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `2020_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5600_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5600_000002.tmp saved as .dta format

. * Number of matched contemporary comparators
. count
  18,081

. * Merge limited COVID-19 dataset with additional variables
. capture noisily import delimited ./output/input_covid_2020_additional.csv, clear
(encoding automatically selected: ISO-8859-9)
(113 vars, 12,972 obs)

. merge 1:1 patient_id using `covid_2020_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            12,972  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile covid_2020_complete

. save `covid_2020_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5600_000003.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5600_000003.tmp saved as .dta format

. di "Matched COVID-19 cases:"
Matched COVID-19 cases:

. safecount
  12,972

. * Merge limited contemporary comparator dataset with additional variables
. capture noisily import delimited ./output/input_2020_additional.csv, clear
(encoding automatically selected: ISO-8859-9)
(106 vars, 18,081 obs)

. merge 1:1 patient_id using `2020_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            18,081  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile 2020_complete

. save `2020_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5600_000004.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5600_000004.tmp saved as .dta format

. di "Matched contemporary comparators:"
Matched contemporary comparators:

. safecount
  18,081

. * Append matched COVID-19 cases and contemporary comparators
. append using `covid_2020_complete', force

. order patient_id set_id match_count case

. gsort set_id -case

. count if case==0
  18,081

. di "Matched COVID-19 cases and contemporary comparators:"
Matched COVID-19 cases and contemporary comparators:

. safecount
  31,053

. tab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,081       58.23       58.23
          1 |     12,972       41.77      100.00
------------+-----------------------------------
      Total |     31,053      100.00

. * Save list of matched COVID-19 cases
. preserve

.         keep if case==1
(18,081 observations deleted)

.         keep patient_id

.         tempfile covid_2020_matched_list

.         save `covid_2020_matched_list', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5600_000006.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5600_000006.tmp saved as .dta format

. restore

. * Generate list of unmatched COVID-19 cases
. preserve

.         capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-9)
(55 vars, 50,000 obs)

.         * For dummy data, should do nothing in the real data
.         duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

.         tempfile covid_prematching

.         save `covid_prematching', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5600_000008.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5600_000008.tmp saved as .dta format

.         use `covid_2020_matched_list', clear

.         merge 1:1 patient_id using `covid_prematching'

    Result                      Number of obs
    -----------------------------------------
    Not matched                        37,028
        from master                         0  (_merge==1)
        from using                     37,028  (_merge==2)

    Matched                            12,972  (_merge==3)
    -----------------------------------------

.         keep if _merge==2
(12,972 observations deleted)

.         safecount
  37,028

.         save output/covid_unmatched_2020.dta, replace
file output/covid_unmatched_2020.dta saved

.         di "Unmatched COVID-19 cases:"
Unmatched COVID-19 cases:

.         safecount
  37,028

. restore

. 
. **ID
. * Need to create unique identifiers as individuals may be in both covid_2020_matched and 2020_matched so will have the same patient_id
. gen unique = _n

. label var unique "Unique ID"

. 
. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label var imd "Index of multiple deprivation (IMD)"

. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      1,521        4.90        4.90
 1 Most deprived |      5,989       19.29       24.18
               2 |      6,063       19.52       43.71
               3 |      5,794       18.66       62.37
               4 |      5,891       18.97       81.34
5 Least deprived |      5,795       18.66      100.00
-----------------+-----------------------------------
           Total |     31,053      100.00

. drop if imd==0
(1,521 observations deleted)

. safetab imd

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |      5,989       20.28       20.28
               2 |      6,063       20.53       40.81
               3 |      5,794       19.62       60.43
               4 |      5,891       19.95       80.38
5 Least deprived |      5,795       19.62      100.00
-----------------+-----------------------------------
           Total |     29,532      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(29,501 missing values generated)

. replace stp1 = sum(stp1)
(29,531 real changes made)

. drop stp

. rename stp1 stp

. label define stp        1 "1"   ///
>                                         2 "2"   ///
>                                         3 "3"   ///
>                                         4 "4"   ///
>                                         5 "5"   ///
>                                         6 "6"   ///
>                                         7 "7"   ///
>                                         8 "8"   ///
>                                         9 "9"   ///
>                                         10 "10" ///
>                                         11 "11" ///                                     
>                                         12 "12" ///
>                                         13 "13" ///
>                                         14 "14" ///
>                                         15 "15" ///
>                                         16 "16" ///
>                                         17 "17" ///
>                                         18 "18" ///
>                                         19 "19" ///
>                                         20 "20" ///
>                                         21 "21" ///                                     
>                                         22 "22" ///
>                                         23 "23" ///
>                                         24 "24" ///
>                                         25 "25" ///
>                                         26 "26" ///
>                                         27 "27" ///
>                                         28 "28" ///
>                                         29 "29" ///
>                                         30 "30" ///
>                                         31 "31" 

. label values stp stp

. label var stp "STP"

. safetab stp

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,035        3.50        3.50
          2 |        979        3.32        6.82
          3 |        952        3.22       10.04
          4 |        920        3.12       13.16
          5 |        976        3.30       16.46
          6 |        954        3.23       19.69
          7 |        943        3.19       22.89
          8 |        950        3.22       26.10
          9 |        941        3.19       29.29
         10 |        946        3.20       32.49
         11 |        964        3.26       35.76
         12 |        947        3.21       38.96
         13 |        946        3.20       42.17
         14 |        948        3.21       45.38
         15 |        943        3.19       48.57
         16 |        938        3.18       51.75
         17 |        947        3.21       54.95
         18 |        964        3.26       58.22
         19 |        974        3.30       61.52
         20 |        963        3.26       64.78
         21 |        918        3.11       67.89
         22 |        925        3.13       71.02
         23 |        950        3.22       74.23
         24 |        962        3.26       77.49
         25 |        969        3.28       80.77
         26 |        925        3.13       83.91
         27 |        960        3.25       87.16
         28 |        949        3.21       90.37
         29 |        942        3.19       93.56
         30 |        940        3.18       96.74
         31 |        962        3.26      100.00
------------+-----------------------------------
      Total |     29,532      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(26,645 missing values generated)

. replace region = 2 if region_string=="East"
(2,914 real changes made)

. replace region = 3 if region_string=="London"
(5,958 real changes made)

. replace region = 4 if region_string=="North East"
(2,944 real changes made)

. replace region = 5 if region_string=="North West"
(2,934 real changes made)

. replace region = 6 if region_string=="South East"
(2,994 real changes made)

. replace region = 7 if region_string=="South West"
(2,886 real changes made)

. replace region = 8 if region_string=="West Midlands"
(2,950 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(3,065 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      2,887        9.78        9.78
                    East |      2,914        9.87       19.64
                  London |      5,958       20.17       39.82
              North East |      2,944        9.97       49.79
              North West |      2,934        9.93       59.72
              South East |      2,994       10.14       69.86
              South West |      2,886        9.77       79.63
           West Midlands |      2,950        9.99       89.62
Yorkshire and The Humber |      3,065       10.38      100.00
-------------------------+-----------------------------------
                   Total |     29,532      100.00

. drop if region==10
(0 observations deleted)

. safetab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      2,887        9.78        9.78
                    East |      2,914        9.87       19.64
                  London |      5,958       20.17       39.82
              North East |      2,944        9.97       49.79
              North West |      2,934        9.93       59.72
              South East |      2,994       10.14       69.86
              South West |      2,886        9.77       79.63
           West Midlands |      2,950        9.99       89.62
Yorkshire and The Humber |      3,065       10.38      100.00
-------------------------+-----------------------------------
                   Total |     29,532      100.00

. 
. * Create new index date variable 28 days after case_index_date (i.e. to exclude anyone who does not survive to start follow-up)
. gen index_date = date(case_index_date, "YMD")

. format index_date %td

. gen index_date_28 = index_date + 28

. format index_date_28 %td

. 
. * Create exit date for COVID amongst general population comparator
. gen covid_exit = date(covid_diagnosis_date, "YMD")
(21,977 missing values generated)

. format covid_exit %td

. replace covid_exit=. if case==1
(0 real changes made)

. drop if covid_exit < index_date_28 + 1
(348 observations deleted)

. gen comparator_covid = .
(29,184 missing values generated)

. replace comparator_covid = 0 if case==0
(16,824 real changes made)

. replace comparator_covid = 1 if covid_exit!=.
(7,207 real changes made)

. tab case comparator_covid, m

           |         comparator_covid
      case |         0          1          . |     Total
-----------+---------------------------------+----------
         0 |     9,617      7,207          0 |    16,824 
         1 |         0          0     12,360 |    12,360 
-----------+---------------------------------+----------
     Total |     9,617      7,207     12,360 |    29,184 

. 
. * Deregistered before index_date + 29 days
. gen deregistered_date = date(date_deregistered, "YMD")
(28,229 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date_28 + 1
(40 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(26,356 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(0 observations deleted)

. replace krt_date = index_date_28 + 1 if krt_date < index_date_28 + 1
(113 real changes made)

. 
. * Death before index_date + 29 days (i.e. only include people who survived 29 days after index_date)
. gen death_date1 = date(death_date, "YMD")
(27,472 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28 + 1
(60 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased within 28 days of index date"

. label values deceased deceased

. tab case deceased

           |       deceased
      case | Alive at   Deceased  |     Total
-----------+----------------------+----------
         0 |    16,763         37 |    16,800 
         1 |    12,321         23 |    12,344 
-----------+----------------------+----------
     Total |    29,084         60 |    29,144 

. drop if deceased==1
(60 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched contemporary comparators only
. gen index_year = yofd(index_date)

. gen age = index_year - year_of_birth

. *age>=18*
. drop if age<18|age==.
(0 observations deleted)

. gen sex = 1 if male == "Male"
(14,907 missing values generated)

. label var sex "Sex"

. replace sex = 0 if male == "Female"
(14,907 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2020 ///
>                                                                                                 baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 ///
>                                                                                                 baseline_creatinine_feb2022 ///
>                                                                                                 baseline_creatinine_mar2022 ///
>                                                                                                 baseline_creatinine_apr2022 ///
>                                                                                                 baseline_creatinine_may2022 ///
>                                                                                                 baseline_creatinine_jun2022 ///
>                                                                                                 baseline_creatinine_jul2022 ///
>                                                                                                 baseline_creatinine_aug2022 ///
>                                                                                                 baseline_creatinine_sep2022 ///
>                                                                                                 baseline_creatinine_oct2022 ///
>                                                                                                 baseline_creatinine_nov2022 ///
>                                                                                                 baseline_creatinine_dec2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(12,822 real changes made, 12,822 to missing)
(12,822 missing values generated)
(29,084 missing values generated)
(8,262 real changes made)
(8,000 real changes made)
(8,262 real changes made)
(8,000 real changes made)
(10,256 real changes made)
(29,084 missing values generated)
(8,262 real changes made)
(8,000 real changes made)
(16,262 real changes made)
(18,828 real changes made)
(12,822 missing values generated)
(16,262 real changes made)
(8,262 real changes made)
(12,847 real changes made, 12,847 to missing)
(12,847 missing values generated)
(29,084 missing values generated)
(8,338 real changes made)
(7,899 real changes made)
(8,338 real changes made)
(7,899 real changes made)
(10,241 real changes made)
(29,084 missing values generated)
(8,338 real changes made)
(7,899 real changes made)
(16,237 real changes made)
(18,843 real changes made)
(12,847 missing values generated)
(16,237 real changes made)
(8,338 real changes made)
(12,815 real changes made, 12,815 to missing)
(12,815 missing values generated)
(29,084 missing values generated)
(8,368 real changes made)
(7,901 real changes made)
(8,368 real changes made)
(7,901 real changes made)
(10,356 real changes made)
(29,084 missing values generated)
(8,368 real changes made)
(7,901 real changes made)
(16,269 real changes made)
(18,728 real changes made)
(12,815 missing values generated)
(16,269 real changes made)
(8,368 real changes made)
(12,845 real changes made, 12,845 to missing)
(12,845 missing values generated)
(29,084 missing values generated)
(8,278 real changes made)
(7,961 real changes made)
(8,278 real changes made)
(7,961 real changes made)
(10,264 real changes made)
(29,084 missing values generated)
(8,278 real changes made)
(7,961 real changes made)
(16,239 real changes made)
(18,820 real changes made)
(12,845 missing values generated)
(16,239 real changes made)
(8,278 real changes made)
(12,747 real changes made, 12,747 to missing)
(12,747 missing values generated)
(29,084 missing values generated)
(8,351 real changes made)
(7,986 real changes made)
(8,351 real changes made)
(7,986 real changes made)
(10,352 real changes made)
(29,084 missing values generated)
(8,351 real changes made)
(7,986 real changes made)
(16,337 real changes made)
(18,732 real changes made)
(12,747 missing values generated)
(16,337 real changes made)
(8,351 real changes made)
(12,762 real changes made, 12,762 to missing)
(12,762 missing values generated)
(29,084 missing values generated)
(8,332 real changes made)
(7,990 real changes made)
(8,332 real changes made)
(7,990 real changes made)
(10,340 real changes made)
(29,084 missing values generated)
(8,332 real changes made)
(7,990 real changes made)
(16,322 real changes made)
(18,744 real changes made)
(12,762 missing values generated)
(16,322 real changes made)
(8,332 real changes made)
(12,765 real changes made, 12,765 to missing)
(12,765 missing values generated)
(29,084 missing values generated)
(8,451 real changes made)
(7,868 real changes made)
(8,451 real changes made)
(7,868 real changes made)
(10,386 real changes made)
(29,084 missing values generated)
(8,451 real changes made)
(7,868 real changes made)
(16,319 real changes made)
(18,698 real changes made)
(12,765 missing values generated)
(16,319 real changes made)
(8,451 real changes made)
(12,730 real changes made, 12,730 to missing)
(12,730 missing values generated)
(29,084 missing values generated)
(8,394 real changes made)
(7,960 real changes made)
(8,394 real changes made)
(7,960 real changes made)
(10,387 real changes made)
(29,084 missing values generated)
(8,394 real changes made)
(7,960 real changes made)
(16,354 real changes made)
(18,697 real changes made)
(12,730 missing values generated)
(16,354 real changes made)
(8,394 real changes made)
(12,821 real changes made, 12,821 to missing)
(12,821 missing values generated)
(29,084 missing values generated)
(8,346 real changes made)
(7,917 real changes made)
(8,346 real changes made)
(7,917 real changes made)
(10,370 real changes made)
(29,084 missing values generated)
(8,346 real changes made)
(7,917 real changes made)
(16,263 real changes made)
(18,714 real changes made)
(12,821 missing values generated)
(16,263 real changes made)
(8,346 real changes made)
(12,817 real changes made, 12,817 to missing)
(12,817 missing values generated)
(29,084 missing values generated)
(8,308 real changes made)
(7,959 real changes made)
(8,308 real changes made)
(7,959 real changes made)
(10,358 real changes made)
(29,084 missing values generated)
(8,308 real changes made)
(7,959 real changes made)
(16,267 real changes made)
(18,726 real changes made)
(12,817 missing values generated)
(16,267 real changes made)
(8,308 real changes made)
(12,744 real changes made, 12,744 to missing)
(12,744 missing values generated)
(29,084 missing values generated)
(8,368 real changes made)
(7,972 real changes made)
(8,368 real changes made)
(7,972 real changes made)
(10,338 real changes made)
(29,084 missing values generated)
(8,368 real changes made)
(7,972 real changes made)
(16,340 real changes made)
(18,746 real changes made)
(12,744 missing values generated)
(16,340 real changes made)
(8,368 real changes made)
(12,807 real changes made, 12,807 to missing)
(12,807 missing values generated)
(29,084 missing values generated)
(8,384 real changes made)
(7,893 real changes made)
(8,384 real changes made)
(7,893 real changes made)
(10,315 real changes made)
(29,084 missing values generated)
(8,384 real changes made)
(7,893 real changes made)
(16,277 real changes made)
(18,769 real changes made)
(12,807 missing values generated)
(16,277 real changes made)
(8,384 real changes made)
(12,737 real changes made, 12,737 to missing)
(12,737 missing values generated)
(29,084 missing values generated)
(8,379 real changes made)
(7,968 real changes made)
(8,379 real changes made)
(7,968 real changes made)
(10,301 real changes made)
(29,084 missing values generated)
(8,379 real changes made)
(7,968 real changes made)
(16,347 real changes made)
(18,783 real changes made)
(12,737 missing values generated)
(16,347 real changes made)
(8,379 real changes made)
(12,878 real changes made, 12,878 to missing)
(12,878 missing values generated)
(29,084 missing values generated)
(8,319 real changes made)
(7,887 real changes made)
(8,319 real changes made)
(7,887 real changes made)
(10,271 real changes made)
(29,084 missing values generated)
(8,319 real changes made)
(7,887 real changes made)
(16,206 real changes made)
(18,813 real changes made)
(12,878 missing values generated)
(16,206 real changes made)
(8,319 real changes made)
(12,778 real changes made, 12,778 to missing)
(12,778 missing values generated)
(29,084 missing values generated)
(8,372 real changes made)
(7,934 real changes made)
(8,372 real changes made)
(7,934 real changes made)
(10,399 real changes made)
(29,084 missing values generated)
(8,372 real changes made)
(7,934 real changes made)
(16,306 real changes made)
(18,685 real changes made)
(12,778 missing values generated)
(16,306 real changes made)
(8,372 real changes made)
(12,775 real changes made, 12,775 to missing)
(12,775 missing values generated)
(29,084 missing values generated)
(8,392 real changes made)
(7,917 real changes made)
(8,392 real changes made)
(7,917 real changes made)
(10,391 real changes made)
(29,084 missing values generated)
(8,392 real changes made)
(7,917 real changes made)
(16,309 real changes made)
(18,693 real changes made)
(12,775 missing values generated)
(16,309 real changes made)
(8,392 real changes made)
(12,774 real changes made, 12,774 to missing)
(12,774 missing values generated)
(29,084 missing values generated)
(8,440 real changes made)
(7,870 real changes made)
(8,440 real changes made)
(7,870 real changes made)
(10,491 real changes made)
(29,084 missing values generated)
(8,440 real changes made)
(7,870 real changes made)
(16,310 real changes made)
(18,593 real changes made)
(12,774 missing values generated)
(16,310 real changes made)
(8,440 real changes made)
(12,842 real changes made, 12,842 to missing)
(12,842 missing values generated)
(29,084 missing values generated)
(8,281 real changes made)
(7,961 real changes made)
(8,281 real changes made)
(7,961 real changes made)
(10,354 real changes made)
(29,084 missing values generated)
(8,281 real changes made)
(7,961 real changes made)
(16,242 real changes made)
(18,730 real changes made)
(12,842 missing values generated)
(16,242 real changes made)
(8,281 real changes made)
(12,872 real changes made, 12,872 to missing)
(12,872 missing values generated)
(29,084 missing values generated)
(8,291 real changes made)
(7,921 real changes made)
(8,291 real changes made)
(7,921 real changes made)
(10,382 real changes made)
(29,084 missing values generated)
(8,291 real changes made)
(7,921 real changes made)
(16,212 real changes made)
(18,702 real changes made)
(12,872 missing values generated)
(16,212 real changes made)
(8,291 real changes made)
(12,863 real changes made, 12,863 to missing)
(12,863 missing values generated)
(29,084 missing values generated)
(8,259 real changes made)
(7,962 real changes made)
(8,259 real changes made)
(7,962 real changes made)
(10,384 real changes made)
(29,084 missing values generated)
(8,259 real changes made)
(7,962 real changes made)
(16,221 real changes made)
(18,700 real changes made)
(12,863 missing values generated)
(16,221 real changes made)
(8,259 real changes made)
(12,837 real changes made, 12,837 to missing)
(12,837 missing values generated)
(29,084 missing values generated)
(8,348 real changes made)
(7,899 real changes made)
(8,348 real changes made)
(7,899 real changes made)
(10,268 real changes made)
(29,084 missing values generated)
(8,348 real changes made)
(7,899 real changes made)
(16,247 real changes made)
(18,816 real changes made)
(12,837 missing values generated)
(16,247 real changes made)
(8,348 real changes made)
(12,792 real changes made, 12,792 to missing)
(12,792 missing values generated)
(29,084 missing values generated)
(8,354 real changes made)
(7,938 real changes made)
(8,354 real changes made)
(7,938 real changes made)
(10,243 real changes made)
(29,084 missing values generated)
(8,354 real changes made)
(7,938 real changes made)
(16,292 real changes made)
(18,841 real changes made)
(12,792 missing values generated)
(16,292 real changes made)
(8,354 real changes made)
(12,755 real changes made, 12,755 to missing)
(12,755 missing values generated)
(29,084 missing values generated)
(8,324 real changes made)
(8,005 real changes made)
(8,324 real changes made)
(8,005 real changes made)
(10,361 real changes made)
(29,084 missing values generated)
(8,324 real changes made)
(8,005 real changes made)
(16,329 real changes made)
(18,723 real changes made)
(12,755 missing values generated)
(16,329 real changes made)
(8,324 real changes made)
(12,807 real changes made, 12,807 to missing)
(12,807 missing values generated)
(29,084 missing values generated)
(8,337 real changes made)
(7,940 real changes made)
(8,337 real changes made)
(7,940 real changes made)
(10,241 real changes made)
(29,084 missing values generated)
(8,337 real changes made)
(7,940 real changes made)
(16,277 real changes made)
(18,843 real changes made)
(12,807 missing values generated)
(16,277 real changes made)
(8,337 real changes made)
(12,898 real changes made, 12,898 to missing)
(12,898 missing values generated)
(29,084 missing values generated)
(8,290 real changes made)
(7,896 real changes made)
(8,290 real changes made)
(7,896 real changes made)
(10,166 real changes made)
(29,084 missing values generated)
(8,290 real changes made)
(7,896 real changes made)
(16,186 real changes made)
(18,918 real changes made)
(12,898 missing values generated)
(16,186 real changes made)
(8,290 real changes made)
(12,866 real changes made, 12,866 to missing)
(12,866 missing values generated)
(29,084 missing values generated)
(8,321 real changes made)
(7,897 real changes made)
(8,321 real changes made)
(7,897 real changes made)
(10,265 real changes made)
(29,084 missing values generated)
(8,321 real changes made)
(7,897 real changes made)
(16,218 real changes made)
(18,819 real changes made)
(12,866 missing values generated)
(16,218 real changes made)
(8,321 real changes made)
(12,816 real changes made, 12,816 to missing)
(12,816 missing values generated)
(29,084 missing values generated)
(8,370 real changes made)
(7,898 real changes made)
(8,370 real changes made)
(7,898 real changes made)
(10,296 real changes made)
(29,084 missing values generated)
(8,370 real changes made)
(7,898 real changes made)
(16,268 real changes made)
(18,788 real changes made)
(12,816 missing values generated)
(16,268 real changes made)
(8,370 real changes made)
(12,815 real changes made, 12,815 to missing)
(12,815 missing values generated)
(29,084 missing values generated)
(8,344 real changes made)
(7,925 real changes made)
(8,344 real changes made)
(7,925 real changes made)
(10,434 real changes made)
(29,084 missing values generated)
(8,344 real changes made)
(7,925 real changes made)
(16,269 real changes made)
(18,650 real changes made)
(12,815 missing values generated)
(16,269 real changes made)
(8,344 real changes made)
(12,804 real changes made, 12,804 to missing)
(12,804 missing values generated)
(29,084 missing values generated)
(8,345 real changes made)
(7,935 real changes made)
(8,345 real changes made)
(7,935 real changes made)
(10,392 real changes made)
(29,084 missing values generated)
(8,345 real changes made)
(7,935 real changes made)
(16,280 real changes made)
(18,692 real changes made)
(12,804 missing values generated)
(16,280 real changes made)
(8,345 real changes made)
(12,859 real changes made, 12,859 to missing)
(12,859 missing values generated)
(29,084 missing values generated)
(8,365 real changes made)
(7,860 real changes made)
(8,365 real changes made)
(7,860 real changes made)
(10,245 real changes made)
(29,084 missing values generated)
(8,365 real changes made)
(7,860 real changes made)
(16,225 real changes made)
(18,839 real changes made)
(12,859 missing values generated)
(16,225 real changes made)
(8,365 real changes made)
(12,825 real changes made, 12,825 to missing)
(12,825 missing values generated)
(29,084 missing values generated)
(8,330 real changes made)
(7,929 real changes made)
(8,330 real changes made)
(7,929 real changes made)
(10,331 real changes made)
(29,084 missing values generated)
(8,330 real changes made)
(7,929 real changes made)
(16,259 real changes made)
(18,753 real changes made)
(12,825 missing values generated)
(16,259 real changes made)
(8,330 real changes made)
(12,824 real changes made, 12,824 to missing)
(12,824 missing values generated)
(29,084 missing values generated)
(8,396 real changes made)
(7,864 real changes made)
(8,396 real changes made)
(7,864 real changes made)
(10,334 real changes made)
(29,084 missing values generated)
(8,396 real changes made)
(7,864 real changes made)
(16,260 real changes made)
(18,750 real changes made)
(12,824 missing values generated)
(16,260 real changes made)
(8,396 real changes made)
(12,828 real changes made, 12,828 to missing)
(12,828 missing values generated)
(29,084 missing values generated)
(8,353 real changes made)
(7,903 real changes made)
(8,353 real changes made)
(7,903 real changes made)
(10,207 real changes made)
(29,084 missing values generated)
(8,353 real changes made)
(7,903 real changes made)
(16,256 real changes made)
(18,877 real changes made)
(12,828 missing values generated)
(16,256 real changes made)
(8,353 real changes made)
(12,788 real changes made, 12,788 to missing)
(12,788 missing values generated)
(29,084 missing values generated)
(8,324 real changes made)
(7,972 real changes made)
(8,324 real changes made)
(7,972 real changes made)
(10,375 real changes made)
(29,084 missing values generated)
(8,324 real changes made)
(7,972 real changes made)
(16,296 real changes made)
(18,709 real changes made)
(12,788 missing values generated)
(16,296 real changes made)
(8,324 real changes made)
(12,772 real changes made, 12,772 to missing)
(12,772 missing values generated)
(29,084 missing values generated)
(8,361 real changes made)
(7,951 real changes made)
(8,361 real changes made)
(7,951 real changes made)
(10,421 real changes made)
(29,084 missing values generated)
(8,361 real changes made)
(7,951 real changes made)
(16,312 real changes made)
(18,663 real changes made)
(12,772 missing values generated)
(16,312 real changes made)
(8,361 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)

. gen baseline_egfr=.
(29,084 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 
> jul2022 aug2022 sep2022 oct2022 nov2022 dec2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(845 real changes made)
(936 real changes made)
(974 real changes made)
(850 real changes made)
(835 real changes made)
(796 real changes made)
(767 real changes made)
(758 real changes made)
(634 real changes made)
(618 real changes made)
(596 real changes made)
(575 real changes made)
(476 real changes made)
(536 real changes made)
(429 real changes made)
(406 real changes made)
(414 real changes made)
(428 real changes made)
(361 real changes made)
(372 real changes made)
(343 real changes made)
(317 real changes made)
(323 real changes made)
(259 real changes made)
(222 real changes made)
(273 real changes made)
(250 real changes made)
(246 real changes made)
(201 real changes made)
(207 real changes made)
(207 real changes made)
(209 real changes made)
(210 real changes made)
(183 real changes made)
(173 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab case baseline_esrd

           | baseline_e
           |    srd
      case |   No ESRD |     Total
-----------+-----------+----------
         0 |    16,763 |    16,763 
         1 |    12,321 |    12,321 
-----------+-----------+----------
     Total |    29,084 |    29,084 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. * Drop COVID-19 cases without any matched contemporary comparators after further application of exclusion criteria
. generate match_counts1=.
(29,084 missing values generated)

. order patient_id set_id match_counts match_counts1

. bysort set_id: replace match_counts1=_N-1
(29,084 real changes made)

. replace match_counts1=. if case==0
(16,763 real changes made, 16,763 to missing)

. drop match_counts

. rename match_counts1 match_counts

. count if match_counts==0
  5,574

. drop if match_counts==0
(5,574 observations deleted)

. safetab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,763       71.30       71.30
          1 |      6,747       28.70      100.00
------------+-----------------------------------
      Total |     23,510      100.00

. tab match_counts

match_count |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,280       18.97       18.97
          2 |      1,763       26.13       45.10
          3 |      3,704       54.90      100.00
------------+-----------------------------------
      Total |      6,747      100.00

. 
. bysort set_id: egen set_case_mean = mean(case) // if mean of exposure var is 0 then only uncase in set, if 1 then only case in set

. gen valid_set = (set_case_mean>0 & set_case_mean<1) // ==1 is valid set containing both case and uncase

. tab valid_set, miss

  valid_set |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        845        3.59        3.59
          1 |     22,665       96.41      100.00
------------+-----------------------------------
      Total |     23,510      100.00

. tab valid_set case, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |         case
 valid_set |         0          1 |     Total
-----------+----------------------+----------
         0 |       845          0 |       845 
           |      5.04       0.00 |      3.59 
-----------+----------------------+----------
         1 |    15,918      6,747 |    22,665 
           |     94.96     100.00 |     96.41 
-----------+----------------------+----------
     Total |    16,763      6,747 |    23,510 
           |    100.00     100.00 |    100.00 

. keep if valid_set==1
(845 observations deleted)

. drop valid_set set_case_mean

. 
. ** Exposure
. label define case 0 "Contemporary comparator" ///
>                                   1 "SARS-CoV-2"

. label values case case

. safetab case 

                   case |      Freq.     Percent        Cum.
------------------------+-----------------------------------
Contemporary comparator |     15,918       70.23       70.23
             SARS-CoV-2 |      6,747       29.77      100.00
------------------------+-----------------------------------
                  Total |     22,665      100.00

. 
. * COVID-19 severity
. gen covid_severity = case

. replace covid_severity = 2 if covid_hospitalised==1
(657 real changes made)

. replace covid_severity = 3 if covid_critical_care==1
(335 real changes made)

. replace covid_severity = 3 if covid_critical_days==1
(307 real changes made)

. label define covid_severity     0 "Contemporary comparator"             ///
>                                                         1 "Non-hospitalised COVID" ///
>                                                         2 "Hospitalised COVID"          ///
>                                                         3 "Critical care COVID"

. label values covid_severity covid_severity

. label var covid_severity "SARS-CoV-2 severity"

. drop covid_critical_care

. drop covid_critical_days

. safetab covid_severity, m

    SARS-CoV-2 severity |      Freq.     Percent        Cum.
------------------------+-----------------------------------
Contemporary comparator |     15,918       70.23       70.23
 Non-hospitalised COVID |      5,517       24.34       94.57
     Hospitalised COVID |        588        2.59       97.17
    Critical care COVID |        642        2.83      100.00
------------------------+-----------------------------------
                  Total |     22,665      100.00

. 
. * COVID-19 acute kidney injury
. gen covid_aki = case

. replace covid_aki = 2 if covid_hospitalised==1
(657 real changes made)

. replace covid_aki = 3 if covid_acute_kidney_injury==1
(353 real changes made)

. label define covid_aki  0 "Contemporary comparator"                     ///
>                                                 1 "Non-hospitalised COVID"              ///
>                                                 2 "Hospitalised COVID"  ///
>                                                 3 "Hospitalised COVID-AKI"

. label values covid_aki covid_aki

. label var covid_aki "COVID-19 acute kidney injury"

. drop covid_acute_kidney_injury

. safetab covid_aki, m

  COVID-19 acute kidney |
                 injury |      Freq.     Percent        Cum.
------------------------+-----------------------------------
Contemporary comparator |     15,918       70.23       70.23
 Non-hospitalised COVID |      5,775       25.48       95.71
     Hospitalised COVID |        619        2.73       98.44
 Hospitalised COVID-AKI |        353        1.56      100.00
------------------------+-----------------------------------
                  Total |     22,665      100.00

. 
. * COVID-19 kidney replacement therapy
. gen covid_krt_combined = covid_krt_icd_10
(15,918 missing values generated)

. replace covid_krt_combined = covid_krt_opcs_4 if covid_krt_icd_10==0
(336 real changes made)

. gen covid_krt = case

. replace covid_krt = 2 if covid_hospitalised==1
(657 real changes made)

. replace covid_krt = 3 if covid_krt_combined==1
(680 real changes made)

. label define covid_krt  0 "Contemporary comparator"                     ///
>                                                 1 "Non-hospitalised SARS-CoV-2"         ///
>                                                 2 "No KRT hospitalised COVID-19"        ///
>                                                 3 "KRT hospitalised COVID-19"

. label values covid_krt covid_krt

. label var covid_krt "COVID-19 kidney replacement therapy"

. drop covid_krt_icd_10

. drop covid_krt_opcs_4

. safetab covid_krt, m

 COVID-19 kidney replacement |
                     therapy |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
     Contemporary comparator |     15,918       70.23       70.23
 Non-hospitalised SARS-CoV-2 |      5,484       24.20       94.43
No KRT hospitalised COVID-19 |        583        2.57       97.00
   KRT hospitalised COVID-19 |        680        3.00      100.00
-----------------------------+-----------------------------------
                       Total |     22,665      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(18,080 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(18,142 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(18,160 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(18,153 missing values generated)

. format covidvax4date %td

. gen covid_vax = 1

. replace covid_vax = 2 if covidvax1date!=.
(4,585 real changes made)

. replace covid_vax = 3 if covidvax2date!=.
(4,523 real changes made)

. replace covid_vax = 4 if covidvax3date!=.
(4,505 real changes made)

. replace covid_vax = 5 if covidvax4date!=.
(4,512 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  1 "Pre-vaccination"                     ///
>                                                 2 "1 vaccine dose"                      ///
>                                                 3 "2 vaccine doses"                     ///
>                                                 4 "3 vaccine doses"                     ///
>                                                 5 "4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "Vaccination status"

. safetab covid_vax, m

    Vaccination |
         status |      Freq.     Percent        Cum.
----------------+-----------------------------------
Pre-vaccination |      9,320       41.12       41.12
 1 vaccine dose |      2,334       10.30       51.42
2 vaccine doses |      2,891       12.76       64.17
3 vaccine doses |      3,608       15.92       80.09
4 vaccine doses |      4,512       19.91      100.00
----------------+-----------------------------------
          Total |     22,665      100.00

. 
. * COVID-19 wave
. gen wave = 1

. replace wave = 2 if index_month=="sep2020"
(1,209 real changes made)

. replace wave = 2 if index_month=="oct2020"
(1,003 real changes made)

. replace wave = 2 if index_month=="nov2020"
(948 real changes made)

. replace wave = 2 if index_month=="dec2020"
(933 real changes made)

. replace wave = 2 if index_month=="jan2021"
(824 real changes made)

. replace wave = 2 if index_month=="feb2021"
(690 real changes made)

. replace wave = 2 if index_month=="mar2021"
(732 real changes made)

. replace wave = 2 if index_month=="apr2021"
(575 real changes made)

. replace wave = 2 if index_month=="may2021"
(583 real changes made)

. replace wave = 2 if index_month=="jun2021"
(514 real changes made)

. replace wave = 3 if index_month=="jul2021"
(578 real changes made)

. replace wave = 3 if index_month=="aug2021"
(437 real changes made)

. replace wave = 3 if index_month=="sep2021"
(413 real changes made)

. replace wave = 3 if index_month=="oct2021"
(386 real changes made)

. replace wave = 3 if index_month=="nov2021"
(313 real changes made)

. replace wave = 4 if index_month=="dec2021"
(334 real changes made)

. replace wave = 4 if index_month=="jan2022"
(259 real changes made)

. replace wave = 4 if index_month=="feb2022"
(226 real changes made)

. replace wave = 4 if index_month=="mar2022"
(234 real changes made)

. replace wave = 4 if index_month=="apr2022"
(230 real changes made)

. replace wave = 4 if index_month=="may2022"
(213 real changes made)

. replace wave = 4 if index_month=="jun2022"
(167 real changes made)

. replace wave = 4 if index_month=="jul2022"
(141 real changes made)

. replace wave = 4 if index_month=="aug2022"
(155 real changes made)

. replace wave = 4 if index_month=="sep2022"
(124 real changes made)

. replace wave = 4 if index_month=="oct2022"
(125 real changes made)

. replace wave = 4 if index_month=="nov2022"
(110 real changes made)

. replace wave = 4 if index_month=="dec2022"
(103 real changes made)

. label define wave       1 "Feb20-Aug20" ///
>                                         2 "Sep20-Jun21" ///
>                                         3 "Jul21-Nov21" ///
>                                         4 "Dec21-Dec22" 

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m

   COVID-19 |
       wave |      Freq.     Percent        Cum.
------------+-----------------------------------
Feb20-Aug20 |     10,106       44.59       44.59
Sep20-Jun21 |      8,011       35.35       79.93
Jul21-Nov21 |      2,127        9.38       89.32
Dec21-Dec22 |      2,421       10.68      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. 
. ** Covariates
. * Check of GP consultations over past year by groups
. sum gp_count, detail

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -5
 5%            0             -4
10%            0             -4       Obs              22,665
25%            0             -4       Sum of wgt.      22,665

50%            3                      Mean           3.320274
                        Largest       Std. dev.      3.551001
75%            6             16
90%            8             16       Variance       12.60961
95%           10             16       Skewness       .6302866
99%           12             16       Kurtosis       2.252322

. bysort case: sum gp_count, detail

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Contemporary comparator

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -5
 5%            0             -4
10%            0             -4       Obs              15,918
25%            0             -4       Sum of wgt.      15,918

50%            3                      Mean           3.327868
                        Largest       Std. dev.      3.561148
75%            6             16
90%            8             16       Variance       12.68178
95%           10             16       Skewness       .6309651
99%           12             16       Kurtosis       2.247505

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = SARS-CoV-2

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -3
 5%            0             -2
10%            0             -2       Obs               6,747
25%            0             -2       Sum of wgt.       6,747

50%            3                      Mean           3.302357
                        Largest       Std. dev.      3.527142
75%            6             15
90%            8             15       Variance       12.44073
95%           10             16       Skewness       .6283147
99%           12             16       Kurtosis       2.263051


. egen gp_consults = cut(gp_count), at(0, 1, 3, 10, 1500)
(129 missing values generated)

. recode gp_consults 3=2 10=3
(11,421 changes made to gp_consults)

. label define gp_consults 0 "0" 1 "1-2" 2 "3-9" 3 ">9"

. label values gp_consults gp_consults

. label var gp_consults "GP interactions"

. tab case gp_consults

                      |               GP interactions
                 case |         0        1-2        3-9         >9 |     Total
----------------------+--------------------------------------------+----------
Contemporary comparat |     6,736      1,087      7,096        913 |    15,832 
           SARS-CoV-2 |     2,866        426      3,039        373 |     6,704 
----------------------+--------------------------------------------+----------
                Total |     9,602      1,513     10,135      1,286 |    22,536 

. 
. * Check of hospital admissions in preceding 5 years
. sum hosp_count, detail

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs              22,665
25%            0             -2       Sum of wgt.      22,665

50%            0                      Mean           .3961174
                        Largest       Std. dev.        .72155
75%            1              4
90%            1              4       Variance       .5206344
95%            2              4       Skewness       1.492993
99%            3              6       Kurtosis        5.17867

. bysort case: sum hosp_count, detail

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Contemporary comparator

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs              15,918
25%            0             -2       Sum of wgt.      15,918

50%            0                      Mean           .3938309
                        Largest       Std. dev.      .7167073
75%            1              4
90%            1              4       Variance       .5136693
95%            2              4       Skewness       1.476311
99%            3              4       Kurtosis       5.064761

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = SARS-CoV-2

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs               6,747
25%            0             -2       Sum of wgt.       6,747

50%            0                      Mean           .4015118
                        Largest       Std. dev.      .7328739
75%            1              3
90%            1              4       Variance       .5371041
95%            2              4       Skewness        1.52826
99%            3              6       Kurtosis       5.413594


. egen admissions = cut(hosp_count), at(0, 1, 2, 1000)
(309 missing values generated)

. label define admissions 0 "0" 1 "1" 2 ">1"

. label values admissions admissions

. label var admissions "Hospital admissions"

. tab case admissions

                      |       Hospital admissions
                 case |         0          1         >1 |     Total
----------------------+---------------------------------+----------
Contemporary comparat |    10,929      3,264      1,510 |    15,703 
           SARS-CoV-2 |     4,621      1,369        663 |     6,653 
----------------------+---------------------------------+----------
                Total |    15,550      4,633      2,173 |    22,356 

. 
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         20 |          1        0.00        0.00
         21 |        284        1.25        1.26
         22 |        457        2.02        3.27
         23 |        457        2.02        5.29
         24 |        437        1.93        7.22
         25 |        455        2.01        9.23
         26 |        432        1.91       11.13
         27 |        479        2.11       13.25
         28 |        468        2.06       15.31
         29 |        452        1.99       17.30
         30 |        472        2.08       19.39
         31 |        422        1.86       21.25
         32 |        504        2.22       23.47
         33 |        486        2.14       25.62
         34 |        450        1.99       27.60
         35 |        448        1.98       29.58
         36 |        459        2.03       31.60
         37 |        424        1.87       33.47
         38 |        498        2.20       35.67
         39 |        456        2.01       37.68
         40 |        440        1.94       39.62
         41 |        439        1.94       41.56
         42 |        477        2.10       43.67
         43 |        436        1.92       45.59
         44 |        458        2.02       47.61
         45 |        451        1.99       49.60
         46 |        443        1.95       51.56
         47 |        433        1.91       53.47
         48 |        458        2.02       55.49
         49 |        443        1.95       57.44
         50 |        459        2.03       59.47
         51 |        431        1.90       61.37
         52 |        442        1.95       63.32
         53 |        455        2.01       65.33
         54 |        459        2.03       67.35
         55 |        447        1.97       69.32
         56 |        429        1.89       71.22
         57 |        467        2.06       73.28
         58 |        438        1.93       75.21
         59 |        436        1.92       77.13
         60 |        414        1.83       78.96
         61 |        436        1.92       80.88
         62 |        464        2.05       82.93
         63 |        449        1.98       84.91
         64 |        481        2.12       87.03
         65 |        410        1.81       88.84
         66 |        500        2.21       91.05
         67 |        459        2.03       93.07
         68 |        458        2.02       95.09
         69 |        484        2.14       97.23
         70 |        425        1.88       99.10
         71 |        162        0.71       99.82
         72 |         39        0.17       99.99
         73 |          2        0.01      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. safecount
  22,665

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///                                     
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(22,665 differences between age and agegroup)

. 
. label var age "Age"

. label values age age

. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label var agegroup "Age group"

. label values agegroup agegroup

. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex

        Sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     11,592       51.14       51.14
       Male |     11,073       48.86      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. safecount
  22,665

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(847 real changes made)

. replace ethnicity=2 if ethnicity==3
(858 real changes made)

. replace ethnicity=3 if ethnicity==4
(891 real changes made)

. replace ethnicity=4 if ethnicity==6
(847 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///                                             
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                                                               

. label values ethnicity ethnicity

. safetab ethnicity, m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     13,532       59.70       59.70
South Asian |        858        3.79       63.49
      Black |        891        3.93       67.42
      Mixed |        847        3.74       71.16
      Other |        859        3.79       74.95
          . |      5,678       25.05      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(5,678 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(5,678 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. label var ethnicity1 "Ethnicity"

. safetab ethnicity1, m

  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     13,532       59.70       59.70
South Asian |        858        3.79       63.49
      Black |        891        3.93       67.42
      Mixed |        847        3.74       71.16
      Other |        859        3.79       74.95
    Unknown |      5,678       25.05      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,219        9.79        9.79
                Urban minor conurbation |      2,320       10.24       20.03
                    Urban city and town |      2,301       10.15       30.18
Urban city and town in a sparse setting |      2,307       10.18       40.36
                  Rural town and fringe |      2,344       10.34       50.70
Rural town and fringe in a sparse setti |      2,257        9.96       60.66
            Rural village and dispersed |      4,458       19.67       80.33
Rural village and dispersed in a sparse |      4,459       19.67      100.00
----------------------------------------+-----------------------------------
                                  Total |     22,665      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(22,665 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(9,147 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(13,518 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                                       rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow  Rural tow  Rural vil  Rural vil |     Total
-----------+----------------------------------------------------------------------------------------+----------
     Rural |         0          0          0          0      2,344      2,257      4,458      4,459 |    13,518 
     Urban |     2,219      2,320      2,301      2,307          0          0          0          0 |     9,147 
-----------+----------------------------------------------------------------------------------------+----------
     Total |     2,219      2,320      2,301      2,307      2,344      2,257      4,458      4,459 |    22,665 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Contemporary comparat |     9,537      6,381 |    15,918 
           SARS-CoV-2 |     3,981      2,766 |     6,747 
----------------------+----------------------+----------
                Total |    13,518      9,147 |    22,665 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,317 real changes made, 2,317 to missing)

. gen     bmi = .
(22,665 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(1,373 changes made to bmi)

. recode  bmi . = 2 if body_mass_index<25
(5,048 changes made to bmi)

. recode  bmi . = 3 if body_mass_index<30
(5,347 changes made to bmi)

. recode  bmi . = 4 if body_mass_index<35
(4,525 changes made to bmi)

. recode  bmi . = 5 if body_mass_index<40
(2,653 changes made to bmi)

. recode  bmi . = 6 if body_mass_index<.
(1,402 changes made to bmi)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                             

. label values bmi bmi

. label var bmi "Body mass index (BMI)"

. safetab bmi, m

     Body mass index |
               (BMI) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,373        6.06        6.06
  Normal (18.5-24.9) |      5,048       22.27       28.33
Overweight (25-29.9) |      5,347       23.59       51.92
   Obese I (30-34.9) |      4,525       19.96       71.89
  Obese II (35-39.9) |      2,653       11.71       83.59
     Obese III (40+) |      1,402        6.19       89.78
                   . |      2,317       10.22      100.00
---------------------+-----------------------------------
               Total |     22,665      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(20,007 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(453 real changes made)

. replace smoking = 0 if smoking_status=="N"
(911 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |        911        4.02        4.02
Current/former smoker |      3,111       13.73       17.75
                    . |     18,643       82.25      100.00
----------------------+-----------------------------------
                Total |     22,665      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000)
(9,865 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(12,800 changes made to egfr_group)

. label define egfr_group 1 "105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       105 |      3,963       17.49       17.49
     90-104 |      1,816        8.01       25.50
      75-89 |      1,627        7.18       32.68
      60-74 |      2,024        8.93       41.61
      45-59 |      2,100        9.27       50.87
      30-44 |      1,183        5.22       56.09
      15-29 |         87        0.38       56.47
          . |      9,865       43.53      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 15-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(9,865 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(18,702 changes made to ckd_stage)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6 "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |      9,430       41.61       41.61
                      CKD 3A |      2,100        9.27       50.87
                      CKD 3B |      1,183        5.22       56.09
                       CKD 4 |         87        0.38       56.47
No baseline eGFR measurement |      9,865       43.53      100.00
-----------------------------+-----------------------------------
                       Total |     22,665      100.00

. 
. * Comorbidities
. rename acute_kidney_injury_baseline aki_baseline

. safetab aki_baseline

aki_baselin |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,531       95.00       95.00
          1 |      1,134        5.00      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,497       94.85       94.85
          1 |      1,168        5.15      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,212       98.00       98.00
          1 |        453        2.00      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. label var diabetes "Diabetes"

. safetab diabetes

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,116       79.93       79.93
          1 |      4,549       20.07      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,444       99.02       99.02
          1 |        221        0.98      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. safetab heart_failure

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,761       96.01       96.01
          1 |        904        3.99      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. safetab hiv

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,212       98.00       98.00
          1 |        453        2.00      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. label var hypertension "Hypertension"

. safetab hypertension

Hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,142       80.04       80.04
          1 |      4,523       19.96      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. label var non_haem_cancer "Cancer (non-haematological)"

. safetab non_haem_cancer

     Cancer |
(non-haemat |
  ological) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,234       98.10       98.10
          1 |        431        1.90      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. safetab myocardial_infarction

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,407       90.04       90.04
          1 |      2,258        9.96      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,210       97.99       97.99
          1 |        455        2.01      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,564       95.14       95.14
          1 |      1,101        4.86      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. safetab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,184       97.88       97.88
          1 |        481        2.12      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,207       97.98       97.98
          1 |        458        2.02      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(856 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,052 real changes made)

. replace cardiovascular = 1 if pvd==1
(371 real changes made)

. replace cardiovascular = 1 if stroke==1
(387 real changes made)

. label var cardiovascular "Cardiovascular diseases"

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(451 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,066 real changes made)

. replace immunosuppressed = 1 if lupus==1
(422 real changes made)

. label var immunosuppressed "Immunosuppressive diseases"

. safetab cardiovascular

Cardiovascu |
        lar |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,831       78.67       78.67
          1 |      4,834       21.33      100.00
------------+-----------------------------------
      Total |     22,665      100.00

. safetab immunosuppressed

Immunosuppr |
     essive |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,505       90.47       90.47
          1 |      2,160        9.53      100.00
------------+-----------------------------------
      Total |     22,665      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2020 ///
>                                                                                 creatinine_mar2020 ///
>                                                                                 creatinine_apr2020 ///
>                                                                                 creatinine_may2020 ///
>                                                                                 creatinine_jun2020 ///
>                                                                                 creatinine_jul2020 ///
>                                                                                 creatinine_aug2020 ///
>                                                                                 creatinine_sep2020 ///
>                                                                                 creatinine_oct2020 ///
>                                                                                 creatinine_nov2020 ///
>                                                                                 creatinine_dec2020 ///
>                                                                                 creatinine_jan2021 ///
>                                                                                 creatinine_feb2021 ///
>                                                                                 creatinine_mar2021 ///
>                                                                                 creatinine_apr2021 ///
>                                                                                 creatinine_may2021 ///
>                                                                                 creatinine_jun2021 ///
>                                                                                 creatinine_jul2021 ///
>                                                                                 creatinine_aug2021 ///
>                                                                                 creatinine_sep2021 ///
>                                                                                 creatinine_oct2021 ///
>                                                                                 creatinine_nov2021 ///
>                                                                                 creatinine_dec2021 ///
>                                                                                 creatinine_jan2022 ///
>                                                                                 creatinine_feb2022 ///
>                                                                                 creatinine_mar2022 ///
>                                                                                 creatinine_apr2022 ///
>                                                                                 creatinine_may2022 ///
>                                                                                 creatinine_jun2022 ///
>                                                                                 creatinine_jul2022 ///
>                                                                                 creatinine_aug2022 ///
>                                                                                 creatinine_sep2022 ///
>                                                                                 creatinine_oct2022 ///
>                                                                                 creatinine_nov2022 ///
>                                                                                 creatinine_dec2022 ///
>                                                                                 creatinine_jan2023 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 3000)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex==0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex==1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_monthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(9,973 real changes made, 9,973 to missing)
(9,973 missing values generated)
(22,665 missing values generated)
(6,484 real changes made)
(6,208 real changes made)
(6,484 real changes made)
(6,208 real changes made)
(8,079 real changes made)
(22,665 missing values generated)
(6,484 real changes made)
(6,208 real changes made)
(12,692 real changes made)
(14,586 real changes made)
(9,973 missing values generated)
(12,692 real changes made)
(6,484 real changes made)
(9,994 real changes made, 9,994 to missing)
(9,994 missing values generated)
(22,665 missing values generated)
(6,473 real changes made)
(6,198 real changes made)
(6,473 real changes made)
(6,198 real changes made)
(7,980 real changes made)
(22,665 missing values generated)
(6,473 real changes made)
(6,198 real changes made)
(12,671 real changes made)
(14,685 real changes made)
(9,994 missing values generated)
(12,671 real changes made)
(6,473 real changes made)
(9,946 real changes made, 9,946 to missing)
(9,946 missing values generated)
(22,665 missing values generated)
(6,529 real changes made)
(6,190 real changes made)
(6,529 real changes made)
(6,190 real changes made)
(8,035 real changes made)
(22,665 missing values generated)
(6,529 real changes made)
(6,190 real changes made)
(12,719 real changes made)
(14,630 real changes made)
(9,946 missing values generated)
(12,719 real changes made)
(6,529 real changes made)
(10,052 real changes made, 10,052 to missing)
(10,052 missing values generated)
(22,665 missing values generated)
(6,497 real changes made)
(6,116 real changes made)
(6,497 real changes made)
(6,116 real changes made)
(7,958 real changes made)
(22,665 missing values generated)
(6,497 real changes made)
(6,116 real changes made)
(12,613 real changes made)
(14,707 real changes made)
(10,052 missing values generated)
(12,613 real changes made)
(6,497 real changes made)
(10,009 real changes made, 10,009 to missing)
(10,009 missing values generated)
(22,665 missing values generated)
(6,398 real changes made)
(6,258 real changes made)
(6,398 real changes made)
(6,258 real changes made)
(8,038 real changes made)
(22,665 missing values generated)
(6,398 real changes made)
(6,258 real changes made)
(12,656 real changes made)
(14,627 real changes made)
(10,009 missing values generated)
(12,656 real changes made)
(6,398 real changes made)
(10,020 real changes made, 10,020 to missing)
(10,020 missing values generated)
(22,665 missing values generated)
(6,497 real changes made)
(6,148 real changes made)
(6,497 real changes made)
(6,148 real changes made)
(8,081 real changes made)
(22,665 missing values generated)
(6,497 real changes made)
(6,148 real changes made)
(12,645 real changes made)
(14,584 real changes made)
(10,020 missing values generated)
(12,645 real changes made)
(6,497 real changes made)
(9,955 real changes made, 9,955 to missing)
(9,955 missing values generated)
(22,665 missing values generated)
(6,517 real changes made)
(6,193 real changes made)
(6,517 real changes made)
(6,193 real changes made)
(8,150 real changes made)
(22,665 missing values generated)
(6,517 real changes made)
(6,193 real changes made)
(12,710 real changes made)
(14,515 real changes made)
(9,955 missing values generated)
(12,710 real changes made)
(6,517 real changes made)
(9,966 real changes made, 9,966 to missing)
(9,966 missing values generated)
(22,665 missing values generated)
(6,477 real changes made)
(6,222 real changes made)
(6,477 real changes made)
(6,222 real changes made)
(8,070 real changes made)
(22,665 missing values generated)
(6,477 real changes made)
(6,222 real changes made)
(12,699 real changes made)
(14,595 real changes made)
(9,966 missing values generated)
(12,699 real changes made)
(6,477 real changes made)
(9,988 real changes made, 9,988 to missing)
(9,988 missing values generated)
(22,665 missing values generated)
(6,415 real changes made)
(6,262 real changes made)
(6,415 real changes made)
(6,262 real changes made)
(8,021 real changes made)
(22,665 missing values generated)
(6,415 real changes made)
(6,262 real changes made)
(12,677 real changes made)
(14,644 real changes made)
(9,988 missing values generated)
(12,677 real changes made)
(6,415 real changes made)
(10,025 real changes made, 10,025 to missing)
(10,025 missing values generated)
(22,665 missing values generated)
(6,459 real changes made)
(6,181 real changes made)
(6,459 real changes made)
(6,181 real changes made)
(7,959 real changes made)
(22,665 missing values generated)
(6,459 real changes made)
(6,181 real changes made)
(12,640 real changes made)
(14,706 real changes made)
(10,025 missing values generated)
(12,640 real changes made)
(6,459 real changes made)
(9,959 real changes made, 9,959 to missing)
(9,959 missing values generated)
(22,665 missing values generated)
(6,455 real changes made)
(6,251 real changes made)
(6,455 real changes made)
(6,251 real changes made)
(8,034 real changes made)
(22,665 missing values generated)
(6,455 real changes made)
(6,251 real changes made)
(12,706 real changes made)
(14,631 real changes made)
(9,959 missing values generated)
(12,706 real changes made)
(6,455 real changes made)
(9,984 real changes made, 9,984 to missing)
(9,984 missing values generated)
(22,665 missing values generated)
(6,477 real changes made)
(6,204 real changes made)
(6,477 real changes made)
(6,204 real changes made)
(8,002 real changes made)
(22,665 missing values generated)
(6,477 real changes made)
(6,204 real changes made)
(12,681 real changes made)
(14,663 real changes made)
(9,984 missing values generated)
(12,681 real changes made)
(6,477 real changes made)
(9,919 real changes made, 9,919 to missing)
(9,919 missing values generated)
(22,665 missing values generated)
(6,550 real changes made)
(6,196 real changes made)
(6,550 real changes made)
(6,196 real changes made)
(8,204 real changes made)
(22,665 missing values generated)
(6,550 real changes made)
(6,196 real changes made)
(12,746 real changes made)
(14,461 real changes made)
(9,919 missing values generated)
(12,746 real changes made)
(6,550 real changes made)
(9,996 real changes made, 9,996 to missing)
(9,996 missing values generated)
(22,665 missing values generated)
(6,472 real changes made)
(6,197 real changes made)
(6,472 real changes made)
(6,197 real changes made)
(8,114 real changes made)
(22,665 missing values generated)
(6,472 real changes made)
(6,197 real changes made)
(12,669 real changes made)
(14,551 real changes made)
(9,996 missing values generated)
(12,669 real changes made)
(6,472 real changes made)
(9,901 real changes made, 9,901 to missing)
(9,901 missing values generated)
(22,665 missing values generated)
(6,554 real changes made)
(6,210 real changes made)
(6,554 real changes made)
(6,210 real changes made)
(8,067 real changes made)
(22,665 missing values generated)
(6,554 real changes made)
(6,210 real changes made)
(12,764 real changes made)
(14,598 real changes made)
(9,901 missing values generated)
(12,764 real changes made)
(6,554 real changes made)
(9,939 real changes made, 9,939 to missing)
(9,939 missing values generated)
(22,665 missing values generated)
(6,481 real changes made)
(6,245 real changes made)
(6,481 real changes made)
(6,245 real changes made)
(8,096 real changes made)
(22,665 missing values generated)
(6,481 real changes made)
(6,245 real changes made)
(12,726 real changes made)
(14,569 real changes made)
(9,939 missing values generated)
(12,726 real changes made)
(6,481 real changes made)
(9,887 real changes made, 9,887 to missing)
(9,887 missing values generated)
(22,665 missing values generated)
(6,528 real changes made)
(6,250 real changes made)
(6,528 real changes made)
(6,250 real changes made)
(8,069 real changes made)
(22,665 missing values generated)
(6,528 real changes made)
(6,250 real changes made)
(12,778 real changes made)
(14,596 real changes made)
(9,887 missing values generated)
(12,778 real changes made)
(6,528 real changes made)
(9,960 real changes made, 9,960 to missing)
(9,960 missing values generated)
(22,665 missing values generated)
(6,484 real changes made)
(6,221 real changes made)
(6,484 real changes made)
(6,221 real changes made)
(8,128 real changes made)
(22,665 missing values generated)
(6,484 real changes made)
(6,221 real changes made)
(12,705 real changes made)
(14,537 real changes made)
(9,960 missing values generated)
(12,705 real changes made)
(6,484 real changes made)
(9,975 real changes made, 9,975 to missing)
(9,975 missing values generated)
(22,665 missing values generated)
(6,485 real changes made)
(6,205 real changes made)
(6,485 real changes made)
(6,205 real changes made)
(7,970 real changes made)
(22,665 missing values generated)
(6,485 real changes made)
(6,205 real changes made)
(12,690 real changes made)
(14,695 real changes made)
(9,975 missing values generated)
(12,690 real changes made)
(6,485 real changes made)
(9,930 real changes made, 9,930 to missing)
(9,930 missing values generated)
(22,665 missing values generated)
(6,587 real changes made)
(6,148 real changes made)
(6,587 real changes made)
(6,148 real changes made)
(8,142 real changes made)
(22,665 missing values generated)
(6,587 real changes made)
(6,148 real changes made)
(12,735 real changes made)
(14,523 real changes made)
(9,930 missing values generated)
(12,735 real changes made)
(6,587 real changes made)
(9,992 real changes made, 9,992 to missing)
(9,992 missing values generated)
(22,665 missing values generated)
(6,453 real changes made)
(6,220 real changes made)
(6,453 real changes made)
(6,220 real changes made)
(8,061 real changes made)
(22,665 missing values generated)
(6,453 real changes made)
(6,220 real changes made)
(12,673 real changes made)
(14,604 real changes made)
(9,992 missing values generated)
(12,673 real changes made)
(6,453 real changes made)
(10,019 real changes made, 10,019 to missing)
(10,019 missing values generated)
(22,665 missing values generated)
(6,494 real changes made)
(6,152 real changes made)
(6,494 real changes made)
(6,152 real changes made)
(8,021 real changes made)
(22,665 missing values generated)
(6,494 real changes made)
(6,152 real changes made)
(12,646 real changes made)
(14,644 real changes made)
(10,019 missing values generated)
(12,646 real changes made)
(6,494 real changes made)
(9,935 real changes made, 9,935 to missing)
(9,935 missing values generated)
(22,665 missing values generated)
(6,527 real changes made)
(6,203 real changes made)
(6,527 real changes made)
(6,203 real changes made)
(8,073 real changes made)
(22,665 missing values generated)
(6,527 real changes made)
(6,203 real changes made)
(12,730 real changes made)
(14,592 real changes made)
(9,935 missing values generated)
(12,730 real changes made)
(6,527 real changes made)
(9,932 real changes made, 9,932 to missing)
(9,932 missing values generated)
(22,665 missing values generated)
(6,485 real changes made)
(6,248 real changes made)
(6,485 real changes made)
(6,248 real changes made)
(8,110 real changes made)
(22,665 missing values generated)
(6,485 real changes made)
(6,248 real changes made)
(12,733 real changes made)
(14,555 real changes made)
(9,932 missing values generated)
(12,733 real changes made)
(6,485 real changes made)
(9,969 real changes made, 9,969 to missing)
(9,969 missing values generated)
(22,665 missing values generated)
(6,470 real changes made)
(6,226 real changes made)
(6,470 real changes made)
(6,226 real changes made)
(7,993 real changes made)
(22,665 missing values generated)
(6,470 real changes made)
(6,226 real changes made)
(12,696 real changes made)
(14,672 real changes made)
(9,969 missing values generated)
(12,696 real changes made)
(6,470 real changes made)
(10,037 real changes made, 10,037 to missing)
(10,037 missing values generated)
(22,665 missing values generated)
(6,489 real changes made)
(6,139 real changes made)
(6,489 real changes made)
(6,139 real changes made)
(8,074 real changes made)
(22,665 missing values generated)
(6,489 real changes made)
(6,139 real changes made)
(12,628 real changes made)
(14,591 real changes made)
(10,037 missing values generated)
(12,628 real changes made)
(6,489 real changes made)
(10,039 real changes made, 10,039 to missing)
(10,039 missing values generated)
(22,665 missing values generated)
(6,469 real changes made)
(6,157 real changes made)
(6,469 real changes made)
(6,157 real changes made)
(7,973 real changes made)
(22,665 missing values generated)
(6,469 real changes made)
(6,157 real changes made)
(12,626 real changes made)
(14,692 real changes made)
(10,039 missing values generated)
(12,626 real changes made)
(6,469 real changes made)
(10,041 real changes made, 10,041 to missing)
(10,041 missing values generated)
(22,665 missing values generated)
(6,413 real changes made)
(6,211 real changes made)
(6,413 real changes made)
(6,211 real changes made)
(8,056 real changes made)
(22,665 missing values generated)
(6,413 real changes made)
(6,211 real changes made)
(12,624 real changes made)
(14,609 real changes made)
(10,041 missing values generated)
(12,624 real changes made)
(6,413 real changes made)
(9,926 real changes made, 9,926 to missing)
(9,926 missing values generated)
(22,665 missing values generated)
(6,555 real changes made)
(6,184 real changes made)
(6,555 real changes made)
(6,184 real changes made)
(8,188 real changes made)
(22,665 missing values generated)
(6,555 real changes made)
(6,184 real changes made)
(12,739 real changes made)
(14,477 real changes made)
(9,926 missing values generated)
(12,739 real changes made)
(6,555 real changes made)
(9,996 real changes made, 9,996 to missing)
(9,996 missing values generated)
(22,665 missing values generated)
(6,519 real changes made)
(6,150 real changes made)
(6,519 real changes made)
(6,150 real changes made)
(8,160 real changes made)
(22,665 missing values generated)
(6,519 real changes made)
(6,150 real changes made)
(12,669 real changes made)
(14,505 real changes made)
(9,996 missing values generated)
(12,669 real changes made)
(6,519 real changes made)
(9,936 real changes made, 9,936 to missing)
(9,936 missing values generated)
(22,665 missing values generated)
(6,411 real changes made)
(6,318 real changes made)
(6,411 real changes made)
(6,318 real changes made)
(7,961 real changes made)
(22,665 missing values generated)
(6,411 real changes made)
(6,318 real changes made)
(12,729 real changes made)
(14,704 real changes made)
(9,936 missing values generated)
(12,729 real changes made)
(6,411 real changes made)
(9,990 real changes made, 9,990 to missing)
(9,990 missing values generated)
(22,665 missing values generated)
(6,523 real changes made)
(6,152 real changes made)
(6,523 real changes made)
(6,152 real changes made)
(8,045 real changes made)
(22,665 missing values generated)
(6,523 real changes made)
(6,152 real changes made)
(12,675 real changes made)
(14,620 real changes made)
(9,990 missing values generated)
(12,675 real changes made)
(6,523 real changes made)
(10,074 real changes made, 10,074 to missing)
(10,074 missing values generated)
(22,665 missing values generated)
(6,499 real changes made)
(6,092 real changes made)
(6,499 real changes made)
(6,092 real changes made)
(8,091 real changes made)
(22,665 missing values generated)
(6,499 real changes made)
(6,092 real changes made)
(12,591 real changes made)
(14,574 real changes made)
(10,074 missing values generated)
(12,591 real changes made)
(6,499 real changes made)
(9,926 real changes made, 9,926 to missing)
(9,926 missing values generated)
(22,665 missing values generated)
(6,552 real changes made)
(6,187 real changes made)
(6,552 real changes made)
(6,187 real changes made)
(8,050 real changes made)
(22,665 missing values generated)
(6,552 real changes made)
(6,187 real changes made)
(12,739 real changes made)
(14,615 real changes made)
(9,926 missing values generated)
(12,739 real changes made)
(6,552 real changes made)
(9,959 real changes made, 9,959 to missing)
(9,959 missing values generated)
(22,665 missing values generated)
(6,451 real changes made)
(6,255 real changes made)
(6,451 real changes made)
(6,255 real changes made)
(8,137 real changes made)
(22,665 missing values generated)
(6,451 real changes made)
(6,255 real changes made)
(12,706 real changes made)
(14,528 real changes made)
(9,959 missing values generated)
(12,706 real changes made)
(6,451 real changes made)
(9,976 real changes made, 9,976 to missing)
(9,976 missing values generated)
(22,665 missing values generated)
(6,433 real changes made)
(6,256 real changes made)
(6,433 real changes made)
(6,256 real changes made)
(8,035 real changes made)
(22,665 missing values generated)
(6,433 real changes made)
(6,256 real changes made)
(12,689 real changes made)
(14,630 real changes made)
(9,976 missing values generated)
(12,689 real changes made)
(6,433 real changes made)

. 
. replace index_date = index_date_28
(22,665 real changes made)

. drop index_date_28

. gen egfr15_date=.
(22,665 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 
> jul2022 aug2022 sep2022 oct2022 nov2022 dec2022 jan2023"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatinine_`x'<15 & date("01`x'", "DMY")>index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen index_date_esrd = index_date

. gen esrd_date = egfr15_date
(22,665 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if esrd_date==.
(2,388 real changes made)

. gen esrd = 0

. replace esrd = 1 if esrd_date!=.
(2,388 real changes made)

. label var esrd "Kidney failure"

. gen esrd_time = (esrd_date - index_date_esrd)
(20,277 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(20,277 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(2,383 changes made to esrd_time_cat)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"                      ///
>                                                         3 "1 to 28 days"        ///
>                                                         4 "20 to 90 days"       ///
>                                                         5 "91 to 180 days"      ///
>                                                         6 "181 to 365 days"     ///
>                                                         7 "366 to 730 days"     ///
>                                                         8 "731 to 973 days"     ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 covid_severity  ///
>                                                                 covid_aki               {
  2.                                                                 by `exposure',sort: sum esrd_time, de
  3.                                                                 tab esrd_time_cat `exposure', m col chi
  4.                                                                 }

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Contemporary comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           12              1
10%           53              1       Obs               1,707
25%          165              1       Sum of wgt.       1,707

50%          364                      Mean           398.2068
                        Largest       Std. dev.      270.5786
75%          600           1039
90%          793           1039       Variance       73212.77
95%          883           1043       Skewness       .3433866
99%          984           1051       Kurtosis       2.109761

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = SARS-CoV-2

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            7              1
10%           41              1       Obs                 681
25%          145              1       Sum of wgt.         681

50%          340                      Mean           375.5022
                        Largest       Std. dev.      264.0898
75%          577           1003
90%          758           1008       Variance       69743.43
95%          835           1011       Skewness       .3493358
99%          973           1020       Kurtosis       2.085206


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Contempor  SARS-CoV- |     Total
----------------+----------------------+----------
   1 to 28 days |       121         51 |       172 
                |      0.76       0.76 |      0.76 
----------------+----------------------+----------
  20 to 90 days |       131         71 |       202 
                |      0.82       1.05 |      0.89 
----------------+----------------------+----------
 91 to 180 days |       208         83 |       291 
                |      1.31       1.23 |      1.28 
----------------+----------------------+----------
181 to 365 days |       396        150 |       546 
                |      2.49       2.22 |      2.41 
----------------+----------------------+----------
366 to 730 days |       614        247 |       861 
                |      3.86       3.66 |      3.80 
----------------+----------------------+----------
731 to 973 days |       214         73 |       287 
                |      1.34       1.08 |      1.27 
----------------+----------------------+----------
      >973 days |        23          6 |        29 
                |      0.14       0.09 |      0.13 
----------------+----------------------+----------
              . |    14,211      6,066 |    20,277 
                |     89.28      89.91 |     89.46 
----------------+----------------------+----------
          Total |    15,918      6,747 |    22,665 
                |    100.00     100.00 |    100.00 

          Pearson chi2(7) =   8.8024   Pr = 0.267

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Contemporary comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           12              1
10%           53              1       Obs               1,707
25%          165              1       Sum of wgt.       1,707

50%          364                      Mean           398.2068
                        Largest       Std. dev.      270.5786
75%          600           1039
90%          793           1039       Variance       73212.77
95%          883           1043       Skewness       .3433866
99%          984           1051       Kurtosis       2.109761

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            6              1
10%           38              1       Obs                 548
25%          147              1       Sum of wgt.         548

50%        352.5                      Mean           378.1569
                        Largest       Std. dev.      261.4792
75%          588            958
90%          749            973       Variance       68371.35
95%          826           1011       Skewness       .2844595
99%          933           1020       Kurtosis       2.018468

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            7              1
10%           39              5       Obs                  69
25%          166              7       Sum of wgt.          69

50%          317                      Mean           388.8841
                        Largest       Std. dev.      277.6788
75%          576            894
90%          812            957       Variance       77105.52
95%          894            977       Skewness       .5215258
99%         1003           1003       Kurtosis       2.236567

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Critical care COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           18              1
10%           46              1       Obs                  64
25%          100             18       Sum of wgt.          64

50%          262                      Mean           338.3438
                        Largest       Std. dev.      272.5145
75%        528.5            846
90%          764            873       Variance       74264.13
95%          846            990       Skewness       .6762079
99%         1008           1008       Kurtosis       2.500304


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |             SARS-CoV-2 severity
  esrd_time_cat | Contempor  Non-hospi  Hospitali  Critical  |     Total
----------------+--------------------------------------------+----------
   1 to 28 days |       121         40          6          5 |       172 
                |      0.76       0.73       1.02       0.78 |      0.76 
----------------+--------------------------------------------+----------
  20 to 90 days |       131         59          3          9 |       202 
                |      0.82       1.07       0.51       1.40 |      0.89 
----------------+--------------------------------------------+----------
 91 to 180 days |       208         63          9         11 |       291 
                |      1.31       1.14       1.53       1.71 |      1.28 
----------------+--------------------------------------------+----------
181 to 365 days |       396        118         21         11 |       546 
                |      2.49       2.14       3.57       1.71 |      2.41 
----------------+--------------------------------------------+----------
366 to 730 days |       614        206         20         21 |       861 
                |      3.86       3.73       3.40       3.27 |      3.80 
----------------+--------------------------------------------+----------
731 to 973 days |       214         60          8          5 |       287 
                |      1.34       1.09       1.36       0.78 |      1.27 
----------------+--------------------------------------------+----------
      >973 days |        23          2          2          2 |        29 
                |      0.14       0.04       0.34       0.31 |      0.13 
----------------+--------------------------------------------+----------
              . |    14,211      4,969        519        578 |    20,277 
                |     89.28      90.07      88.27      90.03 |     89.46 
----------------+--------------------------------------------+----------
          Total |    15,918      5,517        588        642 |    22,665 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(21) =  27.5064   Pr = 0.155

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Contemporary comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           12              1
10%           53              1       Obs               1,707
25%          165              1       Sum of wgt.       1,707

50%          364                      Mean           398.2068
                        Largest       Std. dev.      270.5786
75%          600           1039
90%          793           1039       Variance       73212.77
95%          883           1043       Skewness       .3433866
99%          984           1051       Kurtosis       2.109761

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           10              1
10%           44              1       Obs                 573
25%          145              1       Sum of wgt.         573

50%          352                      Mean           375.8028
                        Largest       Std. dev.      261.1596
75%          583            990
90%          747           1008       Variance       68204.34
95%          826           1011       Skewness       .3073518
99%          949           1020       Kurtosis       2.041782

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            5              1
10%           56              1       Obs                  73
25%          166              5       Sum of wgt.          73

50%          316                      Mean           386.7808
                        Largest       Std. dev.      279.8714
75%          576            894
90%          812            957       Variance       78328.01
95%          894            977       Skewness       .5457309
99%         1003           1003       Kurtosis       2.222535

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID-AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            7              6       Obs                  35
25%           67              7       Sum of wgt.          35

50%          317                      Mean           347.0571
                        Largest       Std. dev.       283.641
75%          568            763
90%          763            799       Variance       80452.23
95%          912            912       Skewness        .517862
99%          973            973       Kurtosis       2.246672


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |        COVID-19 acute kidney injury
  esrd_time_cat | Contempor  Non-hospi  Hospitali  Hospitali |     Total
----------------+--------------------------------------------+----------
   1 to 28 days |       121         39          6          6 |       172 
                |      0.76       0.68       0.97       1.70 |      0.76 
----------------+--------------------------------------------+----------
  20 to 90 days |       131         64          4          3 |       202 
                |      0.82       1.11       0.65       0.85 |      0.89 
----------------+--------------------------------------------+----------
 91 to 180 days |       208         71          9          3 |       291 
                |      1.31       1.23       1.45       0.85 |      1.28 
----------------+--------------------------------------------+----------
181 to 365 days |       396        119         23          8 |       546 
                |      2.49       2.06       3.72       2.27 |      2.41 
----------------+--------------------------------------------+----------
366 to 730 days |       614        217         20         10 |       861 
                |      3.86       3.76       3.23       2.83 |      3.80 
----------------+--------------------------------------------+----------
731 to 973 days |       214         59          9          5 |       287 
                |      1.34       1.02       1.45       1.42 |      1.27 
----------------+--------------------------------------------+----------
      >973 days |        23          4          2          0 |        29 
                |      0.14       0.07       0.32       0.00 |      0.13 
----------------+--------------------------------------------+----------
              . |    14,211      5,202        546        318 |    20,277 
                |     89.28      90.08      88.21      90.08 |     89.46 
----------------+--------------------------------------------+----------
          Total |    15,918      5,775        619        353 |    22,665 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(21) =  27.8214   Pr = 0.145

. gen exit_date_esrd = esrd_date
(20,277 missing values generated)

. format exit_date_esrd %td

. gen end_date = date("2023-01-31", "YMD")

. format end_date %td

. replace exit_date_esrd = min(deregistered_date, death_date, end_date, covid_exit) if esrd_date==.
(20,277 real changes made)

. replace exit_date_esrd = covid_exit if covid_exit < esrd_date
(669 real changes made)

. replace esrd_date=. if covid_exit<esrd_date&case==0
(392 real changes made, 392 to missing)

. gen esrd_denominator = 1

. gen follow_up_time_esrd = (exit_date_esrd - index_date_esrd)

. label var follow_up_time_esrd "Follow-up time (Days)"

. gen follow_up_cat_esrd = follow_up_time_esrd

. recode follow_up_cat_esrd       min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0=3                     ///
>                                                 1/365=4         ///
>                                                 366/730=5       ///
>                                                 731/1040=6      ///                                     
>                                                 1041/max=7
(22,648 changes made to follow_up_cat_esrd)

. label define follow_up_cat_esrd         1 "<-29 days"   ///
>                                                         2 "-28 to -1 days"              ///
>                                                         3 "0 days"                              ///
>                                                         4 "1 to 365 days"               ///
>                                                         5 "366 to 730 days"     ///
>                                                         6 "731 to 1040 days"    ///
>                                                         7 ">1040 days"

. label values follow_up_cat_esrd follow_up_cat_esrd

. label var follow_up_cat_esrd "Follow_up time"

. tab case follow_up_cat_esrd

                      |                          Follow_up time
                 case | -28 to -1     0 days  1 to 365   366 to 73  731 to 10  >1040 day |     Total
----------------------+------------------------------------------------------------------+----------
Contemporary comparat |        62          3      5,771      5,323      4,399        360 |    15,918 
           SARS-CoV-2 |        35          2      1,272      2,147      3,008        283 |     6,747 
----------------------+------------------------------------------------------------------+----------
                Total |        97          5      7,043      7,470      7,407        643 |    22,665 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |                          Follow_up time
  replacement therapy | -28 to -1     0 days  1 to 365   366 to 73  731 to 10  >1040 day |     Total
----------------------+------------------------------------------------------------------+----------
Contemporary comparat |        62          3      5,771      5,323      4,399        360 |    15,918 
Non-hospitalised SARS |        29          1      1,043      1,724      2,450        237 |     5,484 
No KRT hospitalised C |         3          0        115        173        268         24 |       583 
KRT hospitalised COVI |         3          1        114        250        290         22 |       680 
----------------------+------------------------------------------------------------------+----------
                Total |        97          5      7,043      7,470      7,407        643 |    22,665 

. drop if follow_up_time_esrd<1
(102 observations deleted)

. drop if follow_up_time_esrd>1040
(643 observations deleted)

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Contemporary comparat |     5,771      5,323      4,399 |    15,493 
           SARS-CoV-2 |     1,272      2,147      3,008 |     6,427 
----------------------+---------------------------------+----------
                Total |     7,043      7,470      7,407 |    21,920 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |          Follow_up time
  replacement therapy | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Contemporary comparat |     5,771      5,323      4,399 |    15,493 
Non-hospitalised SARS |     1,043      1,724      2,450 |     5,217 
No KRT hospitalised C |       115        173        268 |       556 
KRT hospitalised COVI |       114        250        290 |       654 
----------------------+---------------------------------+----------
                Total |     7,043      7,470      7,407 |    21,920 

. gen follow_up_years_esrd = follow_up_time_esrd/365.25

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(21,920 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 
> jul2022 aug2022 sep2022 oct2022 nov2022 dec2022 jan2023"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_half_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>index_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(30 real changes made)
(74 real changes made)
(130 real changes made)
(144 real changes made)
(170 real changes made)
(174 real changes made)
(213 real changes made)
(238 real changes made)
(208 real changes made)
(229 real changes made)
(245 real changes made)
(240 real changes made)
(236 real changes made)
(234 real changes made)
(225 real changes made)
(210 real changes made)
(210 real changes made)
(204 real changes made)
(189 real changes made)
(191 real changes made)
(168 real changes made)
(195 real changes made)
(162 real changes made)
(144 real changes made)
(148 real changes made)
(151 real changes made)
(145 real changes made)
(143 real changes made)
(112 real changes made)
(127 real changes made)
(107 real changes made)
(98 real changes made)
(95 real changes made)
(113 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(1,450 real changes made)

. gen egfr_half = 0

. replace egfr_half = 1 if egfr_half_date!=.
(7,152 real changes made)

. label var egfr_half "50% reduction in eGFR"

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(9,479 real changes made, 9,479 to missing)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(14,768 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date,covid_exit) if egfr_half_date==. & index_date_egfr_half!=.
(6,170 real changes made)

. replace exit_date_egfr_half = covid_exit if covid_exit < egfr_half_date
(3,536 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(9,479 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days)"

. replace egfr_half_date=. if covid_exit<egfr_half_date&case==0
(681 real changes made, 681 to missing)

. gen egfr_half_denominator = 0

. replace egfr_half_denominator = 1 if index_date_egfr_half!=.
(12,441 real changes made)

. gen follow_up_years_egfr_half = follow_up_time_egfr_half/365.25
(9,479 missing values generated)

. 
. * AKI (or ESRD)
. gen index_date_aki = index_date

. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(19,863 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(1,812 real changes made)

. gen aki = 0

. replace aki = 1 if aki_date!=.
(3,869 real changes made)

. label var aki "Acute kidney injury"

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(18,051 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date,covid_exit)  if aki_date==.
(18,051 real changes made)

. replace exit_date_aki = covid_exit if covid_exit < aki_date
(530 real changes made)

. replace aki_date=. if covid_exit<aki_date&case==0
(265 real changes made, 265 to missing)

. gen aki_denominator = 1

. gen follow_up_time_aki = (exit_date_aki - index_date_aki)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. gen follow_up_years_aki = follow_up_time_aki/365.25

. 
. * Exit date (death)
. gen index_date_death = index_date

. gen exit_date_death = death_date
(20,504 missing values generated)

. gen death = 0

. replace death = 1 if death_date!=.
(1,416 real changes made)

. label var death "Death"

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date,covid_exit)  if death_date==.
(20,504 real changes made)

. replace exit_date_death = covid_exit if covid_exit < death_date
(375 real changes made)

. replace death_date=. if covid_exit<death_date&case==0
(279 real changes made, 279 to missing)

. gen death_denominator = 1

. gen follow_up_time_death = (exit_date_death - index_date_death)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. gen follow_up_years_death = follow_up_time_death/365.25

. 
. *Outcomes by time period
. *ESRD
. *0-29 days
. gen esrd_date29 = esrd_date if esrd_date < (index_date_esrd + 30) 
(21,740 missing values generated)

. gen exit_date29_esrd = esrd_date29
(21,740 missing values generated)

. gen index_date29_esrd = index_date_esrd

. format exit_date29_esrd %td

. replace exit_date29_esrd = min(deregistered_date, death_date, end_date, (index_date_esrd + 29)) if esrd_date29==.
(21,740 real changes made)

. stset exit_date29_esrd, fail(esrd_date29) origin(index_date29_esrd) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: esrd_date29!=0 & esrd_date29<.
Observed time interval: (exit_date29_esrd[_n-1], exit_date29_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date29_esrd

--------------------------------------------------------------------------
     21,920  total observations
          0  exclusions
--------------------------------------------------------------------------
     21,920  observations remaining, representing
     21,920  subjects
        180  failures in single-failure-per-subject data
  1,723.283  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .0793977

. *30-89 days
. gen esrd_date89 = esrd_date if esrd_date < (index_date_esrd + 90) 
(21,554 missing values generated)

. gen exit_date89_esrd = esrd_date89
(21,554 missing values generated)

. gen index_date89_esrd = index_date_esrd + 30

. format exit_date89_esrd %td

. replace exit_date89_esrd = min(deregistered_date, death_date, end_date, (index_date_esrd + 89)) if esrd_date89==.
(21,554 real changes made)

. stset exit_date89_esrd, fail(esrd_date89) origin(index_date89_esrd) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: esrd_date89!=0 & esrd_date89<.
Observed time interval: (exit_date89_esrd[_n-1], exit_date89_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date89_esrd

--------------------------------------------------------------------------
     21,920  total observations
        359  observations end on or before enter()
--------------------------------------------------------------------------
     21,561  observations remaining, representing
     21,561  subjects
        185  failures in single-failure-per-subject data
  3,438.563  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .1615332

. *90-179 days
. gen esrd_date179 = esrd_date if esrd_date < (index_date_esrd + 180) 
(21,288 missing values generated)

. gen exit_date179_esrd = esrd_date179
(21,288 missing values generated)

. gen index_date179_esrd = index_date_esrd + 90

. format exit_date179_esrd %td

. replace exit_date179_esrd = min(deregistered_date, death_date, end_date, (index_date_esrd + 179)) if esrd_date179==.
(21,288 real changes made)

. stset exit_date179_esrd, fail(esrd_date179) origin(index_date179_esrd) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: esrd_date179!=0 & esrd_date179<.
Observed time interval: (exit_date179_esrd[_n-1], exit_date179_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date179_esrd

--------------------------------------------------------------------------
     21,920  total observations
        912  observations end on or before enter()
--------------------------------------------------------------------------
     21,008  observations remaining, representing
     21,008  subjects
        264  failures in single-failure-per-subject data
  5,012.372  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .2436687

. *180+ days
. gen index_datemax_esrd = index_date_esrd + 180

. gen exit_datemax_esrd = exit_date_esrd

. gen esrd_datemax = esrd_date
(19,924 missing values generated)

. stset exit_date_esrd, fail(esrd_date) origin(index_datemax_esrd) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: esrd_date!=0 & esrd_date<.
Observed time interval: (exit_date_esrd[_n-1], exit_date_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_datemax_esrd

--------------------------------------------------------------------------
     21,920  total observations
      3,500  observations end on or before enter()
--------------------------------------------------------------------------
     18,420  observations remaining, representing
     18,420  subjects
      1,362  failures in single-failure-per-subject data
 22,913.432  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.354552

. 
. *50% reduction in eGFR
. *0-29 days
. gen egfr_half_date29 = egfr_half_date if egfr_half_date < (index_date_egfr_half + 30) 
(20,635 missing values generated)

. gen exit_date29_egfr_half = egfr_half_date29
(20,635 missing values generated)

. gen index_date29_egfr_half = index_date_egfr_half
(9,479 missing values generated)

. format exit_date29_egfr_half %td

. replace exit_date29_egfr_half = min(deregistered_date, death_date, end_date, (index_date_egfr_half + 29)) if egfr_half_date29==.
(20,635 real changes made)

. stset exit_date29_egfr_half, fail(egfr_half_date29) origin(index_date29_egfr_half) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: egfr_half_date29!=0 & egfr_half_date29<.
Observed time interval: (exit_date29_egfr_half[_n-1], exit_date29_egfr_half]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date29_egfr_half

--------------------------------------------------------------------------
     21,920  total observations
      9,479  ignored because never entered
--------------------------------------------------------------------------
     12,441  observations remaining, representing
     12,441  subjects
        404  failures in single-failure-per-subject data
    974.678  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .0793977

. *30-89 days
. gen egfr_half_date89 = egfr_half_date if egfr_half_date < (index_date_egfr_half + 90) 
(19,425 missing values generated)

. gen exit_date89_egfr_half = egfr_half_date89
(19,425 missing values generated)

. gen index_date89_egfr_half = index_date_egfr_half + 30
(9,479 missing values generated)

. format exit_date89_egfr_half %td

. replace exit_date89_egfr_half = min(deregistered_date, death_date, end_date, (index_date_egfr_half + 89)) if egfr_half_date89==.
(19,425 real changes made)

. stset exit_date89_egfr_half, fail(egfr_half_date89) origin(index_date89_egfr_half) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: egfr_half_date89!=0 & egfr_half_date89<.
Observed time interval: (exit_date89_egfr_half[_n-1], exit_date89_egfr_half]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date89_egfr_half

--------------------------------------------------------------------------
     21,920  total observations
      9,479  ignored because never entered
        517  observations end on or before enter()
--------------------------------------------------------------------------
     11,924  observations remaining, representing
     11,924  subjects
      1,186  failures in single-failure-per-subject data
  1,812.597  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .1615332

. *90-179 days
. gen egfr_half_date179 = egfr_half_date if egfr_half_date < (index_date_egfr_half + 180) 
(18,177 missing values generated)

. gen exit_date179_egfr_half = egfr_half_date179
(18,177 missing values generated)

. gen index_date179_egfr_half = index_date_egfr_half + 90
(9,479 missing values generated)

. format exit_date179_egfr_half %td

. replace exit_date179_egfr_half = min(deregistered_date, death_date, end_date, (index_date_egfr_half + 179)) if egfr_half_date179==.
(18,177 real changes made)

. stset exit_date179_egfr_half, fail(egfr_half_date179) origin(index_date179_egfr_half) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: egfr_half_date179!=0 & egfr_half_date179<.
Observed time interval: (exit_date179_egfr_half[_n-1], exit_date179_egfr_half]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date179_egfr_half

--------------------------------------------------------------------------
     21,920  total observations
      9,479  ignored because never entered
      1,901  observations end on or before enter()
--------------------------------------------------------------------------
     10,540  observations remaining, representing
     10,540  subjects
      1,231  failures in single-failure-per-subject data
  2,373.703  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .2436687

. *180+ days
. gen index_datemax_egfr_half = index_date_egfr_half + 180
(9,479 missing values generated)

. gen exit_datemax_egfr_half = exit_date_egfr_half
(5,818 missing values generated)

. gen egfr_half_datemax = egfr_half_date
(15,449 missing values generated)

. stset exit_date_egfr_half, fail(egfr_half_date) origin(index_datemax_egfr_half) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: egfr_half_date!=0 & egfr_half_date<.
Observed time interval: (exit_date_egfr_half[_n-1], exit_date_egfr_half]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_datemax_egfr_half

--------------------------------------------------------------------------
     21,920  total observations
      5,818  event time missing (exit_date_egfr_half>=.)    PROBABLE ERROR
      3,661  ignored because never entered
      4,287  observations end on or before enter()
--------------------------------------------------------------------------
      8,154  observations remaining, representing
      8,154  subjects
      2,715  failures in single-failure-per-subject data
  8,066.513  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =   2.38193

. 
. *AKI
. *0-29 days
. gen aki_date29 = aki_date if aki_date < (index_date_aki + 30) 
(21,049 missing values generated)

. gen exit_date29_aki = aki_date29
(21,049 missing values generated)

. gen index_date29_aki = index_date_aki

. format exit_date29_aki %td

. replace exit_date29_aki = min(deregistered_date, death_date, end_date, (index_date_aki + 29)) if aki_date29==.
(21,049 real changes made)

. stset exit_date29_aki, fail(aki_date29) origin(index_date29_aki) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: aki_date29!=0 & aki_date29<.
Observed time interval: (exit_date29_aki[_n-1], exit_date29_aki]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date29_aki

--------------------------------------------------------------------------
     21,920  total observations
        652  observations end on or before enter()
--------------------------------------------------------------------------
     21,268  observations remaining, representing
     21,268  subjects
        219  failures in single-failure-per-subject data
   1,670.48  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .0793977

. *30-89 days
. gen aki_date89 = aki_date if aki_date < (index_date_aki + 90) 
(20,760 missing values generated)

. gen exit_date89_aki = aki_date89
(20,760 missing values generated)

. gen index_date89_aki = index_date_aki + 30

. format exit_date89_aki %td

. replace exit_date89_aki = min(deregistered_date, death_date, end_date, (index_date_aki + 89)) if aki_date89==.
(20,760 real changes made)

. stset exit_date89_aki, fail(aki_date89) origin(index_date89_aki) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: aki_date89!=0 & aki_date89<.
Observed time interval: (exit_date89_aki[_n-1], exit_date89_aki]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date89_aki

--------------------------------------------------------------------------
     21,920  total observations
      1,043  observations end on or before enter()
--------------------------------------------------------------------------
     20,877  observations remaining, representing
     20,877  subjects
        287  failures in single-failure-per-subject data
  3,321.525  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .1615332

. *90-179 days
. gen aki_date179 = aki_date if aki_date < (index_date_aki + 180) 
(20,365 missing values generated)

. gen exit_date179_aki = aki_date179
(20,365 missing values generated)

. gen index_date179_aki = index_date_aki + 90

. format exit_date179_aki %td

. replace exit_date179_aki = min(deregistered_date, death_date, end_date, (index_date_aki + 179)) if aki_date179==.
(20,365 real changes made)

. stset exit_date179_aki, fail(aki_date179) origin(index_date179_aki) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: aki_date179!=0 & aki_date179<.
Observed time interval: (exit_date179_aki[_n-1], exit_date179_aki]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date179_aki

--------------------------------------------------------------------------
     21,920  total observations
      1,680  observations end on or before enter()
--------------------------------------------------------------------------
     20,240  observations remaining, representing
     20,240  subjects
        392  failures in single-failure-per-subject data
  4,815.001  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .2436687

. *180+ days
. gen index_datemax_aki = index_date_aki + 180

. gen exit_datemax_aki = exit_date_aki

. gen aki_datemax = aki_date
(18,316 missing values generated)

. stset exit_date_aki, fail(aki_date) origin(index_datemax_aki) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: aki_date!=0 & aki_date<.
Observed time interval: (exit_date_aki[_n-1], exit_date_aki]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_datemax_aki

--------------------------------------------------------------------------
     21,920  total observations
      4,277  observations end on or before enter()
--------------------------------------------------------------------------
     17,643  observations remaining, representing
     17,643  subjects
      2,044  failures in single-failure-per-subject data
 21,463.808  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.354552

. 
. *Death
. *0-29 days
. gen death_date29 = death_date if death_date < (index_date_death + 30) 
(21,867 missing values generated)

. gen exit_date29_death = death_date29
(21,867 missing values generated)

. gen index_date29_death = index_date_death

. format exit_date29_death %td

. replace exit_date29_death = min(deregistered_date, death_date, end_date, (index_date_death + 29)) if death_date29==.
(21,867 real changes made)

. stset exit_date29_death, fail(death_date29) origin(index_date29_death) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: death_date29!=0 & death_date29<.
Observed time interval: (exit_date29_death[_n-1], exit_date29_death]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date29_death

--------------------------------------------------------------------------
     21,920  total observations
          0  exclusions
--------------------------------------------------------------------------
     21,920  observations remaining, representing
     21,920  subjects
         53  failures in single-failure-per-subject data
  1,733.394  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .0793977

. *30-89 days
. gen death_date89 = death_date if death_date < (index_date_death + 90) 
(21,771 missing values generated)

. gen exit_date89_death = death_date89
(21,771 missing values generated)

. gen index_date89_death = index_date_death + 30

. format exit_date89_death %td

. replace exit_date89_death = min(deregistered_date, death_date, end_date, (index_date_death + 89)) if death_date89==.
(21,771 real changes made)

. stset exit_date89_death, fail(death_date89) origin(index_date89_death) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: death_date89!=0 & death_date89<.
Observed time interval: (exit_date89_death[_n-1], exit_date89_death]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date89_death

--------------------------------------------------------------------------
     21,920  total observations
        181  observations end on or before enter()
--------------------------------------------------------------------------
     21,739  observations remaining, representing
     21,739  subjects
         96  failures in single-failure-per-subject data
  3,482.037  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .1615332

. *90-179 days
. gen death_date179 = death_date if death_date < (index_date_death + 180) 
(21,614 missing values generated)

. gen exit_date179_death = death_date179
(21,614 missing values generated)

. gen index_date179_death = index_date_death + 90

. format exit_date179_death %td

. replace exit_date179_death = min(deregistered_date, death_date, end_date, (index_date_death + 179)) if death_date179==.
(21,614 real changes made)

. stset exit_date179_death, fail(death_date179) origin(index_date179_death) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: death_date179!=0 & death_date179<.
Observed time interval: (exit_date179_death[_n-1], exit_date179_death]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date179_death

--------------------------------------------------------------------------
     21,920  total observations
        557  observations end on or before enter()
--------------------------------------------------------------------------
     21,363  observations remaining, representing
     21,363  subjects
        155  failures in single-failure-per-subject data
  5,129.248  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .2436687

. *180+ days
. gen index_datemax_death = index_date_death + 180

. gen exit_datemax_death = exit_date_death

. gen death_datemax = death_date
(20,783 missing values generated)

. stset exit_date_death, fail(death_date) origin(index_datemax_death) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: death_date!=0 & death_date<.
Observed time interval: (exit_date_death[_n-1], exit_date_death]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_datemax_death

--------------------------------------------------------------------------
     21,920  total observations
      3,019  observations end on or before enter()
--------------------------------------------------------------------------
     18,901  observations remaining, representing
     18,901  subjects
        829  failures in single-failure-per-subject data
 24,641.654  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.425736

. 
. stset exit_date_esrd, fail(esrd_date) origin(index_date_esrd) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: esrd_date!=0 & esrd_date<.
Observed time interval: (exit_date_esrd[_n-1], exit_date_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_esrd

--------------------------------------------------------------------------
     21,920  total observations
          0  exclusions
--------------------------------------------------------------------------
     21,920  observations remaining, representing
     21,920  subjects
      1,996  failures in single-failure-per-subject data
 32,828.854  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.847365

. tab _st follow_up_cat_esrd

      1 if |
 record is |
     to be |
   used; 0 |          Follow_up time
 otherwise | 1 to 365   366 to 73  731 to 10 |     Total
-----------+---------------------------------+----------
         1 |     7,043      7,470      7,407 |    21,920 
-----------+---------------------------------+----------
     Total |     7,043      7,470      7,407 |    21,920 

. 
. foreach outcome of varlist esrd egfr_half aki death {
  2.         stset exit_date_`outcome', fail(`outcome'_date) origin(index_date_`outcome') id(unique) scale(365.25)
  3.         bysort case: egen total_follow_up_`outcome' = total(_t)
  4.         forvalues i=0/1 {
  5.         di "Denominator case=`i' `outcome':"
  6.         count if case==`i' & `outcome'_denominator==1
  7.         local denominator = r(N)
  8.         di "Denominator(_st=1) case=`i' `outcome':"
  9.         count if case==`i' & `outcome'_denominator==1 & _st==1
 10.         local st_denominator = r(N)
 11.         di "Events case=`i' `outcome':"
 12.         count if case==`i' & `outcome'==1
 13.         local event = r(N)
 14.         di "Events (_st=1) case=`i' `outcome':"
 15.         count if case==`i' & `outcome'==1 & _st==1
 16.         local st_event = r(N)
 17.         di "Total follow_up case=`i' `outcome':"
 18.         su total_follow_up_`outcome' if case==`i'
 19.         local person_year = r(mean)
 20.         local rate = 100000*(`event'/`person_year')
 21.         di "Rate case=`i' `outcome':"
 22.         di `rate'
 23.         local st_rate = 100000*(`st_event'/`person_year')
 24.         di "Rate (_st=1) case=`i' `outcome':"
 25.         di `st_rate'
 26.         }
 27.         drop total_follow_up_`outcome'
 28. }

Survival-time data settings

           ID variable: unique
         Failure event: esrd_date!=0 & esrd_date<.
Observed time interval: (exit_date_esrd[_n-1], exit_date_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_esrd

--------------------------------------------------------------------------
     21,920  total observations
          0  exclusions
--------------------------------------------------------------------------
     21,920  observations remaining, representing
     21,920  subjects
      1,996  failures in single-failure-per-subject data
 32,828.854  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.847365
Denominator case=0 esrd:
  15,493
Denominator(_st=1) case=0 esrd:
  15,493
Events case=0 esrd:
  1,707
Events (_st=1) case=0 esrd:
  1,707
Total follow_up case=0 esrd:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~d |     15,493    21465.25           0   21465.25   21465.25
Rate case=0 esrd:
7952.3889
Rate (_st=1) case=0 esrd:
7952.3889
Denominator case=1 esrd:
  6,427
Denominator(_st=1) case=1 esrd:
  6,427
Events case=1 esrd:
  681
Events (_st=1) case=1 esrd:
  681
Total follow_up case=1 esrd:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~d |      6,427    11363.61           0   11363.61   11363.61
Rate case=1 esrd:
5992.8163
Rate (_st=1) case=1 esrd:
5992.8163

Survival-time data settings

           ID variable: unique
         Failure event: egfr_half_date!=0 & egfr_half_date<.
Observed time interval: (exit_date_egfr_half[_n-1], exit_date_egfr_half]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_egfr_half

--------------------------------------------------------------------------
     21,920  total observations
      5,818  event time missing (exit_date_egfr_half>=.)    PROBABLE ERROR
      3,661  ignored because never entered
--------------------------------------------------------------------------
     12,441  observations remaining, representing
     12,441  subjects
      5,590  failures in single-failure-per-subject data
 13,091.305  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.874743
Denominator case=0 egfr_half:
  8,761
Denominator(_st=1) case=0 egfr_half:
  8,761
Events case=0 egfr_half:
  5,028
Events (_st=1) case=0 egfr_half:
  4,432
Total follow_up case=0 egfr_half:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~f |     15,493    8626.095           0   8626.095   8626.095
Rate case=0 egfr_half:
58288.254
Rate (_st=1) case=0 egfr_half:
51378.986
Denominator case=1 egfr_half:
  3,680
Denominator(_st=1) case=1 egfr_half:
  3,680
Events case=1 egfr_half:
  2,124
Events (_st=1) case=1 egfr_half:
  1,839
Total follow_up case=1 egfr_half:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~f |      6,427     4465.21           0    4465.21    4465.21
Rate case=1 egfr_half:
47567.752
Rate (_st=1) case=1 egfr_half:
41185.073

Survival-time data settings

           ID variable: unique
         Failure event: aki_date!=0 & aki_date<.
Observed time interval: (exit_date_aki[_n-1], exit_date_aki]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_aki

--------------------------------------------------------------------------
     21,920  total observations
        652  observations end on or before enter()
--------------------------------------------------------------------------
     21,268  observations remaining, representing
     21,268  subjects
      2,952  failures in single-failure-per-subject data
 31,021.985  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.847365
Denominator case=0 aki:
  15,493
Denominator(_st=1) case=0 aki:
  15,047
Events case=0 aki:
  2,656
Events (_st=1) case=0 aki:
  2,210
Total follow_up case=0 aki:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~i |     15,493    20324.99           0   20324.99   20324.99
Rate case=0 aki:
13067.657
Rate (_st=1) case=0 aki:
10873.314
Denominator case=1 aki:
  6,427
Denominator(_st=1) case=1 aki:
  6,221
Events case=1 aki:
  1,213
Events (_st=1) case=1 aki:
  1,007
Total follow_up case=1 aki:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~i |      6,427    10696.99           0   10696.99   10696.99
Rate case=1 aki:
11339.634
Rate (_st=1) case=1 aki:
9413.8595

Survival-time data settings

           ID variable: unique
         Failure event: death_date!=0 & death_date<.
Observed time interval: (exit_date_death[_n-1], exit_date_death]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_death

--------------------------------------------------------------------------
     21,920  total observations
          0  exclusions
--------------------------------------------------------------------------
     21,920  observations remaining, representing
     21,920  subjects
      1,137  failures in single-failure-per-subject data
 34,701.169  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.918549
Denominator case=0 death:
  15,493
Denominator(_st=1) case=0 death:
  15,493
Events case=0 death:
  1,140
Events (_st=1) case=0 death:
  1,140
Total follow_up case=0 death:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~h |     15,493    22564.62           0   22564.62   22564.62
Rate case=0 death:
5052.1571
Rate (_st=1) case=0 death:
5052.1571
Denominator case=1 death:
  6,427
Denominator(_st=1) case=1 death:
  6,427
Events case=1 death:
  276
Events (_st=1) case=1 death:
  276
Total follow_up case=1 death:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~h |      6,427    12136.55           0   12136.55   12136.55
Rate case=1 death:
2274.1222
Rate (_st=1) case=1 death:
2274.1222

. 
. save ./output/analysis_2020.dta, replace
file ./output/analysis_2020.dta saved

. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_2020.log
  log type:  text
 closed on:  28 Jul 2023, 11:42:24
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
