------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_hospitalised.log
  log type:  text
 opened on:  26 Jul 2023, 18:29:12

. 
. capture noisily import delimited ./output/input_covid_hospitalised.csv, clear
(encoding automatically selected: ISO-8859-9)
(124 vars, 50,000 obs)

. tempfile covid_hospitalised

. save `covid_hospitalised', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_1100_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_1100_000001.tmp saved as .dta format

. di "COVID-19 hospitalised:"
COVID-19 hospitalised:

. safecount
  50,000

. 
. capture noisily import delimited ./output/input_pneumonia_hospitalised.csv, clear
(encoding automatically selected: ISO-8859-9)
(120 vars, 50,000 obs)

. tempfile pneumonia_hospitalised

. save `pneumonia_hospitalised', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_1100_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_1100_000002.tmp saved as .dta format

. di "Pneumonia hospitalised:"
Pneumonia hospitalised:

. safecount
  50,000

. 
. append using `covid_hospitalised', force

. 
. **ID
. * Need to create unique identifiers as individuals may be in both covid_hospitalised and pneumonia_hospitalised so will have the same patient_id
. gen unique = _n

. label var unique "Unique ID"

. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      5,063        5.06        5.06
 1 Most deprived |     19,097       19.10       24.16
               2 |     18,995       19.00       43.16
               3 |     18,919       18.92       62.07
               4 |     18,893       18.89       80.97
5 Least deprived |     19,033       19.03      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. drop if imd==0
(5,063 observations deleted)

. safetab imd

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |     19,097       20.12       20.12
               2 |     18,995       20.01       40.12
               3 |     18,919       19.93       60.05
               4 |     18,893       19.90       79.95
5 Least deprived |     19,033       20.05      100.00
-----------------+-----------------------------------
           Total |     94,937      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(94,936 missing values generated)

. replace stp1 = sum(stp1)
(94,936 real changes made)

. drop stp

. rename stp1 stp

. label define stp        1 "1"   ///
>                                         2 "2"   ///
>                                         3 "3"   ///
>                                         4 "4"   ///
>                                         5 "5"   ///
>                                         6 "6"   ///
>                                         7 "7"   ///
>                                         8 "8"   ///
>                                         9 "9"   ///
>                                         10 "10" ///
>                                         11 "11" ///                                     
>                                         12 "12" ///
>                                         13 "13" ///
>                                         14 "14" ///
>                                         15 "15" ///
>                                         16 "16" ///
>                                         17 "17" ///
>                                         18 "18" ///
>                                         19 "19" ///
>                                         20 "20" ///
>                                         21 "21" ///                                     
>                                         22 "22" ///
>                                         23 "23" ///
>                                         24 "24" ///
>                                         25 "25" ///
>                                         26 "26" ///
>                                         27 "27" ///
>                                         28 "28" ///
>                                         29 "29" ///
>                                         30 "30" ///
>                                         31 "31" 

. label values stp stp

. label var stp "STP"

. safetab stp

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     94,937      100.00      100.00
------------+-----------------------------------
      Total |     94,937      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(85,385 missing values generated)

. replace region = 2 if region_string=="East"
(9,498 real changes made)

. replace region = 3 if region_string=="London"
(18,743 real changes made)

. replace region = 4 if region_string=="North East"
(9,430 real changes made)

. replace region = 5 if region_string=="North West"
(9,426 real changes made)

. replace region = 6 if region_string=="South East"
(9,623 real changes made)

. replace region = 7 if region_string=="South West"
(9,500 real changes made)

. replace region = 8 if region_string=="West Midlands"
(9,626 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(9,539 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,552       10.06       10.06
                    East |      9,498       10.00       20.07
                  London |     18,743       19.74       39.81
              North East |      9,430        9.93       49.74
              North West |      9,426        9.93       59.67
              South East |      9,623       10.14       69.81
              South West |      9,500       10.01       79.81
           West Midlands |      9,626       10.14       89.95
Yorkshire and The Humber |      9,539       10.05      100.00
-------------------------+-----------------------------------
                   Total |     94,937      100.00

. drop if region==10
(0 observations deleted)

. safetab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,552       10.06       10.06
                    East |      9,498       10.00       20.07
                  London |     18,743       19.74       39.81
              North East |      9,430        9.93       49.74
              North West |      9,426        9.93       59.67
              South East |      9,623       10.14       69.81
              South West |      9,500       10.01       79.81
           West Midlands |      9,626       10.14       89.95
Yorkshire and The Humber |      9,539       10.05      100.00
-------------------------+-----------------------------------
                   Total |     94,937      100.00

. 
. * Create new index date variable 28 days after case_index_date (i.e. to exclude anyone who does not survive to start follow-up)
. gen index_date = date(patient_index_date, "YMD")
(7,693 missing values generated)

. format index_date %td

. gen index_date_28 = index_date + 28
(7,693 missing values generated)

. format index_date_28 %td

. 
. * Deregistered before index_date + 29 days
. gen deregistered_date = date(date_deregistered, "YMD")
(28,831 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date_28 + 1
(64,023 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(26,519 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(2,232 observations deleted)

. replace krt_date = index_date_28 + 1 if krt_date < index_date_28 + 1
(117 real changes made)

. 
. * Death before index_date + 29 days (i.e. only include people who survived beyond 28 days after admission)
. drop if deceased==1
(301 observations deleted)

. drop deceased

. gen death_date1 = date(death_date, "YMD")
(25,557 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28 + 1
(1,690 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased within 28 days of index date"

. label values deceased deceased

. tab covid deceased

           |       deceased
     covid | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,135      1,051 |    14,186 
-----------+----------------------+----------
     Total |    13,135      1,051 |    14,186 

. tab pneumonia deceased

           |       deceased
 pneumonia | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,556        639 |    14,195 
-----------+----------------------+----------
     Total |    13,556        639 |    14,195 

. drop if deceased==1
(1,690 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators only
. gen sex1 = 1 if sex=="M"
(13,541 missing values generated)

. replace sex1 = 0 if sex=="F"
(13,541 real changes made)

. drop sex

. rename sex1 sex

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 ///
>                                                                                                 baseline_creatinine_mar2017 ///
>                                                                                                 baseline_creatinine_apr2017 ///
>                                                                                                 baseline_creatinine_may2017 ///
>                                                                                                 baseline_creatinine_jun2017 ///
>                                                                                                 baseline_creatinine_jul2017 ///
>                                                                                                 baseline_creatinine_aug2017 ///
>                                                                                                 baseline_creatinine_sep2017 ///
>                                                                                                 baseline_creatinine_oct2017 ///
>                                                                                                 baseline_creatinine_nov2017 ///
>                                                                                                 baseline_creatinine_dec2017 ///
>                                                                                                 baseline_creatinine_jan2018 ///
>                                                                                                 baseline_creatinine_feb2018 ///
>                                                                                                 baseline_creatinine_mar2018 ///
>                                                                                                 baseline_creatinine_apr2018 ///
>                                                                                                 baseline_creatinine_may2018 ///
>                                                                                                 baseline_creatinine_jun2018 ///
>                                                                                                 baseline_creatinine_jul2018 ///
>                                                                                                 baseline_creatinine_aug2018 ///
>                                                                                                 baseline_creatinine_sep2018 ///
>                                                                                                 baseline_creatinine_oct2018 ///
>                                                                                                 baseline_creatinine_nov2018 ///
>                                                                                                 baseline_creatinine_dec2018 ///
>                                                                                                 baseline_creatinine_jan2019 ///
>                                                                                                 baseline_creatinine_feb2019 ///
>                                                                                                 baseline_creatinine_mar2019 ///
>                                                                                                 baseline_creatinine_apr2019 ///
>                                                                                                 baseline_creatinine_may2019 ///
>                                                                                                 baseline_creatinine_jun2019 ///
>                                                                                                 baseline_creatinine_jul2019 ///
>                                                                                                 baseline_creatinine_aug2019 ///
>                                                                                                 baseline_creatinine_sep2019 ///
>                                                                                                 baseline_creatinine_feb2020 ///
>                                                                                                 baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 ///
>                                                                                                 baseline_creatinine_feb2022 ///
>                                                                                                 baseline_creatinine_mar2022 ///
>                                                                                                 baseline_creatinine_apr2022 ///
>                                                                                                 baseline_creatinine_may2022 ///
>                                                                                                 baseline_creatinine_jun2022 ///
>                                                                                                 baseline_creatinine_jul2022 ///
>                                                                                                 baseline_creatinine_aug2022 ///
>                                                                                                 baseline_creatinine_sep2022 ///
>                                                                                                 baseline_creatinine_oct2022 ///
>                                                                                                 baseline_creatinine_nov2022 ///
>                                                                                                 baseline_creatinine_dec2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(5,966 real changes made, 5,966 to missing)
(19,101 missing values generated)
(26,691 missing values generated)
(3,866 real changes made)
(3,724 real changes made)
(3,866 real changes made)
(3,724 real changes made)
(4,817 real changes made)
(26,691 missing values generated)
(3,866 real changes made)
(3,724 real changes made)
(7,590 real changes made)
(21,874 real changes made)
(19,101 missing values generated)
(7,511 real changes made)
(3,866 real changes made)
(5,952 real changes made, 5,952 to missing)
(19,087 missing values generated)
(26,691 missing values generated)
(3,876 real changes made)
(3,728 real changes made)
(3,876 real changes made)
(3,728 real changes made)
(4,716 real changes made)
(26,691 missing values generated)
(3,876 real changes made)
(3,728 real changes made)
(7,604 real changes made)
(21,975 real changes made)
(19,087 missing values generated)
(7,525 real changes made)
(3,876 real changes made)
(6,002 real changes made, 6,002 to missing)
(19,137 missing values generated)
(26,691 missing values generated)
(3,845 real changes made)
(3,709 real changes made)
(3,845 real changes made)
(3,709 real changes made)
(4,789 real changes made)
(26,691 missing values generated)
(3,845 real changes made)
(3,709 real changes made)
(7,554 real changes made)
(21,902 real changes made)
(19,137 missing values generated)
(7,486 real changes made)
(3,845 real changes made)
(6,006 real changes made, 6,006 to missing)
(19,141 missing values generated)
(26,691 missing values generated)
(3,884 real changes made)
(3,666 real changes made)
(3,884 real changes made)
(3,666 real changes made)
(4,784 real changes made)
(26,691 missing values generated)
(3,884 real changes made)
(3,666 real changes made)
(7,550 real changes made)
(21,907 real changes made)
(19,141 missing values generated)
(7,476 real changes made)
(3,884 real changes made)
(5,918 real changes made, 5,918 to missing)
(19,053 missing values generated)
(26,691 missing values generated)
(3,934 real changes made)
(3,704 real changes made)
(3,934 real changes made)
(3,704 real changes made)
(4,869 real changes made)
(26,691 missing values generated)
(3,934 real changes made)
(3,704 real changes made)
(7,638 real changes made)
(21,822 real changes made)
(19,053 missing values generated)
(7,566 real changes made)
(3,934 real changes made)
(5,912 real changes made, 5,912 to missing)
(19,047 missing values generated)
(26,691 missing values generated)
(3,907 real changes made)
(3,737 real changes made)
(3,907 real changes made)
(3,737 real changes made)
(4,863 real changes made)
(26,691 missing values generated)
(3,907 real changes made)
(3,737 real changes made)
(7,644 real changes made)
(21,828 real changes made)
(19,047 missing values generated)
(7,566 real changes made)
(3,907 real changes made)
(5,966 real changes made, 5,966 to missing)
(19,101 missing values generated)
(26,691 missing values generated)
(3,860 real changes made)
(3,730 real changes made)
(3,860 real changes made)
(3,730 real changes made)
(4,805 real changes made)
(26,691 missing values generated)
(3,860 real changes made)
(3,730 real changes made)
(7,590 real changes made)
(21,886 real changes made)
(19,101 missing values generated)
(7,525 real changes made)
(3,860 real changes made)
(5,945 real changes made, 5,945 to missing)
(19,080 missing values generated)
(26,691 missing values generated)
(3,854 real changes made)
(3,757 real changes made)
(3,854 real changes made)
(3,757 real changes made)
(4,796 real changes made)
(26,691 missing values generated)
(3,854 real changes made)
(3,757 real changes made)
(7,611 real changes made)
(21,895 real changes made)
(19,080 missing values generated)
(7,530 real changes made)
(3,854 real changes made)
(5,925 real changes made, 5,925 to missing)
(19,060 missing values generated)
(26,691 missing values generated)
(3,907 real changes made)
(3,724 real changes made)
(3,907 real changes made)
(3,724 real changes made)
(4,872 real changes made)
(26,691 missing values generated)
(3,907 real changes made)
(3,724 real changes made)
(7,631 real changes made)
(21,819 real changes made)
(19,060 missing values generated)
(7,560 real changes made)
(3,907 real changes made)
(5,923 real changes made, 5,923 to missing)
(19,058 missing values generated)
(26,691 missing values generated)
(3,907 real changes made)
(3,726 real changes made)
(3,907 real changes made)
(3,726 real changes made)
(4,867 real changes made)
(26,691 missing values generated)
(3,907 real changes made)
(3,726 real changes made)
(7,633 real changes made)
(21,824 real changes made)
(19,058 missing values generated)
(7,561 real changes made)
(3,907 real changes made)
(6,002 real changes made, 6,002 to missing)
(19,137 missing values generated)
(26,691 missing values generated)
(3,853 real changes made)
(3,701 real changes made)
(3,853 real changes made)
(3,701 real changes made)
(4,841 real changes made)
(26,691 missing values generated)
(3,853 real changes made)
(3,701 real changes made)
(7,554 real changes made)
(21,850 real changes made)
(19,137 missing values generated)
(7,483 real changes made)
(3,853 real changes made)
(5,904 real changes made, 5,904 to missing)
(19,039 missing values generated)
(26,691 missing values generated)
(3,920 real changes made)
(3,732 real changes made)
(3,920 real changes made)
(3,732 real changes made)
(4,897 real changes made)
(26,691 missing values generated)
(3,920 real changes made)
(3,732 real changes made)
(7,652 real changes made)
(21,794 real changes made)
(19,039 missing values generated)
(7,583 real changes made)
(3,920 real changes made)
(5,974 real changes made, 5,974 to missing)
(19,109 missing values generated)
(26,691 missing values generated)
(3,869 real changes made)
(3,713 real changes made)
(3,869 real changes made)
(3,713 real changes made)
(4,871 real changes made)
(26,691 missing values generated)
(3,869 real changes made)
(3,713 real changes made)
(7,582 real changes made)
(21,820 real changes made)
(19,109 missing values generated)
(7,523 real changes made)
(3,869 real changes made)
(5,928 real changes made, 5,928 to missing)
(19,063 missing values generated)
(26,691 missing values generated)
(3,913 real changes made)
(3,715 real changes made)
(3,913 real changes made)
(3,715 real changes made)
(4,764 real changes made)
(26,691 missing values generated)
(3,913 real changes made)
(3,715 real changes made)
(7,628 real changes made)
(21,927 real changes made)
(19,063 missing values generated)
(7,555 real changes made)
(3,913 real changes made)
(5,967 real changes made, 5,967 to missing)
(19,102 missing values generated)
(26,691 missing values generated)
(3,907 real changes made)
(3,682 real changes made)
(3,907 real changes made)
(3,682 real changes made)
(4,723 real changes made)
(26,691 missing values generated)
(3,907 real changes made)
(3,682 real changes made)
(7,589 real changes made)
(21,968 real changes made)
(19,102 missing values generated)
(7,520 real changes made)
(3,907 real changes made)
(5,962 real changes made, 5,962 to missing)
(19,097 missing values generated)
(26,691 missing values generated)
(3,848 real changes made)
(3,746 real changes made)
(3,848 real changes made)
(3,746 real changes made)
(4,813 real changes made)
(26,691 missing values generated)
(3,848 real changes made)
(3,746 real changes made)
(7,594 real changes made)
(21,878 real changes made)
(19,097 missing values generated)
(7,511 real changes made)
(3,848 real changes made)
(6,049 real changes made, 6,049 to missing)
(19,184 missing values generated)
(26,691 missing values generated)
(3,808 real changes made)
(3,699 real changes made)
(3,808 real changes made)
(3,699 real changes made)
(4,786 real changes made)
(26,691 missing values generated)
(3,808 real changes made)
(3,699 real changes made)
(7,507 real changes made)
(21,905 real changes made)
(19,184 missing values generated)
(7,447 real changes made)
(3,808 real changes made)
(5,984 real changes made, 5,984 to missing)
(19,119 missing values generated)
(26,691 missing values generated)
(3,869 real changes made)
(3,703 real changes made)
(3,869 real changes made)
(3,703 real changes made)
(4,820 real changes made)
(26,691 missing values generated)
(3,869 real changes made)
(3,703 real changes made)
(7,572 real changes made)
(21,871 real changes made)
(19,119 missing values generated)
(7,497 real changes made)
(3,869 real changes made)
(6,018 real changes made, 6,018 to missing)
(19,153 missing values generated)
(26,691 missing values generated)
(3,840 real changes made)
(3,698 real changes made)
(3,840 real changes made)
(3,698 real changes made)
(4,807 real changes made)
(26,691 missing values generated)
(3,840 real changes made)
(3,698 real changes made)
(7,538 real changes made)
(21,884 real changes made)
(19,153 missing values generated)
(7,460 real changes made)
(3,840 real changes made)
(5,931 real changes made, 5,931 to missing)
(19,066 missing values generated)
(26,691 missing values generated)
(3,925 real changes made)
(3,700 real changes made)
(3,925 real changes made)
(3,700 real changes made)
(4,861 real changes made)
(26,691 missing values generated)
(3,925 real changes made)
(3,700 real changes made)
(7,625 real changes made)
(21,830 real changes made)
(19,066 missing values generated)
(7,550 real changes made)
(3,925 real changes made)
(6,016 real changes made, 6,016 to missing)
(19,151 missing values generated)
(26,691 missing values generated)
(3,847 real changes made)
(3,693 real changes made)
(3,847 real changes made)
(3,693 real changes made)
(4,746 real changes made)
(26,691 missing values generated)
(3,847 real changes made)
(3,693 real changes made)
(7,540 real changes made)
(21,945 real changes made)
(19,151 missing values generated)
(7,455 real changes made)
(3,847 real changes made)
(5,978 real changes made, 5,978 to missing)
(19,113 missing values generated)
(26,691 missing values generated)
(3,875 real changes made)
(3,703 real changes made)
(3,875 real changes made)
(3,703 real changes made)
(4,740 real changes made)
(26,691 missing values generated)
(3,875 real changes made)
(3,703 real changes made)
(7,578 real changes made)
(21,951 real changes made)
(19,113 missing values generated)
(7,511 real changes made)
(3,875 real changes made)
(5,980 real changes made, 5,980 to missing)
(19,115 missing values generated)
(26,691 missing values generated)
(3,853 real changes made)
(3,723 real changes made)
(3,853 real changes made)
(3,723 real changes made)
(4,818 real changes made)
(26,691 missing values generated)
(3,853 real changes made)
(3,723 real changes made)
(7,576 real changes made)
(21,873 real changes made)
(19,115 missing values generated)
(7,511 real changes made)
(3,853 real changes made)
(5,954 real changes made, 5,954 to missing)
(19,089 missing values generated)
(26,691 missing values generated)
(3,902 real changes made)
(3,700 real changes made)
(3,902 real changes made)
(3,700 real changes made)
(4,820 real changes made)
(26,691 missing values generated)
(3,902 real changes made)
(3,700 real changes made)
(7,602 real changes made)
(21,871 real changes made)
(19,089 missing values generated)
(7,526 real changes made)
(3,902 real changes made)
(5,909 real changes made, 5,909 to missing)
(19,044 missing values generated)
(26,691 missing values generated)
(3,873 real changes made)
(3,774 real changes made)
(3,873 real changes made)
(3,774 real changes made)
(4,890 real changes made)
(26,691 missing values generated)
(3,873 real changes made)
(3,774 real changes made)
(7,647 real changes made)
(21,801 real changes made)
(19,044 missing values generated)
(7,568 real changes made)
(3,873 real changes made)
(6,032 real changes made, 6,032 to missing)
(19,167 missing values generated)
(26,691 missing values generated)
(3,857 real changes made)
(3,667 real changes made)
(3,857 real changes made)
(3,667 real changes made)
(4,696 real changes made)
(26,691 missing values generated)
(3,857 real changes made)
(3,667 real changes made)
(7,524 real changes made)
(21,995 real changes made)
(19,167 missing values generated)
(7,452 real changes made)
(3,857 real changes made)
(6,000 real changes made, 6,000 to missing)
(19,135 missing values generated)
(26,691 missing values generated)
(3,804 real changes made)
(3,752 real changes made)
(3,804 real changes made)
(3,752 real changes made)
(4,787 real changes made)
(26,691 missing values generated)
(3,804 real changes made)
(3,752 real changes made)
(7,556 real changes made)
(21,904 real changes made)
(19,135 missing values generated)
(7,486 real changes made)
(3,804 real changes made)
(5,998 real changes made, 5,998 to missing)
(19,133 missing values generated)
(26,691 missing values generated)
(3,892 real changes made)
(3,666 real changes made)
(3,892 real changes made)
(3,666 real changes made)
(4,780 real changes made)
(26,691 missing values generated)
(3,892 real changes made)
(3,666 real changes made)
(7,558 real changes made)
(21,911 real changes made)
(19,133 missing values generated)
(7,488 real changes made)
(3,892 real changes made)
(6,046 real changes made, 6,046 to missing)
(19,181 missing values generated)
(26,691 missing values generated)
(3,841 real changes made)
(3,669 real changes made)
(3,841 real changes made)
(3,669 real changes made)
(4,773 real changes made)
(26,691 missing values generated)
(3,841 real changes made)
(3,669 real changes made)
(7,510 real changes made)
(21,918 real changes made)
(19,181 missing values generated)
(7,441 real changes made)
(3,841 real changes made)
(6,107 real changes made, 6,107 to missing)
(19,242 missing values generated)
(26,691 missing values generated)
(3,774 real changes made)
(3,675 real changes made)
(3,774 real changes made)
(3,675 real changes made)
(4,749 real changes made)
(26,691 missing values generated)
(3,774 real changes made)
(3,675 real changes made)
(7,449 real changes made)
(21,942 real changes made)
(19,242 missing values generated)
(7,374 real changes made)
(3,774 real changes made)
(5,981 real changes made, 5,981 to missing)
(19,116 missing values generated)
(26,691 missing values generated)
(3,865 real changes made)
(3,710 real changes made)
(3,865 real changes made)
(3,710 real changes made)
(4,791 real changes made)
(26,691 missing values generated)
(3,865 real changes made)
(3,710 real changes made)
(7,575 real changes made)
(21,900 real changes made)
(19,116 missing values generated)
(7,502 real changes made)
(3,865 real changes made)
(5,999 real changes made, 5,999 to missing)
(19,134 missing values generated)
(26,691 missing values generated)
(3,899 real changes made)
(3,658 real changes made)
(3,899 real changes made)
(3,658 real changes made)
(4,754 real changes made)
(26,691 missing values generated)
(3,899 real changes made)
(3,658 real changes made)
(7,557 real changes made)
(21,937 real changes made)
(19,134 missing values generated)
(7,481 real changes made)
(3,899 real changes made)
(5,788 real changes made, 5,788 to missing)
(19,344 missing values generated)
(26,691 missing values generated)
(3,706 real changes made)
(3,641 real changes made)
(3,706 real changes made)
(3,641 real changes made)
(4,548 real changes made)
(26,691 missing values generated)
(3,706 real changes made)
(3,641 real changes made)
(7,347 real changes made)
(22,143 real changes made)
(19,344 missing values generated)
(7,258 real changes made)
(3,706 real changes made)
(5,771 real changes made, 5,771 to missing)
(19,327 missing values generated)
(26,691 missing values generated)
(3,718 real changes made)
(3,646 real changes made)
(3,718 real changes made)
(3,646 real changes made)
(4,704 real changes made)
(26,691 missing values generated)
(3,718 real changes made)
(3,646 real changes made)
(7,364 real changes made)
(21,987 real changes made)
(19,327 missing values generated)
(7,268 real changes made)
(3,718 real changes made)
(5,854 real changes made, 5,854 to missing)
(19,410 missing values generated)
(26,691 missing values generated)
(3,638 real changes made)
(3,643 real changes made)
(3,638 real changes made)
(3,643 real changes made)
(4,658 real changes made)
(26,691 missing values generated)
(3,638 real changes made)
(3,643 real changes made)
(7,281 real changes made)
(22,033 real changes made)
(19,410 missing values generated)
(7,186 real changes made)
(3,638 real changes made)
(5,757 real changes made, 5,757 to missing)
(19,313 missing values generated)
(26,691 missing values generated)
(3,747 real changes made)
(3,631 real changes made)
(3,747 real changes made)
(3,631 real changes made)
(4,738 real changes made)
(26,691 missing values generated)
(3,747 real changes made)
(3,631 real changes made)
(7,378 real changes made)
(21,953 real changes made)
(19,313 missing values generated)
(7,281 real changes made)
(3,747 real changes made)
(5,862 real changes made, 5,862 to missing)
(19,418 missing values generated)
(26,691 missing values generated)
(3,634 real changes made)
(3,639 real changes made)
(3,634 real changes made)
(3,639 real changes made)
(4,573 real changes made)
(26,691 missing values generated)
(3,634 real changes made)
(3,639 real changes made)
(7,273 real changes made)
(22,118 real changes made)
(19,418 missing values generated)
(7,177 real changes made)
(3,634 real changes made)
(5,846 real changes made, 5,846 to missing)
(19,402 missing values generated)
(26,691 missing values generated)
(3,676 real changes made)
(3,613 real changes made)
(3,676 real changes made)
(3,613 real changes made)
(4,597 real changes made)
(26,691 missing values generated)
(3,676 real changes made)
(3,613 real changes made)
(7,289 real changes made)
(22,094 real changes made)
(19,402 missing values generated)
(7,197 real changes made)
(3,676 real changes made)
(5,831 real changes made, 5,831 to missing)
(19,387 missing values generated)
(26,691 missing values generated)
(3,682 real changes made)
(3,622 real changes made)
(3,682 real changes made)
(3,622 real changes made)
(4,631 real changes made)
(26,691 missing values generated)
(3,682 real changes made)
(3,622 real changes made)
(7,304 real changes made)
(22,060 real changes made)
(19,387 missing values generated)
(7,218 real changes made)
(3,682 real changes made)
(5,789 real changes made, 5,789 to missing)
(19,345 missing values generated)
(26,691 missing values generated)
(3,701 real changes made)
(3,645 real changes made)
(3,701 real changes made)
(3,645 real changes made)
(4,587 real changes made)
(26,691 missing values generated)
(3,701 real changes made)
(3,645 real changes made)
(7,346 real changes made)
(22,104 real changes made)
(19,345 missing values generated)
(7,247 real changes made)
(3,701 real changes made)
(5,793 real changes made, 5,793 to missing)
(19,349 missing values generated)
(26,691 missing values generated)
(3,637 real changes made)
(3,705 real changes made)
(3,637 real changes made)
(3,705 real changes made)
(4,638 real changes made)
(26,691 missing values generated)
(3,637 real changes made)
(3,705 real changes made)
(7,342 real changes made)
(22,053 real changes made)
(19,349 missing values generated)
(7,255 real changes made)
(3,637 real changes made)
(5,778 real changes made, 5,778 to missing)
(19,334 missing values generated)
(26,691 missing values generated)
(3,689 real changes made)
(3,668 real changes made)
(3,689 real changes made)
(3,668 real changes made)
(4,644 real changes made)
(26,691 missing values generated)
(3,689 real changes made)
(3,668 real changes made)
(7,357 real changes made)
(22,047 real changes made)
(19,334 missing values generated)
(7,266 real changes made)
(3,689 real changes made)
(5,836 real changes made, 5,836 to missing)
(19,392 missing values generated)
(26,691 missing values generated)
(3,714 real changes made)
(3,585 real changes made)
(3,714 real changes made)
(3,585 real changes made)
(4,616 real changes made)
(26,691 missing values generated)
(3,714 real changes made)
(3,585 real changes made)
(7,299 real changes made)
(22,075 real changes made)
(19,392 missing values generated)
(7,195 real changes made)
(3,714 real changes made)
(5,731 real changes made, 5,731 to missing)
(19,287 missing values generated)
(26,691 missing values generated)
(3,764 real changes made)
(3,640 real changes made)
(3,764 real changes made)
(3,640 real changes made)
(4,708 real changes made)
(26,691 missing values generated)
(3,764 real changes made)
(3,640 real changes made)
(7,404 real changes made)
(21,983 real changes made)
(19,287 missing values generated)
(7,316 real changes made)
(3,764 real changes made)
(5,871 real changes made, 5,871 to missing)
(19,427 missing values generated)
(26,691 missing values generated)
(3,637 real changes made)
(3,627 real changes made)
(3,637 real changes made)
(3,627 real changes made)
(4,619 real changes made)
(26,691 missing values generated)
(3,637 real changes made)
(3,627 real changes made)
(7,264 real changes made)
(22,072 real changes made)
(19,427 missing values generated)
(7,169 real changes made)
(3,637 real changes made)
(5,707 real changes made, 5,707 to missing)
(19,263 missing values generated)
(26,691 missing values generated)
(3,769 real changes made)
(3,659 real changes made)
(3,769 real changes made)
(3,659 real changes made)
(4,754 real changes made)
(26,691 missing values generated)
(3,769 real changes made)
(3,659 real changes made)
(7,428 real changes made)
(21,937 real changes made)
(19,263 missing values generated)
(7,338 real changes made)
(3,769 real changes made)
(5,817 real changes made, 5,817 to missing)
(19,373 missing values generated)
(26,691 missing values generated)
(3,660 real changes made)
(3,658 real changes made)
(3,660 real changes made)
(3,658 real changes made)
(4,618 real changes made)
(26,691 missing values generated)
(3,660 real changes made)
(3,658 real changes made)
(7,318 real changes made)
(22,073 real changes made)
(19,373 missing values generated)
(7,224 real changes made)
(3,660 real changes made)
(5,773 real changes made, 5,773 to missing)
(19,329 missing values generated)
(26,691 missing values generated)
(3,718 real changes made)
(3,644 real changes made)
(3,718 real changes made)
(3,644 real changes made)
(4,755 real changes made)
(26,691 missing values generated)
(3,718 real changes made)
(3,644 real changes made)
(7,362 real changes made)
(21,936 real changes made)
(19,329 missing values generated)
(7,265 real changes made)
(3,718 real changes made)
(5,714 real changes made, 5,714 to missing)
(19,270 missing values generated)
(26,691 missing values generated)
(3,758 real changes made)
(3,663 real changes made)
(3,758 real changes made)
(3,663 real changes made)
(4,621 real changes made)
(26,691 missing values generated)
(3,758 real changes made)
(3,663 real changes made)
(7,421 real changes made)
(22,070 real changes made)
(19,270 missing values generated)
(7,317 real changes made)
(3,758 real changes made)
(5,767 real changes made, 5,767 to missing)
(19,323 missing values generated)
(26,691 missing values generated)
(3,749 real changes made)
(3,619 real changes made)
(3,749 real changes made)
(3,619 real changes made)
(4,666 real changes made)
(26,691 missing values generated)
(3,749 real changes made)
(3,619 real changes made)
(7,368 real changes made)
(22,025 real changes made)
(19,323 missing values generated)
(7,276 real changes made)
(3,749 real changes made)
(5,855 real changes made, 5,855 to missing)
(19,411 missing values generated)
(26,691 missing values generated)
(3,715 real changes made)
(3,565 real changes made)
(3,715 real changes made)
(3,565 real changes made)
(4,596 real changes made)
(26,691 missing values generated)
(3,715 real changes made)
(3,565 real changes made)
(7,280 real changes made)
(22,095 real changes made)
(19,411 missing values generated)
(7,187 real changes made)
(3,715 real changes made)
(5,786 real changes made, 5,786 to missing)
(19,342 missing values generated)
(26,691 missing values generated)
(3,710 real changes made)
(3,639 real changes made)
(3,710 real changes made)
(3,639 real changes made)
(4,581 real changes made)
(26,691 missing values generated)
(3,710 real changes made)
(3,639 real changes made)
(7,349 real changes made)
(22,110 real changes made)
(19,342 missing values generated)
(7,255 real changes made)
(3,710 real changes made)
(5,802 real changes made, 5,802 to missing)
(19,358 missing values generated)
(26,691 missing values generated)
(3,700 real changes made)
(3,633 real changes made)
(3,700 real changes made)
(3,633 real changes made)
(4,679 real changes made)
(26,691 missing values generated)
(3,700 real changes made)
(3,633 real changes made)
(7,333 real changes made)
(22,012 real changes made)
(19,358 missing values generated)
(7,239 real changes made)
(3,700 real changes made)
(5,753 real changes made, 5,753 to missing)
(19,309 missing values generated)
(26,691 missing values generated)
(3,651 real changes made)
(3,731 real changes made)
(3,651 real changes made)
(3,731 real changes made)
(4,623 real changes made)
(26,691 missing values generated)
(3,651 real changes made)
(3,731 real changes made)
(7,382 real changes made)
(22,068 real changes made)
(19,309 missing values generated)
(7,293 real changes made)
(3,651 real changes made)
(5,755 real changes made, 5,755 to missing)
(19,311 missing values generated)
(26,691 missing values generated)
(3,737 real changes made)
(3,643 real changes made)
(3,737 real changes made)
(3,643 real changes made)
(4,677 real changes made)
(26,691 missing values generated)
(3,737 real changes made)
(3,643 real changes made)
(7,380 real changes made)
(22,014 real changes made)
(19,311 missing values generated)
(7,279 real changes made)
(3,737 real changes made)
(5,778 real changes made, 5,778 to missing)
(19,334 missing values generated)
(26,691 missing values generated)
(3,674 real changes made)
(3,683 real changes made)
(3,674 real changes made)
(3,683 real changes made)
(4,659 real changes made)
(26,691 missing values generated)
(3,674 real changes made)
(3,683 real changes made)
(7,357 real changes made)
(22,032 real changes made)
(19,334 missing values generated)
(7,268 real changes made)
(3,674 real changes made)
(5,851 real changes made, 5,851 to missing)
(19,407 missing values generated)
(26,691 missing values generated)
(3,724 real changes made)
(3,560 real changes made)
(3,724 real changes made)
(3,560 real changes made)
(4,662 real changes made)
(26,691 missing values generated)
(3,724 real changes made)
(3,560 real changes made)
(7,284 real changes made)
(22,029 real changes made)
(19,407 missing values generated)
(7,193 real changes made)
(3,724 real changes made)
(5,772 real changes made, 5,772 to missing)
(19,328 missing values generated)
(26,691 missing values generated)
(3,707 real changes made)
(3,656 real changes made)
(3,707 real changes made)
(3,656 real changes made)
(4,616 real changes made)
(26,691 missing values generated)
(3,707 real changes made)
(3,656 real changes made)
(7,363 real changes made)
(22,075 real changes made)
(19,328 missing values generated)
(7,275 real changes made)
(3,707 real changes made)
(5,779 real changes made, 5,779 to missing)
(19,335 missing values generated)
(26,691 missing values generated)
(3,732 real changes made)
(3,624 real changes made)
(3,732 real changes made)
(3,624 real changes made)
(4,674 real changes made)
(26,691 missing values generated)
(3,732 real changes made)
(3,624 real changes made)
(7,356 real changes made)
(22,017 real changes made)
(19,335 missing values generated)
(7,257 real changes made)
(3,732 real changes made)
(5,820 real changes made, 5,820 to missing)
(19,376 missing values generated)
(26,691 missing values generated)
(3,691 real changes made)
(3,624 real changes made)
(3,691 real changes made)
(3,624 real changes made)
(4,611 real changes made)
(26,691 missing values generated)
(3,691 real changes made)
(3,624 real changes made)
(7,315 real changes made)
(22,080 real changes made)
(19,376 missing values generated)
(7,216 real changes made)
(3,691 real changes made)
(5,799 real changes made, 5,799 to missing)
(19,355 missing values generated)
(26,691 missing values generated)
(3,727 real changes made)
(3,609 real changes made)
(3,727 real changes made)
(3,609 real changes made)
(4,616 real changes made)
(26,691 missing values generated)
(3,727 real changes made)
(3,609 real changes made)
(7,336 real changes made)
(22,075 real changes made)
(19,355 missing values generated)
(7,239 real changes made)
(3,727 real changes made)
(5,748 real changes made, 5,748 to missing)
(19,304 missing values generated)
(26,691 missing values generated)
(3,723 real changes made)
(3,664 real changes made)
(3,723 real changes made)
(3,664 real changes made)
(4,688 real changes made)
(26,691 missing values generated)
(3,723 real changes made)
(3,664 real changes made)
(7,387 real changes made)
(22,003 real changes made)
(19,304 missing values generated)
(7,298 real changes made)
(3,723 real changes made)
(5,751 real changes made, 5,751 to missing)
(19,307 missing values generated)
(26,691 missing values generated)
(3,721 real changes made)
(3,663 real changes made)
(3,721 real changes made)
(3,663 real changes made)
(4,639 real changes made)
(26,691 missing values generated)
(3,721 real changes made)
(3,663 real changes made)
(7,384 real changes made)
(22,052 real changes made)
(19,307 missing values generated)
(7,287 real changes made)
(3,721 real changes made)
(5,730 real changes made, 5,730 to missing)
(19,286 missing values generated)
(26,691 missing values generated)
(3,769 real changes made)
(3,636 real changes made)
(3,769 real changes made)
(3,636 real changes made)
(4,681 real changes made)
(26,691 missing values generated)
(3,769 real changes made)
(3,636 real changes made)
(7,405 real changes made)
(22,010 real changes made)
(19,286 missing values generated)
(7,312 real changes made)
(3,769 real changes made)
(5,720 real changes made, 5,720 to missing)
(19,276 missing values generated)
(26,691 missing values generated)
(3,797 real changes made)
(3,618 real changes made)
(3,797 real changes made)
(3,618 real changes made)
(4,683 real changes made)
(26,691 missing values generated)
(3,797 real changes made)
(3,618 real changes made)
(7,415 real changes made)
(22,008 real changes made)
(19,276 missing values generated)
(7,313 real changes made)
(3,797 real changes made)
(5,841 real changes made, 5,841 to missing)
(19,397 missing values generated)
(26,691 missing values generated)
(3,664 real changes made)
(3,630 real changes made)
(3,664 real changes made)
(3,630 real changes made)
(4,594 real changes made)
(26,691 missing values generated)
(3,664 real changes made)
(3,630 real changes made)
(7,294 real changes made)
(22,097 real changes made)
(19,397 missing values generated)
(7,204 real changes made)
(3,664 real changes made)
(5,816 real changes made, 5,816 to missing)
(19,372 missing values generated)
(26,691 missing values generated)
(3,702 real changes made)
(3,617 real changes made)
(3,702 real changes made)
(3,617 real changes made)
(4,606 real changes made)
(26,691 missing values generated)
(3,702 real changes made)
(3,617 real changes made)
(7,319 real changes made)
(22,085 real changes made)
(19,372 missing values generated)
(7,216 real changes made)
(3,702 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)
(1,798 missing values generated)

. gen baseline_egfr=.
(26,691 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022 nov2022 dec2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(239 real changes made)
(276 real changes made)
(289 real changes made)
(251 real changes made)
(280 real changes made)
(246 real changes made)
(242 real changes made)
(208 real changes made)
(272 real changes made)
(232 real changes made)
(256 real changes made)
(226 real changes made)
(189 real changes made)
(233 real changes made)
(241 real changes made)
(268 real changes made)
(233 real changes made)
(224 real changes made)
(226 real changes made)
(220 real changes made)
(218 real changes made)
(221 real changes made)
(211 real changes made)
(188 real changes made)
(181 real changes made)
(196 real changes made)
(201 real changes made)
(204 real changes made)
(212 real changes made)
(177 real changes made)
(194 real changes made)
(169 real changes made)
(218 real changes made)
(224 real changes made)
(208 real changes made)
(245 real changes made)
(176 real changes made)
(213 real changes made)
(209 real changes made)
(218 real changes made)
(209 real changes made)
(173 real changes made)
(181 real changes made)
(213 real changes made)
(167 real changes made)
(189 real changes made)
(197 real changes made)
(193 real changes made)
(193 real changes made)
(183 real changes made)
(193 real changes made)
(179 real changes made)
(172 real changes made)
(160 real changes made)
(163 real changes made)
(183 real changes made)
(148 real changes made)
(183 real changes made)
(138 real changes made)
(162 real changes made)
(153 real changes made)
(150 real changes made)
(167 real changes made)
(145 real changes made)
(157 real changes made)
(166 real changes made)
(162 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab covid baseline_esrd

           | baseline_e
           |    srd
     covid |   No ESRD |     Total
-----------+-----------+----------
         1 |    13,135 |    13,135 
-----------+-----------+----------
     Total |    13,135 |    13,135 

. tab pneumonia baseline_esrd

           | baseline_e
           |    srd
 pneumonia |   No ESRD |     Total
-----------+-----------+----------
         1 |    13,556 |    13,556 
-----------+-----------+----------
     Total |    13,556 |    13,556 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. ** Exposure
. gen case = covid
(13,556 missing values generated)

. replace case = 0 if covid==.
(13,556 real changes made)

. label define case 0 "Pneumonia (pre-pandemic)" ///
>                                   1 "COVID-19"

. label values case case

. tab case covid

                      |   covid
                 case |         1 |     Total
----------------------+-----------+----------
             COVID-19 |    13,135 |    13,135 
----------------------+-----------+----------
                Total |    13,135 |    13,135 

. tab case pneumonia

                      | pneumonia
                 case |         1 |     Total
----------------------+-----------+----------
Pneumonia (pre-pandem |    13,556 |    13,556 
----------------------+-----------+----------
                Total |    13,556 |    13,556 

. drop covid

. drop pneumonia

. safetab case 

                    case |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,556       50.79       50.79
                COVID-19 |     13,135       49.21      100.00
-------------------------+-----------------------------------
                   Total |     26,691      100.00

. 
. * Critical care during index admission
. replace critical_care = 1 if critical_days==1
(1,278 real changes made)

. drop critical_days

. label define critical_care      0 "Ward-based"          ///
>                                                         1 "Critical care"

. label values critical_care critical_care

. label var critical_care "Critical care"

. safetab critical_care, m

Critical care |      Freq.     Percent        Cum.
--------------+-----------------------------------
   Ward-based |     24,128       90.40       90.40
Critical care |      2,563        9.60      100.00
--------------+-----------------------------------
        Total |     26,691      100.00

. gen case_critical_care = critical_care

. replace case_critical_care = 2 if case==1
(13,135 real changes made)

. replace case_critical_care = 3 if case==1 &critical_care==1
(1,237 real changes made)

. label define case_critical_care 0 "Ward-based pneumonia (pre-pandemic)"         ///
>                                                                 1 "Critical care pneumonia (pre-pandemic)"      ///
>                                                                 2 "Ward-based COVID-19"                                         ///
>                                                                 3 "Critical care COVID-19"

. label values case_critical_care case_critical_care

. safetab case_critical_care, m

                    case_critical_care |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
   Ward-based pneumonia (pre-pandemic) |     12,230       45.82       45.82
Critical care pneumonia (pre-pandemic) |      1,326        4.97       50.79
                   Ward-based COVID-19 |     11,898       44.58       95.37
                Critical care COVID-19 |      1,237        4.63      100.00
---------------------------------------+-----------------------------------
                                 Total |     26,691      100.00

. 
. * Acute kidney injury during index admission
. rename acute_kidney_injury adm_aki

. label define adm_aki    0 "No AKI"      ///
>                                                 1 "AKI"

. label values adm_aki adm_aki

. label var adm_aki "Acute kidney injury"

. safetab adm_aki, m

      Acute |
     kidney |
     injury |      Freq.     Percent        Cum.
------------+-----------------------------------
     No AKI |     16,082       60.25       60.25
        AKI |     10,609       39.75      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. gen case_adm_aki = adm_aki

. replace case_adm_aki = 2 if case==1
(13,135 real changes made)

. replace case_adm_aki = 3 if case==1 &adm_aki==1
(5,250 real changes made)

. label define case_adm_aki       0 "No AKI pneumonia (pre-pandemic)"     ///
>                                                                                 1 "AKI pneumonia (pre-pandemic)"        ///
>                                                                                 2 "No AKI COVID-19"                             ///
>                                                                                 3 "AKI COVID-19"

. label values case_adm_aki case_adm_aki

. safetab case_adm_aki, m

                   case_adm_aki |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
No AKI pneumonia (pre-pandemic) |      8,197       30.71       30.71
   AKI pneumonia (pre-pandemic) |      5,359       20.08       50.79
                No AKI COVID-19 |      7,885       29.54       80.33
                   AKI COVID-19 |      5,250       19.67      100.00
--------------------------------+-----------------------------------
                          Total |     26,691      100.00

. 
. * Kidney replacement therapy during index admission
. gen krt = adm_aki

. replace krt = 2 if krt_icd_10==1
(255 real changes made)

. drop krt_icd_10

. replace krt = 2 if krt_opcs_4==1
(279 real changes made)

. drop krt_opcs_4

. label define krt        0 "No AKI"                              ///
>                                         1 "AKI without KRT"             ///
>                                         2 "AKI requiring KRT"

. label values krt krt

. label var krt "Kidney replacement therapy"

. safetab krt, m

           Kidney |
      replacement |
          therapy |      Freq.     Percent        Cum.
------------------+-----------------------------------
           No AKI |     15,754       59.02       59.02
  AKI without KRT |     10,403       38.98       98.00
AKI requiring KRT |        534        2.00      100.00
------------------+-----------------------------------
            Total |     26,691      100.00

. gen case_krt = krt

. replace case_krt = 3 if case==1
(13,135 real changes made)

. replace case_krt = 4 if case==1 &krt==1
(5,150 real changes made)

. replace case_krt = 5 if case==1 &krt==2
(247 real changes made)

. label define case_krt   0 "No AKI pneumonia (pre-pandemic)"                     ///
>                                                 1 "AKI without KRT pneumonia (pre-pandemic)"    ///
>                                                 2 "AKI requiring KRT pneumonia (pre-pandemic)"  ///
>                                                 3 "No AKI COVID-19"                                                             ///
>                                                 4 "AKI without KRT COVID-19"                                    ///
>                                                 5 "AKI requiring KRT COVID-19"

. label values case_krt case_krt

. safetab case_krt, m

                               case_krt |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
        No AKI pneumonia (pre-pandemic) |      8,016       30.03       30.03
AKI without KRT pneumonia (pre-pandemic |      5,253       19.68       49.71
AKI requiring KRT pneumonia (pre-pandem |        287        1.08       50.79
                        No AKI COVID-19 |      7,738       28.99       79.78
               AKI without KRT COVID-19 |      5,150       19.29       99.07
             AKI requiring KRT COVID-19 |        247        0.93      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,691      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(17,433 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(17,427 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(17,497 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(17,481 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(9,210 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(2,753 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(820 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(253 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Pneumonia (pre-pandemic)"    ///
>                                                 1 "COVID pre-vaccination"                       ///
>                                                 2 "COVID 1 vaccine dose"                        ///
>                                                 3 "COVID 2 vaccine doses"                       ///
>                                                 4 "COVID 3 vaccine doses"                       ///
>                                                 5 "COVID 4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "COVID-19 vaccination status"

. safetab covid_vax, m

    COVID-19 vaccination |
                  status |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,556       50.79       50.79
   COVID pre-vaccination |         99        0.37       51.16
    COVID 1 vaccine dose |        253        0.95       52.11
   COVID 2 vaccine doses |        820        3.07       55.18
   COVID 3 vaccine doses |      2,753       10.31       65.49
   COVID 4 vaccine doses |      9,210       34.51      100.00
-------------------------+-----------------------------------
                   Total |     26,691      100.00

. 
. * COVID-19 wave
. gen wave = case

. replace wave = 2 if index_month=="sep2020"
(393 real changes made)

. replace wave = 2 if index_month=="oct2020"
(379 real changes made)

. replace wave = 2 if index_month=="nov2020"
(361 real changes made)

. replace wave = 2 if index_month=="dec2020"
(346 real changes made)

. replace wave = 2 if index_month=="jan2021"
(341 real changes made)

. replace wave = 2 if index_month=="feb2021"
(306 real changes made)

. replace wave = 2 if index_month=="mar2021"
(348 real changes made)

. replace wave = 2 if index_month=="apr2021"
(346 real changes made)

. replace wave = 2 if index_month=="may2021"
(336 real changes made)

. replace wave = 2 if index_month=="jun2021"
(314 real changes made)

. replace wave = 3 if index_month=="jul2021"
(333 real changes made)

. replace wave = 3 if index_month=="aug2021"
(336 real changes made)

. replace wave = 3 if index_month=="sep2021"
(323 real changes made)

. replace wave = 3 if index_month=="oct2021"
(322 real changes made)

. replace wave = 3 if index_month=="nov2021"
(297 real changes made)

. replace wave = 4 if index_month=="dec2021"
(302 real changes made)

. replace wave = 4 if index_month=="jan2022"
(294 real changes made)

. replace wave = 4 if index_month=="feb2022"
(270 real changes made)

. replace wave = 4 if index_month=="mar2022"
(325 real changes made)

. replace wave = 4 if index_month=="apr2022"
(258 real changes made)

. replace wave = 4 if index_month=="may2022"
(271 real changes made)

. replace wave = 4 if index_month=="jun2022"
(283 real changes made)

. replace wave = 4 if index_month=="jul2022"
(269 real changes made)

. replace wave = 4 if index_month=="aug2022"
(285 real changes made)

. replace wave = 4 if index_month=="sep2022"
(258 real changes made)

. replace wave = 4 if index_month=="oct2022"
(282 real changes made)

. replace wave = 4 if index_month=="nov2022"
(292 real changes made)

. replace wave = 4 if index_month=="dec2022"
(263 real changes made)

. label define wave       0 "Pneumonia (pre-pandemic)"    ///
>                                         1 "COVID Feb20-Aug20"   ///
>                                         2 "COVID Sep20-Jun21"   ///
>                                         3 "COVID Jul21-Nov21"   ///
>                                         4 "COVID Dec21-Dec22"   

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m

           COVID-19 wave |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,556       50.79       50.79
       COVID Feb20-Aug20 |      4,402       16.49       67.28
       COVID Sep20-Jun21 |      3,470       13.00       80.28
       COVID Jul21-Nov21 |      1,611        6.04       86.32
       COVID Dec21-Dec22 |      3,652       13.68      100.00
-------------------------+-----------------------------------
                   Total |     26,691      100.00

. 
. * Month
. gen month_string=substr(index_date_string ,3,3)
(1,798 missing values generated)

. gen month = 1 if month_string=="jan"
(25,303 missing values generated)

. replace month = 2 if month_string=="feb"
(2,068 real changes made)

. replace month = 3 if month_string=="mar"
(2,320 real changes made)

. replace month = 4 if month_string=="apr"
(2,294 real changes made)

. replace month = 5 if month_string=="may"
(2,234 real changes made)

. replace month = 6 if month_string=="jun"
(2,191 real changes made)

. replace month = 7 if month_string=="jul"
(2,195 real changes made)

. replace month = 8 if month_string=="aug"
(2,134 real changes made)

. replace month = 9 if month_string=="sep"
(2,081 real changes made)

. replace month = 10 if month_string=="oct"
(2,173 real changes made)

. replace month = 11 if month_string=="nov"
(2,108 real changes made)

. replace month = 12 if month_string=="dec"
(1,707 real changes made)

. drop month_string

. label define month      1 "January"             ///
>                                         2 "February"    ///
>                                         3 "March"               ///
>                                         4 "April"               ///
>                                         5 "May"                 ///
>                                         6 "June"                ///
>                                         7 "July"                ///
>                                         8 "August"              ///
>                                         9 "September"   ///
>                                         10 "October"    ///
>                                         11 "November"   ///
>                                         12 "December"

. label values month month

. safetab month case, m

           |         case
     month | Pneumonia   COVID-19 |     Total
-----------+----------------------+----------
   January |       753        635 |     1,388 
  February |     1,106        962 |     2,068 
     March |     1,252      1,068 |     2,320 
     April |     1,321        973 |     2,294 
       May |     1,234      1,000 |     2,234 
      June |     1,269        922 |     2,191 
      July |     1,214        981 |     2,195 
    August |     1,156        978 |     2,134 
 September |     1,107        974 |     2,081 
   October |     1,190        983 |     2,173 
  November |     1,158        950 |     2,108 
  December |       796        911 |     1,707 
         . |         0      1,798 |     1,798 
-----------+----------------------+----------
     Total |    13,556     13,135 |    26,691 

. 
. ** Covariates
. ** Covariates
. * Check of GP consultations over past year by groups
. sum gp_count, detail

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -4
 5%            0             -4
10%            0             -4       Obs              26,691
25%            0             -4       Sum of wgt.      26,691

50%            3                      Mean           3.316099
                        Largest       Std. dev.      3.548835
75%            6             16
90%            8             16       Variance       12.59423
95%           10             16       Skewness       .6220032
99%           12             17       Kurtosis       2.231612

. bysort case: sum gp_count, detail

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Pneumonia (pre-pandemic)

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -4
 5%            0             -3
10%            0             -3       Obs              13,556
25%            0             -3       Sum of wgt.      13,556

50%            3                      Mean            3.30931
                        Largest       Std. dev.      3.550075
75%            6             15
90%            8             16       Variance       12.60303
95%           10             16       Skewness       .6275492
99%           12             16       Kurtosis       2.231307

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = COVID-19

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -4
 5%            0             -4
10%            0             -4       Obs              13,135
25%            0             -3       Sum of wgt.      13,135

50%            3                      Mean           3.323106
                        Largest       Std. dev.      3.547678
75%            6             16
90%            8             16       Variance       12.58602
95%           10             16       Skewness       .6162828
99%           12             17       Kurtosis       2.232013


. egen gp_consults = cut(gp_count), at(0, 1, 3, 10, 1500)
(154 missing values generated)

. recode gp_consults 3=2 10=3
(13,426 changes made to gp_consults)

. label define gp_consults 0 "0" 1 "1-2" 2 "3-9" 3 ">9"

. label values gp_consults gp_consults

. label var gp_consults "GP interactions"

. tab case gp_consults

                      |               GP interactions
                 case |         0        1-2        3-9         >9 |     Total
----------------------+--------------------------------------------+----------
Pneumonia (pre-pandem |     5,763        924      6,070        715 |    13,472 
             COVID-19 |     5,590        834      5,921        720 |    13,065 
----------------------+--------------------------------------------+----------
                Total |    11,353      1,758     11,991      1,435 |    26,537 

. 
. * Check of hospital admissions in preceding 5 years
. sum hosp_count, detail

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs              26,691
25%            0             -2       Sum of wgt.      26,691

50%            0                      Mean           .3942153
                        Largest       Std. dev.       .722389
75%            1              4
90%            1              4       Variance       .5218459
95%            2              4       Skewness       1.485381
99%            3              4       Kurtosis       5.190185

. bysort case: sum hosp_count, detail

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Pneumonia (pre-pandemic)

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs              13,556
25%            0             -2       Sum of wgt.      13,556

50%            0                      Mean           .3904544
                        Largest       Std. dev.      .7181231
75%            1              4
90%            1              4       Variance       .5157008
95%            2              4       Skewness       1.468973
99%            3              4       Kurtosis       5.179719

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = COVID-19

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs              13,135
25%            0             -2       Sum of wgt.      13,135

50%            0                      Mean           .3980967
                        Largest       Std. dev.      .7267723
75%            1              4
90%            1              4       Variance        .528198
95%            2              4       Skewness       1.501302
99%            3              4       Kurtosis       5.197451


. egen admissions = cut(hosp_count), at(0, 1, 2, 1000)
(368 missing values generated)

. label define admissions 0 "0" 1 "1" 2 ">1"

. label values admissions admissions

. label var admissions "Hospital admissions"

. tab case admissions

                      |       Hospital admissions
                 case |         0          1         >1 |     Total
----------------------+---------------------------------+----------
Pneumonia (pre-pandem |     9,304      2,779      1,273 |    13,356 
             COVID-19 |     9,037      2,651      1,279 |    12,967 
----------------------+---------------------------------+----------
                Total |    18,341      5,430      2,552 |    26,323 

. 
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        301        1.13        1.13
          1 |        291        1.09        2.22
          2 |        297        1.11        3.33
          3 |        317        1.19        4.52
          4 |        320        1.20        5.72
          5 |        331        1.24        6.96
          6 |        339        1.27        8.23
          7 |        307        1.15        9.38
          8 |        327        1.23       10.60
          9 |        312        1.17       11.77
         10 |        303        1.14       12.91
         11 |        322        1.21       14.11
         12 |        292        1.09       15.21
         13 |        317        1.19       16.40
         14 |        331        1.24       17.64
         15 |        287        1.08       18.71
         16 |        283        1.06       19.77
         17 |        299        1.12       20.89
         18 |        285        1.07       21.96
         19 |        330        1.24       23.20
         20 |        316        1.18       24.38
         21 |        341        1.28       25.66
         22 |        365        1.37       27.02
         23 |        350        1.31       28.34
         24 |        334        1.25       29.59
         25 |        352        1.32       30.91
         26 |        384        1.44       32.34
         27 |        406        1.52       33.87
         28 |        372        1.39       35.26
         29 |        349        1.31       36.57
         30 |        359        1.35       37.91
         31 |        357        1.34       39.25
         32 |        367        1.37       40.62
         33 |        354        1.33       41.95
         34 |        354        1.33       43.28
         35 |        340        1.27       44.55
         36 |        343        1.29       45.84
         37 |        339        1.27       47.11
         38 |        391        1.46       48.57
         39 |        365        1.37       49.94
         40 |        313        1.17       51.11
         41 |        350        1.31       52.42
         42 |        309        1.16       53.58
         43 |        346        1.30       54.88
         44 |        312        1.17       56.05
         45 |        375        1.40       57.45
         46 |        349        1.31       58.76
         47 |        367        1.37       60.13
         48 |        351        1.32       61.45
         49 |        390        1.46       62.91
         50 |        356        1.33       64.24
         51 |        377        1.41       65.66
         52 |        370        1.39       67.04
         53 |        382        1.43       68.47
         54 |        379        1.42       69.89
         55 |        372        1.39       71.29
         56 |        346        1.30       72.58
         57 |        341        1.28       73.86
         58 |        342        1.28       75.14
         59 |        339        1.27       76.41
         60 |        283        1.06       77.47
         61 |        286        1.07       78.54
         62 |        264        0.99       79.53
         63 |        285        1.07       80.60
         64 |        296        1.11       81.71
         65 |        255        0.96       82.66
         66 |        281        1.05       83.72
         67 |        276        1.03       84.75
         68 |        271        1.02       85.77
         69 |        280        1.05       86.82
         70 |        258        0.97       87.78
         71 |        270        1.01       88.79
         72 |        260        0.97       89.77
         73 |        255        0.96       90.72
         74 |        267        1.00       91.72
         75 |        162        0.61       92.33
         76 |        169        0.63       92.96
         77 |        171        0.64       93.60
         78 |        160        0.60       94.20
         79 |        198        0.74       94.95
         80 |        134        0.50       95.45
         81 |        136        0.51       95.96
         82 |        181        0.68       96.64
         83 |        111        0.42       97.05
         84 |        136        0.51       97.56
         85 |         89        0.33       97.89
         86 |         87        0.33       98.22
         87 |         70        0.26       98.48
         88 |         87        0.33       98.81
         89 |         71        0.27       99.07
         90 |         32        0.12       99.19
         91 |         40        0.15       99.34
         92 |         31        0.12       99.46
         93 |         41        0.15       99.61
         94 |         39        0.15       99.76
         95 |         13        0.05       99.81
         96 |         14        0.05       99.86
         97 |          9        0.03       99.90
         98 |         13        0.05       99.94
         99 |          6        0.02       99.97
        101 |          2        0.01       99.97
        102 |          4        0.01       99.99
        103 |          1        0.00       99.99
        107 |          1        0.00      100.00
        108 |          1        0.00      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. safecount
  26,691

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///                                     
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(26,400 differences between age and agegroup)

. 
. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label values agegroup agegroup

. label var agegroup "Age group"

. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     13,541       50.73       50.73
       Male |     13,150       49.27      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. safecount
  26,691

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(1,033 real changes made)

. replace ethnicity=2 if ethnicity==3
(994 real changes made)

. replace ethnicity=3 if ethnicity==4
(984 real changes made)

. replace ethnicity=4 if ethnicity==6
(1,033 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///                                             
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                                                               

. label values ethnicity ethnicity

. safetab ethnicity, m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,123       60.41       60.41
South Asian |        994        3.72       64.13
      Black |        984        3.69       67.82
      Mixed |      1,033        3.87       71.69
      Other |        937        3.51       75.20
          . |      6,620       24.80      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(6,620 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(6,620 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. safetab ethnicity1, m

 ethnicity1 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,123       60.41       60.41
South Asian |        994        3.72       64.13
      Black |        984        3.69       67.82
      Mixed |      1,033        3.87       71.69
      Other |        937        3.51       75.20
    Unknown |      6,620       24.80      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,635        9.87        9.87
                Urban minor conurbation |      2,755       10.32       20.19
                    Urban city and town |      2,668       10.00       30.19
Urban city and town in a sparse setting |      2,680       10.04       40.23
                  Rural town and fringe |      2,655        9.95       50.18
Rural town and fringe in a sparse setti |      2,633        9.86       60.04
            Rural village and dispersed |      5,295       19.84       79.88
Rural village and dispersed in a sparse |      5,370       20.12      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,691      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(26,691 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(10,738 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(15,953 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                                       rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow  Rural tow  Rural vil  Rural vil |     Total
-----------+----------------------------------------------------------------------------------------+----------
     Rural |         0          0          0          0      2,655      2,633      5,295      5,370 |    15,953 
     Urban |     2,635      2,755      2,668      2,680          0          0          0          0 |    10,738 
-----------+----------------------------------------------------------------------------------------+----------
     Total |     2,635      2,755      2,668      2,680      2,655      2,633      5,295      5,370 |    26,691 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Pneumonia (pre-pandem |     8,051      5,505 |    13,556 
             COVID-19 |     7,902      5,233 |    13,135 
----------------------+----------------------+----------
                Total |    15,953     10,738 |    26,691 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,772 real changes made, 2,772 to missing)

. gen     bmi = .
(26,691 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(1,608 changes made to bmi)

. recode  bmi . = 2 if body_mass_index<25
(6,056 changes made to bmi)

. recode  bmi . = 3 if body_mass_index<30
(6,071 changes made to bmi)

. recode  bmi . = 4 if body_mass_index<35
(5,508 changes made to bmi)

. recode  bmi . = 5 if body_mass_index<40
(3,009 changes made to bmi)

. recode  bmi . = 6 if body_mass_index<.
(1,667 changes made to bmi)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                             

. label values bmi bmi

. safetab bmi, m

                 bmi |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,608        6.02        6.02
  Normal (18.5-24.9) |      6,056       22.69       28.71
Overweight (25-29.9) |      6,071       22.75       51.46
   Obese I (30-34.9) |      5,508       20.64       72.10
  Obese II (35-39.9) |      3,009       11.27       83.37
     Obese III (40+) |      1,667        6.25       89.61
                   . |      2,772       10.39      100.00
---------------------+-----------------------------------
               Total |     26,691      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(15,497 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(1,868 real changes made)

. replace smoking = 0 if smoking_status=="N"
(3,792 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |      3,792       14.21       14.21
Current/former smoker |     13,062       48.94       63.14
                    . |      9,837       36.86      100.00
----------------------+-----------------------------------
                Total |     26,691      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000)
(13,078 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(13,613 changes made to egfr_group)

. label define egfr_group 1 "≥105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       ≥105 |      4,661       17.46       17.46
     90-104 |      1,790        6.71       24.17
      75-89 |      1,887        7.07       31.24
      60-74 |      2,067        7.74       38.98
      45-59 |      1,956        7.33       46.31
      30-44 |      1,127        4.22       50.53
      15-29 |        125        0.47       51.00
          . |     13,078       49.00      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 15-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(13,078 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(22,030 changes made to ckd_stage)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6 "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |     10,405       38.98       38.98
                      CKD 3A |      1,956        7.33       46.31
                      CKD 3B |      1,127        4.22       50.53
                       CKD 4 |        125        0.47       51.00
No baseline eGFR measurement |     13,078       49.00      100.00
-----------------------------+-----------------------------------
                       Total |     26,691      100.00

. 
. * Comorbidities
. rename acute_kidney_injury_baseline aki_baseline

. safetab aki_baseline

aki_baselin |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,332       94.91       94.91
          1 |      1,359        5.09      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,383       95.10       95.10
          1 |      1,308        4.90      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,137       97.92       97.92
          1 |        554        2.08      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. label var diabetes "Diabetes"

. safetab diabetes

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,382       80.11       80.11
          1 |      5,309       19.89      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,423       99.00       99.00
          1 |        268        1.00      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. safetab heart_failure

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,665       96.16       96.16
          1 |      1,026        3.84      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. safetab hiv

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,154       97.99       97.99
          1 |        537        2.01      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. label var hypertension "Hypertension"

. safetab hypertension

Hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,309       79.84       79.84
          1 |      5,382       20.16      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. label var non_haem_cancer "Cancer (non-haematological)"

. safetab non_haem_cancer

     Cancer |
(non-haemat |
  ological) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,166       98.03       98.03
          1 |        525        1.97      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. safetab myocardial_infarction

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,049       90.10       90.10
          1 |      2,642        9.90      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,121       97.86       97.86
          1 |        570        2.14      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,319       94.86       94.86
          1 |      1,372        5.14      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. safetab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,197       98.15       98.15
          1 |        494        1.85      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,182       98.09       98.09
          1 |        509        1.91      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(977 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,428 real changes made)

. replace cardiovascular = 1 if pvd==1
(476 real changes made)

. replace cardiovascular = 1 if stroke==1
(408 real changes made)

. label var cardiovascular "Cardiovascular diseases"

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(531 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,335 real changes made)

. replace immunosuppressed = 1 if lupus==1
(466 real changes made)

. label var immunosuppressed "Immunosuppressive diseases"

. safetab cardiovascular

Cardiovascu |
        lar |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,094       79.03       79.03
          1 |      5,597       20.97      100.00
------------+-----------------------------------
      Total |     26,691      100.00

. safetab immunosuppressed

Immunosuppr |
     essive |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,091       90.26       90.26
          1 |      2,600        9.74      100.00
------------+-----------------------------------
      Total |     26,691      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                                 creatinine_mar2017 ///
>                                                                                 creatinine_apr2017 ///
>                                                                                 creatinine_may2017 ///
>                                                                                 creatinine_jun2017 ///
>                                                                                 creatinine_jul2017 ///
>                                                                                 creatinine_aug2017 ///
>                                                                                 creatinine_sep2017 ///
>                                                                                 creatinine_oct2017 ///
>                                                                                 creatinine_nov2017 ///
>                                                                                 creatinine_dec2017 ///
>                                                                                 creatinine_jan2018 ///
>                                                                                 creatinine_feb2018 ///
>                                                                                 creatinine_mar2018 ///
>                                                                                 creatinine_apr2018 ///
>                                                                                 creatinine_may2018 ///
>                                                                                 creatinine_jun2018 ///
>                                                                                 creatinine_jul2018 ///
>                                                                                 creatinine_aug2018 ///
>                                                                                 creatinine_sep2018 ///
>                                                                                 creatinine_oct2018 ///
>                                                                                 creatinine_nov2018 ///
>                                                                                 creatinine_dec2018 ///
>                                                                                 creatinine_jan2019 ///
>                                                                                 creatinine_feb2019 ///
>                                                                                 creatinine_mar2019 ///
>                                                                                 creatinine_apr2019 ///
>                                                                                 creatinine_may2019 ///
>                                                                                 creatinine_jun2019 ///
>                                                                                 creatinine_jul2019 ///
>                                                                                 creatinine_aug2019 ///
>                                                                                 creatinine_sep2019 ///
>                                                                                 creatinine_feb2020 ///
>                                                                                 creatinine_mar2020 ///
>                                                                                 creatinine_apr2020 ///
>                                                                                 creatinine_may2020 ///
>                                                                                 creatinine_jun2020 ///
>                                                                                 creatinine_jul2020 ///
>                                                                                 creatinine_aug2020 ///
>                                                                                 creatinine_sep2020 ///
>                                                                                 creatinine_oct2020 ///
>                                                                                 creatinine_nov2020 ///
>                                                                                 creatinine_dec2020 ///
>                                                                                 creatinine_jan2021 ///
>                                                                                 creatinine_feb2021 ///
>                                                                                 creatinine_mar2021 ///
>                                                                                 creatinine_apr2021 ///
>                                                                                 creatinine_may2021 ///
>                                                                                 creatinine_jun2021 ///
>                                                                                 creatinine_jul2021 ///
>                                                                                 creatinine_aug2021 ///
>                                                                                 creatinine_sep2021 ///
>                                                                                 creatinine_oct2021 ///
>                                                                                 creatinine_nov2021 ///
>                                                                                 creatinine_dec2021 ///
>                                                                                 creatinine_jan2022 ///
>                                                                                 creatinine_feb2022 ///
>                                                                                 creatinine_mar2022 ///
>                                                                                 creatinine_apr2022 ///
>                                                                                 creatinine_may2022 ///
>                                                                                 creatinine_jun2022 ///
>                                                                                 creatinine_jul2022 ///
>                                                                                 creatinine_aug2022 ///
>                                                                                 creatinine_sep2022 ///
>                                                                                 creatinine_oct2022 ///
>                                                                                 creatinine_nov2022 ///
>                                                                                 creatinine_dec2022 ///
>                                                                                 creatinine_jan2023 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 3000)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex==0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex==1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_monthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(5,943 real changes made, 5,943 to missing)
(19,078 missing values generated)
(26,691 missing values generated)
(3,860 real changes made)
(3,753 real changes made)
(3,860 real changes made)
(3,753 real changes made)
(4,845 real changes made)
(26,691 missing values generated)
(3,860 real changes made)
(3,753 real changes made)
(7,613 real changes made)
(21,846 real changes made)
(19,078 missing values generated)
(7,536 real changes made)
(3,860 real changes made)
(6,025 real changes made, 6,025 to missing)
(19,160 missing values generated)
(26,691 missing values generated)
(3,837 real changes made)
(3,694 real changes made)
(3,837 real changes made)
(3,694 real changes made)
(4,813 real changes made)
(26,691 missing values generated)
(3,837 real changes made)
(3,694 real changes made)
(7,531 real changes made)
(21,878 real changes made)
(19,160 missing values generated)
(7,466 real changes made)
(3,837 real changes made)
(5,858 real changes made, 5,858 to missing)
(18,993 missing values generated)
(26,691 missing values generated)
(3,918 real changes made)
(3,780 real changes made)
(3,918 real changes made)
(3,780 real changes made)
(4,801 real changes made)
(26,691 missing values generated)
(3,918 real changes made)
(3,780 real changes made)
(7,698 real changes made)
(21,890 real changes made)
(18,993 missing values generated)
(7,621 real changes made)
(3,918 real changes made)
(5,996 real changes made, 5,996 to missing)
(19,131 missing values generated)
(26,691 missing values generated)
(3,875 real changes made)
(3,685 real changes made)
(3,875 real changes made)
(3,685 real changes made)
(4,704 real changes made)
(26,691 missing values generated)
(3,875 real changes made)
(3,685 real changes made)
(7,560 real changes made)
(21,987 real changes made)
(19,131 missing values generated)
(7,492 real changes made)
(3,875 real changes made)
(5,936 real changes made, 5,936 to missing)
(19,071 missing values generated)
(26,691 missing values generated)
(3,887 real changes made)
(3,733 real changes made)
(3,887 real changes made)
(3,733 real changes made)
(4,870 real changes made)
(26,691 missing values generated)
(3,887 real changes made)
(3,733 real changes made)
(7,620 real changes made)
(21,821 real changes made)
(19,071 missing values generated)
(7,537 real changes made)
(3,887 real changes made)
(5,992 real changes made, 5,992 to missing)
(19,127 missing values generated)
(26,691 missing values generated)
(3,853 real changes made)
(3,711 real changes made)
(3,853 real changes made)
(3,711 real changes made)
(4,817 real changes made)
(26,691 missing values generated)
(3,853 real changes made)
(3,711 real changes made)
(7,564 real changes made)
(21,874 real changes made)
(19,127 missing values generated)
(7,484 real changes made)
(3,853 real changes made)
(5,992 real changes made, 5,992 to missing)
(19,127 missing values generated)
(26,691 missing values generated)
(3,895 real changes made)
(3,669 real changes made)
(3,895 real changes made)
(3,669 real changes made)
(4,747 real changes made)
(26,691 missing values generated)
(3,895 real changes made)
(3,669 real changes made)
(7,564 real changes made)
(21,944 real changes made)
(19,127 missing values generated)
(7,501 real changes made)
(3,895 real changes made)
(5,987 real changes made, 5,987 to missing)
(19,122 missing values generated)
(26,691 missing values generated)
(3,852 real changes made)
(3,717 real changes made)
(3,852 real changes made)
(3,717 real changes made)
(4,804 real changes made)
(26,691 missing values generated)
(3,852 real changes made)
(3,717 real changes made)
(7,569 real changes made)
(21,887 real changes made)
(19,122 missing values generated)
(7,481 real changes made)
(3,852 real changes made)
(5,977 real changes made, 5,977 to missing)
(19,112 missing values generated)
(26,691 missing values generated)
(3,826 real changes made)
(3,753 real changes made)
(3,826 real changes made)
(3,753 real changes made)
(4,763 real changes made)
(26,691 missing values generated)
(3,826 real changes made)
(3,753 real changes made)
(7,579 real changes made)
(21,928 real changes made)
(19,112 missing values generated)
(7,500 real changes made)
(3,826 real changes made)
(5,970 real changes made, 5,970 to missing)
(19,105 missing values generated)
(26,691 missing values generated)
(3,897 real changes made)
(3,689 real changes made)
(3,897 real changes made)
(3,689 real changes made)
(4,853 real changes made)
(26,691 missing values generated)
(3,897 real changes made)
(3,689 real changes made)
(7,586 real changes made)
(21,838 real changes made)
(19,105 missing values generated)
(7,514 real changes made)
(3,897 real changes made)
(5,950 real changes made, 5,950 to missing)
(19,085 missing values generated)
(26,691 missing values generated)
(3,849 real changes made)
(3,757 real changes made)
(3,849 real changes made)
(3,757 real changes made)
(4,818 real changes made)
(26,691 missing values generated)
(3,849 real changes made)
(3,757 real changes made)
(7,606 real changes made)
(21,873 real changes made)
(19,085 missing values generated)
(7,525 real changes made)
(3,849 real changes made)
(5,825 real changes made, 5,825 to missing)
(18,960 missing values generated)
(26,691 missing values generated)
(3,970 real changes made)
(3,761 real changes made)
(3,970 real changes made)
(3,761 real changes made)
(4,920 real changes made)
(26,691 missing values generated)
(3,970 real changes made)
(3,761 real changes made)
(7,731 real changes made)
(21,771 real changes made)
(18,960 missing values generated)
(7,644 real changes made)
(3,970 real changes made)
(5,937 real changes made, 5,937 to missing)
(19,072 missing values generated)
(26,691 missing values generated)
(3,893 real changes made)
(3,726 real changes made)
(3,893 real changes made)
(3,726 real changes made)
(4,866 real changes made)
(26,691 missing values generated)
(3,893 real changes made)
(3,726 real changes made)
(7,619 real changes made)
(21,825 real changes made)
(19,072 missing values generated)
(7,537 real changes made)
(3,893 real changes made)
(5,978 real changes made, 5,978 to missing)
(19,113 missing values generated)
(26,691 missing values generated)
(3,798 real changes made)
(3,780 real changes made)
(3,798 real changes made)
(3,780 real changes made)
(4,770 real changes made)
(26,691 missing values generated)
(3,798 real changes made)
(3,780 real changes made)
(7,578 real changes made)
(21,921 real changes made)
(19,113 missing values generated)
(7,510 real changes made)
(3,798 real changes made)
(6,010 real changes made, 6,010 to missing)
(19,145 missing values generated)
(26,691 missing values generated)
(3,917 real changes made)
(3,629 real changes made)
(3,917 real changes made)
(3,629 real changes made)
(4,822 real changes made)
(26,691 missing values generated)
(3,917 real changes made)
(3,629 real changes made)
(7,546 real changes made)
(21,869 real changes made)
(19,145 missing values generated)
(7,470 real changes made)
(3,917 real changes made)
(5,959 real changes made, 5,959 to missing)
(19,094 missing values generated)
(26,691 missing values generated)
(3,866 real changes made)
(3,731 real changes made)
(3,866 real changes made)
(3,731 real changes made)
(4,811 real changes made)
(26,691 missing values generated)
(3,866 real changes made)
(3,731 real changes made)
(7,597 real changes made)
(21,880 real changes made)
(19,094 missing values generated)
(7,515 real changes made)
(3,866 real changes made)
(6,013 real changes made, 6,013 to missing)
(19,148 missing values generated)
(26,691 missing values generated)
(3,851 real changes made)
(3,692 real changes made)
(3,851 real changes made)
(3,692 real changes made)
(4,767 real changes made)
(26,691 missing values generated)
(3,851 real changes made)
(3,692 real changes made)
(7,543 real changes made)
(21,924 real changes made)
(19,148 missing values generated)
(7,457 real changes made)
(3,851 real changes made)
(5,985 real changes made, 5,985 to missing)
(19,120 missing values generated)
(26,691 missing values generated)
(3,849 real changes made)
(3,722 real changes made)
(3,849 real changes made)
(3,722 real changes made)
(4,808 real changes made)
(26,691 missing values generated)
(3,849 real changes made)
(3,722 real changes made)
(7,571 real changes made)
(21,883 real changes made)
(19,120 missing values generated)
(7,494 real changes made)
(3,849 real changes made)
(5,917 real changes made, 5,917 to missing)
(19,052 missing values generated)
(26,691 missing values generated)
(3,889 real changes made)
(3,750 real changes made)
(3,889 real changes made)
(3,750 real changes made)
(4,863 real changes made)
(26,691 missing values generated)
(3,889 real changes made)
(3,750 real changes made)
(7,639 real changes made)
(21,828 real changes made)
(19,052 missing values generated)
(7,572 real changes made)
(3,889 real changes made)
(5,942 real changes made, 5,942 to missing)
(19,077 missing values generated)
(26,691 missing values generated)
(3,875 real changes made)
(3,739 real changes made)
(3,875 real changes made)
(3,739 real changes made)
(4,842 real changes made)
(26,691 missing values generated)
(3,875 real changes made)
(3,739 real changes made)
(7,614 real changes made)
(21,849 real changes made)
(19,077 missing values generated)
(7,544 real changes made)
(3,875 real changes made)
(6,028 real changes made, 6,028 to missing)
(19,163 missing values generated)
(26,691 missing values generated)
(3,791 real changes made)
(3,737 real changes made)
(3,791 real changes made)
(3,737 real changes made)
(4,792 real changes made)
(26,691 missing values generated)
(3,791 real changes made)
(3,737 real changes made)
(7,528 real changes made)
(21,899 real changes made)
(19,163 missing values generated)
(7,449 real changes made)
(3,791 real changes made)
(5,916 real changes made, 5,916 to missing)
(19,051 missing values generated)
(26,691 missing values generated)
(3,907 real changes made)
(3,733 real changes made)
(3,907 real changes made)
(3,733 real changes made)
(4,851 real changes made)
(26,691 missing values generated)
(3,907 real changes made)
(3,733 real changes made)
(7,640 real changes made)
(21,840 real changes made)
(19,051 missing values generated)
(7,573 real changes made)
(3,907 real changes made)
(5,802 real changes made, 5,802 to missing)
(18,937 missing values generated)
(26,691 missing values generated)
(3,945 real changes made)
(3,809 real changes made)
(3,945 real changes made)
(3,809 real changes made)
(4,900 real changes made)
(26,691 missing values generated)
(3,945 real changes made)
(3,809 real changes made)
(7,754 real changes made)
(21,791 real changes made)
(18,937 missing values generated)
(7,668 real changes made)
(3,945 real changes made)
(6,011 real changes made, 6,011 to missing)
(19,146 missing values generated)
(26,691 missing values generated)
(3,905 real changes made)
(3,640 real changes made)
(3,905 real changes made)
(3,640 real changes made)
(4,798 real changes made)
(26,691 missing values generated)
(3,905 real changes made)
(3,640 real changes made)
(7,545 real changes made)
(21,893 real changes made)
(19,146 missing values generated)
(7,473 real changes made)
(3,905 real changes made)
(5,917 real changes made, 5,917 to missing)
(19,052 missing values generated)
(26,691 missing values generated)
(3,892 real changes made)
(3,747 real changes made)
(3,892 real changes made)
(3,747 real changes made)
(4,889 real changes made)
(26,691 missing values generated)
(3,892 real changes made)
(3,747 real changes made)
(7,639 real changes made)
(21,802 real changes made)
(19,052 missing values generated)
(7,559 real changes made)
(3,892 real changes made)
(5,950 real changes made, 5,950 to missing)
(19,085 missing values generated)
(26,691 missing values generated)
(3,869 real changes made)
(3,737 real changes made)
(3,869 real changes made)
(3,737 real changes made)
(4,825 real changes made)
(26,691 missing values generated)
(3,869 real changes made)
(3,737 real changes made)
(7,606 real changes made)
(21,866 real changes made)
(19,085 missing values generated)
(7,524 real changes made)
(3,869 real changes made)
(5,938 real changes made, 5,938 to missing)
(19,073 missing values generated)
(26,691 missing values generated)
(3,848 real changes made)
(3,770 real changes made)
(3,848 real changes made)
(3,770 real changes made)
(4,783 real changes made)
(26,691 missing values generated)
(3,848 real changes made)
(3,770 real changes made)
(7,618 real changes made)
(21,908 real changes made)
(19,073 missing values generated)
(7,540 real changes made)
(3,848 real changes made)
(5,948 real changes made, 5,948 to missing)
(19,083 missing values generated)
(26,691 missing values generated)
(3,911 real changes made)
(3,697 real changes made)
(3,911 real changes made)
(3,697 real changes made)
(4,804 real changes made)
(26,691 missing values generated)
(3,911 real changes made)
(3,697 real changes made)
(7,608 real changes made)
(21,887 real changes made)
(19,083 missing values generated)
(7,521 real changes made)
(3,911 real changes made)
(5,967 real changes made, 5,967 to missing)
(19,102 missing values generated)
(26,691 missing values generated)
(3,869 real changes made)
(3,720 real changes made)
(3,869 real changes made)
(3,720 real changes made)
(4,797 real changes made)
(26,691 missing values generated)
(3,869 real changes made)
(3,720 real changes made)
(7,589 real changes made)
(21,894 real changes made)
(19,102 missing values generated)
(7,519 real changes made)
(3,869 real changes made)
(6,004 real changes made, 6,004 to missing)
(19,139 missing values generated)
(26,691 missing values generated)
(3,846 real changes made)
(3,706 real changes made)
(3,846 real changes made)
(3,706 real changes made)
(4,809 real changes made)
(26,691 missing values generated)
(3,846 real changes made)
(3,706 real changes made)
(7,552 real changes made)
(21,882 real changes made)
(19,139 missing values generated)
(7,485 real changes made)
(3,846 real changes made)
(5,950 real changes made, 5,950 to missing)
(19,085 missing values generated)
(26,691 missing values generated)
(3,832 real changes made)
(3,774 real changes made)
(3,832 real changes made)
(3,774 real changes made)
(4,758 real changes made)
(26,691 missing values generated)
(3,832 real changes made)
(3,774 real changes made)
(7,606 real changes made)
(21,933 real changes made)
(19,085 missing values generated)
(7,524 real changes made)
(3,832 real changes made)
(5,967 real changes made, 5,967 to missing)
(19,102 missing values generated)
(26,691 missing values generated)
(3,841 real changes made)
(3,748 real changes made)
(3,841 real changes made)
(3,748 real changes made)
(4,899 real changes made)
(26,691 missing values generated)
(3,841 real changes made)
(3,748 real changes made)
(7,589 real changes made)
(21,792 real changes made)
(19,102 missing values generated)
(7,513 real changes made)
(3,841 real changes made)
(5,705 real changes made, 5,705 to missing)
(19,261 missing values generated)
(26,691 missing values generated)
(3,790 real changes made)
(3,640 real changes made)
(3,790 real changes made)
(3,640 real changes made)
(4,642 real changes made)
(26,691 missing values generated)
(3,790 real changes made)
(3,640 real changes made)
(7,430 real changes made)
(22,049 real changes made)
(19,261 missing values generated)
(7,329 real changes made)
(3,790 real changes made)
(5,711 real changes made, 5,711 to missing)
(19,267 missing values generated)
(26,691 missing values generated)
(3,741 real changes made)
(3,683 real changes made)
(3,741 real changes made)
(3,683 real changes made)
(4,723 real changes made)
(26,691 missing values generated)
(3,741 real changes made)
(3,683 real changes made)
(7,424 real changes made)
(21,968 real changes made)
(19,267 missing values generated)
(7,338 real changes made)
(3,741 real changes made)
(5,812 real changes made, 5,812 to missing)
(19,368 missing values generated)
(26,691 missing values generated)
(3,662 real changes made)
(3,661 real changes made)
(3,662 real changes made)
(3,661 real changes made)
(4,581 real changes made)
(26,691 missing values generated)
(3,662 real changes made)
(3,661 real changes made)
(7,323 real changes made)
(22,110 real changes made)
(19,368 missing values generated)
(7,229 real changes made)
(3,662 real changes made)
(5,682 real changes made, 5,682 to missing)
(19,238 missing values generated)
(26,691 missing values generated)
(3,760 real changes made)
(3,693 real changes made)
(3,760 real changes made)
(3,693 real changes made)
(4,772 real changes made)
(26,691 missing values generated)
(3,760 real changes made)
(3,693 real changes made)
(7,453 real changes made)
(21,919 real changes made)
(19,238 missing values generated)
(7,345 real changes made)
(3,760 real changes made)
(5,712 real changes made, 5,712 to missing)
(19,268 missing values generated)
(26,691 missing values generated)
(3,715 real changes made)
(3,708 real changes made)
(3,715 real changes made)
(3,708 real changes made)
(4,681 real changes made)
(26,691 missing values generated)
(3,715 real changes made)
(3,708 real changes made)
(7,423 real changes made)
(22,010 real changes made)
(19,268 missing values generated)
(7,314 real changes made)
(3,715 real changes made)
(5,806 real changes made, 5,806 to missing)
(19,362 missing values generated)
(26,691 missing values generated)
(3,691 real changes made)
(3,638 real changes made)
(3,691 real changes made)
(3,638 real changes made)
(4,679 real changes made)
(26,691 missing values generated)
(3,691 real changes made)
(3,638 real changes made)
(7,329 real changes made)
(22,012 real changes made)
(19,362 missing values generated)
(7,244 real changes made)
(3,691 real changes made)
(5,773 real changes made, 5,773 to missing)
(19,329 missing values generated)
(26,691 missing values generated)
(3,723 real changes made)
(3,639 real changes made)
(3,723 real changes made)
(3,639 real changes made)
(4,699 real changes made)
(26,691 missing values generated)
(3,723 real changes made)
(3,639 real changes made)
(7,362 real changes made)
(21,992 real changes made)
(19,329 missing values generated)
(7,268 real changes made)
(3,723 real changes made)
(5,753 real changes made, 5,753 to missing)
(19,309 missing values generated)
(26,691 missing values generated)
(3,755 real changes made)
(3,627 real changes made)
(3,755 real changes made)
(3,627 real changes made)
(4,664 real changes made)
(26,691 missing values generated)
(3,755 real changes made)
(3,627 real changes made)
(7,382 real changes made)
(22,027 real changes made)
(19,309 missing values generated)
(7,295 real changes made)
(3,755 real changes made)
(5,804 real changes made, 5,804 to missing)
(19,360 missing values generated)
(26,691 missing values generated)
(3,722 real changes made)
(3,609 real changes made)
(3,722 real changes made)
(3,609 real changes made)
(4,732 real changes made)
(26,691 missing values generated)
(3,722 real changes made)
(3,609 real changes made)
(7,331 real changes made)
(21,959 real changes made)
(19,360 missing values generated)
(7,245 real changes made)
(3,722 real changes made)
(5,775 real changes made, 5,775 to missing)
(19,331 missing values generated)
(26,691 missing values generated)
(3,698 real changes made)
(3,662 real changes made)
(3,698 real changes made)
(3,662 real changes made)
(4,661 real changes made)
(26,691 missing values generated)
(3,698 real changes made)
(3,662 real changes made)
(7,360 real changes made)
(22,030 real changes made)
(19,331 missing values generated)
(7,255 real changes made)
(3,698 real changes made)
(5,810 real changes made, 5,810 to missing)
(19,366 missing values generated)
(26,691 missing values generated)
(3,674 real changes made)
(3,651 real changes made)
(3,674 real changes made)
(3,651 real changes made)
(4,653 real changes made)
(26,691 missing values generated)
(3,674 real changes made)
(3,651 real changes made)
(7,325 real changes made)
(22,038 real changes made)
(19,366 missing values generated)
(7,233 real changes made)
(3,674 real changes made)
(5,809 real changes made, 5,809 to missing)
(19,365 missing values generated)
(26,691 missing values generated)
(3,726 real changes made)
(3,600 real changes made)
(3,726 real changes made)
(3,600 real changes made)
(4,577 real changes made)
(26,691 missing values generated)
(3,726 real changes made)
(3,600 real changes made)
(7,326 real changes made)
(22,114 real changes made)
(19,365 missing values generated)
(7,231 real changes made)
(3,726 real changes made)
(5,709 real changes made, 5,709 to missing)
(19,265 missing values generated)
(26,691 missing values generated)
(3,723 real changes made)
(3,703 real changes made)
(3,723 real changes made)
(3,703 real changes made)
(4,631 real changes made)
(26,691 missing values generated)
(3,723 real changes made)
(3,703 real changes made)
(7,426 real changes made)
(22,060 real changes made)
(19,265 missing values generated)
(7,333 real changes made)
(3,723 real changes made)
(5,752 real changes made, 5,752 to missing)
(19,308 missing values generated)
(26,691 missing values generated)
(3,693 real changes made)
(3,690 real changes made)
(3,693 real changes made)
(3,690 real changes made)
(4,603 real changes made)
(26,691 missing values generated)
(3,693 real changes made)
(3,690 real changes made)
(7,383 real changes made)
(22,088 real changes made)
(19,308 missing values generated)
(7,291 real changes made)
(3,693 real changes made)
(5,785 real changes made, 5,785 to missing)
(19,341 missing values generated)
(26,691 missing values generated)
(3,713 real changes made)
(3,637 real changes made)
(3,713 real changes made)
(3,637 real changes made)
(4,671 real changes made)
(26,691 missing values generated)
(3,713 real changes made)
(3,637 real changes made)
(7,350 real changes made)
(22,020 real changes made)
(19,341 missing values generated)
(7,264 real changes made)
(3,713 real changes made)
(5,780 real changes made, 5,780 to missing)
(19,336 missing values generated)
(26,691 missing values generated)
(3,707 real changes made)
(3,648 real changes made)
(3,707 real changes made)
(3,648 real changes made)
(4,679 real changes made)
(26,691 missing values generated)
(3,707 real changes made)
(3,648 real changes made)
(7,355 real changes made)
(22,012 real changes made)
(19,336 missing values generated)
(7,267 real changes made)
(3,707 real changes made)
(5,807 real changes made, 5,807 to missing)
(19,363 missing values generated)
(26,691 missing values generated)
(3,636 real changes made)
(3,692 real changes made)
(3,636 real changes made)
(3,692 real changes made)
(4,651 real changes made)
(26,691 missing values generated)
(3,636 real changes made)
(3,692 real changes made)
(7,328 real changes made)
(22,040 real changes made)
(19,363 missing values generated)
(7,230 real changes made)
(3,636 real changes made)
(5,830 real changes made, 5,830 to missing)
(19,386 missing values generated)
(26,691 missing values generated)
(3,684 real changes made)
(3,621 real changes made)
(3,684 real changes made)
(3,621 real changes made)
(4,623 real changes made)
(26,691 missing values generated)
(3,684 real changes made)
(3,621 real changes made)
(7,305 real changes made)
(22,068 real changes made)
(19,386 missing values generated)
(7,207 real changes made)
(3,684 real changes made)
(5,775 real changes made, 5,775 to missing)
(19,331 missing values generated)
(26,691 missing values generated)
(3,772 real changes made)
(3,588 real changes made)
(3,772 real changes made)
(3,588 real changes made)
(4,675 real changes made)
(26,691 missing values generated)
(3,772 real changes made)
(3,588 real changes made)
(7,360 real changes made)
(22,016 real changes made)
(19,331 missing values generated)
(7,266 real changes made)
(3,772 real changes made)
(5,741 real changes made, 5,741 to missing)
(19,297 missing values generated)
(26,691 missing values generated)
(3,685 real changes made)
(3,709 real changes made)
(3,685 real changes made)
(3,709 real changes made)
(4,677 real changes made)
(26,691 missing values generated)
(3,685 real changes made)
(3,709 real changes made)
(7,394 real changes made)
(22,014 real changes made)
(19,297 missing values generated)
(7,300 real changes made)
(3,685 real changes made)
(5,790 real changes made, 5,790 to missing)
(19,346 missing values generated)
(26,691 missing values generated)
(3,746 real changes made)
(3,599 real changes made)
(3,746 real changes made)
(3,599 real changes made)
(4,574 real changes made)
(26,691 missing values generated)
(3,746 real changes made)
(3,599 real changes made)
(7,345 real changes made)
(22,117 real changes made)
(19,346 missing values generated)
(7,253 real changes made)
(3,746 real changes made)
(5,810 real changes made, 5,810 to missing)
(19,366 missing values generated)
(26,691 missing values generated)
(3,719 real changes made)
(3,606 real changes made)
(3,719 real changes made)
(3,606 real changes made)
(4,636 real changes made)
(26,691 missing values generated)
(3,719 real changes made)
(3,606 real changes made)
(7,325 real changes made)
(22,055 real changes made)
(19,366 missing values generated)
(7,236 real changes made)
(3,719 real changes made)
(5,716 real changes made, 5,716 to missing)
(19,272 missing values generated)
(26,691 missing values generated)
(3,766 real changes made)
(3,653 real changes made)
(3,766 real changes made)
(3,653 real changes made)
(4,751 real changes made)
(26,691 missing values generated)
(3,766 real changes made)
(3,653 real changes made)
(7,419 real changes made)
(21,940 real changes made)
(19,272 missing values generated)
(7,336 real changes made)
(3,766 real changes made)
(5,781 real changes made, 5,781 to missing)
(19,337 missing values generated)
(26,691 missing values generated)
(3,674 real changes made)
(3,680 real changes made)
(3,674 real changes made)
(3,680 real changes made)
(4,607 real changes made)
(26,691 missing values generated)
(3,674 real changes made)
(3,680 real changes made)
(7,354 real changes made)
(22,084 real changes made)
(19,337 missing values generated)
(7,261 real changes made)
(3,674 real changes made)
(5,770 real changes made, 5,770 to missing)
(19,326 missing values generated)
(26,691 missing values generated)
(3,719 real changes made)
(3,646 real changes made)
(3,719 real changes made)
(3,646 real changes made)
(4,664 real changes made)
(26,691 missing values generated)
(3,719 real changes made)
(3,646 real changes made)
(7,365 real changes made)
(22,027 real changes made)
(19,326 missing values generated)
(7,266 real changes made)
(3,719 real changes made)
(5,773 real changes made, 5,773 to missing)
(19,329 missing values generated)
(26,691 missing values generated)
(3,752 real changes made)
(3,610 real changes made)
(3,752 real changes made)
(3,610 real changes made)
(4,635 real changes made)
(26,691 missing values generated)
(3,752 real changes made)
(3,610 real changes made)
(7,362 real changes made)
(22,056 real changes made)
(19,329 missing values generated)
(7,265 real changes made)
(3,752 real changes made)
(5,757 real changes made, 5,757 to missing)
(19,313 missing values generated)
(26,691 missing values generated)
(3,742 real changes made)
(3,636 real changes made)
(3,742 real changes made)
(3,636 real changes made)
(4,681 real changes made)
(26,691 missing values generated)
(3,742 real changes made)
(3,636 real changes made)
(7,378 real changes made)
(22,010 real changes made)
(19,313 missing values generated)
(7,293 real changes made)
(3,742 real changes made)
(5,746 real changes made, 5,746 to missing)
(19,302 missing values generated)
(26,691 missing values generated)
(3,727 real changes made)
(3,662 real changes made)
(3,727 real changes made)
(3,662 real changes made)
(4,672 real changes made)
(26,691 missing values generated)
(3,727 real changes made)
(3,662 real changes made)
(7,389 real changes made)
(22,019 real changes made)
(19,302 missing values generated)
(7,295 real changes made)
(3,727 real changes made)
(5,834 real changes made, 5,834 to missing)
(19,390 missing values generated)
(26,691 missing values generated)
(3,676 real changes made)
(3,625 real changes made)
(3,676 real changes made)
(3,625 real changes made)
(4,687 real changes made)
(26,691 missing values generated)
(3,676 real changes made)
(3,625 real changes made)
(7,301 real changes made)
(22,004 real changes made)
(19,390 missing values generated)
(7,218 real changes made)
(3,676 real changes made)
(5,702 real changes made, 5,702 to missing)
(19,258 missing values generated)
(26,691 missing values generated)
(3,820 real changes made)
(3,613 real changes made)
(3,820 real changes made)
(3,613 real changes made)
(4,737 real changes made)
(26,691 missing values generated)
(3,820 real changes made)
(3,613 real changes made)
(7,433 real changes made)
(21,954 real changes made)
(19,258 missing values generated)
(7,346 real changes made)
(3,820 real changes made)
(5,760 real changes made, 5,760 to missing)
(19,316 missing values generated)
(26,691 missing values generated)
(3,695 real changes made)
(3,680 real changes made)
(3,695 real changes made)
(3,680 real changes made)
(4,702 real changes made)
(26,691 missing values generated)
(3,695 real changes made)
(3,680 real changes made)
(7,375 real changes made)
(21,989 real changes made)
(19,316 missing values generated)
(7,275 real changes made)
(3,695 real changes made)
(5,725 real changes made, 5,725 to missing)
(19,281 missing values generated)
(26,691 missing values generated)
(3,772 real changes made)
(3,638 real changes made)
(3,772 real changes made)
(3,638 real changes made)
(4,611 real changes made)
(26,691 missing values generated)
(3,772 real changes made)
(3,638 real changes made)
(7,410 real changes made)
(22,080 real changes made)
(19,281 missing values generated)
(7,317 real changes made)
(3,772 real changes made)
(5,846 real changes made, 5,846 to missing)
(19,402 missing values generated)
(26,691 missing values generated)
(3,638 real changes made)
(3,651 real changes made)
(3,638 real changes made)
(3,651 real changes made)
(4,613 real changes made)
(26,691 missing values generated)
(3,638 real changes made)
(3,651 real changes made)
(7,289 real changes made)
(22,078 real changes made)
(19,402 missing values generated)
(7,196 real changes made)
(3,638 real changes made)
(5,720 real changes made, 5,720 to missing)
(19,276 missing values generated)
(26,691 missing values generated)
(3,743 real changes made)
(3,672 real changes made)
(3,743 real changes made)
(3,672 real changes made)
(4,720 real changes made)
(26,691 missing values generated)
(3,743 real changes made)
(3,672 real changes made)
(7,415 real changes made)
(21,971 real changes made)
(19,276 missing values generated)
(7,316 real changes made)
(3,743 real changes made)
(5,837 real changes made, 5,837 to missing)
(19,393 missing values generated)
(26,691 missing values generated)
(3,663 real changes made)
(3,635 real changes made)
(3,663 real changes made)
(3,635 real changes made)
(4,592 real changes made)
(26,691 missing values generated)
(3,663 real changes made)
(3,635 real changes made)
(7,298 real changes made)
(22,099 real changes made)
(19,393 missing values generated)
(7,210 real changes made)
(3,663 real changes made)
(5,802 real changes made, 5,802 to missing)
(19,358 missing values generated)
(26,691 missing values generated)
(3,699 real changes made)
(3,634 real changes made)
(3,699 real changes made)
(3,634 real changes made)
(4,579 real changes made)
(26,691 missing values generated)
(3,699 real changes made)
(3,634 real changes made)
(7,333 real changes made)
(22,112 real changes made)
(19,358 missing values generated)
(7,241 real changes made)
(3,699 real changes made)

. 
. replace index_date = index_date_28
(24,893 real changes made)

. drop index_date_28

. gen egfr15_date=.
(26,691 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022 nov2022 dec2022 jan2023"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatinine_`x'<15 & date("01`x'", "DMY")>index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen index_date_esrd = index_date
(1,798 missing values generated)

. gen esrd_date = egfr15_date
(26,691 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if krt_date < egfr15_date
(2,043 real changes made)

. replace esrd_date = krt_date if esrd_date==.
(0 real changes made)

. gen esrd = 0

. replace esrd = 1 if esrd_date!=.
(2,043 real changes made)

. label var esrd "Kidney failure"

. gen esrd_time = (esrd_date - index_date_esrd)
(24,648 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(24,648 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(2,040 changes made to esrd_time_cat)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"                      ///
>                                                         3 "1 to 28 days"        ///
>                                                         4 "20 to 90 days"       ///
>                                                         5 "91 to 180 days"      ///
>                                                         6 "181 to 365 days"     ///
>                                                         7 "366 to 730 days"     ///
>                                                         8 "731 to 973 days"     ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 critical_care   ///
>                                                                 krt             {
  2.                                                                 by `exposure',sort: sum esrd_time, de
  3.                                                                 tab esrd_time_cat `exposure', m col chi
  4.                                                                 }

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Pneumonia (pre-pandemic)

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           24              1       Obs               1,126
25%          130              1       Sum of wgt.       1,126

50%        318.5                      Mean           355.2984
                        Largest       Std. dev.      261.4028
75%          548            994
90%          743           1004       Variance       68331.45
95%          845           1015       Skewness       .4864198
99%          954           1019       Kurtosis       2.289414

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           25              1       Obs                 917
25%          125              1       Sum of wgt.         917

50%          295                      Mean           342.9368
                        Largest       Std. dev.       262.623
75%          533           1008
90%          746           1025       Variance       68970.83
95%          844           1033       Skewness       .5921311
99%          980           1050       Kurtosis       2.415533


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Pneumonia   COVID-19 |     Total
----------------+----------------------+----------
   1 to 28 days |       117         97 |       214 
                |      0.86       0.74 |      0.80 
----------------+----------------------+----------
  20 to 90 days |       103         98 |       201 
                |      0.76       0.75 |      0.75 
----------------+----------------------+----------
 91 to 180 days |       134        111 |       245 
                |      0.99       0.85 |      0.92 
----------------+----------------------+----------
181 to 365 days |       278        242 |       520 
                |      2.05       1.84 |      1.95 
----------------+----------------------+----------
366 to 730 days |       375        268 |       643 
                |      2.77       2.04 |      2.41 
----------------+----------------------+----------
731 to 973 days |       112         91 |       203 
                |      0.83       0.69 |      0.76 
----------------+----------------------+----------
      >973 days |         7         10 |        17 
                |      0.05       0.08 |      0.06 
----------------+----------------------+----------
              . |    12,430     12,218 |    24,648 
                |     91.69      93.02 |     92.35 
----------------+----------------------+----------
          Total |    13,556     13,135 |    26,691 
                |    100.00     100.00 |    100.00 

          Pearson chi2(7) =  22.3410   Pr = 0.002

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> critical_care = Ward-based

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           24              1       Obs               1,835
25%          126              1       Sum of wgt.       1,835

50%          309                      Mean           349.7204
                        Largest       Std. dev.      264.0648
75%          545           1019
90%          746           1025       Variance       69730.24
95%          847           1033       Skewness       .5302251
99%          965           1050       Kurtosis       2.320134

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> critical_care = Critical care

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           21              1
10%           58              1       Obs                 208
25%          163              1       Sum of wgt.         208

50%          310                      Mean           350.0096
                        Largest       Std. dev.      243.1886
75%          514            909
90%          706            926       Variance       59140.69
95%          779            945       Skewness       .5651404
99%          926            992       Kurtosis       2.542763


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |     Critical care
  esrd_time_cat | Ward-base  Critical  |     Total
----------------+----------------------+----------
   1 to 28 days |       200         14 |       214 
                |      0.83       0.55 |      0.80 
----------------+----------------------+----------
  20 to 90 days |       181         20 |       201 
                |      0.75       0.78 |      0.75 
----------------+----------------------+----------
 91 to 180 days |       221         24 |       245 
                |      0.92       0.94 |      0.92 
----------------+----------------------+----------
181 to 365 days |       455         65 |       520 
                |      1.89       2.54 |      1.95 
----------------+----------------------+----------
366 to 730 days |       577         66 |       643 
                |      2.39       2.58 |      2.41 
----------------+----------------------+----------
731 to 973 days |       185         18 |       203 
                |      0.77       0.70 |      0.76 
----------------+----------------------+----------
      >973 days |        16          1 |        17 
                |      0.07       0.04 |      0.06 
----------------+----------------------+----------
              . |    22,293      2,355 |    24,648 
                |     92.39      91.88 |     92.35 
----------------+----------------------+----------
          Total |    24,128      2,563 |    26,691 
                |    100.00     100.00 |    100.00 

          Pearson chi2(7) =   8.1644   Pr = 0.318

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = No AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           24              1       Obs               1,200
25%        123.5              1       Sum of wgt.       1,200

50%          313                      Mean           351.8608
                        Largest       Std. dev.      263.9567
75%          544           1004
90%        752.5           1015       Variance       69673.14
95%        837.5           1019       Skewness       .5088678
99%        967.5           1025       Kurtosis       2.256558

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = AKI without KRT

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           28              1       Obs                 798
25%          145              1       Sum of wgt.         798

50%          306                      Mean           349.6779
                        Largest       Std. dev.      257.2117
75%          531            994
90%          730           1008       Variance       66157.86
95%          851           1033       Skewness       .5561142
99%          964           1050       Kurtosis       2.476026

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = AKI requiring KRT

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                  45
25%           51              1       Sum of wgt.          45

50%          213                      Mean           294.7333
                        Largest       Std. dev.      290.7644
75%          519            878
90%          806            909       Variance       84543.93
95%          909            930       Skewness        .867503
99%          945            945       Kurtosis       2.608628


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |    Kidney replacement therapy
  esrd_time_cat |    No AKI  AKI witho  AKI requi |     Total
----------------+---------------------------------+----------
   1 to 28 days |       124         81          9 |       214 
                |      0.79       0.78       1.69 |      0.80 
----------------+---------------------------------+----------
  20 to 90 days |       116         79          6 |       201 
                |      0.74       0.76       1.12 |      0.75 
----------------+---------------------------------+----------
 91 to 180 days |       152         87          6 |       245 
                |      0.96       0.84       1.12 |      0.92 
----------------+---------------------------------+----------
181 to 365 days |       297        215          8 |       520 
                |      1.89       2.07       1.50 |      1.95 
----------------+---------------------------------+----------
366 to 730 days |       375        257         11 |       643 
                |      2.38       2.47       2.06 |      2.41 
----------------+---------------------------------+----------
731 to 973 days |       125         73          5 |       203 
                |      0.79       0.70       0.94 |      0.76 
----------------+---------------------------------+----------
      >973 days |        11          6          0 |        17 
                |      0.07       0.06       0.00 |      0.06 
----------------+---------------------------------+----------
              . |    14,554      9,605        489 |    24,648 
                |     92.38      92.33      91.57 |     92.35 
----------------+---------------------------------+----------
          Total |    15,754     10,403        534 |    26,691 
                |    100.00     100.00     100.00 |    100.00 

         Pearson chi2(14) =  11.2853   Pr = 0.663

.         
. * Exit date
. gen exit_date_esrd = esrd_date
(24,648 missing values generated)

. format exit_date_esrd %td

. gen end_date = date("2023-01-31", "YMD") if case==1
(13,556 missing values generated)

. replace end_date = date("2020-01-31", "YMD") if case==0
(13,556 real changes made)

. format end_date %td

. replace exit_date_esrd = min(deregistered_date, death_date, end_date) if esrd_date==.
(24,648 real changes made)

. gen esrd_denominator = 1

. gen follow_up_time_esrd = (exit_date_esrd - index_date_esrd)
(1,798 missing values generated)

. label var follow_up_time_esrd "Follow-up time (ESRD) (Days)"

. gen follow_up_cat_esrd = follow_up_time_esrd
(1,798 missing values generated)

. recode follow_up_cat_esrd       min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0=3                     ///
>                                                 1/365=4         ///
>                                                 366/730=5       ///
>                                                 731/1040=6      ///                                     
>                                                 1041/max=7
(24,877 changes made to follow_up_cat_esrd)

. label define follow_up_cat_esrd         1 "<-29 days"   ///
>                                                         2 "-28 to -1 days"              ///
>                                                         3 "0 days"                              ///
>                                                         4 "1 to 365 days"               ///
>                                                         5 "366 to 730 days"     ///
>                                                         6 "731 to 1040 days"    ///
>                                                         7 ">1040 days"

. label values follow_up_cat_esrd follow_up_cat_esrd

. label var follow_up_cat_esrd "Follow_up time"

. tab case follow_up_cat_esrd

                      |               Follow_up time
                 case | 1 to 365   366 to 73  731 to 10  >1040 day |     Total
----------------------+--------------------------------------------+----------
Pneumonia (pre-pandem |     5,082      4,694      3,524        256 |    13,556 
             COVID-19 |     4,246      3,886      2,947        258 |    11,337 
----------------------+--------------------------------------------+----------
                Total |     9,328      8,580      6,471        514 |    24,893 

. drop if follow_up_time_esrd<1
(0 observations deleted)

. drop if follow_up_time_esrd>1040
(2,312 observations deleted)

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Pneumonia (pre-pandem |     5,082      4,694      3,524 |    13,300 
             COVID-19 |     4,246      3,886      2,947 |    11,079 
----------------------+---------------------------------+----------
                Total |     9,328      8,580      6,471 |    24,379 

. * Time zero variable to account for differences in length of follow-up
. gen time_zero_esrd = date("2000-01-01", "YMD")

. gen time_end_esrd = time_zero_esrd + follow_up_time_esrd

. gen time_esrd = time_zero_esrd + esrd_time
(22,337 missing values generated)

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(24,379 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022 nov2022 dec2022 jan2023"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_half_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>index_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(8 real changes made)
(22 real changes made)
(39 real changes made)
(52 real changes made)
(72 real changes made)
(62 real changes made)
(60 real changes made)
(65 real changes made)
(76 real changes made)
(102 real changes made)
(76 real changes made)
(80 real changes made)
(94 real changes made)
(84 real changes made)
(95 real changes made)
(91 real changes made)
(106 real changes made)
(86 real changes made)
(109 real changes made)
(107 real changes made)
(104 real changes made)
(98 real changes made)
(105 real changes made)
(103 real changes made)
(82 real changes made)
(123 real changes made)
(103 real changes made)
(108 real changes made)
(97 real changes made)
(134 real changes made)
(0 real changes made)
(0 real changes made)
(6 real changes made)
(20 real changes made)
(27 real changes made)
(52 real changes made)
(35 real changes made)
(34 real changes made)
(57 real changes made)
(71 real changes made)
(57 real changes made)
(63 real changes made)
(69 real changes made)
(71 real changes made)
(68 real changes made)
(68 real changes made)
(77 real changes made)
(75 real changes made)
(87 real changes made)
(91 real changes made)
(77 real changes made)
(82 real changes made)
(92 real changes made)
(81 real changes made)
(85 real changes made)
(103 real changes made)
(88 real changes made)
(79 real changes made)
(88 real changes made)
(90 real changes made)
(85 real changes made)
(80 real changes made)
(97 real changes made)
(99 real changes made)
(82 real changes made)
(78 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(1,541 real changes made)

. gen egfr_half = 0

. replace egfr_half = 1 if egfr_half_date!=.
(6,498 real changes made)

. label var egfr_half "50% reduction in eGFR"

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(11,055 real changes made, 11,055 to missing)

. gen egfr_half_time = (egfr_half_date - index_date_egfr_half)
(18,775 missing values generated)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(17,881 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date) if egfr_half_date==. & index_date_egfr_half!=.
(7,720 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(11,055 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days)"

. gen egfr_half_denominator = 0

. replace egfr_half_denominator = 1 if index_date_egfr_half!=.
(13,324 real changes made)

. gen time_zero_egfr_half = date("2000-01-01", "YMD")

. gen time_end_egfr_half = time_zero_egfr_half + follow_up_time_egfr_half
(11,055 missing values generated)

. gen time_egfr_half = time_zero_egfr_half + egfr_half_time
(18,775 missing values generated)

. 
. * AKI (or ESRD)
. gen index_date_aki = index_date

. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(22,003 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(1,846 real changes made)

. gen aki = 0

. replace aki = 1 if aki_date!=.
(4,222 real changes made)

. label var aki "Acute kidney injury"

. gen aki_time = (aki_date - index_date_aki)
(20,157 missing values generated)

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(20,157 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date)  if aki_date==.
(20,157 real changes made)

. gen aki_denominator = 1

. gen follow_up_time_aki = (exit_date_aki - index_date_aki)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. gen time_zero_aki = date("2000-01-01", "YMD")

. gen time_end_aki = time_zero_aki + follow_up_time_aki

. gen time_aki = time_zero_aki + aki_time
(20,157 missing values generated)

. 
. * Exit date (death)
. gen index_date_death = index_date

. gen exit_date_death = death_date
(23,245 missing values generated)

. gen death = 0

. replace death = 1 if death_date!=.
(1,134 real changes made)

. label var death "Death"

. gen death_time = (death_date - index_date_death)
(23,245 missing values generated)

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(23,245 real changes made)

. gen death_denominator = 1

. gen follow_up_time_death = (exit_date_death - index_date_death)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. gen time_zero_death = date("2000-01-01", "YMD")

. gen time_end_death = time_zero_death + follow_up_time_death

. gen time_death = time_zero_death + death_time
(23,245 missing values generated)

. 
. *Outcomes by time period
. *ESRD
. *0-29 days
. gen esrd_date29 = esrd_date if esrd_date < (index_date_esrd + 30) 
(24,163 missing values generated)

. gen exit_date29_esrd = esrd_date29
(24,163 missing values generated)

. gen index_date29_esrd = index_date_esrd

. format exit_date29_esrd %td

. replace exit_date29_esrd = min(deregistered_date, death_date, end_date, (index_date_esrd + 29)) if esrd_date29==.
(24,163 real changes made)

. stset exit_date29_esrd, fail(esrd_date29) origin(index_date29_esrd) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: esrd_date29!=0 & esrd_date29<.
Observed time interval: (exit_date29_esrd[_n-1], exit_date29_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date29_esrd

--------------------------------------------------------------------------
     24,379  total observations
          0  exclusions
--------------------------------------------------------------------------
     24,379  observations remaining, representing
     24,379  subjects
        216  failures in single-failure-per-subject data
  1,909.566  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .0793977

. *30-89 days
. gen esrd_date89 = esrd_date if esrd_date < (index_date_esrd + 90) 
(23,970 missing values generated)

. gen exit_date89_esrd = esrd_date89
(23,970 missing values generated)

. gen index_date89_esrd = index_date_esrd + 30

. format exit_date89_esrd %td

. replace exit_date89_esrd = min(deregistered_date, death_date, end_date, (index_date_esrd + 89)) if esrd_date89==.
(23,970 real changes made)

. stset exit_date89_esrd, fail(esrd_date89) origin(index_date89_esrd) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: esrd_date89!=0 & esrd_date89<.
Observed time interval: (exit_date89_esrd[_n-1], exit_date89_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date89_esrd

--------------------------------------------------------------------------
     24,379  total observations
        616  observations end on or before enter()
--------------------------------------------------------------------------
     23,763  observations remaining, representing
     23,763  subjects
        190  failures in single-failure-per-subject data
  3,709.084  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .1615332

. *90-179 days
. gen esrd_date179 = esrd_date if esrd_date < (index_date_esrd + 180) 
(23,720 missing values generated)

. gen exit_date179_esrd = esrd_date179
(23,720 missing values generated)

. gen index_date179_esrd = index_date_esrd + 90

. format exit_date179_esrd %td

. replace exit_date179_esrd = min(deregistered_date, death_date, end_date, (index_date_esrd + 179)) if esrd_date179==.
(23,720 real changes made)

. stset exit_date179_esrd, fail(esrd_date179) origin(index_date179_esrd) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: esrd_date179!=0 & esrd_date179<.
Observed time interval: (exit_date179_esrd[_n-1], exit_date179_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date179_esrd

--------------------------------------------------------------------------
     24,379  total observations
      2,293  observations end on or before enter()
--------------------------------------------------------------------------
     22,086  observations remaining, representing
     22,086  subjects
        244  failures in single-failure-per-subject data
  5,102.637  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .2436687

. *180+ days
. gen index_datemax_esrd = index_date_esrd + 180

. gen exit_datemax_esrd = exit_date_esrd

. gen esrd_datemax = esrd_date
(22,337 missing values generated)

. stset exit_date_esrd, fail(esrd_date) origin(index_datemax_esrd) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: esrd_date!=0 & esrd_date<.
Observed time interval: (exit_date_esrd[_n-1], exit_date_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_datemax_esrd

--------------------------------------------------------------------------
     24,379  total observations
      4,590  observations end on or before enter()
--------------------------------------------------------------------------
     19,789  observations remaining, representing
     19,789  subjects
      1,382  failures in single-failure-per-subject data
 22,187.943  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.354552

. 
. *50% reduction in eGFR
. *0-29 days
. gen egfr_half_date29 = egfr_half_date if egfr_half_date < (index_date_egfr_half + 30) 
(23,047 missing values generated)

. gen exit_date29_egfr_half = egfr_half_date29
(23,047 missing values generated)

. gen index_date29_egfr_half = index_date_egfr_half
(11,055 missing values generated)

. format exit_date29_egfr_half %td

. replace exit_date29_egfr_half = min(deregistered_date, death_date, end_date, (index_date_egfr_half + 29)) if egfr_half_date29==.
(23,047 real changes made)

. stset exit_date29_egfr_half, fail(egfr_half_date29) origin(index_date29_egfr_half) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: egfr_half_date29!=0 & egfr_half_date29<.
Observed time interval: (exit_date29_egfr_half[_n-1], exit_date29_egfr_half]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date29_egfr_half

--------------------------------------------------------------------------
     24,379  total observations
     11,055  ignored because never entered
--------------------------------------------------------------------------
     13,324  observations remaining, representing
     13,324  subjects
        438  failures in single-failure-per-subject data
  1,038.111  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .0793977

. *30-89 days
. gen egfr_half_date89 = egfr_half_date if egfr_half_date < (index_date_egfr_half + 90) 
(21,717 missing values generated)

. gen exit_date89_egfr_half = egfr_half_date89
(21,717 missing values generated)

. gen index_date89_egfr_half = index_date_egfr_half + 30
(11,055 missing values generated)

. format exit_date89_egfr_half %td

. replace exit_date89_egfr_half = min(deregistered_date, death_date, end_date, (index_date_egfr_half + 89)) if egfr_half_date89==.
(21,717 real changes made)

. stset exit_date89_egfr_half, fail(egfr_half_date89) origin(index_date89_egfr_half) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: egfr_half_date89!=0 & egfr_half_date89<.
Observed time interval: (exit_date89_egfr_half[_n-1], exit_date89_egfr_half]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date89_egfr_half

--------------------------------------------------------------------------
     24,379  total observations
     11,055  ignored because never entered
        708  observations end on or before enter()
--------------------------------------------------------------------------
     12,616  observations remaining, representing
     12,616  subjects
      1,300  failures in single-failure-per-subject data
  1,892.816  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .1615332

. *90-179 days
. gen egfr_half_date179 = egfr_half_date if egfr_half_date < (index_date_egfr_half + 180) 
(20,386 missing values generated)

. gen exit_date179_egfr_half = egfr_half_date179
(20,386 missing values generated)

. gen index_date179_egfr_half = index_date_egfr_half + 90
(11,055 missing values generated)

. format exit_date179_egfr_half %td

. replace exit_date179_egfr_half = min(deregistered_date, death_date, end_date, (index_date_egfr_half + 179)) if egfr_half_date179==.
(20,386 real changes made)

. stset exit_date179_egfr_half, fail(egfr_half_date179) origin(index_date179_egfr_half) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: egfr_half_date179!=0 & egfr_half_date179<.
Observed time interval: (exit_date179_egfr_half[_n-1], exit_date179_egfr_half]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date179_egfr_half

--------------------------------------------------------------------------
     24,379  total observations
     11,055  ignored because never entered
      2,454  observations end on or before enter()
--------------------------------------------------------------------------
     10,870  observations remaining, representing
     10,870  subjects
      1,304  failures in single-failure-per-subject data
  2,356.088  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .2436687

. *180+ days
. gen index_datemax_egfr_half = index_date_egfr_half + 180
(11,055 missing values generated)

. gen exit_datemax_egfr_half = exit_date_egfr_half
(10,161 missing values generated)

. gen egfr_half_datemax = egfr_half_date
(17,881 missing values generated)

. stset exit_date_egfr_half, fail(egfr_half_date) origin(index_datemax_egfr_half) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: egfr_half_date!=0 & egfr_half_date<.
Observed time interval: (exit_date_egfr_half[_n-1], exit_date_egfr_half]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_datemax_egfr_half

--------------------------------------------------------------------------
     24,379  total observations
     10,161  event time missing (exit_date_egfr_half>=.)    PROBABLE ERROR
        894  ignored because never entered
      4,661  observations end on or before enter()
--------------------------------------------------------------------------
      8,663  observations remaining, representing
      8,663  subjects
      2,495  failures in single-failure-per-subject data
  7,919.299  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.354552

. 
. *AKI
. *0-29 days
. gen aki_date29 = aki_date if aki_date < (index_date_aki + 30) 
(22,926 missing values generated)

. gen exit_date29_aki = aki_date29
(22,926 missing values generated)

. gen index_date29_aki = index_date_aki

. format exit_date29_aki %td

. replace exit_date29_aki = min(deregistered_date, death_date, end_date, (index_date_aki + 29)) if aki_date29==.
(22,926 real changes made)

. stset exit_date29_aki, fail(aki_date29) origin(index_date29_aki) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: aki_date29!=0 & aki_date29<.
Observed time interval: (exit_date29_aki[_n-1], exit_date29_aki]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date29_aki

--------------------------------------------------------------------------
     24,379  total observations
      1,204  observations end on or before enter()
--------------------------------------------------------------------------
     23,175  observations remaining, representing
     23,175  subjects
        249  failures in single-failure-per-subject data
  1,814.984  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .0793977

. *30-89 days
. gen aki_date89 = aki_date if aki_date < (index_date_aki + 90) 
(22,634 missing values generated)

. gen exit_date89_aki = aki_date89
(22,634 missing values generated)

. gen index_date89_aki = index_date_aki + 30

. format exit_date89_aki %td

. replace exit_date89_aki = min(deregistered_date, death_date, end_date, (index_date_aki + 89)) if aki_date89==.
(22,634 real changes made)

. stset exit_date89_aki, fail(aki_date89) origin(index_date89_aki) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: aki_date89!=0 & aki_date89<.
Observed time interval: (exit_date89_aki[_n-1], exit_date89_aki]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date89_aki

--------------------------------------------------------------------------
     24,379  total observations
      1,816  observations end on or before enter()
--------------------------------------------------------------------------
     22,563  observations remaining, representing
     22,563  subjects
        287  failures in single-failure-per-subject data
  3,516.851  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .1615332

. *90-179 days
. gen aki_date179 = aki_date if aki_date < (index_date_aki + 180) 
(22,224 missing values generated)

. gen exit_date179_aki = aki_date179
(22,224 missing values generated)

. gen index_date179_aki = index_date_aki + 90

. format exit_date179_aki %td

. replace exit_date179_aki = min(deregistered_date, death_date, end_date, (index_date_aki + 179)) if aki_date179==.
(22,224 real changes made)

. stset exit_date179_aki, fail(aki_date179) origin(index_date179_aki) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: aki_date179!=0 & aki_date179<.
Observed time interval: (exit_date179_aki[_n-1], exit_date179_aki]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date179_aki

--------------------------------------------------------------------------
     24,379  total observations
      3,455  observations end on or before enter()
--------------------------------------------------------------------------
     20,924  observations remaining, representing
     20,924  subjects
        406  failures in single-failure-per-subject data
  4,823.365  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .2436687

. *180+ days
. gen index_datemax_aki = index_date_aki + 180

. gen exit_datemax_aki = exit_date_aki

. gen aki_datemax = aki_date
(20,157 missing values generated)

. stset exit_date_aki, fail(aki_date) origin(index_datemax_aki) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: aki_date!=0 & aki_date<.
Observed time interval: (exit_date_aki[_n-1], exit_date_aki]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_datemax_aki

--------------------------------------------------------------------------
     24,379  total observations
      5,722  observations end on or before enter()
--------------------------------------------------------------------------
     18,657  observations remaining, representing
     18,657  subjects
      2,062  failures in single-failure-per-subject data
 20,612.569  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.354552

. 
. *Death
. *0-29 days
. gen death_date29 = death_date if death_date < (index_date_death + 30) 
(24,308 missing values generated)

. gen exit_date29_death = death_date29
(24,308 missing values generated)

. gen index_date29_death = index_date_death

. format exit_date29_death %td

. replace exit_date29_death = min(deregistered_date, death_date, end_date, (index_date_death + 29)) if death_date29==.
(24,308 real changes made)

. stset exit_date29_death, fail(death_date29) origin(index_date29_death) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: death_date29!=0 & death_date29<.
Observed time interval: (exit_date29_death[_n-1], exit_date29_death]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date29_death

--------------------------------------------------------------------------
     24,379  total observations
          0  exclusions
--------------------------------------------------------------------------
     24,379  observations remaining, representing
     24,379  subjects
         71  failures in single-failure-per-subject data
  1,921.873  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .0793977

. *30-89 days
. gen death_date89 = death_date if death_date < (index_date_death + 90) 
(24,191 missing values generated)

. gen exit_date89_death = death_date89
(24,191 missing values generated)

. gen index_date89_death = index_date_death + 30

. format exit_date89_death %td

. replace exit_date89_death = min(deregistered_date, death_date, end_date, (index_date_death + 89)) if death_date89==.
(24,191 real changes made)

. stset exit_date89_death, fail(death_date89) origin(index_date89_death) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: death_date89!=0 & death_date89<.
Observed time interval: (exit_date89_death[_n-1], exit_date89_death]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date89_death

--------------------------------------------------------------------------
     24,379  total observations
        404  observations end on or before enter()
--------------------------------------------------------------------------
     23,975  observations remaining, representing
     23,975  subjects
        115  failures in single-failure-per-subject data
  3,756.507  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .1615332

. *90-179 days
. gen death_date179 = death_date if death_date < (index_date_death + 180) 
(24,038 missing values generated)

. gen exit_date179_death = death_date179
(24,038 missing values generated)

. gen index_date179_death = index_date_death + 90

. format exit_date179_death %td

. replace exit_date179_death = min(deregistered_date, death_date, end_date, (index_date_death + 179)) if death_date179==.
(24,038 real changes made)

. stset exit_date179_death, fail(death_date179) origin(index_date179_death) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: death_date179!=0 & death_date179<.
Observed time interval: (exit_date179_death[_n-1], exit_date179_death]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date179_death

--------------------------------------------------------------------------
     24,379  total observations
      1,906  observations end on or before enter()
--------------------------------------------------------------------------
     22,473  observations remaining, representing
     22,473  subjects
        153  failures in single-failure-per-subject data
  5,217.552  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  .2436687

. *180+ days
. gen index_datemax_death = index_date_death + 180

. gen exit_datemax_death = exit_date_death

. gen death_datemax = death_date
(23,245 missing values generated)

. stset exit_date_death, fail(death_date) origin(index_datemax_death) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: death_date!=0 & death_date<.
Observed time interval: (exit_date_death[_n-1], exit_date_death]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_datemax_death

--------------------------------------------------------------------------
     24,379  total observations
      4,044  observations end on or before enter()
--------------------------------------------------------------------------
     20,335  observations remaining, representing
     20,335  subjects
        792  failures in single-failure-per-subject data
 23,805.593  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.425736

. 
. save ./output/analysis_hospitalised.dta, replace
file ./output/analysis_hospitalised.dta saved

. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_hospitalised.log
  log type:  text
 closed on:  26 Jul 2023, 18:29:38
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
