------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_hospitalised.log
  log type:  text
 opened on:  13 Jan 2023, 17:17:35

. 
. capture noisily import delimited ./output/input_covid_hospitalised.csv, clear
(encoding automatically selected: ISO-8859-9)
(117 vars, 50,000 obs)

. tempfile covid_hospitalised

. save `covid_hospitalised', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_45dc_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_45dc_000001.tmp saved as .dta format

. di "COVID-19 hospitalised:"
COVID-19 hospitalised:

. safecount
  50,000

. 
. capture noisily import delimited ./output/input_pneumonia_hospitalised.csv, clear
(encoding automatically selected: ISO-8859-9)
(113 vars, 50,000 obs)

. tempfile pneumonia_hospitalised

. save `pneumonia_hospitalised', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_45dc_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_45dc_000002.tmp saved as .dta format

. di "Pneumonia hospitalised:"
Pneumonia hospitalised:

. safecount
  50,000

. 
. append using `covid_hospitalised', force

. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      5,095        5.09        5.09
 1 Most deprived |     18,805       18.80       23.90
               2 |     19,012       19.01       42.91
               3 |     18,891       18.89       61.80
               4 |     19,083       19.08       80.89
5 Least deprived |     19,114       19.11      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. drop if imd==0
(5,095 observations deleted)

. safetab imd

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |     18,805       19.81       19.81
               2 |     19,012       20.03       39.85
               3 |     18,891       19.91       59.75
               4 |     19,083       20.11       79.86
5 Least deprived |     19,114       20.14      100.00
-----------------+-----------------------------------
           Total |     94,905      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(94,904 missing values generated)

. replace stp1 = sum(stp1)
(94,904 real changes made)

. drop stp

. rename stp1 stp

. label values stp stp

. label var stp "STP"

. safetab stp

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     94,905      100.00      100.00
------------+-----------------------------------
      Total |     94,905      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(85,417 missing values generated)

. replace region = 2 if region_string=="East"
(9,496 real changes made)

. replace region = 3 if region_string=="London"
(19,043 real changes made)

. replace region = 4 if region_string=="North East"
(9,549 real changes made)

. replace region = 5 if region_string=="North West"
(9,406 real changes made)

. replace region = 6 if region_string=="South East"
(9,476 real changes made)

. replace region = 7 if region_string=="South West"
(9,415 real changes made)

. replace region = 8 if region_string=="West Midlands"
(9,641 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(9,391 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,488       10.00       10.00
                    East |      9,496       10.01       20.00
                  London |     19,043       20.07       40.07
              North East |      9,549       10.06       50.13
              North West |      9,406        9.91       60.04
              South East |      9,476        9.98       70.03
              South West |      9,415        9.92       79.95
           West Midlands |      9,641       10.16       90.10
Yorkshire and The Humber |      9,391        9.90      100.00
-------------------------+-----------------------------------
                   Total |     94,905      100.00

. drop if region==10
(0 observations deleted)

. safetab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,488       10.00       10.00
                    East |      9,496       10.01       20.00
                  London |     19,043       20.07       40.07
              North East |      9,549       10.06       50.13
              North West |      9,406        9.91       60.04
              South East |      9,476        9.98       70.03
              South West |      9,415        9.92       79.95
           West Midlands |      9,641       10.16       90.10
Yorkshire and The Humber |      9,391        9.90      100.00
-------------------------+-----------------------------------
                   Total |     94,905      100.00

. 
. * Exclusions due to deregistration and kidney replacement therapy will be checked (should already have been applied from previous steps in workflow)
. gen index_date = date(patient_index_date, "YMD")
(4,657 missing values generated)

. format index_date %td

. 
. * Deregistered before index_date
. gen deregistered_date = date(date_deregistered, "YMD")
(28,625 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date
(64,063 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(26,500 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(2,179 observations deleted)

. gen index_date_28 = index_date + 28
(1,203 missing values generated)

. format index_date_28 %td

. replace krt_date = index_date_28 if krt_date < index_date_28
(110 real changes made)

. 
. * Death before index_date + 28 days (i.e. only include people who survived 28 days after index_date)
. drop if deceased==1
(281 observations deleted)

. drop deceased

. gen death_date1 = date(death_date, "YMD")
(25,535 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28
(1,789 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased within 28 days of index date"

. label values deceased deceased

. tab covid deceased

           |       deceased
     covid | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,059      1,055 |    14,114 
-----------+----------------------+----------
     Total |    13,059      1,055 |    14,114 

. tab pneumonia deceased

           |       deceased
 pneumonia | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,534        734 |    14,268 
-----------+----------------------+----------
     Total |    13,534        734 |    14,268 

. drop if deceased==1
(1,789 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators only
. gen sex1 = 1 if sex=="M"
(13,576 missing values generated)

. replace sex1 = 0 if sex=="F"
(13,576 real changes made)

. drop sex

. rename sex1 sex

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 ///
>                                                                                                 baseline_creatinine_mar2017 ///
>                                                                                                 baseline_creatinine_apr2017 ///
>                                                                                                 baseline_creatinine_may2017 ///
>                                                                                                 baseline_creatinine_jun2017 ///
>                                                                                                 baseline_creatinine_jul2017 ///
>                                                                                                 baseline_creatinine_aug2017 ///
>                                                                                                 baseline_creatinine_sep2017 ///
>                                                                                                 baseline_creatinine_oct2017 ///
>                                                                                                 baseline_creatinine_nov2017 ///
>                                                                                                 baseline_creatinine_dec2017 ///
>                                                                                                 baseline_creatinine_jan2018 ///
>                                                                                                 baseline_creatinine_feb2018 ///
>                                                                                                 baseline_creatinine_mar2018 ///
>                                                                                                 baseline_creatinine_apr2018 ///
>                                                                                                 baseline_creatinine_may2018 ///
>                                                                                                 baseline_creatinine_jun2018 ///
>                                                                                                 baseline_creatinine_jul2018 ///
>                                                                                                 baseline_creatinine_aug2018 ///
>                                                                                                 baseline_creatinine_sep2018 ///
>                                                                                                 baseline_creatinine_oct2018 ///
>                                                                                                 baseline_creatinine_nov2018 ///
>                                                                                                 baseline_creatinine_dec2018 ///
>                                                                                                 baseline_creatinine_jan2019 ///
>                                                                                                 baseline_creatinine_feb2019 ///
>                                                                                                 baseline_creatinine_mar2019 ///
>                                                                                                 baseline_creatinine_apr2019 ///
>                                                                                                 baseline_creatinine_may2019 ///
>                                                                                                 baseline_creatinine_jun2019 ///
>                                                                                                 baseline_creatinine_jul2019 ///
>                                                                                                 baseline_creatinine_aug2019 ///
>                                                                                                 baseline_creatinine_sep2019 ///
>                                                                                                 baseline_creatinine_feb2020 ///
>                                                                                                 baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 ///
>                                                                                                 baseline_creatinine_feb2022 ///
>                                                                                                 baseline_creatinine_mar2022 ///
>                                                                                                 baseline_creatinine_apr2022 ///
>                                                                                                 baseline_creatinine_may2022 ///
>                                                                                                 baseline_creatinine_jun2022 ///
>                                                                                                 baseline_creatinine_jul2022 ///
>                                                                                                 baseline_creatinine_aug2022 ///
>                                                                                                 baseline_creatinine_sep2022 ///
>                                                                                                 baseline_creatinine_oct2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(5,926 real changes made, 5,926 to missing)
(18,985 missing values generated)
(26,593 missing values generated)
(3,908 real changes made)
(3,700 real changes made)
(3,908 real changes made)
(3,700 real changes made)
(4,820 real changes made)
(26,593 missing values generated)
(3,908 real changes made)
(3,700 real changes made)
(7,608 real changes made)
(21,773 real changes made)
(18,985 missing values generated)
(7,519 real changes made)
(3,908 real changes made)
(5,959 real changes made, 5,959 to missing)
(19,018 missing values generated)
(26,593 missing values generated)
(3,893 real changes made)
(3,682 real changes made)
(3,893 real changes made)
(3,682 real changes made)
(4,823 real changes made)
(26,593 missing values generated)
(3,893 real changes made)
(3,682 real changes made)
(7,575 real changes made)
(21,770 real changes made)
(19,018 missing values generated)
(7,480 real changes made)
(3,893 real changes made)
(5,998 real changes made, 5,998 to missing)
(19,057 missing values generated)
(26,593 missing values generated)
(3,893 real changes made)
(3,643 real changes made)
(3,893 real changes made)
(3,643 real changes made)
(4,901 real changes made)
(26,593 missing values generated)
(3,893 real changes made)
(3,643 real changes made)
(7,536 real changes made)
(21,692 real changes made)
(19,057 missing values generated)
(7,450 real changes made)
(3,893 real changes made)
(5,895 real changes made, 5,895 to missing)
(18,954 missing values generated)
(26,593 missing values generated)
(3,864 real changes made)
(3,775 real changes made)
(3,864 real changes made)
(3,775 real changes made)
(4,810 real changes made)
(26,593 missing values generated)
(3,864 real changes made)
(3,775 real changes made)
(7,639 real changes made)
(21,783 real changes made)
(18,954 missing values generated)
(7,552 real changes made)
(3,864 real changes made)
(5,965 real changes made, 5,965 to missing)
(19,024 missing values generated)
(26,593 missing values generated)
(3,920 real changes made)
(3,649 real changes made)
(3,920 real changes made)
(3,649 real changes made)
(4,788 real changes made)
(26,593 missing values generated)
(3,920 real changes made)
(3,649 real changes made)
(7,569 real changes made)
(21,805 real changes made)
(19,024 missing values generated)
(7,476 real changes made)
(3,920 real changes made)
(5,880 real changes made, 5,880 to missing)
(18,939 missing values generated)
(26,593 missing values generated)
(3,940 real changes made)
(3,714 real changes made)
(3,940 real changes made)
(3,714 real changes made)
(4,844 real changes made)
(26,593 missing values generated)
(3,940 real changes made)
(3,714 real changes made)
(7,654 real changes made)
(21,749 real changes made)
(18,939 missing values generated)
(7,556 real changes made)
(3,940 real changes made)
(6,001 real changes made, 6,001 to missing)
(19,060 missing values generated)
(26,593 missing values generated)
(3,845 real changes made)
(3,688 real changes made)
(3,845 real changes made)
(3,688 real changes made)
(4,827 real changes made)
(26,593 missing values generated)
(3,845 real changes made)
(3,688 real changes made)
(7,533 real changes made)
(21,766 real changes made)
(19,060 missing values generated)
(7,444 real changes made)
(3,845 real changes made)
(5,955 real changes made, 5,955 to missing)
(19,014 missing values generated)
(26,593 missing values generated)
(3,842 real changes made)
(3,737 real changes made)
(3,842 real changes made)
(3,737 real changes made)
(4,765 real changes made)
(26,593 missing values generated)
(3,842 real changes made)
(3,737 real changes made)
(7,579 real changes made)
(21,828 real changes made)
(19,014 missing values generated)
(7,502 real changes made)
(3,842 real changes made)
(5,995 real changes made, 5,995 to missing)
(19,054 missing values generated)
(26,593 missing values generated)
(3,874 real changes made)
(3,665 real changes made)
(3,874 real changes made)
(3,665 real changes made)
(4,860 real changes made)
(26,593 missing values generated)
(3,874 real changes made)
(3,665 real changes made)
(7,539 real changes made)
(21,733 real changes made)
(19,054 missing values generated)
(7,455 real changes made)
(3,874 real changes made)
(5,920 real changes made, 5,920 to missing)
(18,979 missing values generated)
(26,593 missing values generated)
(3,910 real changes made)
(3,704 real changes made)
(3,910 real changes made)
(3,704 real changes made)
(4,846 real changes made)
(26,593 missing values generated)
(3,910 real changes made)
(3,704 real changes made)
(7,614 real changes made)
(21,747 real changes made)
(18,979 missing values generated)
(7,521 real changes made)
(3,910 real changes made)
(5,955 real changes made, 5,955 to missing)
(19,014 missing values generated)
(26,593 missing values generated)
(3,873 real changes made)
(3,706 real changes made)
(3,873 real changes made)
(3,706 real changes made)
(4,833 real changes made)
(26,593 missing values generated)
(3,873 real changes made)
(3,706 real changes made)
(7,579 real changes made)
(21,760 real changes made)
(19,014 missing values generated)
(7,483 real changes made)
(3,873 real changes made)
(5,960 real changes made, 5,960 to missing)
(19,019 missing values generated)
(26,593 missing values generated)
(3,871 real changes made)
(3,703 real changes made)
(3,871 real changes made)
(3,703 real changes made)
(4,765 real changes made)
(26,593 missing values generated)
(3,871 real changes made)
(3,703 real changes made)
(7,574 real changes made)
(21,828 real changes made)
(19,019 missing values generated)
(7,482 real changes made)
(3,871 real changes made)
(5,975 real changes made, 5,975 to missing)
(19,034 missing values generated)
(26,593 missing values generated)
(3,849 real changes made)
(3,710 real changes made)
(3,849 real changes made)
(3,710 real changes made)
(4,871 real changes made)
(26,593 missing values generated)
(3,849 real changes made)
(3,710 real changes made)
(7,559 real changes made)
(21,722 real changes made)
(19,034 missing values generated)
(7,466 real changes made)
(3,849 real changes made)
(6,007 real changes made, 6,007 to missing)
(19,066 missing values generated)
(26,593 missing values generated)
(3,832 real changes made)
(3,695 real changes made)
(3,832 real changes made)
(3,695 real changes made)
(4,753 real changes made)
(26,593 missing values generated)
(3,832 real changes made)
(3,695 real changes made)
(7,527 real changes made)
(21,840 real changes made)
(19,066 missing values generated)
(7,442 real changes made)
(3,832 real changes made)
(5,961 real changes made, 5,961 to missing)
(19,020 missing values generated)
(26,593 missing values generated)
(3,859 real changes made)
(3,714 real changes made)
(3,859 real changes made)
(3,714 real changes made)
(4,711 real changes made)
(26,593 missing values generated)
(3,859 real changes made)
(3,714 real changes made)
(7,573 real changes made)
(21,882 real changes made)
(19,020 missing values generated)
(7,486 real changes made)
(3,859 real changes made)
(5,947 real changes made, 5,947 to missing)
(19,006 missing values generated)
(26,593 missing values generated)
(3,848 real changes made)
(3,739 real changes made)
(3,848 real changes made)
(3,739 real changes made)
(4,808 real changes made)
(26,593 missing values generated)
(3,848 real changes made)
(3,739 real changes made)
(7,587 real changes made)
(21,785 real changes made)
(19,006 missing values generated)
(7,488 real changes made)
(3,848 real changes made)
(5,958 real changes made, 5,958 to missing)
(19,017 missing values generated)
(26,593 missing values generated)
(3,926 real changes made)
(3,650 real changes made)
(3,926 real changes made)
(3,650 real changes made)
(4,804 real changes made)
(26,593 missing values generated)
(3,926 real changes made)
(3,650 real changes made)
(7,576 real changes made)
(21,789 real changes made)
(19,017 missing values generated)
(7,478 real changes made)
(3,926 real changes made)
(6,002 real changes made, 6,002 to missing)
(19,061 missing values generated)
(26,593 missing values generated)
(3,879 real changes made)
(3,653 real changes made)
(3,879 real changes made)
(3,653 real changes made)
(4,784 real changes made)
(26,593 missing values generated)
(3,879 real changes made)
(3,653 real changes made)
(7,532 real changes made)
(21,809 real changes made)
(19,061 missing values generated)
(7,438 real changes made)
(3,879 real changes made)
(6,005 real changes made, 6,005 to missing)
(19,064 missing values generated)
(26,593 missing values generated)
(3,855 real changes made)
(3,674 real changes made)
(3,855 real changes made)
(3,674 real changes made)
(4,678 real changes made)
(26,593 missing values generated)
(3,855 real changes made)
(3,674 real changes made)
(7,529 real changes made)
(21,915 real changes made)
(19,064 missing values generated)
(7,437 real changes made)
(3,855 real changes made)
(6,047 real changes made, 6,047 to missing)
(19,106 missing values generated)
(26,593 missing values generated)
(3,837 real changes made)
(3,650 real changes made)
(3,837 real changes made)
(3,650 real changes made)
(4,767 real changes made)
(26,593 missing values generated)
(3,837 real changes made)
(3,650 real changes made)
(7,487 real changes made)
(21,826 real changes made)
(19,106 missing values generated)
(7,403 real changes made)
(3,837 real changes made)
(6,038 real changes made, 6,038 to missing)
(19,097 missing values generated)
(26,593 missing values generated)
(3,808 real changes made)
(3,688 real changes made)
(3,808 real changes made)
(3,688 real changes made)
(4,761 real changes made)
(26,593 missing values generated)
(3,808 real changes made)
(3,688 real changes made)
(7,496 real changes made)
(21,832 real changes made)
(19,097 missing values generated)
(7,401 real changes made)
(3,808 real changes made)
(5,962 real changes made, 5,962 to missing)
(19,021 missing values generated)
(26,593 missing values generated)
(3,904 real changes made)
(3,668 real changes made)
(3,904 real changes made)
(3,668 real changes made)
(4,842 real changes made)
(26,593 missing values generated)
(3,904 real changes made)
(3,668 real changes made)
(7,572 real changes made)
(21,751 real changes made)
(19,021 missing values generated)
(7,463 real changes made)
(3,904 real changes made)
(5,949 real changes made, 5,949 to missing)
(19,008 missing values generated)
(26,593 missing values generated)
(3,893 real changes made)
(3,692 real changes made)
(3,893 real changes made)
(3,692 real changes made)
(4,855 real changes made)
(26,593 missing values generated)
(3,893 real changes made)
(3,692 real changes made)
(7,585 real changes made)
(21,738 real changes made)
(19,008 missing values generated)
(7,496 real changes made)
(3,893 real changes made)
(5,954 real changes made, 5,954 to missing)
(19,013 missing values generated)
(26,593 missing values generated)
(3,861 real changes made)
(3,719 real changes made)
(3,861 real changes made)
(3,719 real changes made)
(4,749 real changes made)
(26,593 missing values generated)
(3,861 real changes made)
(3,719 real changes made)
(7,580 real changes made)
(21,844 real changes made)
(19,013 missing values generated)
(7,490 real changes made)
(3,861 real changes made)
(5,990 real changes made, 5,990 to missing)
(19,049 missing values generated)
(26,593 missing values generated)
(3,877 real changes made)
(3,667 real changes made)
(3,877 real changes made)
(3,667 real changes made)
(4,756 real changes made)
(26,593 missing values generated)
(3,877 real changes made)
(3,667 real changes made)
(7,544 real changes made)
(21,837 real changes made)
(19,049 missing values generated)
(7,462 real changes made)
(3,877 real changes made)
(6,007 real changes made, 6,007 to missing)
(19,066 missing values generated)
(26,593 missing values generated)
(3,870 real changes made)
(3,657 real changes made)
(3,870 real changes made)
(3,657 real changes made)
(4,711 real changes made)
(26,593 missing values generated)
(3,870 real changes made)
(3,657 real changes made)
(7,527 real changes made)
(21,882 real changes made)
(19,066 missing values generated)
(7,453 real changes made)
(3,870 real changes made)
(6,059 real changes made, 6,059 to missing)
(19,118 missing values generated)
(26,593 missing values generated)
(3,840 real changes made)
(3,635 real changes made)
(3,840 real changes made)
(3,635 real changes made)
(4,746 real changes made)
(26,593 missing values generated)
(3,840 real changes made)
(3,635 real changes made)
(7,475 real changes made)
(21,847 real changes made)
(19,118 missing values generated)
(7,371 real changes made)
(3,840 real changes made)
(5,977 real changes made, 5,977 to missing)
(19,036 missing values generated)
(26,593 missing values generated)
(3,876 real changes made)
(3,681 real changes made)
(3,876 real changes made)
(3,681 real changes made)
(4,847 real changes made)
(26,593 missing values generated)
(3,876 real changes made)
(3,681 real changes made)
(7,557 real changes made)
(21,746 real changes made)
(19,036 missing values generated)
(7,454 real changes made)
(3,876 real changes made)
(5,958 real changes made, 5,958 to missing)
(19,017 missing values generated)
(26,593 missing values generated)
(3,884 real changes made)
(3,692 real changes made)
(3,884 real changes made)
(3,692 real changes made)
(4,793 real changes made)
(26,593 missing values generated)
(3,884 real changes made)
(3,692 real changes made)
(7,576 real changes made)
(21,800 real changes made)
(19,017 missing values generated)
(7,490 real changes made)
(3,884 real changes made)
(5,990 real changes made, 5,990 to missing)
(19,049 missing values generated)
(26,593 missing values generated)
(3,884 real changes made)
(3,660 real changes made)
(3,884 real changes made)
(3,660 real changes made)
(4,782 real changes made)
(26,593 missing values generated)
(3,884 real changes made)
(3,660 real changes made)
(7,544 real changes made)
(21,811 real changes made)
(19,049 missing values generated)
(7,448 real changes made)
(3,884 real changes made)
(5,930 real changes made, 5,930 to missing)
(18,989 missing values generated)
(26,593 missing values generated)
(3,889 real changes made)
(3,715 real changes made)
(3,889 real changes made)
(3,715 real changes made)
(4,748 real changes made)
(26,593 missing values generated)
(3,889 real changes made)
(3,715 real changes made)
(7,604 real changes made)
(21,845 real changes made)
(18,989 missing values generated)
(7,508 real changes made)
(3,889 real changes made)
(5,982 real changes made, 5,982 to missing)
(19,041 missing values generated)
(26,593 missing values generated)
(3,874 real changes made)
(3,678 real changes made)
(3,874 real changes made)
(3,678 real changes made)
(4,775 real changes made)
(26,593 missing values generated)
(3,874 real changes made)
(3,678 real changes made)
(7,552 real changes made)
(21,818 real changes made)
(19,041 missing values generated)
(7,466 real changes made)
(3,874 real changes made)
(5,768 real changes made, 5,768 to missing)
(19,302 missing values generated)
(26,593 missing values generated)
(3,742 real changes made)
(3,549 real changes made)
(3,742 real changes made)
(3,549 real changes made)
(4,634 real changes made)
(26,593 missing values generated)
(3,742 real changes made)
(3,549 real changes made)
(7,291 real changes made)
(21,959 real changes made)
(19,302 missing values generated)
(7,216 real changes made)
(3,742 real changes made)
(5,776 real changes made, 5,776 to missing)
(19,310 missing values generated)
(26,593 missing values generated)
(3,677 real changes made)
(3,606 real changes made)
(3,677 real changes made)
(3,606 real changes made)
(4,613 real changes made)
(26,593 missing values generated)
(3,677 real changes made)
(3,606 real changes made)
(7,283 real changes made)
(21,980 real changes made)
(19,310 missing values generated)
(7,199 real changes made)
(3,677 real changes made)
(5,584 real changes made, 5,584 to missing)
(19,118 missing values generated)
(26,593 missing values generated)
(3,794 real changes made)
(3,681 real changes made)
(3,794 real changes made)
(3,681 real changes made)
(4,731 real changes made)
(26,593 missing values generated)
(3,794 real changes made)
(3,681 real changes made)
(7,475 real changes made)
(21,862 real changes made)
(19,118 missing values generated)
(7,388 real changes made)
(3,794 real changes made)
(5,739 real changes made, 5,739 to missing)
(19,273 missing values generated)
(26,593 missing values generated)
(3,689 real changes made)
(3,631 real changes made)
(3,689 real changes made)
(3,631 real changes made)
(4,594 real changes made)
(26,593 missing values generated)
(3,689 real changes made)
(3,631 real changes made)
(7,320 real changes made)
(21,999 real changes made)
(19,273 missing values generated)
(7,231 real changes made)
(3,689 real changes made)
(5,791 real changes made, 5,791 to missing)
(19,325 missing values generated)
(26,593 missing values generated)
(3,673 real changes made)
(3,595 real changes made)
(3,673 real changes made)
(3,595 real changes made)
(4,631 real changes made)
(26,593 missing values generated)
(3,673 real changes made)
(3,595 real changes made)
(7,268 real changes made)
(21,962 real changes made)
(19,325 missing values generated)
(7,172 real changes made)
(3,673 real changes made)
(5,682 real changes made, 5,682 to missing)
(19,216 missing values generated)
(26,593 missing values generated)
(3,772 real changes made)
(3,605 real changes made)
(3,772 real changes made)
(3,605 real changes made)
(4,685 real changes made)
(26,593 missing values generated)
(3,772 real changes made)
(3,605 real changes made)
(7,377 real changes made)
(21,908 real changes made)
(19,216 missing values generated)
(7,300 real changes made)
(3,772 real changes made)
(5,725 real changes made, 5,725 to missing)
(19,259 missing values generated)
(26,593 missing values generated)
(3,707 real changes made)
(3,627 real changes made)
(3,707 real changes made)
(3,627 real changes made)
(4,624 real changes made)
(26,593 missing values generated)
(3,707 real changes made)
(3,627 real changes made)
(7,334 real changes made)
(21,969 real changes made)
(19,259 missing values generated)
(7,250 real changes made)
(3,707 real changes made)
(5,733 real changes made, 5,733 to missing)
(19,267 missing values generated)
(26,593 missing values generated)
(3,707 real changes made)
(3,619 real changes made)
(3,707 real changes made)
(3,619 real changes made)
(4,583 real changes made)
(26,593 missing values generated)
(3,707 real changes made)
(3,619 real changes made)
(7,326 real changes made)
(22,010 real changes made)
(19,267 missing values generated)
(7,235 real changes made)
(3,707 real changes made)
(5,744 real changes made, 5,744 to missing)
(19,278 missing values generated)
(26,593 missing values generated)
(3,707 real changes made)
(3,608 real changes made)
(3,707 real changes made)
(3,608 real changes made)
(4,603 real changes made)
(26,593 missing values generated)
(3,707 real changes made)
(3,608 real changes made)
(7,315 real changes made)
(21,990 real changes made)
(19,278 missing values generated)
(7,229 real changes made)
(3,707 real changes made)
(5,707 real changes made, 5,707 to missing)
(19,241 missing values generated)
(26,593 missing values generated)
(3,734 real changes made)
(3,618 real changes made)
(3,734 real changes made)
(3,618 real changes made)
(4,651 real changes made)
(26,593 missing values generated)
(3,734 real changes made)
(3,618 real changes made)
(7,352 real changes made)
(21,942 real changes made)
(19,241 missing values generated)
(7,258 real changes made)
(3,734 real changes made)
(5,729 real changes made, 5,729 to missing)
(19,263 missing values generated)
(26,593 missing values generated)
(3,707 real changes made)
(3,623 real changes made)
(3,707 real changes made)
(3,623 real changes made)
(4,673 real changes made)
(26,593 missing values generated)
(3,707 real changes made)
(3,623 real changes made)
(7,330 real changes made)
(21,920 real changes made)
(19,263 missing values generated)
(7,236 real changes made)
(3,707 real changes made)
(5,805 real changes made, 5,805 to missing)
(19,339 missing values generated)
(26,593 missing values generated)
(3,646 real changes made)
(3,608 real changes made)
(3,646 real changes made)
(3,608 real changes made)
(4,585 real changes made)
(26,593 missing values generated)
(3,646 real changes made)
(3,608 real changes made)
(7,254 real changes made)
(22,008 real changes made)
(19,339 missing values generated)
(7,174 real changes made)
(3,646 real changes made)
(5,794 real changes made, 5,794 to missing)
(19,328 missing values generated)
(26,593 missing values generated)
(3,716 real changes made)
(3,549 real changes made)
(3,716 real changes made)
(3,549 real changes made)
(4,652 real changes made)
(26,593 missing values generated)
(3,716 real changes made)
(3,549 real changes made)
(7,265 real changes made)
(21,941 real changes made)
(19,328 missing values generated)
(7,172 real changes made)
(3,716 real changes made)
(5,729 real changes made, 5,729 to missing)
(19,263 missing values generated)
(26,593 missing values generated)
(3,765 real changes made)
(3,565 real changes made)
(3,765 real changes made)
(3,565 real changes made)
(4,644 real changes made)
(26,593 missing values generated)
(3,765 real changes made)
(3,565 real changes made)
(7,330 real changes made)
(21,949 real changes made)
(19,263 missing values generated)
(7,251 real changes made)
(3,765 real changes made)
(5,739 real changes made, 5,739 to missing)
(19,273 missing values generated)
(26,593 missing values generated)
(3,695 real changes made)
(3,625 real changes made)
(3,695 real changes made)
(3,625 real changes made)
(4,675 real changes made)
(26,593 missing values generated)
(3,695 real changes made)
(3,625 real changes made)
(7,320 real changes made)
(21,918 real changes made)
(19,273 missing values generated)
(7,227 real changes made)
(3,695 real changes made)
(5,705 real changes made, 5,705 to missing)
(19,239 missing values generated)
(26,593 missing values generated)
(3,720 real changes made)
(3,634 real changes made)
(3,720 real changes made)
(3,634 real changes made)
(4,678 real changes made)
(26,593 missing values generated)
(3,720 real changes made)
(3,634 real changes made)
(7,354 real changes made)
(21,915 real changes made)
(19,239 missing values generated)
(7,270 real changes made)
(3,720 real changes made)
(5,739 real changes made, 5,739 to missing)
(19,273 missing values generated)
(26,593 missing values generated)
(3,730 real changes made)
(3,590 real changes made)
(3,730 real changes made)
(3,590 real changes made)
(4,673 real changes made)
(26,593 missing values generated)
(3,730 real changes made)
(3,590 real changes made)
(7,320 real changes made)
(21,920 real changes made)
(19,273 missing values generated)
(7,235 real changes made)
(3,730 real changes made)
(5,754 real changes made, 5,754 to missing)
(19,288 missing values generated)
(26,593 missing values generated)
(3,717 real changes made)
(3,588 real changes made)
(3,717 real changes made)
(3,588 real changes made)
(4,647 real changes made)
(26,593 missing values generated)
(3,717 real changes made)
(3,588 real changes made)
(7,305 real changes made)
(21,946 real changes made)
(19,288 missing values generated)
(7,219 real changes made)
(3,717 real changes made)
(5,848 real changes made, 5,848 to missing)
(19,382 missing values generated)
(26,593 missing values generated)
(3,654 real changes made)
(3,557 real changes made)
(3,654 real changes made)
(3,557 real changes made)
(4,621 real changes made)
(26,593 missing values generated)
(3,654 real changes made)
(3,557 real changes made)
(7,211 real changes made)
(21,972 real changes made)
(19,382 missing values generated)
(7,129 real changes made)
(3,654 real changes made)
(5,731 real changes made, 5,731 to missing)
(19,265 missing values generated)
(26,593 missing values generated)
(3,719 real changes made)
(3,609 real changes made)
(3,719 real changes made)
(3,609 real changes made)
(4,657 real changes made)
(26,593 missing values generated)
(3,719 real changes made)
(3,609 real changes made)
(7,328 real changes made)
(21,936 real changes made)
(19,265 missing values generated)
(7,247 real changes made)
(3,719 real changes made)
(5,753 real changes made, 5,753 to missing)
(19,287 missing values generated)
(26,593 missing values generated)
(3,706 real changes made)
(3,600 real changes made)
(3,706 real changes made)
(3,600 real changes made)
(4,604 real changes made)
(26,593 missing values generated)
(3,706 real changes made)
(3,600 real changes made)
(7,306 real changes made)
(21,989 real changes made)
(19,287 missing values generated)
(7,233 real changes made)
(3,706 real changes made)
(5,713 real changes made, 5,713 to missing)
(19,247 missing values generated)
(26,593 missing values generated)
(3,736 real changes made)
(3,610 real changes made)
(3,736 real changes made)
(3,610 real changes made)
(4,647 real changes made)
(26,593 missing values generated)
(3,736 real changes made)
(3,610 real changes made)
(7,346 real changes made)
(21,946 real changes made)
(19,247 missing values generated)
(7,261 real changes made)
(3,736 real changes made)
(5,737 real changes made, 5,737 to missing)
(19,271 missing values generated)
(26,593 missing values generated)
(3,740 real changes made)
(3,582 real changes made)
(3,740 real changes made)
(3,582 real changes made)
(4,600 real changes made)
(26,593 missing values generated)
(3,740 real changes made)
(3,582 real changes made)
(7,322 real changes made)
(21,993 real changes made)
(19,271 missing values generated)
(7,234 real changes made)
(3,740 real changes made)
(5,739 real changes made, 5,739 to missing)
(19,273 missing values generated)
(26,593 missing values generated)
(3,690 real changes made)
(3,630 real changes made)
(3,690 real changes made)
(3,630 real changes made)
(4,588 real changes made)
(26,593 missing values generated)
(3,690 real changes made)
(3,630 real changes made)
(7,320 real changes made)
(22,005 real changes made)
(19,273 missing values generated)
(7,237 real changes made)
(3,690 real changes made)
(5,793 real changes made, 5,793 to missing)
(19,327 missing values generated)
(26,593 missing values generated)
(3,662 real changes made)
(3,604 real changes made)
(3,662 real changes made)
(3,604 real changes made)
(4,638 real changes made)
(26,593 missing values generated)
(3,662 real changes made)
(3,604 real changes made)
(7,266 real changes made)
(21,955 real changes made)
(19,327 missing values generated)
(7,176 real changes made)
(3,662 real changes made)
(5,811 real changes made, 5,811 to missing)
(19,345 missing values generated)
(26,593 missing values generated)
(3,668 real changes made)
(3,580 real changes made)
(3,668 real changes made)
(3,580 real changes made)
(4,647 real changes made)
(26,593 missing values generated)
(3,668 real changes made)
(3,580 real changes made)
(7,248 real changes made)
(21,946 real changes made)
(19,345 missing values generated)
(7,154 real changes made)
(3,668 real changes made)
(5,839 real changes made, 5,839 to missing)
(19,373 missing values generated)
(26,593 missing values generated)
(3,635 real changes made)
(3,585 real changes made)
(3,635 real changes made)
(3,585 real changes made)
(4,557 real changes made)
(26,593 missing values generated)
(3,635 real changes made)
(3,585 real changes made)
(7,220 real changes made)
(22,036 real changes made)
(19,373 missing values generated)
(7,135 real changes made)
(3,635 real changes made)
(5,767 real changes made, 5,767 to missing)
(19,301 missing values generated)
(26,593 missing values generated)
(3,683 real changes made)
(3,609 real changes made)
(3,683 real changes made)
(3,609 real changes made)
(4,564 real changes made)
(26,593 missing values generated)
(3,683 real changes made)
(3,609 real changes made)
(7,292 real changes made)
(22,029 real changes made)
(19,301 missing values generated)
(7,199 real changes made)
(3,683 real changes made)
(5,814 real changes made, 5,814 to missing)
(19,348 missing values generated)
(26,593 missing values generated)
(3,729 real changes made)
(3,516 real changes made)
(3,729 real changes made)
(3,516 real changes made)
(4,689 real changes made)
(26,593 missing values generated)
(3,729 real changes made)
(3,516 real changes made)
(7,245 real changes made)
(21,904 real changes made)
(19,348 missing values generated)
(7,159 real changes made)
(3,729 real changes made)
(5,770 real changes made, 5,770 to missing)
(19,304 missing values generated)
(26,593 missing values generated)
(3,724 real changes made)
(3,565 real changes made)
(3,724 real changes made)
(3,565 real changes made)
(4,660 real changes made)
(26,593 missing values generated)
(3,724 real changes made)
(3,565 real changes made)
(7,289 real changes made)
(21,933 real changes made)
(19,304 missing values generated)
(7,208 real changes made)
(3,724 real changes made)
(5,818 real changes made, 5,818 to missing)
(19,352 missing values generated)
(26,593 missing values generated)
(3,728 real changes made)
(3,513 real changes made)
(3,728 real changes made)
(3,513 real changes made)
(4,608 real changes made)
(26,593 missing values generated)
(3,728 real changes made)
(3,513 real changes made)
(7,241 real changes made)
(21,985 real changes made)
(19,352 missing values generated)
(7,170 real changes made)
(3,728 real changes made)
(5,807 real changes made, 5,807 to missing)
(19,341 missing values generated)
(26,593 missing values generated)
(3,703 real changes made)
(3,549 real changes made)
(3,703 real changes made)
(3,549 real changes made)
(4,568 real changes made)
(26,593 missing values generated)
(3,703 real changes made)
(3,549 real changes made)
(7,252 real changes made)
(22,025 real changes made)
(19,341 missing values generated)
(7,170 real changes made)
(3,703 real changes made)
(5,738 real changes made, 5,738 to missing)
(19,272 missing values generated)
(26,593 missing values generated)
(3,711 real changes made)
(3,610 real changes made)
(3,711 real changes made)
(3,610 real changes made)
(4,657 real changes made)
(26,593 missing values generated)
(3,711 real changes made)
(3,610 real changes made)
(7,321 real changes made)
(21,936 real changes made)
(19,272 missing values generated)
(7,231 real changes made)
(3,711 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)
(1,074 missing values generated)

. gen baseline_egfr=.
(26,593 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(217 real changes made)
(274 real changes made)
(229 real changes made)
(231 real changes made)
(280 real changes made)
(240 real changes made)
(245 real changes made)
(227 real changes made)
(259 real changes made)
(231 real changes made)
(266 real changes made)
(259 real changes made)
(216 real changes made)
(239 real changes made)
(221 real changes made)
(235 real changes made)
(206 real changes made)
(232 real changes made)
(227 real changes made)
(223 real changes made)
(222 real changes made)
(210 real changes made)
(212 real changes made)
(209 real changes made)
(208 real changes made)
(183 real changes made)
(198 real changes made)
(202 real changes made)
(196 real changes made)
(192 real changes made)
(194 real changes made)
(180 real changes made)
(236 real changes made)
(270 real changes made)
(244 real changes made)
(234 real changes made)
(254 real changes made)
(255 real changes made)
(243 real changes made)
(242 real changes made)
(213 real changes made)
(221 real changes made)
(235 real changes made)
(232 real changes made)
(205 real changes made)
(205 real changes made)
(225 real changes made)
(198 real changes made)
(180 real changes made)
(170 real changes made)
(215 real changes made)
(197 real changes made)
(210 real changes made)
(214 real changes made)
(186 real changes made)
(203 real changes made)
(170 real changes made)
(211 real changes made)
(177 real changes made)
(198 real changes made)
(199 real changes made)
(196 real changes made)
(194 real changes made)
(165 real changes made)
(192 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab covid baseline_esrd

           | baseline_e
           |    srd
     covid |   No ESRD |     Total
-----------+-----------+----------
         1 |    13,059 |    13,059 
-----------+-----------+----------
     Total |    13,059 |    13,059 

. tab pneumonia baseline_esrd

           | baseline_e
           |    srd
 pneumonia |   No ESRD |     Total
-----------+-----------+----------
         1 |    13,534 |    13,534 
-----------+-----------+----------
     Total |    13,534 |    13,534 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. ** Exposure
. gen case = covid
(13,534 missing values generated)

. replace case = 0 if covid==.
(13,534 real changes made)

. label define case 0 "Pneumonia (pre-pandemic)" ///
>                                   1 "COVID-19"

. label values case case

. tab case covid

                      |   covid
                 case |         1 |     Total
----------------------+-----------+----------
             COVID-19 |    13,059 |    13,059 
----------------------+-----------+----------
                Total |    13,059 |    13,059 

. tab case pneumonia

                      | pneumonia
                 case |         1 |     Total
----------------------+-----------+----------
Pneumonia (pre-pandem |    13,534 |    13,534 
----------------------+-----------+----------
                Total |    13,534 |    13,534 

. drop covid

. drop pneumonia

. safetab case 

                    case |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,534       50.89       50.89
                COVID-19 |     13,059       49.11      100.00
-------------------------+-----------------------------------
                   Total |     26,593      100.00

. 
. * Critical care during index admission
. replace critical_care = 1 if critical_days==1
(1,298 real changes made)

. drop critical_days

. label define critical_care      0 "Ward-based"          ///
>                                                         1 "Critical care"

. label values critical_care critical_care

. label var critical_care "Critical care"

. safetab critical_care, m

Critical care |      Freq.     Percent        Cum.
--------------+-----------------------------------
   Ward-based |     23,980       90.17       90.17
Critical care |      2,613        9.83      100.00
--------------+-----------------------------------
        Total |     26,593      100.00

. gen case_critical_care = critical_care

. replace case_critical_care = 2 if case==1
(13,059 real changes made)

. replace case_critical_care = 3 if case==1 &critical_care==1
(1,286 real changes made)

. label define case_critical_care 0 "Ward-based pneumonia (pre-pandemic)"         ///
>                                                                 1 "Critical care pneumonia (pre-pandemic)"      ///
>                                                                 2 "Ward-based COVID-19"                                         ///
>                                                                 3 "Critical care COVID-19"

. label values case_critical_care case_critical_care

. safetab case_critical_care, m

                    case_critical_care |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
   Ward-based pneumonia (pre-pandemic) |     12,207       45.90       45.90
Critical care pneumonia (pre-pandemic) |      1,327        4.99       50.89
                   Ward-based COVID-19 |     11,773       44.27       95.16
                Critical care COVID-19 |      1,286        4.84      100.00
---------------------------------------+-----------------------------------
                                 Total |     26,593      100.00

. 
. * Acute kidney injury during index admission
. label define acute_kidney_injury        0 "No AKI"      ///
>                                                                         1 "AKI"

. label values acute_kidney_injury acute_kidney_injury

. label var acute_kidney_injury "Acute kidney injury"

. safetab acute_kidney_injury, m

      Acute |
     kidney |
     injury |      Freq.     Percent        Cum.
------------+-----------------------------------
     No AKI |     16,068       60.42       60.42
        AKI |     10,525       39.58      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. gen case_acute_kidney_injury = acute_kidney_injury

. replace case_acute_kidney_injury = 2 if case==1
(13,059 real changes made)

. replace case_acute_kidney_injury = 3 if case==1 &acute_kidney_injury==1
(5,169 real changes made)

. label define case_acute_kidney_injury   0 "No AKI pneumonia (pre-pandemic)"     ///
>                                                                                 1 "AKI pneumonia (pre-pandemic)"        ///
>                                                                                 2 "No AKI COVID-19"                             ///
>                                                                                 3 "AKI COVID-19"

. label values case_acute_kidney_injury case_acute_kidney_injury

. safetab case_acute_kidney_injury, m

       case_acute_kidney_injury |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
No AKI pneumonia (pre-pandemic) |      8,178       30.75       30.75
   AKI pneumonia (pre-pandemic) |      5,356       20.14       50.89
                No AKI COVID-19 |      7,890       29.67       80.56
                   AKI COVID-19 |      5,169       19.44      100.00
--------------------------------+-----------------------------------
                          Total |     26,593      100.00

. 
. * Kidney replacement therapy during index admission
. gen krt = acute_kidney_injury

. replace krt = 2 if krt_icd_10==1
(276 real changes made)

. drop krt_icd_10

. replace krt = 2 if krt_opcs_4==1
(262 real changes made)

. drop krt_opcs_4

. label define krt        0 "No AKI"                              ///
>                                         1 "AKI without KRT"             ///
>                                         2 "AKI requiring KRT"

. label values krt krt

. label var krt "Kidney replacement therapy"

. safetab krt, m

           Kidney |
      replacement |
          therapy |      Freq.     Percent        Cum.
------------------+-----------------------------------
           No AKI |     15,756       59.25       59.25
  AKI without KRT |     10,299       38.73       97.98
AKI requiring KRT |        538        2.02      100.00
------------------+-----------------------------------
            Total |     26,593      100.00

. gen case_krt = krt

. replace case_krt = 3 if case==1
(13,059 real changes made)

. replace case_krt = 4 if case==1 &krt==1
(5,066 real changes made)

. replace case_krt = 5 if case==1 &krt==2
(252 real changes made)

. label define case_krt   0 "No AKI pneumonia (pre-pandemic)"                     ///
>                                                 1 "AKI without KRT pneumonia (pre-pandemic)"    ///
>                                                 2 "AKI requiring KRT pneumonia (pre-pandemic)"  ///
>                                                 3 "No AKI COVID-19"                                                             ///
>                                                 4 "AKI without KRT COVID-19"                                    ///
>                                                 5 "AKI requiring KRT COVID-19"

. label values case_krt case_krt

. safetab case_krt, m

                               case_krt |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
        No AKI pneumonia (pre-pandemic) |      8,015       30.14       30.14
AKI without KRT pneumonia (pre-pandemic |      5,233       19.68       49.82
AKI requiring KRT pneumonia (pre-pandem |        286        1.08       50.89
                        No AKI COVID-19 |      7,741       29.11       80.00
               AKI without KRT COVID-19 |      5,066       19.05       99.05
             AKI requiring KRT COVID-19 |        252        0.95      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,593      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(17,440 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(17,450 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(17,433 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(17,399 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(9,194 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(2,714 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(821 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(244 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Pneumonia (pre-pandemic)"    ///
>                                                 1 "COVID pre-vaccination"                       ///
>                                                 2 "COVID 1 vaccine dose"                        ///
>                                                 3 "COVID 2 vaccine doses"                       ///
>                                                 4 "COVID 3 vaccine doses"                       ///
>                                                 5 "COVID 4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "COVID-19 vaccination status"

. safetab covid_vax, m

    COVID-19 vaccination |
                  status |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,534       50.89       50.89
   COVID pre-vaccination |         86        0.32       51.22
    COVID 1 vaccine dose |        244        0.92       52.13
   COVID 2 vaccine doses |        821        3.09       55.22
   COVID 3 vaccine doses |      2,714       10.21       65.43
   COVID 4 vaccine doses |      9,194       34.57      100.00
-------------------------+-----------------------------------
                   Total |     26,593      100.00

. 
. * COVID-19 wave
. gen wave = case

. replace wave = 2 if index_month=="sep2020"
(401 real changes made)

. replace wave = 2 if index_month=="oct2020"
(388 real changes made)

. replace wave = 2 if index_month=="nov2020"
(402 real changes made)

. replace wave = 2 if index_month=="dec2020"
(411 real changes made)

. replace wave = 2 if index_month=="jan2021"
(402 real changes made)

. replace wave = 2 if index_month=="feb2021"
(367 real changes made)

. replace wave = 2 if index_month=="mar2021"
(354 real changes made)

. replace wave = 2 if index_month=="apr2021"
(388 real changes made)

. replace wave = 2 if index_month=="may2021"
(358 real changes made)

. replace wave = 2 if index_month=="jun2021"
(349 real changes made)

. replace wave = 3 if index_month=="jul2021"
(340 real changes made)

. replace wave = 3 if index_month=="aug2021"
(387 real changes made)

. replace wave = 3 if index_month=="sep2021"
(342 real changes made)

. replace wave = 3 if index_month=="oct2021"
(365 real changes made)

. replace wave = 3 if index_month=="nov2021"
(359 real changes made)

. replace wave = 4 if index_month=="dec2021"
(359 real changes made)

. replace wave = 4 if index_month=="jan2022"
(357 real changes made)

. replace wave = 4 if index_month=="feb2022"
(301 real changes made)

. replace wave = 4 if index_month=="mar2022"
(384 real changes made)

. replace wave = 4 if index_month=="apr2022"
(320 real changes made)

. replace wave = 4 if index_month=="may2022"
(354 real changes made)

. replace wave = 4 if index_month=="jun2022"
(340 real changes made)

. replace wave = 4 if index_month=="jul2022"
(345 real changes made)

. replace wave = 4 if index_month=="aug2022"
(328 real changes made)

. replace wave = 4 if index_month=="sep2022"
(291 real changes made)

. replace wave = 4 if index_month=="oct2022"
(311 real changes made)

. label define wave       0 "Pneumonia (pre-pandemic)"    ///
>                                         1 "COVID Feb20-Aug20"   ///
>                                         2 "COVID Sep20-Jun21"   ///
>                                         3 "COVID Jul21-Nov21"   ///
>                                         4 "COVID Dec21-Oct22"   

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m

           COVID-19 wave |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,534       50.89       50.89
       COVID Feb20-Aug20 |      3,756       14.12       65.02
       COVID Sep20-Jun21 |      3,820       14.36       79.38
       COVID Jul21-Nov21 |      1,793        6.74       86.12
       COVID Dec21-Oct22 |      3,690       13.88      100.00
-------------------------+-----------------------------------
                   Total |     26,593      100.00

. 
. * Month
. gen month_string=substr(index_date_string ,3,3)
(1,074 missing values generated)

. gen month = 1 if month_string=="jan"
(25,007 missing values generated)

. replace month = 2 if month_string=="feb"
(2,253 real changes made)

. replace month = 3 if month_string=="mar"
(2,526 real changes made)

. replace month = 4 if month_string=="apr"
(2,298 real changes made)

. replace month = 5 if month_string=="may"
(2,352 real changes made)

. replace month = 6 if month_string=="jun"
(2,331 real changes made)

. replace month = 7 if month_string=="jul"
(2,348 real changes made)

. replace month = 8 if month_string=="aug"
(2,291 real changes made)

. replace month = 9 if month_string=="sep"
(2,167 real changes made)

. replace month = 10 if month_string=="oct"
(2,232 real changes made)

. replace month = 11 if month_string=="nov"
(1,560 real changes made)

. replace month = 12 if month_string=="dec"
(1,575 real changes made)

. drop month_string

. label define month      1 "January"             ///
>                                         2 "February"    ///
>                                         3 "March"               ///
>                                         4 "April"               ///
>                                         5 "May"                 ///
>                                         6 "June"                ///
>                                         7 "July"                ///
>                                         8 "August"              ///
>                                         9 "September"   ///
>                                         10 "October"    ///
>                                         11 "November"   ///
>                                         12 "December"

. label values month month

. safetab month case, m

           |         case
     month | Pneumonia   COVID-19 |     Total
-----------+----------------------+----------
   January |       827        759 |     1,586 
  February |     1,179      1,074 |     2,253 
     March |     1,275      1,251 |     2,526 
     April |     1,162      1,136 |     2,298 
       May |     1,235      1,117 |     2,352 
      June |     1,217      1,114 |     2,331 
      July |     1,240      1,108 |     2,348 
    August |     1,162      1,129 |     2,291 
 September |     1,133      1,034 |     2,167 
   October |     1,168      1,064 |     2,232 
  November |       799        761 |     1,560 
  December |       805        770 |     1,575 
         . |       332        742 |     1,074 
-----------+----------------------+----------
     Total |    13,534     13,059 |    26,593 

. 
. ** Covariates
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        312        1.17        1.17
          1 |        325        1.22        2.40
          2 |        314        1.18        3.58
          3 |        325        1.22        4.80
          4 |        316        1.19        5.99
          5 |        372        1.40        7.39
          6 |        327        1.23        8.62
          7 |        346        1.30        9.92
          8 |        300        1.13       11.04
          9 |        310        1.17       12.21
         10 |        309        1.16       13.37
         11 |        334        1.26       14.63
         12 |        292        1.10       15.73
         13 |        284        1.07       16.79
         14 |        326        1.23       18.02
         15 |        304        1.14       19.16
         16 |        265        1.00       20.16
         17 |        259        0.97       21.13
         18 |        288        1.08       22.22
         19 |        270        1.02       23.23
         20 |        343        1.29       24.52
         21 |        323        1.21       25.74
         22 |        326        1.23       26.96
         23 |        315        1.18       28.15
         24 |        324        1.22       29.36
         25 |        374        1.41       30.77
         26 |        362        1.36       32.13
         27 |        333        1.25       33.38
         28 |        367        1.38       34.76
         29 |        384        1.44       36.21
         30 |        374        1.41       37.62
         31 |        367        1.38       39.00
         32 |        366        1.38       40.37
         33 |        390        1.47       41.84
         34 |        368        1.38       43.22
         35 |        354        1.33       44.55
         36 |        384        1.44       46.00
         37 |        327        1.23       47.23
         38 |        339        1.27       48.50
         39 |        364        1.37       49.87
         40 |        323        1.21       51.08
         41 |        322        1.21       52.30
         42 |        304        1.14       53.44
         43 |        357        1.34       54.78
         44 |        299        1.12       55.91
         45 |        353        1.33       57.23
         46 |        357        1.34       58.58
         47 |        377        1.42       59.99
         48 |        340        1.28       61.27
         49 |        390        1.47       62.74
         50 |        377        1.42       64.16
         51 |        365        1.37       65.53
         52 |        348        1.31       66.84
         53 |        338        1.27       68.11
         54 |        379        1.43       69.53
         55 |        327        1.23       70.76
         56 |        341        1.28       72.05
         57 |        339        1.27       73.32
         58 |        330        1.24       74.56
         59 |        385        1.45       76.01
         60 |        269        1.01       77.02
         61 |        307        1.15       78.17
         62 |        313        1.18       79.35
         63 |        291        1.09       80.45
         64 |        337        1.27       81.71
         65 |        256        0.96       82.68
         66 |        293        1.10       83.78
         67 |        277        1.04       84.82
         68 |        260        0.98       85.80
         69 |        301        1.13       86.93
         70 |        257        0.97       87.90
         71 |        269        1.01       88.91
         72 |        278        1.05       89.95
         73 |        275        1.03       90.99
         74 |        261        0.98       91.97
         75 |        187        0.70       92.67
         76 |        168        0.63       93.30
         77 |        168        0.63       93.93
         78 |        156        0.59       94.52
         79 |        195        0.73       95.25
         80 |        136        0.51       95.77
         81 |        113        0.42       96.19
         82 |        157        0.59       96.78
         83 |        135        0.51       97.29
         84 |        122        0.46       97.75
         85 |         73        0.27       98.02
         86 |         80        0.30       98.32
         87 |         71        0.27       98.59
         88 |         77        0.29       98.88
         89 |         75        0.28       99.16
         90 |         30        0.11       99.27
         91 |         27        0.10       99.38
         92 |         34        0.13       99.50
         93 |         25        0.09       99.60
         94 |         45        0.17       99.77
         95 |          9        0.03       99.80
         96 |         12        0.05       99.85
         97 |         14        0.05       99.90
         98 |          7        0.03       99.92
         99 |          9        0.03       99.96
        100 |          1        0.00       99.96
        101 |          1        0.00       99.97
        103 |          2        0.01       99.97
        105 |          2        0.01       99.98
        107 |          2        0.01       99.99
        108 |          1        0.00       99.99
        109 |          2        0.01      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. safecount
  26,593

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///                                     
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(26268 differences between age and agegroup)

. 
. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label values agegroup agegroup

. label var agegroup "Age group"

. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     13,576       51.05       51.05
       Male |     13,017       48.95      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. safecount
  26,593

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(1,059 real changes made)

. replace ethnicity=2 if ethnicity==3
(961 real changes made)

. replace ethnicity=3 if ethnicity==4
(1,028 real changes made)

. replace ethnicity=4 if ethnicity==6
(1,059 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///                                             
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                                                               

. label values ethnicity ethnicity

. safetab ethnicity, m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     15,907       59.82       59.82
South Asian |        961        3.61       63.43
      Black |      1,028        3.87       67.30
      Mixed |      1,059        3.98       71.28
      Other |        943        3.55       74.82
          . |      6,695       25.18      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(6,695 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(6,695 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. safetab ethnicity1, m

 ethnicity1 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     15,907       59.82       59.82
South Asian |        961        3.61       63.43
      Black |      1,028        3.87       67.30
      Mixed |      1,059        3.98       71.28
      Other |        943        3.55       74.82
    Unknown |      6,695       25.18      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,655        9.98        9.98
                Urban minor conurbation |      2,617        9.84       19.82
                    Urban city and town |      2,759       10.37       30.20
Urban city and town in a sparse setting |      2,695       10.13       40.33
                  Rural town and fringe |      2,653        9.98       50.31
Rural town and fringe in a sparse setti |      2,635        9.91       60.22
            Rural village and dispersed |      5,338       20.07       80.29
Rural village and dispersed in a sparse |      5,241       19.71      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,593      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(26,593 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(10,726 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(15,867 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                                       rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow  Rural tow  Rural vil  Rural vil |     Total
-----------+----------------------------------------------------------------------------------------+----------
     Rural |         0          0          0          0      2,653      2,635      5,338      5,241 |    15,867 
     Urban |     2,655      2,617      2,759      2,695          0          0          0          0 |    10,726 
-----------+----------------------------------------------------------------------------------------+----------
     Total |     2,655      2,617      2,759      2,695      2,653      2,635      5,338      5,241 |    26,593 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Pneumonia (pre-pandem |     7,982      5,552 |    13,534 
             COVID-19 |     7,885      5,174 |    13,059 
----------------------+----------------------+----------
                Total |    15,867     10,726 |    26,593 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,734 real changes made, 2,734 to missing)

. gen     bmi = .
(26,593 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(1642 changes made to bmi)

. recode  bmi . = 2 if body_mass_index<25
(5993 changes made to bmi)

. recode  bmi . = 3 if body_mass_index<30
(6182 changes made to bmi)

. recode  bmi . = 4 if body_mass_index<35
(5303 changes made to bmi)

. recode  bmi . = 5 if body_mass_index<40
(3167 changes made to bmi)

. recode  bmi . = 6 if body_mass_index<.
(1572 changes made to bmi)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                             

. label values bmi bmi

. safetab bmi, m

                 bmi |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,642        6.17        6.17
  Normal (18.5-24.9) |      5,993       22.54       28.71
Overweight (25-29.9) |      6,182       23.25       51.96
   Obese I (30-34.9) |      5,303       19.94       71.90
  Obese II (35-39.9) |      3,167       11.91       83.81
     Obese III (40+) |      1,572        5.91       89.72
                   . |      2,734       10.28      100.00
---------------------+-----------------------------------
               Total |     26,593      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(15,477 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(1,810 real changes made)

. replace smoking = 0 if smoking_status=="N"
(3,795 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |      3,795       14.27       14.27
Current/former smoker |     12,926       48.61       62.88
                    . |      9,872       37.12      100.00
----------------------+-----------------------------------
                Total |     26,593      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000)
(12,441 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(14152 changes made to egfr_group)

. label define egfr_group 1 "≥105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       ≥105 |      4,789       18.01       18.01
     90-104 |      1,890        7.11       25.12
      75-89 |      1,903        7.16       32.27
      60-74 |      2,150        8.08       40.36
      45-59 |      2,090        7.86       48.22
      30-44 |      1,209        4.55       52.76
      15-29 |        121        0.46       53.22
          . |     12,441       46.78      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 15-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(12,441 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(21804 changes made to ckd_stage)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6 "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |     10,732       40.36       40.36
                      CKD 3A |      2,090        7.86       48.22
                      CKD 3B |      1,209        4.55       52.76
                       CKD 4 |        121        0.46       53.22
No baseline eGFR measurement |     12,441       46.78      100.00
-----------------------------+-----------------------------------
                       Total |     26,593      100.00

. 
. * Comorbidities
. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,280       95.06       95.06
          1 |      1,313        4.94      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,057       97.98       97.98
          1 |        536        2.02      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. safetab diabetes

   diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,325       80.19       80.19
          1 |      5,268       19.81      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,343       99.06       99.06
          1 |        250        0.94      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. safetab heart_failure

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,570       96.15       96.15
          1 |      1,023        3.85      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. safetab hiv

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,056       97.98       97.98
          1 |        537        2.02      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. safetab hypertension

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,184       79.66       79.66
          1 |      5,409       20.34      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. safetab non_haem_cancer

non_haem_ca |
       ncer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,059       97.99       97.99
          1 |        534        2.01      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. safetab myocardial_infarction

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,927       89.97       89.97
          1 |      2,666       10.03      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,022       97.85       97.85
          1 |        571        2.15      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,208       94.79       94.79
          1 |      1,385        5.21      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. safetab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,041       97.92       97.92
          1 |        552        2.08      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,068       98.03       98.03
          1 |        525        1.97      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(976 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,443 real changes made)

. replace cardiovascular = 1 if pvd==1
(460 real changes made)

. replace cardiovascular = 1 if stroke==1
(437 real changes made)

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(534 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,341 real changes made)

. replace immunosuppressed = 1 if lupus==1
(488 real changes made)

. safetab cardiovascular

cardiovascu |
        lar |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,964       78.83       78.83
          1 |      5,629       21.17      100.00
------------+-----------------------------------
      Total |     26,593      100.00

. safetab immunosuppressed

immunosuppr |
      essed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,980       90.17       90.17
          1 |      2,613        9.83      100.00
------------+-----------------------------------
      Total |     26,593      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                                 creatinine_mar2017 ///
>                                                                                 creatinine_apr2017 ///
>                                                                                 creatinine_may2017 ///
>                                                                                 creatinine_jun2017 ///
>                                                                                 creatinine_jul2017 ///
>                                                                                 creatinine_aug2017 ///
>                                                                                 creatinine_sep2017 ///
>                                                                                 creatinine_oct2017 ///
>                                                                                 creatinine_nov2017 ///
>                                                                                 creatinine_dec2017 ///
>                                                                                 creatinine_jan2018 ///
>                                                                                 creatinine_feb2018 ///
>                                                                                 creatinine_mar2018 ///
>                                                                                 creatinine_apr2018 ///
>                                                                                 creatinine_may2018 ///
>                                                                                 creatinine_jun2018 ///
>                                                                                 creatinine_jul2018 ///
>                                                                                 creatinine_aug2018 ///
>                                                                                 creatinine_sep2018 ///
>                                                                                 creatinine_oct2018 ///
>                                                                                 creatinine_nov2018 ///
>                                                                                 creatinine_dec2018 ///
>                                                                                 creatinine_jan2019 ///
>                                                                                 creatinine_feb2019 ///
>                                                                                 creatinine_mar2019 ///
>                                                                                 creatinine_apr2019 ///
>                                                                                 creatinine_may2019 ///
>                                                                                 creatinine_jun2019 ///
>                                                                                 creatinine_jul2019 ///
>                                                                                 creatinine_aug2019 ///
>                                                                                 creatinine_sep2019 ///
>                                                                                 creatinine_feb2020 ///
>                                                                                 creatinine_mar2020 ///
>                                                                                 creatinine_apr2020 ///
>                                                                                 creatinine_may2020 ///
>                                                                                 creatinine_jun2020 ///
>                                                                                 creatinine_jul2020 ///
>                                                                                 creatinine_aug2020 ///
>                                                                                 creatinine_sep2020 ///
>                                                                                 creatinine_oct2020 ///
>                                                                                 creatinine_nov2020 ///
>                                                                                 creatinine_dec2020 ///
>                                                                                 creatinine_jan2021 ///
>                                                                                 creatinine_feb2021 ///
>                                                                                 creatinine_mar2021 ///
>                                                                                 creatinine_apr2021 ///
>                                                                                 creatinine_may2021 ///
>                                                                                 creatinine_jun2021 ///
>                                                                                 creatinine_jul2021 ///
>                                                                                 creatinine_aug2021 ///
>                                                                                 creatinine_sep2021 ///
>                                                                                 creatinine_oct2021 ///
>                                                                                 creatinine_nov2021 ///
>                                                                                 creatinine_dec2021 ///
>                                                                                 creatinine_jan2022 ///
>                                                                                 creatinine_feb2022 ///
>                                                                                 creatinine_mar2022 ///
>                                                                                 creatinine_apr2022 ///
>                                                                                 creatinine_may2022 ///
>                                                                                 creatinine_jun2022 ///
>                                                                                 creatinine_jul2022 ///
>                                                                                 creatinine_aug2022 ///
>                                                                                 creatinine_sep2022 ///
>                                                                                 creatinine_oct2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 3000)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex==0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex==1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_monthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(5,923 real changes made, 5,923 to missing)
(18,982 missing values generated)
(26,593 missing values generated)
(3,954 real changes made)
(3,657 real changes made)
(3,954 real changes made)
(3,657 real changes made)
(4,796 real changes made)
(26,593 missing values generated)
(3,954 real changes made)
(3,657 real changes made)
(7,611 real changes made)
(21,797 real changes made)
(18,982 missing values generated)
(7,519 real changes made)
(3,954 real changes made)
(6,034 real changes made, 6,034 to missing)
(19,093 missing values generated)
(26,593 missing values generated)
(3,801 real changes made)
(3,699 real changes made)
(3,801 real changes made)
(3,699 real changes made)
(4,683 real changes made)
(26,593 missing values generated)
(3,801 real changes made)
(3,699 real changes made)
(7,500 real changes made)
(21,910 real changes made)
(19,093 missing values generated)
(7,421 real changes made)
(3,801 real changes made)
(5,929 real changes made, 5,929 to missing)
(18,988 missing values generated)
(26,593 missing values generated)
(3,893 real changes made)
(3,712 real changes made)
(3,893 real changes made)
(3,712 real changes made)
(4,862 real changes made)
(26,593 missing values generated)
(3,893 real changes made)
(3,712 real changes made)
(7,605 real changes made)
(21,731 real changes made)
(18,988 missing values generated)
(7,514 real changes made)
(3,893 real changes made)
(5,992 real changes made, 5,992 to missing)
(19,051 missing values generated)
(26,593 missing values generated)
(3,915 real changes made)
(3,627 real changes made)
(3,915 real changes made)
(3,627 real changes made)
(4,806 real changes made)
(26,593 missing values generated)
(3,915 real changes made)
(3,627 real changes made)
(7,542 real changes made)
(21,787 real changes made)
(19,051 missing values generated)
(7,449 real changes made)
(3,915 real changes made)
(6,048 real changes made, 6,048 to missing)
(19,107 missing values generated)
(26,593 missing values generated)
(3,859 real changes made)
(3,627 real changes made)
(3,859 real changes made)
(3,627 real changes made)
(4,724 real changes made)
(26,593 missing values generated)
(3,859 real changes made)
(3,627 real changes made)
(7,486 real changes made)
(21,869 real changes made)
(19,107 missing values generated)
(7,396 real changes made)
(3,859 real changes made)
(6,023 real changes made, 6,023 to missing)
(19,082 missing values generated)
(26,593 missing values generated)
(3,863 real changes made)
(3,648 real changes made)
(3,863 real changes made)
(3,648 real changes made)
(4,812 real changes made)
(26,593 missing values generated)
(3,863 real changes made)
(3,648 real changes made)
(7,511 real changes made)
(21,781 real changes made)
(19,082 missing values generated)
(7,429 real changes made)
(3,863 real changes made)
(5,975 real changes made, 5,975 to missing)
(19,034 missing values generated)
(26,593 missing values generated)
(3,881 real changes made)
(3,678 real changes made)
(3,881 real changes made)
(3,678 real changes made)
(4,764 real changes made)
(26,593 missing values generated)
(3,881 real changes made)
(3,678 real changes made)
(7,559 real changes made)
(21,829 real changes made)
(19,034 missing values generated)
(7,473 real changes made)
(3,881 real changes made)
(5,894 real changes made, 5,894 to missing)
(18,953 missing values generated)
(26,593 missing values generated)
(3,929 real changes made)
(3,711 real changes made)
(3,929 real changes made)
(3,711 real changes made)
(4,800 real changes made)
(26,593 missing values generated)
(3,929 real changes made)
(3,711 real changes made)
(7,640 real changes made)
(21,793 real changes made)
(18,953 missing values generated)
(7,554 real changes made)
(3,929 real changes made)
(5,965 real changes made, 5,965 to missing)
(19,024 missing values generated)
(26,593 missing values generated)
(3,844 real changes made)
(3,725 real changes made)
(3,844 real changes made)
(3,725 real changes made)
(4,865 real changes made)
(26,593 missing values generated)
(3,844 real changes made)
(3,725 real changes made)
(7,569 real changes made)
(21,728 real changes made)
(19,024 missing values generated)
(7,485 real changes made)
(3,844 real changes made)
(5,941 real changes made, 5,941 to missing)
(19,000 missing values generated)
(26,593 missing values generated)
(3,910 real changes made)
(3,683 real changes made)
(3,910 real changes made)
(3,683 real changes made)
(4,763 real changes made)
(26,593 missing values generated)
(3,910 real changes made)
(3,683 real changes made)
(7,593 real changes made)
(21,830 real changes made)
(19,000 missing values generated)
(7,507 real changes made)
(3,910 real changes made)
(5,936 real changes made, 5,936 to missing)
(18,995 missing values generated)
(26,593 missing values generated)
(3,879 real changes made)
(3,719 real changes made)
(3,879 real changes made)
(3,719 real changes made)
(4,805 real changes made)
(26,593 missing values generated)
(3,879 real changes made)
(3,719 real changes made)
(7,598 real changes made)
(21,788 real changes made)
(18,995 missing values generated)
(7,511 real changes made)
(3,879 real changes made)
(5,934 real changes made, 5,934 to missing)
(18,993 missing values generated)
(26,593 missing values generated)
(3,873 real changes made)
(3,727 real changes made)
(3,873 real changes made)
(3,727 real changes made)
(4,814 real changes made)
(26,593 missing values generated)
(3,873 real changes made)
(3,727 real changes made)
(7,600 real changes made)
(21,779 real changes made)
(18,993 missing values generated)
(7,506 real changes made)
(3,873 real changes made)
(5,919 real changes made, 5,919 to missing)
(18,978 missing values generated)
(26,593 missing values generated)
(3,892 real changes made)
(3,723 real changes made)
(3,892 real changes made)
(3,723 real changes made)
(4,854 real changes made)
(26,593 missing values generated)
(3,892 real changes made)
(3,723 real changes made)
(7,615 real changes made)
(21,739 real changes made)
(18,978 missing values generated)
(7,538 real changes made)
(3,892 real changes made)
(5,892 real changes made, 5,892 to missing)
(18,951 missing values generated)
(26,593 missing values generated)
(3,892 real changes made)
(3,750 real changes made)
(3,892 real changes made)
(3,750 real changes made)
(4,831 real changes made)
(26,593 missing values generated)
(3,892 real changes made)
(3,750 real changes made)
(7,642 real changes made)
(21,762 real changes made)
(18,951 missing values generated)
(7,547 real changes made)
(3,892 real changes made)
(5,963 real changes made, 5,963 to missing)
(19,022 missing values generated)
(26,593 missing values generated)
(3,865 real changes made)
(3,706 real changes made)
(3,865 real changes made)
(3,706 real changes made)
(4,843 real changes made)
(26,593 missing values generated)
(3,865 real changes made)
(3,706 real changes made)
(7,571 real changes made)
(21,750 real changes made)
(19,022 missing values generated)
(7,485 real changes made)
(3,865 real changes made)
(6,029 real changes made, 6,029 to missing)
(19,088 missing values generated)
(26,593 missing values generated)
(3,944 real changes made)
(3,561 real changes made)
(3,944 real changes made)
(3,561 real changes made)
(4,779 real changes made)
(26,593 missing values generated)
(3,944 real changes made)
(3,561 real changes made)
(7,505 real changes made)
(21,814 real changes made)
(19,088 missing values generated)
(7,406 real changes made)
(3,944 real changes made)
(5,932 real changes made, 5,932 to missing)
(18,991 missing values generated)
(26,593 missing values generated)
(3,900 real changes made)
(3,702 real changes made)
(3,900 real changes made)
(3,702 real changes made)
(4,879 real changes made)
(26,593 missing values generated)
(3,900 real changes made)
(3,702 real changes made)
(7,602 real changes made)
(21,714 real changes made)
(18,991 missing values generated)
(7,505 real changes made)
(3,900 real changes made)
(5,973 real changes made, 5,973 to missing)
(19,032 missing values generated)
(26,593 missing values generated)
(3,806 real changes made)
(3,755 real changes made)
(3,806 real changes made)
(3,755 real changes made)
(4,767 real changes made)
(26,593 missing values generated)
(3,806 real changes made)
(3,755 real changes made)
(7,561 real changes made)
(21,826 real changes made)
(19,032 missing values generated)
(7,471 real changes made)
(3,806 real changes made)
(5,879 real changes made, 5,879 to missing)
(18,938 missing values generated)
(26,593 missing values generated)
(3,923 real changes made)
(3,732 real changes made)
(3,923 real changes made)
(3,732 real changes made)
(4,865 real changes made)
(26,593 missing values generated)
(3,923 real changes made)
(3,732 real changes made)
(7,655 real changes made)
(21,728 real changes made)
(18,938 missing values generated)
(7,558 real changes made)
(3,923 real changes made)
(5,935 real changes made, 5,935 to missing)
(18,994 missing values generated)
(26,593 missing values generated)
(3,854 real changes made)
(3,745 real changes made)
(3,854 real changes made)
(3,745 real changes made)
(4,788 real changes made)
(26,593 missing values generated)
(3,854 real changes made)
(3,745 real changes made)
(7,599 real changes made)
(21,805 real changes made)
(18,994 missing values generated)
(7,507 real changes made)
(3,854 real changes made)
(6,002 real changes made, 6,002 to missing)
(19,061 missing values generated)
(26,593 missing values generated)
(3,859 real changes made)
(3,673 real changes made)
(3,859 real changes made)
(3,673 real changes made)
(4,763 real changes made)
(26,593 missing values generated)
(3,859 real changes made)
(3,673 real changes made)
(7,532 real changes made)
(21,830 real changes made)
(19,061 missing values generated)
(7,446 real changes made)
(3,859 real changes made)
(5,893 real changes made, 5,893 to missing)
(18,952 missing values generated)
(26,593 missing values generated)
(3,924 real changes made)
(3,717 real changes made)
(3,924 real changes made)
(3,717 real changes made)
(4,805 real changes made)
(26,593 missing values generated)
(3,924 real changes made)
(3,717 real changes made)
(7,641 real changes made)
(21,788 real changes made)
(18,952 missing values generated)
(7,551 real changes made)
(3,924 real changes made)
(5,906 real changes made, 5,906 to missing)
(18,965 missing values generated)
(26,593 missing values generated)
(3,829 real changes made)
(3,799 real changes made)
(3,829 real changes made)
(3,799 real changes made)
(4,825 real changes made)
(26,593 missing values generated)
(3,829 real changes made)
(3,799 real changes made)
(7,628 real changes made)
(21,768 real changes made)
(18,965 missing values generated)
(7,536 real changes made)
(3,829 real changes made)
(5,965 real changes made, 5,965 to missing)
(19,024 missing values generated)
(26,593 missing values generated)
(3,873 real changes made)
(3,696 real changes made)
(3,873 real changes made)
(3,696 real changes made)
(4,772 real changes made)
(26,593 missing values generated)
(3,873 real changes made)
(3,696 real changes made)
(7,569 real changes made)
(21,821 real changes made)
(19,024 missing values generated)
(7,480 real changes made)
(3,873 real changes made)
(5,929 real changes made, 5,929 to missing)
(18,988 missing values generated)
(26,593 missing values generated)
(3,932 real changes made)
(3,673 real changes made)
(3,932 real changes made)
(3,673 real changes made)
(4,791 real changes made)
(26,593 missing values generated)
(3,932 real changes made)
(3,673 real changes made)
(7,605 real changes made)
(21,802 real changes made)
(18,988 missing values generated)
(7,515 real changes made)
(3,932 real changes made)
(5,970 real changes made, 5,970 to missing)
(19,029 missing values generated)
(26,593 missing values generated)
(3,878 real changes made)
(3,686 real changes made)
(3,878 real changes made)
(3,686 real changes made)
(4,704 real changes made)
(26,593 missing values generated)
(3,878 real changes made)
(3,686 real changes made)
(7,564 real changes made)
(21,889 real changes made)
(19,029 missing values generated)
(7,467 real changes made)
(3,878 real changes made)
(5,960 real changes made, 5,960 to missing)
(19,019 missing values generated)
(26,593 missing values generated)
(3,893 real changes made)
(3,681 real changes made)
(3,893 real changes made)
(3,681 real changes made)
(4,811 real changes made)
(26,593 missing values generated)
(3,893 real changes made)
(3,681 real changes made)
(7,574 real changes made)
(21,782 real changes made)
(19,019 missing values generated)
(7,476 real changes made)
(3,893 real changes made)
(5,880 real changes made, 5,880 to missing)
(18,939 missing values generated)
(26,593 missing values generated)
(3,964 real changes made)
(3,690 real changes made)
(3,964 real changes made)
(3,690 real changes made)
(4,904 real changes made)
(26,593 missing values generated)
(3,964 real changes made)
(3,690 real changes made)
(7,654 real changes made)
(21,689 real changes made)
(18,939 missing values generated)
(7,556 real changes made)
(3,964 real changes made)
(6,044 real changes made, 6,044 to missing)
(19,103 missing values generated)
(26,593 missing values generated)
(3,806 real changes made)
(3,684 real changes made)
(3,806 real changes made)
(3,684 real changes made)
(4,673 real changes made)
(26,593 missing values generated)
(3,806 real changes made)
(3,684 real changes made)
(7,490 real changes made)
(21,920 real changes made)
(19,103 missing values generated)
(7,405 real changes made)
(3,806 real changes made)
(5,942 real changes made, 5,942 to missing)
(19,001 missing values generated)
(26,593 missing values generated)
(3,890 real changes made)
(3,702 real changes made)
(3,890 real changes made)
(3,702 real changes made)
(4,828 real changes made)
(26,593 missing values generated)
(3,890 real changes made)
(3,702 real changes made)
(7,592 real changes made)
(21,765 real changes made)
(19,001 missing values generated)
(7,493 real changes made)
(3,890 real changes made)
(5,945 real changes made, 5,945 to missing)
(19,004 missing values generated)
(26,593 missing values generated)
(3,882 real changes made)
(3,707 real changes made)
(3,882 real changes made)
(3,707 real changes made)
(4,866 real changes made)
(26,593 missing values generated)
(3,882 real changes made)
(3,707 real changes made)
(7,589 real changes made)
(21,727 real changes made)
(19,004 missing values generated)
(7,505 real changes made)
(3,882 real changes made)
(5,926 real changes made, 5,926 to missing)
(18,985 missing values generated)
(26,593 missing values generated)
(3,865 real changes made)
(3,743 real changes made)
(3,865 real changes made)
(3,743 real changes made)
(4,825 real changes made)
(26,593 missing values generated)
(3,865 real changes made)
(3,743 real changes made)
(7,608 real changes made)
(21,768 real changes made)
(18,985 missing values generated)
(7,512 real changes made)
(3,865 real changes made)
(5,804 real changes made, 5,804 to missing)
(19,338 missing values generated)
(26,593 missing values generated)
(3,695 real changes made)
(3,560 real changes made)
(3,695 real changes made)
(3,560 real changes made)
(4,635 real changes made)
(26,593 missing values generated)
(3,695 real changes made)
(3,560 real changes made)
(7,255 real changes made)
(21,958 real changes made)
(19,338 missing values generated)
(7,164 real changes made)
(3,695 real changes made)
(5,729 real changes made, 5,729 to missing)
(19,263 missing values generated)
(26,593 missing values generated)
(3,734 real changes made)
(3,596 real changes made)
(3,734 real changes made)
(3,596 real changes made)
(4,663 real changes made)
(26,593 missing values generated)
(3,734 real changes made)
(3,596 real changes made)
(7,330 real changes made)
(21,930 real changes made)
(19,263 missing values generated)
(7,245 real changes made)
(3,734 real changes made)
(5,666 real changes made, 5,666 to missing)
(19,200 missing values generated)
(26,593 missing values generated)
(3,758 real changes made)
(3,635 real changes made)
(3,758 real changes made)
(3,635 real changes made)
(4,611 real changes made)
(26,593 missing values generated)
(3,758 real changes made)
(3,635 real changes made)
(7,393 real changes made)
(21,982 real changes made)
(19,200 missing values generated)
(7,308 real changes made)
(3,758 real changes made)
(5,758 real changes made, 5,758 to missing)
(19,292 missing values generated)
(26,593 missing values generated)
(3,707 real changes made)
(3,594 real changes made)
(3,707 real changes made)
(3,594 real changes made)
(4,667 real changes made)
(26,593 missing values generated)
(3,707 real changes made)
(3,594 real changes made)
(7,301 real changes made)
(21,926 real changes made)
(19,292 missing values generated)
(7,208 real changes made)
(3,707 real changes made)
(5,746 real changes made, 5,746 to missing)
(19,280 missing values generated)
(26,593 missing values generated)
(3,710 real changes made)
(3,603 real changes made)
(3,710 real changes made)
(3,603 real changes made)
(4,618 real changes made)
(26,593 missing values generated)
(3,710 real changes made)
(3,603 real changes made)
(7,313 real changes made)
(21,975 real changes made)
(19,280 missing values generated)
(7,236 real changes made)
(3,710 real changes made)
(5,826 real changes made, 5,826 to missing)
(19,360 missing values generated)
(26,593 missing values generated)
(3,738 real changes made)
(3,495 real changes made)
(3,738 real changes made)
(3,495 real changes made)
(4,586 real changes made)
(26,593 missing values generated)
(3,738 real changes made)
(3,495 real changes made)
(7,233 real changes made)
(22,007 real changes made)
(19,360 missing values generated)
(7,145 real changes made)
(3,738 real changes made)
(5,841 real changes made, 5,841 to missing)
(19,375 missing values generated)
(26,593 missing values generated)
(3,655 real changes made)
(3,563 real changes made)
(3,655 real changes made)
(3,563 real changes made)
(4,553 real changes made)
(26,593 missing values generated)
(3,655 real changes made)
(3,563 real changes made)
(7,218 real changes made)
(22,040 real changes made)
(19,375 missing values generated)
(7,135 real changes made)
(3,655 real changes made)
(5,750 real changes made, 5,750 to missing)
(19,284 missing values generated)
(26,593 missing values generated)
(3,678 real changes made)
(3,631 real changes made)
(3,678 real changes made)
(3,631 real changes made)
(4,633 real changes made)
(26,593 missing values generated)
(3,678 real changes made)
(3,631 real changes made)
(7,309 real changes made)
(21,960 real changes made)
(19,284 missing values generated)
(7,227 real changes made)
(3,678 real changes made)
(5,724 real changes made, 5,724 to missing)
(19,258 missing values generated)
(26,593 missing values generated)
(3,695 real changes made)
(3,640 real changes made)
(3,695 real changes made)
(3,640 real changes made)
(4,601 real changes made)
(26,593 missing values generated)
(3,695 real changes made)
(3,640 real changes made)
(7,335 real changes made)
(21,992 real changes made)
(19,258 missing values generated)
(7,253 real changes made)
(3,695 real changes made)
(5,743 real changes made, 5,743 to missing)
(19,277 missing values generated)
(26,593 missing values generated)
(3,711 real changes made)
(3,605 real changes made)
(3,711 real changes made)
(3,605 real changes made)
(4,603 real changes made)
(26,593 missing values generated)
(3,711 real changes made)
(3,605 real changes made)
(7,316 real changes made)
(21,990 real changes made)
(19,277 missing values generated)
(7,235 real changes made)
(3,711 real changes made)
(5,786 real changes made, 5,786 to missing)
(19,320 missing values generated)
(26,593 missing values generated)
(3,732 real changes made)
(3,541 real changes made)
(3,732 real changes made)
(3,541 real changes made)
(4,547 real changes made)
(26,593 missing values generated)
(3,732 real changes made)
(3,541 real changes made)
(7,273 real changes made)
(22,046 real changes made)
(19,320 missing values generated)
(7,177 real changes made)
(3,732 real changes made)
(5,675 real changes made, 5,675 to missing)
(19,209 missing values generated)
(26,593 missing values generated)
(3,811 real changes made)
(3,573 real changes made)
(3,811 real changes made)
(3,573 real changes made)
(4,688 real changes made)
(26,593 missing values generated)
(3,811 real changes made)
(3,573 real changes made)
(7,384 real changes made)
(21,905 real changes made)
(19,209 missing values generated)
(7,294 real changes made)
(3,811 real changes made)
(5,749 real changes made, 5,749 to missing)
(19,283 missing values generated)
(26,593 missing values generated)
(3,731 real changes made)
(3,579 real changes made)
(3,731 real changes made)
(3,579 real changes made)
(4,607 real changes made)
(26,593 missing values generated)
(3,731 real changes made)
(3,579 real changes made)
(7,310 real changes made)
(21,986 real changes made)
(19,283 missing values generated)
(7,214 real changes made)
(3,731 real changes made)
(5,756 real changes made, 5,756 to missing)
(19,290 missing values generated)
(26,593 missing values generated)
(3,670 real changes made)
(3,633 real changes made)
(3,670 real changes made)
(3,633 real changes made)
(4,652 real changes made)
(26,593 missing values generated)
(3,670 real changes made)
(3,633 real changes made)
(7,303 real changes made)
(21,941 real changes made)
(19,290 missing values generated)
(7,226 real changes made)
(3,670 real changes made)
(5,761 real changes made, 5,761 to missing)
(19,295 missing values generated)
(26,593 missing values generated)
(3,729 real changes made)
(3,569 real changes made)
(3,729 real changes made)
(3,569 real changes made)
(4,646 real changes made)
(26,593 missing values generated)
(3,729 real changes made)
(3,569 real changes made)
(7,298 real changes made)
(21,947 real changes made)
(19,295 missing values generated)
(7,207 real changes made)
(3,729 real changes made)
(5,717 real changes made, 5,717 to missing)
(19,251 missing values generated)
(26,593 missing values generated)
(3,732 real changes made)
(3,610 real changes made)
(3,732 real changes made)
(3,610 real changes made)
(4,702 real changes made)
(26,593 missing values generated)
(3,732 real changes made)
(3,610 real changes made)
(7,342 real changes made)
(21,891 real changes made)
(19,251 missing values generated)
(7,260 real changes made)
(3,732 real changes made)
(5,737 real changes made, 5,737 to missing)
(19,271 missing values generated)
(26,593 missing values generated)
(3,723 real changes made)
(3,599 real changes made)
(3,723 real changes made)
(3,599 real changes made)
(4,571 real changes made)
(26,593 missing values generated)
(3,723 real changes made)
(3,599 real changes made)
(7,322 real changes made)
(22,022 real changes made)
(19,271 missing values generated)
(7,239 real changes made)
(3,723 real changes made)
(5,773 real changes made, 5,773 to missing)
(19,307 missing values generated)
(26,593 missing values generated)
(3,692 real changes made)
(3,594 real changes made)
(3,692 real changes made)
(3,594 real changes made)
(4,661 real changes made)
(26,593 missing values generated)
(3,692 real changes made)
(3,594 real changes made)
(7,286 real changes made)
(21,932 real changes made)
(19,307 missing values generated)
(7,202 real changes made)
(3,692 real changes made)
(5,701 real changes made, 5,701 to missing)
(19,235 missing values generated)
(26,593 missing values generated)
(3,764 real changes made)
(3,594 real changes made)
(3,764 real changes made)
(3,594 real changes made)
(4,663 real changes made)
(26,593 missing values generated)
(3,764 real changes made)
(3,594 real changes made)
(7,358 real changes made)
(21,930 real changes made)
(19,235 missing values generated)
(7,274 real changes made)
(3,764 real changes made)
(5,783 real changes made, 5,783 to missing)
(19,317 missing values generated)
(26,593 missing values generated)
(3,719 real changes made)
(3,557 real changes made)
(3,719 real changes made)
(3,557 real changes made)
(4,624 real changes made)
(26,593 missing values generated)
(3,719 real changes made)
(3,557 real changes made)
(7,276 real changes made)
(21,969 real changes made)
(19,317 missing values generated)
(7,186 real changes made)
(3,719 real changes made)
(5,741 real changes made, 5,741 to missing)
(19,275 missing values generated)
(26,593 missing values generated)
(3,717 real changes made)
(3,601 real changes made)
(3,717 real changes made)
(3,601 real changes made)
(4,654 real changes made)
(26,593 missing values generated)
(3,717 real changes made)
(3,601 real changes made)
(7,318 real changes made)
(21,939 real changes made)
(19,275 missing values generated)
(7,244 real changes made)
(3,717 real changes made)
(5,761 real changes made, 5,761 to missing)
(19,295 missing values generated)
(26,593 missing values generated)
(3,737 real changes made)
(3,561 real changes made)
(3,737 real changes made)
(3,561 real changes made)
(4,526 real changes made)
(26,593 missing values generated)
(3,737 real changes made)
(3,561 real changes made)
(7,298 real changes made)
(22,067 real changes made)
(19,295 missing values generated)
(7,214 real changes made)
(3,737 real changes made)
(5,716 real changes made, 5,716 to missing)
(19,250 missing values generated)
(26,593 missing values generated)
(3,717 real changes made)
(3,626 real changes made)
(3,717 real changes made)
(3,626 real changes made)
(4,700 real changes made)
(26,593 missing values generated)
(3,717 real changes made)
(3,626 real changes made)
(7,343 real changes made)
(21,893 real changes made)
(19,250 missing values generated)
(7,250 real changes made)
(3,717 real changes made)
(5,700 real changes made, 5,700 to missing)
(19,234 missing values generated)
(26,593 missing values generated)
(3,707 real changes made)
(3,652 real changes made)
(3,707 real changes made)
(3,652 real changes made)
(4,604 real changes made)
(26,593 missing values generated)
(3,707 real changes made)
(3,652 real changes made)
(7,359 real changes made)
(21,989 real changes made)
(19,234 missing values generated)
(7,271 real changes made)
(3,707 real changes made)
(5,770 real changes made, 5,770 to missing)
(19,304 missing values generated)
(26,593 missing values generated)
(3,757 real changes made)
(3,532 real changes made)
(3,757 real changes made)
(3,532 real changes made)
(4,661 real changes made)
(26,593 missing values generated)
(3,757 real changes made)
(3,532 real changes made)
(7,289 real changes made)
(21,932 real changes made)
(19,304 missing values generated)
(7,200 real changes made)
(3,757 real changes made)
(5,759 real changes made, 5,759 to missing)
(19,293 missing values generated)
(26,593 missing values generated)
(3,727 real changes made)
(3,573 real changes made)
(3,727 real changes made)
(3,573 real changes made)
(4,633 real changes made)
(26,593 missing values generated)
(3,727 real changes made)
(3,573 real changes made)
(7,300 real changes made)
(21,960 real changes made)
(19,293 missing values generated)
(7,203 real changes made)
(3,727 real changes made)
(5,711 real changes made, 5,711 to missing)
(19,245 missing values generated)
(26,593 missing values generated)
(3,749 real changes made)
(3,599 real changes made)
(3,749 real changes made)
(3,599 real changes made)
(4,623 real changes made)
(26,593 missing values generated)
(3,749 real changes made)
(3,599 real changes made)
(7,348 real changes made)
(21,970 real changes made)
(19,245 missing values generated)
(7,259 real changes made)
(3,749 real changes made)
(5,787 real changes made, 5,787 to missing)
(19,321 missing values generated)
(26,593 missing values generated)
(3,708 real changes made)
(3,564 real changes made)
(3,708 real changes made)
(3,564 real changes made)
(4,603 real changes made)
(26,593 missing values generated)
(3,708 real changes made)
(3,564 real changes made)
(7,272 real changes made)
(21,990 real changes made)
(19,321 missing values generated)
(7,189 real changes made)
(3,708 real changes made)
(5,787 real changes made, 5,787 to missing)
(19,321 missing values generated)
(26,593 missing values generated)
(3,711 real changes made)
(3,561 real changes made)
(3,711 real changes made)
(3,561 real changes made)
(4,643 real changes made)
(26,593 missing values generated)
(3,711 real changes made)
(3,561 real changes made)
(7,272 real changes made)
(21,950 real changes made)
(19,321 missing values generated)
(7,189 real changes made)
(3,711 real changes made)
(5,693 real changes made, 5,693 to missing)
(19,227 missing values generated)
(26,593 missing values generated)
(3,772 real changes made)
(3,594 real changes made)
(3,772 real changes made)
(3,594 real changes made)
(4,662 real changes made)
(26,593 missing values generated)
(3,772 real changes made)
(3,594 real changes made)
(7,366 real changes made)
(21,931 real changes made)
(19,227 missing values generated)
(7,295 real changes made)
(3,772 real changes made)
(5,671 real changes made, 5,671 to missing)
(19,205 missing values generated)
(26,593 missing values generated)
(3,800 real changes made)
(3,588 real changes made)
(3,800 real changes made)
(3,588 real changes made)
(4,618 real changes made)
(26,593 missing values generated)
(3,800 real changes made)
(3,588 real changes made)
(7,388 real changes made)
(21,975 real changes made)
(19,205 missing values generated)
(7,304 real changes made)
(3,800 real changes made)
(5,723 real changes made, 5,723 to missing)
(19,257 missing values generated)
(26,593 missing values generated)
(3,733 real changes made)
(3,603 real changes made)
(3,733 real changes made)
(3,603 real changes made)
(4,656 real changes made)
(26,593 missing values generated)
(3,733 real changes made)
(3,603 real changes made)
(7,336 real changes made)
(21,937 real changes made)
(19,257 missing values generated)
(7,249 real changes made)
(3,733 real changes made)
(5,676 real changes made, 5,676 to missing)
(19,210 missing values generated)
(26,593 missing values generated)
(3,745 real changes made)
(3,638 real changes made)
(3,745 real changes made)
(3,638 real changes made)
(4,701 real changes made)
(26,593 missing values generated)
(3,745 real changes made)
(3,638 real changes made)
(7,383 real changes made)
(21,892 real changes made)
(19,210 missing values generated)
(7,300 real changes made)
(3,745 real changes made)

. 
. replace index_date = index_date_28
(25,519 real changes made)

. drop index_date_28

. gen egfr15_date=.
(26,593 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatinine_`x'<15 & date("01`x'", "DMY")>=index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen esrd_date = egfr15_date
(26,592 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if esrd_date==.
(2,039 real changes made)

. gen esrd = 0

. replace esrd = 1 if esrd_date!=.
(2,040 real changes made)

. label var esrd "Kidney failure"

. gen esrd_time = (esrd_date - index_date)
(24,553 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(24,553 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(2037 changes made to esrd_time_cat)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"                      ///
>                                                         3 "1 to 28 days"        ///
>                                                         4 "20 to 90 days"       ///
>                                                         5 "91 to 180 days"      ///
>                                                         6 "181 to 365 days"     ///
>                                                         7 "366 to 730 days"     ///
>                                                         8 "731 to 973 days"     ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 critical_care   ///
>                                                                 krt             {
  2.                                                                 by `exposure',sort: sum esrd_time, de
  3.                                                                 tab esrd_time_cat `exposure', m col chi
  4.                                                                 }

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Pneumonia (pre-pandemic)

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           37              0       Obs               1,050
25%          136              0       Sum of wgt.       1,050

50%        290.5                      Mean           334.3762
                        Largest       Std. dev.      241.5693
75%          516            963
90%        687.5            969       Variance       58355.72
95%          773            970       Skewness       .5323196
99%          904            978       Kurtosis        2.38398

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           25              0       Obs                 990
25%          112              0       Sum of wgt.         990

50%        282.5                      Mean           320.9576
                        Largest       Std. dev.      239.8143
75%          508            923
90%          673            926       Variance       57510.88
95%          752            933       Skewness        .484885
99%          891            949       Kurtosis       2.240991


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Pneumonia   COVID-19 |     Total
----------------+----------------------+----------
         0 days |        55         51 |       106 
                |      0.41       0.39 |      0.40 
----------------+----------------------+----------
   1 to 28 days |        38         58 |        96 
                |      0.28       0.44 |      0.36 
----------------+----------------------+----------
  20 to 90 days |        88        105 |       193 
                |      0.65       0.80 |      0.73 
----------------+----------------------+----------
 91 to 180 days |       161        132 |       293 
                |      1.19       1.01 |      1.10 
----------------+----------------------+----------
181 to 365 days |       284        251 |       535 
                |      2.10       1.92 |      2.01 
----------------+----------------------+----------
366 to 730 days |       348        335 |       683 
                |      2.57       2.57 |      2.57 
----------------+----------------------+----------
731 to 973 days |        75         58 |       133 
                |      0.55       0.44 |      0.50 
----------------+----------------------+----------
      >973 days |         1          0 |         1 
                |      0.01       0.00 |      0.00 
----------------+----------------------+----------
              . |    12,484     12,069 |    24,553 
                |     92.24      92.42 |     92.33 
----------------+----------------------+----------
          Total |    13,534     13,059 |    26,593 
                |    100.00     100.00 |    100.00 

          Pearson chi2(8) =  12.6753   Pr = 0.124

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> critical_care = Ward-based

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           33              0       Obs               1,837
25%          125              0       Sum of wgt.       1,837

50%          286                      Mean            327.521
                        Largest       Std. dev.      240.8131
75%          511            963
90%          680            969       Variance       57990.93
95%          766            970       Skewness       .5223131
99%          894            978       Kurtosis       2.329626

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> critical_care = Critical care

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           15              0       Obs                 203
25%          138              0       Sum of wgt.         203

50%          296                      Mean           330.9704
                        Largest       Std. dev.       240.787
75%          525            865
90%          662            891       Variance       57978.36
95%          735            915       Skewness       .3939389
99%          891            927       Kurtosis       2.239388


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |     Critical care
  esrd_time_cat | Ward-base  Critical  |     Total
----------------+----------------------+----------
         0 days |        93         13 |       106 
                |      0.39       0.50 |      0.40 
----------------+----------------------+----------
   1 to 28 days |        81         15 |        96 
                |      0.34       0.57 |      0.36 
----------------+----------------------+----------
  20 to 90 days |       179         14 |       193 
                |      0.75       0.54 |      0.73 
----------------+----------------------+----------
 91 to 180 days |       273         20 |       293 
                |      1.14       0.77 |      1.10 
----------------+----------------------+----------
181 to 365 days |       478         57 |       535 
                |      1.99       2.18 |      2.01 
----------------+----------------------+----------
366 to 730 days |       610         73 |       683 
                |      2.54       2.79 |      2.57 
----------------+----------------------+----------
731 to 973 days |       122         11 |       133 
                |      0.51       0.42 |      0.50 
----------------+----------------------+----------
      >973 days |         1          0 |         1 
                |      0.00       0.00 |      0.00 
----------------+----------------------+----------
              . |    22,143      2,410 |    24,553 
                |     92.34      92.23 |     92.33 
----------------+----------------------+----------
          Total |    23,980      2,613 |    26,593 
                |    100.00     100.00 |    100.00 

          Pearson chi2(8) =  10.2343   Pr = 0.249

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = No AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           25              0       Obs               1,193
25%          121              0       Sum of wgt.       1,193

50%          287                      Mean           327.7435
                        Largest       Std. dev.      244.0192
75%          511            940
90%          679            949       Variance       59545.38
95%          774            963       Skewness       .5235282
99%          915            978       Kurtosis       2.340374

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = AKI without KRT

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            7              0
10%           35              0       Obs                 806
25%          127              0       Sum of wgt.         806

50%        293.5                      Mean            327.732
                        Largest       Std. dev.      236.6472
75%          514            926
90%          680            933       Variance        56001.9
95%          746            969       Skewness       .4867999
99%          880            970       Kurtosis       2.281692

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = AKI requiring KRT

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%           20             20
 5%           22             22
10%           42             22       Obs                  41
25%          167             36       Sum of wgt.          41

50%          262                      Mean           333.9756
                        Largest       Std. dev.      230.4327
75%          519            672
90%          658            718       Variance       53099.22
95%          718            745       Skewness       .5103697
99%          891            891       Kurtosis       2.268057


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |    Kidney replacement therapy
  esrd_time_cat |    No AKI  AKI witho  AKI requi |     Total
----------------+---------------------------------+----------
         0 days |        70         36          0 |       106 
                |      0.44       0.35       0.00 |      0.40 
----------------+---------------------------------+----------
   1 to 28 days |        56         37          3 |        96 
                |      0.36       0.36       0.56 |      0.36 
----------------+---------------------------------+----------
  20 to 90 days |       106         84          3 |       193 
                |      0.67       0.82       0.56 |      0.73 
----------------+---------------------------------+----------
 91 to 180 days |       183        103          7 |       293 
                |      1.16       1.00       1.30 |      1.10 
----------------+---------------------------------+----------
181 to 365 days |       296        227         12 |       535 
                |      1.88       2.20       2.23 |      2.01 
----------------+---------------------------------+----------
366 to 730 days |       394        275         14 |       683 
                |      2.50       2.67       2.60 |      2.57 
----------------+---------------------------------+----------
731 to 973 days |        87         44          2 |       133 
                |      0.55       0.43       0.37 |      0.50 
----------------+---------------------------------+----------
      >973 days |         1          0          0 |         1 
                |      0.01       0.00       0.00 |      0.00 
----------------+---------------------------------+----------
              . |    14,563      9,493        497 |    24,553 
                |     92.43      92.17      92.38 |     92.33 
----------------+---------------------------------+----------
          Total |    15,756     10,299        538 |    26,593 
                |    100.00     100.00     100.00 |    100.00 

         Pearson chi2(16) =  14.7817   Pr = 0.541

.         
. * Exit date
. gen exit_date = esrd_date
(24,553 missing values generated)

. format exit_date %td

. gen end_date = date("2022-11-30", "YMD") if case==1
(13,534 missing values generated)

. replace end_date = date("2019-11-30", "YMD") if case==0
(13,534 real changes made)

. format end_date %td

. replace exit_date = min(deregistered_date, death_date, end_date) if esrd_date==.
(24,553 real changes made)

. gen follow_up_time = (exit_date - index_date)
(1,074 missing values generated)

. label var follow_up_time "Follow-up time (Days)"

. gen follow_up_cat = follow_up_time
(1,074 missing values generated)

. recode follow_up_cat    min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0/365=3         ///
>                                                 366/730=4       ///
>                                                 731/1040=5      ///                                     
>                                                 1041/max=6
(25486 changes made to follow_up_cat)

. label define follow_up_cat      1 "<-29 days"           ///
>                                                         2 "-28 to -1 days"      ///
>                                                         3 "0 to 365 days"       ///
>                                                         4 "366 to 730 days" ///
>                                                         5 "731 to 1040 days"    ///
>                                                         6 ">1040 days"

. label values follow_up_cat follow_up_cat

. label var follow_up_cat "Follow_up time"

. tab case follow_up_cat

                      |               Follow_up time
                 case | -28 to -1  0 to 365   366 to 73  731 to 10 |     Total
----------------------+--------------------------------------------+----------
Pneumonia (pre-pandem |        49      5,518      4,655      2,980 |    13,202 
             COVID-19 |        39      5,035      4,326      2,917 |    12,317 
----------------------+--------------------------------------------+----------
                Total |        88     10,553      8,981      5,897 |    25,519 

. drop if follow_up_time<0
(88 observations deleted)

. drop if follow_up_time>1040
(1,074 observations deleted)

. tab case follow_up_cat

                      |          Follow_up time
                 case | 0 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Pneumonia (pre-pandem |     5,518      4,655      2,980 |    13,153 
             COVID-19 |     5,035      4,326      2,917 |    12,278 
----------------------+---------------------------------+----------
                Total |    10,553      8,981      5,897 |    25,431 

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(25,431 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_half_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>=index_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(13 real changes made)
(25 real changes made)
(34 real changes made)
(39 real changes made)
(66 real changes made)
(49 real changes made)
(72 real changes made)
(73 real changes made)
(73 real changes made)
(72 real changes made)
(80 real changes made)
(83 real changes made)
(83 real changes made)
(95 real changes made)
(92 real changes made)
(92 real changes made)
(98 real changes made)
(112 real changes made)
(103 real changes made)
(98 real changes made)
(99 real changes made)
(106 real changes made)
(117 real changes made)
(103 real changes made)
(95 real changes made)
(109 real changes made)
(100 real changes made)
(114 real changes made)
(114 real changes made)
(107 real changes made)
(0 real changes made)
(0 real changes made)
(7 real changes made)
(32 real changes made)
(40 real changes made)
(64 real changes made)
(56 real changes made)
(70 real changes made)
(62 real changes made)
(76 real changes made)
(71 real changes made)
(80 real changes made)
(93 real changes made)
(82 real changes made)
(103 real changes made)
(92 real changes made)
(91 real changes made)
(95 real changes made)
(87 real changes made)
(89 real changes made)
(87 real changes made)
(109 real changes made)
(104 real changes made)
(93 real changes made)
(113 real changes made)
(109 real changes made)
(95 real changes made)
(84 real changes made)
(98 real changes made)
(101 real changes made)
(133 real changes made)
(98 real changes made)
(106 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(1,554 real changes made)

. gen egfr_half = 0

. replace egfr_half = 1 if egfr_half_date!=.
(6,690 real changes made)

. label var egfr_half "50% reduction in eGFR"

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(11,326 real changes made, 11,326 to missing)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(18,741 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date) if egfr_half_date==. & index_date_egfr_half!=.
(8,303 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(11,326 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days)"

. 
. * AKI (or ESRD)
. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(22,888 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(1,833 real changes made)

. gen aki = 0

. replace aki = 1 if aki_date!=.
(4,376 real changes made)

. label var aki "Acute kidney injury"

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(21,055 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date)  if aki_date==.
(21,055 real changes made)

. gen follow_up_time_aki = (exit_date_aki - index_date)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. 
. * Exit date (death)
. gen exit_date_death = death_date
(24,377 missing values generated)

. gen death = 0

. replace death = 1 if death_date!=.
(1,054 real changes made)

. label var death "Death"

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(24,377 real changes made)

. gen follow_up_time_death = (exit_date_death - index_date)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. 
. save ./output/analysis_hospitalised.dta, replace
(file ./output/analysis_hospitalised.dta not found)
file ./output/analysis_hospitalised.dta saved

. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_hospitalised.log
  log type:  text
 closed on:  13 Jan 2023, 17:18:01
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
