------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_2017.log
  log type:  text
 opened on:  30 Jan 2023, 16:30:16

. 
. ** Analysis cohort selection
. capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-9)
(53 vars, 50,000 obs)

. di "Potential COVID-19 cases extracted from OpenSAFELY:"
Potential COVID-19 cases extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/input_2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(16 vars, 50,000 obs)

. di "Potential historical comparators extracted from OpenSAFELY:"
Potential historical comparators extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/covid_matching_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 15,338 obs)

. di "Potential COVID-19 cases after application of exclusion criteria:"
Potential COVID-19 cases after application of exclusion criteria:

. safecount
  15,338

. capture noisily import delimited ./output/2017_matching.csv, clear
(encoding automatically selected: ISO-8859-2)
(7 vars, 28,939 obs)

. di "Potential historical comparators after application of exclusion criteria:"
Potential historical comparators after application of exclusion criteria:

. safecount
  28,939

. * Import COVID-19 dataset comprising individuals matched with historical comparators (limited matching variables only)  
. capture noisily import delimited ./output/input_combined_stps_covid_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(13 vars, 13,990 obs)

. * Drop age & covid_diagnosis_date
. keep patient_id death_date date_deregistered stp krt_outcome_date male covid_date covid_month set_id case match_counts

. tempfile covid_2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `covid_2017_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000001.tmp saved as .dta format

. * Number of matched COVID-19 cases
. count
  13,990

. * Import matched historical comparators (limited matching variables only)
. capture noisily import delimited ./output/input_combined_stps_matches_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 22,201 obs)

. * Drop age
. keep patient_id death_date date_deregistered stp krt_outcome_date male set_id case covid_date

. tempfile 2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `2017_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000002.tmp saved as .dta format

. * Number of matched historical comparators
. count
  22,201

. * Merge limited COVID-19 dataset with additional variables
. capture noisily import delimited ./output/input_covid_2017_additional.csv, clear
(encoding automatically selected: ISO-8859-9)
(106 vars, 13,990 obs)

. merge 1:1 patient_id using `covid_2017_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            13,990  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile covid_2017_complete

. save `covid_2017_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000003.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000003.tmp saved as .dta format

. di "Matched COVID-19 cases:"
Matched COVID-19 cases:

. safecount
  13,990

. * Merge limited historical comparator dataset with additional variables
. capture noisily import delimited ./output/input_2017_additional.csv, clear
(encoding automatically selected: ISO-8859-9)
(95 vars, 22,201 obs)

. merge 1:1 patient_id using `2017_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            22,201  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile 2017_complete

. save `2017_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000004.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000004.tmp saved as .dta format

. di "Matched historical comparators:"
Matched historical comparators:

. safecount
  22,201

. * Append matched COVID-19 cases and historical comparators
. append using `covid_2017_complete', force

. order patient_id set_id match_count case

. gsort set_id -case

. count if case==0
  22,201

. di "Matched COVID-19 cases and historical comparators:"
Matched COVID-19 cases and historical comparators:

. safecount
  36,191

. tab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,201       61.34       61.34
          1 |     13,990       38.66      100.00
------------+-----------------------------------
      Total |     36,191      100.00

. * Save list of matched COVID-19 cases
. preserve

.         keep if case==1
(22,201 observations deleted)

.         keep patient_id

.         tempfile covid_2017_matched_list

.         save `covid_2017_matched_list', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000006.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000006.tmp saved as .dta format

. restore

. * Generate list of unmatched COVID-19 cases
. preserve

.         capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-9)
(53 vars, 50,000 obs)

.         * For dummy data, should do nothing in the real data
.         duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

.         tempfile covid_prematching

.         save `covid_prematching', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000008.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_5158_000008.tmp saved as .dta format

.         use `covid_2017_matched_list', clear

.         merge 1:1 patient_id using `covid_prematching'

    Result                      Number of obs
    -----------------------------------------
    Not matched                        61,188
        from master                    12,589  (_merge==1)
        from using                     48,599  (_merge==2)

    Matched                             1,401  (_merge==3)
    -----------------------------------------

.         keep if _merge==2
(13,990 observations deleted)

.         safecount
  48,599

.         save output/covid_unmatched_2017.dta, replace
file output/covid_unmatched_2017.dta saved

.         di "Unmatched COVID-19 cases:"
Unmatched COVID-19 cases:

.         safecount
  48,599

. restore

. 
. **ID
. * Need to create unique identifiers as individuals may be in both covid_2017_matched and 2017_matched so will have the same patient_id
. gen unique = _n

. label var unique "Unique ID"

. 
. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label var imd "Index of multiple deprivation (IMD)"

. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      1,840        5.08        5.08
 1 Most deprived |      6,800       18.79       23.87
               2 |      6,828       18.87       42.74
               3 |      6,842       18.91       61.65
               4 |      6,936       19.16       80.81
5 Least deprived |      6,945       19.19      100.00
-----------------+-----------------------------------
           Total |     36,191      100.00

. drop if imd==0
(1,840 observations deleted)

. safetab imd

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |      6,800       19.80       19.80
               2 |      6,828       19.88       39.67
               3 |      6,842       19.92       59.59
               4 |      6,936       20.19       79.78
5 Least deprived |      6,945       20.22      100.00
-----------------+-----------------------------------
           Total |     34,351      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(34,320 missing values generated)

. replace stp1 = sum(stp1)
(34,350 real changes made)

. drop stp

. rename stp1 stp

. label define stp        1 "STP1"        ///
>                                         2 "STP2"        ///
>                                         3 "STP3"        ///
>                                         4 "STP4"        ///
>                                         5 "STP5"        ///
>                                         6 "STP6"        ///
>                                         7 "STP7"        ///
>                                         8 "STP8"        ///
>                                         9 "STP9"        ///
>                                         10 "STP10"      ///
>                                         11 "STP11"      ///                                     
>                                         12 "STP12"      ///
>                                         13 "STP13"      ///
>                                         14 "STP14"      ///
>                                         15 "STP15"      ///
>                                         16 "STP16"      ///
>                                         17 "STP17"      ///
>                                         18 "STP18"      ///
>                                         19 "STP19"      ///
>                                         20 "STP20"      ///
>                                         21 "STP21"      ///                                     
>                                         22 "STP22"      ///
>                                         23 "STP23"      ///
>                                         24 "STP24"      ///
>                                         25 "STP25"      ///
>                                         26 "STP26"      ///
>                                         27 "STP27"      ///
>                                         28 "STP28"      ///
>                                         29 "STP29"      ///
>                                         30 "STP30"      ///
>                                         31 "STP31"      

. label values stp stp

. label var stp "STP"

. safetab stp

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |      1,230        3.58        3.58
       STP2 |      1,126        3.28        6.86
       STP3 |      1,101        3.21       10.06
       STP4 |      1,075        3.13       13.19
       STP5 |      1,125        3.28       16.47
       STP6 |      1,102        3.21       19.68
       STP7 |      1,111        3.23       22.91
       STP8 |      1,113        3.24       26.15
       STP9 |      1,099        3.20       29.35
      STP10 |      1,085        3.16       32.51
      STP11 |      1,104        3.21       35.72
      STP12 |      1,107        3.22       38.95
      STP13 |      1,145        3.33       42.28
      STP14 |      1,065        3.10       45.38
      STP15 |      1,082        3.15       48.53
      STP16 |      1,113        3.24       51.77
      STP17 |      1,096        3.19       54.96
      STP18 |      1,100        3.20       58.16
      STP19 |      1,099        3.20       61.36
      STP20 |      1,091        3.18       64.54
      STP21 |      1,075        3.13       67.67
      STP22 |      1,116        3.25       70.91
      STP23 |      1,124        3.27       74.19
      STP24 |      1,090        3.17       77.36
      STP25 |      1,129        3.29       80.65
      STP26 |      1,112        3.24       83.88
      STP27 |      1,148        3.34       87.23
      STP28 |      1,102        3.21       90.43
      STP29 |      1,086        3.16       93.60
      STP30 |      1,095        3.19       96.78
      STP31 |      1,105        3.22      100.00
------------+-----------------------------------
      Total |     34,351      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(30,863 missing values generated)

. replace region = 2 if region_string=="East"
(3,452 real changes made)

. replace region = 3 if region_string=="London"
(6,830 real changes made)

. replace region = 4 if region_string=="North East"
(3,506 real changes made)

. replace region = 5 if region_string=="North West"
(3,444 real changes made)

. replace region = 6 if region_string=="South East"
(3,389 real changes made)

. replace region = 7 if region_string=="South West"
(3,368 real changes made)

. replace region = 8 if region_string=="West Midlands"
(3,487 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(3,387 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,488       10.15       10.15
                    East |      3,452       10.05       20.20
                  London |      6,830       19.88       40.09
              North East |      3,506       10.21       50.29
              North West |      3,444       10.03       60.32
              South East |      3,389        9.87       70.18
              South West |      3,368        9.80       79.99
           West Midlands |      3,487       10.15       90.14
Yorkshire and The Humber |      3,387        9.86      100.00
-------------------------+-----------------------------------
                   Total |     34,351      100.00

. drop if region==10
(0 observations deleted)

. safetab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,488       10.15       10.15
                    East |      3,452       10.05       20.20
                  London |      6,830       19.88       40.09
              North East |      3,506       10.21       50.29
              North West |      3,444       10.03       60.32
              South East |      3,389        9.87       70.18
              South West |      3,368        9.80       79.99
           West Midlands |      3,487       10.15       90.14
Yorkshire and The Humber |      3,387        9.86      100.00
-------------------------+-----------------------------------
                   Total |     34,351      100.00

. 
. * Death/practice deregistration before start of follow-up
.         * NB - case_index_date (renamed index_date below) is either date of first diagnosis of COVID-19 or corresponding matched date 3 years earlier for matched historical comparators
.         * However, follow-up starts from 28 days after index_date with anyone who died or was deregistered in the 28 days after index_date excluded from the final study cohorts
.         * index date_28 variable 28 days therefore created to exclude anyone who does not meet this criteria
. gen index_date = date(case_index_date, "YMD")

. format index_date %td

. gen index_date_28 = index_date + 28

. format index_date_28 %td

. 
. * Deregistered within index_date_28
. gen deregistered_date = date(date_deregistered, "YMD")
(33,260 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date_28 + 1
(50 observations deleted)

. 
. * Death with index_date_28
. gen death_date1 = date(death_date, "YMD")
(32,363 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28 + 1
(89 real changes made)

. label define deceased 0 "Alive at 29 days after index date" 1 "Deceased within 28 days of index date"

. label values deceased deceased

. tab case deceased

           |       deceased
      case | Alive at   Deceased  |     Total
-----------+----------------------+----------
         0 |    20,961         67 |    21,028 
         1 |    13,251         22 |    13,273 
-----------+----------------------+----------
     Total |    34,212         89 |    34,301 

. drop if deceased==1
(89 observations deleted)

. drop deceased

. 
. * Kidney failure before index_date
.         * Kidney failure (when individuals require dialysis or kidney transplantation or have baseline eGFR <15) is the primary outcome and therefore, individuals with pre-existing kidney failure before index_date are excluded
.         * However, unlike death and practice deregistration, we require information on whether people developed kidney failure from immediately after the index_date (including within index_date_28)
.         
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(31,012 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(0 observations deleted)

. * Kidney replacement therapy date recalculated to index_date_28 + 1 (i.e. immediately at start of follow-up)
. replace krt_date = index_date_28 + 1 if krt_date < index_date_28 + 1
(156 real changes made)

. 
. * eGFR <15 before index_date
.         * eGFR calculated using age, sex and extracted monthly baseline serum creatinine before index_date
. gen index_year = yofd(index_date)

. gen age = index_year - year_of_birth

. gen sex = 1 if male == "Male"
(17,640 missing values generated)

. label var sex "Sex"

. replace sex = 0 if male == "Female"
(17,640 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 ///
>                                                                                                 baseline_creatinine_mar2017 ///
>                                                                                                 baseline_creatinine_apr2017 ///
>                                                                                                 baseline_creatinine_may2017 ///
>                                                                                                 baseline_creatinine_jun2017 ///
>                                                                                                 baseline_creatinine_jul2017 ///
>                                                                                                 baseline_creatinine_aug2017 ///
>                                                                                                 baseline_creatinine_sep2017 ///
>                                                                                                 baseline_creatinine_oct2017 ///
>                                                                                                 baseline_creatinine_nov2017 ///
>                                                                                                 baseline_creatinine_dec2017 ///
>                                                                                                 baseline_creatinine_jan2018 ///
>                                                                                                 baseline_creatinine_feb2018 ///
>                                                                                                 baseline_creatinine_mar2018 ///
>                                                                                                 baseline_creatinine_apr2018 ///
>                                                                                                 baseline_creatinine_may2018 ///
>                                                                                                 baseline_creatinine_jun2018 ///
>                                                                                                 baseline_creatinine_jul2018 ///
>                                                                                                 baseline_creatinine_aug2018 ///
>                                                                                                 baseline_creatinine_sep2018 ///
>                                                                                                 baseline_creatinine_oct2018 ///
>                                                                                                 baseline_creatinine_nov2018 ///
>                                                                                                 baseline_creatinine_dec2018 ///
>                                                                                                 baseline_creatinine_jan2019 ///
>                                                                                                 baseline_creatinine_feb2019 ///
>                                                                                                 baseline_creatinine_mar2019 ///
>                                                                                                 baseline_creatinine_apr2019 ///
>                                                                                                 baseline_creatinine_may2019 ///
>                                                                                                 baseline_creatinine_jun2019 ///
>                                                                                                 baseline_creatinine_jul2019 ///
>                                                                                                 baseline_creatinine_aug2019 ///
>                                                                                                 baseline_creatinine_sep2019 ///
>                                                                                                 baseline_creatinine_feb2020 ///
>                                                                                                 baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 ///
>                                                                                                 baseline_creatinine_feb2022 ///
>                                                                                                 baseline_creatinine_mar2022 ///
>                                                                                                 baseline_creatinine_apr2022 ///
>                                                                                                 baseline_creatinine_may2022 ///
>                                                                                                 baseline_creatinine_jun2022 ///
>                                                                                                 baseline_creatinine_jul2022 ///
>                                                                                                 baseline_creatinine_aug2022 ///
>                                                                                                 baseline_creatinine_sep2022 ///
>                                                                                                 baseline_creatinine_oct2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(9,200 real changes made, 9,200 to missing)
(22,451 missing values generated)
(34,212 missing values generated)
(6,019 real changes made)
(5,742 real changes made)
(6,019 real changes made)
(5,742 real changes made)
(7,497 real changes made)
(34,212 missing values generated)
(6,019 real changes made)
(5,742 real changes made)
(11,761 real changes made)
(26,715 real changes made)
(22,451 missing values generated)
(11,761 real changes made)
(6,019 real changes made)
(9,226 real changes made, 9,226 to missing)
(22,477 missing values generated)
(34,212 missing values generated)
(5,970 real changes made)
(5,765 real changes made)
(5,970 real changes made)
(5,765 real changes made)
(7,406 real changes made)
(34,212 missing values generated)
(5,970 real changes made)
(5,765 real changes made)
(11,735 real changes made)
(26,806 real changes made)
(22,477 missing values generated)
(11,735 real changes made)
(5,970 real changes made)
(9,185 real changes made, 9,185 to missing)
(22,436 missing values generated)
(34,212 missing values generated)
(6,023 real changes made)
(5,753 real changes made)
(6,023 real changes made)
(5,753 real changes made)
(7,520 real changes made)
(34,212 missing values generated)
(6,023 real changes made)
(5,753 real changes made)
(11,776 real changes made)
(26,692 real changes made)
(22,436 missing values generated)
(11,776 real changes made)
(6,023 real changes made)
(9,201 real changes made, 9,201 to missing)
(22,452 missing values generated)
(34,212 missing values generated)
(6,069 real changes made)
(5,691 real changes made)
(6,069 real changes made)
(5,691 real changes made)
(7,497 real changes made)
(34,212 missing values generated)
(6,069 real changes made)
(5,691 real changes made)
(11,760 real changes made)
(26,715 real changes made)
(22,452 missing values generated)
(11,760 real changes made)
(6,069 real changes made)
(9,207 real changes made, 9,207 to missing)
(22,458 missing values generated)
(34,212 missing values generated)
(6,014 real changes made)
(5,740 real changes made)
(6,014 real changes made)
(5,740 real changes made)
(7,491 real changes made)
(34,212 missing values generated)
(6,014 real changes made)
(5,740 real changes made)
(11,754 real changes made)
(26,721 real changes made)
(22,458 missing values generated)
(11,754 real changes made)
(6,014 real changes made)
(9,229 real changes made, 9,229 to missing)
(22,480 missing values generated)
(34,212 missing values generated)
(6,000 real changes made)
(5,732 real changes made)
(6,000 real changes made)
(5,732 real changes made)
(7,549 real changes made)
(34,212 missing values generated)
(6,000 real changes made)
(5,732 real changes made)
(11,732 real changes made)
(26,663 real changes made)
(22,480 missing values generated)
(11,732 real changes made)
(6,000 real changes made)
(9,226 real changes made, 9,226 to missing)
(22,477 missing values generated)
(34,212 missing values generated)
(6,006 real changes made)
(5,729 real changes made)
(6,006 real changes made)
(5,729 real changes made)
(7,442 real changes made)
(34,212 missing values generated)
(6,006 real changes made)
(5,729 real changes made)
(11,735 real changes made)
(26,770 real changes made)
(22,477 missing values generated)
(11,735 real changes made)
(6,006 real changes made)
(9,306 real changes made, 9,306 to missing)
(22,557 missing values generated)
(34,212 missing values generated)
(5,899 real changes made)
(5,756 real changes made)
(5,899 real changes made)
(5,756 real changes made)
(7,302 real changes made)
(34,212 missing values generated)
(5,899 real changes made)
(5,756 real changes made)
(11,655 real changes made)
(26,910 real changes made)
(22,557 missing values generated)
(11,655 real changes made)
(5,899 real changes made)
(9,186 real changes made, 9,186 to missing)
(22,437 missing values generated)
(34,212 missing values generated)
(6,040 real changes made)
(5,735 real changes made)
(6,040 real changes made)
(5,735 real changes made)
(7,527 real changes made)
(34,212 missing values generated)
(6,040 real changes made)
(5,735 real changes made)
(11,775 real changes made)
(26,685 real changes made)
(22,437 missing values generated)
(11,775 real changes made)
(6,040 real changes made)
(9,211 real changes made, 9,211 to missing)
(22,462 missing values generated)
(34,212 missing values generated)
(6,022 real changes made)
(5,728 real changes made)
(6,022 real changes made)
(5,728 real changes made)
(7,556 real changes made)
(34,212 missing values generated)
(6,022 real changes made)
(5,728 real changes made)
(11,750 real changes made)
(26,656 real changes made)
(22,462 missing values generated)
(11,750 real changes made)
(6,022 real changes made)
(9,191 real changes made, 9,191 to missing)
(22,442 missing values generated)
(34,212 missing values generated)
(6,101 real changes made)
(5,669 real changes made)
(6,101 real changes made)
(5,669 real changes made)
(7,534 real changes made)
(34,212 missing values generated)
(6,101 real changes made)
(5,669 real changes made)
(11,770 real changes made)
(26,678 real changes made)
(22,442 missing values generated)
(11,770 real changes made)
(6,101 real changes made)
(9,236 real changes made, 9,236 to missing)
(22,487 missing values generated)
(34,212 missing values generated)
(6,069 real changes made)
(5,656 real changes made)
(6,069 real changes made)
(5,656 real changes made)
(7,435 real changes made)
(34,212 missing values generated)
(6,069 real changes made)
(5,656 real changes made)
(11,725 real changes made)
(26,777 real changes made)
(22,487 missing values generated)
(11,725 real changes made)
(6,069 real changes made)
(9,225 real changes made, 9,225 to missing)
(22,476 missing values generated)
(34,212 missing values generated)
(6,018 real changes made)
(5,718 real changes made)
(6,018 real changes made)
(5,718 real changes made)
(7,412 real changes made)
(34,212 missing values generated)
(6,018 real changes made)
(5,718 real changes made)
(11,736 real changes made)
(26,800 real changes made)
(22,476 missing values generated)
(11,736 real changes made)
(6,018 real changes made)
(9,304 real changes made, 9,304 to missing)
(22,555 missing values generated)
(34,212 missing values generated)
(5,974 real changes made)
(5,683 real changes made)
(5,974 real changes made)
(5,683 real changes made)
(7,342 real changes made)
(34,212 missing values generated)
(5,974 real changes made)
(5,683 real changes made)
(11,657 real changes made)
(26,870 real changes made)
(22,555 missing values generated)
(11,657 real changes made)
(5,974 real changes made)
(9,164 real changes made, 9,164 to missing)
(22,415 missing values generated)
(34,212 missing values generated)
(6,077 real changes made)
(5,720 real changes made)
(6,077 real changes made)
(5,720 real changes made)
(7,582 real changes made)
(34,212 missing values generated)
(6,077 real changes made)
(5,720 real changes made)
(11,797 real changes made)
(26,630 real changes made)
(22,415 missing values generated)
(11,797 real changes made)
(6,077 real changes made)
(9,206 real changes made, 9,206 to missing)
(22,457 missing values generated)
(34,212 missing values generated)
(6,032 real changes made)
(5,723 real changes made)
(6,032 real changes made)
(5,723 real changes made)
(7,439 real changes made)
(34,212 missing values generated)
(6,032 real changes made)
(5,723 real changes made)
(11,755 real changes made)
(26,773 real changes made)
(22,457 missing values generated)
(11,755 real changes made)
(6,032 real changes made)
(9,230 real changes made, 9,230 to missing)
(22,481 missing values generated)
(34,212 missing values generated)
(6,093 real changes made)
(5,638 real changes made)
(6,093 real changes made)
(5,638 real changes made)
(7,462 real changes made)
(34,212 missing values generated)
(6,093 real changes made)
(5,638 real changes made)
(11,731 real changes made)
(26,750 real changes made)
(22,481 missing values generated)
(11,731 real changes made)
(6,093 real changes made)
(9,235 real changes made, 9,235 to missing)
(22,486 missing values generated)
(34,212 missing values generated)
(6,027 real changes made)
(5,699 real changes made)
(6,027 real changes made)
(5,699 real changes made)
(7,419 real changes made)
(34,212 missing values generated)
(6,027 real changes made)
(5,699 real changes made)
(11,726 real changes made)
(26,793 real changes made)
(22,486 missing values generated)
(11,726 real changes made)
(6,027 real changes made)
(9,274 real changes made, 9,274 to missing)
(22,525 missing values generated)
(34,212 missing values generated)
(6,038 real changes made)
(5,649 real changes made)
(6,038 real changes made)
(5,649 real changes made)
(7,482 real changes made)
(34,212 missing values generated)
(6,038 real changes made)
(5,649 real changes made)
(11,687 real changes made)
(26,730 real changes made)
(22,525 missing values generated)
(11,687 real changes made)
(6,038 real changes made)
(9,249 real changes made, 9,249 to missing)
(22,500 missing values generated)
(34,212 missing values generated)
(5,964 real changes made)
(5,748 real changes made)
(5,964 real changes made)
(5,748 real changes made)
(7,367 real changes made)
(34,212 missing values generated)
(5,964 real changes made)
(5,748 real changes made)
(11,712 real changes made)
(26,845 real changes made)
(22,500 missing values generated)
(11,712 real changes made)
(5,964 real changes made)
(9,182 real changes made, 9,182 to missing)
(22,433 missing values generated)
(34,212 missing values generated)
(6,029 real changes made)
(5,750 real changes made)
(6,029 real changes made)
(5,750 real changes made)
(7,405 real changes made)
(34,212 missing values generated)
(6,029 real changes made)
(5,750 real changes made)
(11,779 real changes made)
(26,807 real changes made)
(22,433 missing values generated)
(11,779 real changes made)
(6,029 real changes made)
(9,252 real changes made, 9,252 to missing)
(22,503 missing values generated)
(34,212 missing values generated)
(6,033 real changes made)
(5,676 real changes made)
(6,033 real changes made)
(5,676 real changes made)
(7,379 real changes made)
(34,212 missing values generated)
(6,033 real changes made)
(5,676 real changes made)
(11,709 real changes made)
(26,833 real changes made)
(22,503 missing values generated)
(11,709 real changes made)
(6,033 real changes made)
(9,168 real changes made, 9,168 to missing)
(22,419 missing values generated)
(34,212 missing values generated)
(6,066 real changes made)
(5,727 real changes made)
(6,066 real changes made)
(5,727 real changes made)
(7,527 real changes made)
(34,212 missing values generated)
(6,066 real changes made)
(5,727 real changes made)
(11,793 real changes made)
(26,685 real changes made)
(22,419 missing values generated)
(11,793 real changes made)
(6,066 real changes made)
(9,176 real changes made, 9,176 to missing)
(22,427 missing values generated)
(34,212 missing values generated)
(6,074 real changes made)
(5,711 real changes made)
(6,074 real changes made)
(5,711 real changes made)
(7,526 real changes made)
(34,212 missing values generated)
(6,074 real changes made)
(5,711 real changes made)
(11,785 real changes made)
(26,686 real changes made)
(22,427 missing values generated)
(11,785 real changes made)
(6,074 real changes made)
(9,261 real changes made, 9,261 to missing)
(22,512 missing values generated)
(34,212 missing values generated)
(5,975 real changes made)
(5,725 real changes made)
(5,975 real changes made)
(5,725 real changes made)
(7,434 real changes made)
(34,212 missing values generated)
(5,975 real changes made)
(5,725 real changes made)
(11,700 real changes made)
(26,778 real changes made)
(22,512 missing values generated)
(11,700 real changes made)
(5,975 real changes made)
(9,173 real changes made, 9,173 to missing)
(22,424 missing values generated)
(34,212 missing values generated)
(5,978 real changes made)
(5,810 real changes made)
(5,978 real changes made)
(5,810 real changes made)
(7,445 real changes made)
(34,212 missing values generated)
(5,978 real changes made)
(5,810 real changes made)
(11,788 real changes made)
(26,767 real changes made)
(22,424 missing values generated)
(11,788 real changes made)
(5,978 real changes made)
(9,198 real changes made, 9,198 to missing)
(22,449 missing values generated)
(34,212 missing values generated)
(6,044 real changes made)
(5,719 real changes made)
(6,044 real changes made)
(5,719 real changes made)
(7,479 real changes made)
(34,212 missing values generated)
(6,044 real changes made)
(5,719 real changes made)
(11,763 real changes made)
(26,733 real changes made)
(22,449 missing values generated)
(11,763 real changes made)
(6,044 real changes made)
(9,224 real changes made, 9,224 to missing)
(22,475 missing values generated)
(34,212 missing values generated)
(6,048 real changes made)
(5,689 real changes made)
(6,048 real changes made)
(5,689 real changes made)
(7,491 real changes made)
(34,212 missing values generated)
(6,048 real changes made)
(5,689 real changes made)
(11,737 real changes made)
(26,721 real changes made)
(22,475 missing values generated)
(11,737 real changes made)
(6,048 real changes made)
(9,233 real changes made, 9,233 to missing)
(22,484 missing values generated)
(34,212 missing values generated)
(6,028 real changes made)
(5,700 real changes made)
(6,028 real changes made)
(5,700 real changes made)
(7,453 real changes made)
(34,212 missing values generated)
(6,028 real changes made)
(5,700 real changes made)
(11,728 real changes made)
(26,759 real changes made)
(22,484 missing values generated)
(11,728 real changes made)
(6,028 real changes made)
(9,196 real changes made, 9,196 to missing)
(22,447 missing values generated)
(34,212 missing values generated)
(6,053 real changes made)
(5,712 real changes made)
(6,053 real changes made)
(5,712 real changes made)
(7,428 real changes made)
(34,212 missing values generated)
(6,053 real changes made)
(5,712 real changes made)
(11,765 real changes made)
(26,784 real changes made)
(22,447 missing values generated)
(11,765 real changes made)
(6,053 real changes made)
(9,199 real changes made, 9,199 to missing)
(22,450 missing values generated)
(34,212 missing values generated)
(6,033 real changes made)
(5,729 real changes made)
(6,033 real changes made)
(5,729 real changes made)
(7,455 real changes made)
(34,212 missing values generated)
(6,033 real changes made)
(5,729 real changes made)
(11,762 real changes made)
(26,757 real changes made)
(22,450 missing values generated)
(11,762 real changes made)
(6,033 real changes made)
(9,275 real changes made, 9,275 to missing)
(22,526 missing values generated)
(34,212 missing values generated)
(5,991 real changes made)
(5,695 real changes made)
(5,991 real changes made)
(5,695 real changes made)
(7,373 real changes made)
(34,212 missing values generated)
(5,991 real changes made)
(5,695 real changes made)
(11,686 real changes made)
(26,839 real changes made)
(22,526 missing values generated)
(11,686 real changes made)
(5,991 real changes made)
(5,842 real changes made, 5,842 to missing)
(26,803 missing values generated)
(34,212 missing values generated)
(3,842 real changes made)
(3,567 real changes made)
(3,842 real changes made)
(3,567 real changes made)
(4,655 real changes made)
(34,212 missing values generated)
(3,842 real changes made)
(3,567 real changes made)
(7,409 real changes made)
(29,557 real changes made)
(26,803 missing values generated)
(7,409 real changes made)
(3,842 real changes made)
(5,832 real changes made, 5,832 to missing)
(26,793 missing values generated)
(34,212 missing values generated)
(3,896 real changes made)
(3,523 real changes made)
(3,896 real changes made)
(3,523 real changes made)
(4,761 real changes made)
(34,212 missing values generated)
(3,896 real changes made)
(3,523 real changes made)
(7,419 real changes made)
(29,451 real changes made)
(26,793 missing values generated)
(7,419 real changes made)
(3,896 real changes made)
(5,799 real changes made, 5,799 to missing)
(26,760 missing values generated)
(34,212 missing values generated)
(3,819 real changes made)
(3,633 real changes made)
(3,819 real changes made)
(3,633 real changes made)
(4,764 real changes made)
(34,212 missing values generated)
(3,819 real changes made)
(3,633 real changes made)
(7,452 real changes made)
(29,448 real changes made)
(26,760 missing values generated)
(7,452 real changes made)
(3,819 real changes made)
(5,824 real changes made, 5,824 to missing)
(26,785 missing values generated)
(34,212 missing values generated)
(3,842 real changes made)
(3,585 real changes made)
(3,842 real changes made)
(3,585 real changes made)
(4,669 real changes made)
(34,212 missing values generated)
(3,842 real changes made)
(3,585 real changes made)
(7,427 real changes made)
(29,543 real changes made)
(26,785 missing values generated)
(7,427 real changes made)
(3,842 real changes made)
(5,835 real changes made, 5,835 to missing)
(26,796 missing values generated)
(34,212 missing values generated)
(3,804 real changes made)
(3,612 real changes made)
(3,804 real changes made)
(3,612 real changes made)
(4,705 real changes made)
(34,212 missing values generated)
(3,804 real changes made)
(3,612 real changes made)
(7,416 real changes made)
(29,507 real changes made)
(26,796 missing values generated)
(7,416 real changes made)
(3,804 real changes made)
(5,844 real changes made, 5,844 to missing)
(26,805 missing values generated)
(34,212 missing values generated)
(3,838 real changes made)
(3,569 real changes made)
(3,838 real changes made)
(3,569 real changes made)
(4,690 real changes made)
(34,212 missing values generated)
(3,838 real changes made)
(3,569 real changes made)
(7,407 real changes made)
(29,522 real changes made)
(26,805 missing values generated)
(7,407 real changes made)
(3,838 real changes made)
(5,840 real changes made, 5,840 to missing)
(26,801 missing values generated)
(34,212 missing values generated)
(3,863 real changes made)
(3,548 real changes made)
(3,863 real changes made)
(3,548 real changes made)
(4,715 real changes made)
(34,212 missing values generated)
(3,863 real changes made)
(3,548 real changes made)
(7,411 real changes made)
(29,497 real changes made)
(26,801 missing values generated)
(7,411 real changes made)
(3,863 real changes made)
(5,867 real changes made, 5,867 to missing)
(26,828 missing values generated)
(34,212 missing values generated)
(3,875 real changes made)
(3,509 real changes made)
(3,875 real changes made)
(3,509 real changes made)
(4,655 real changes made)
(34,212 missing values generated)
(3,875 real changes made)
(3,509 real changes made)
(7,384 real changes made)
(29,557 real changes made)
(26,828 missing values generated)
(7,384 real changes made)
(3,875 real changes made)
(5,856 real changes made, 5,856 to missing)
(26,817 missing values generated)
(34,212 missing values generated)
(3,837 real changes made)
(3,558 real changes made)
(3,837 real changes made)
(3,558 real changes made)
(4,670 real changes made)
(34,212 missing values generated)
(3,837 real changes made)
(3,558 real changes made)
(7,395 real changes made)
(29,542 real changes made)
(26,817 missing values generated)
(7,395 real changes made)
(3,837 real changes made)
(5,852 real changes made, 5,852 to missing)
(26,813 missing values generated)
(34,212 missing values generated)
(3,849 real changes made)
(3,550 real changes made)
(3,849 real changes made)
(3,550 real changes made)
(4,695 real changes made)
(34,212 missing values generated)
(3,849 real changes made)
(3,550 real changes made)
(7,399 real changes made)
(29,517 real changes made)
(26,813 missing values generated)
(7,399 real changes made)
(3,849 real changes made)
(5,851 real changes made, 5,851 to missing)
(26,812 missing values generated)
(34,212 missing values generated)
(3,858 real changes made)
(3,542 real changes made)
(3,858 real changes made)
(3,542 real changes made)
(4,702 real changes made)
(34,212 missing values generated)
(3,858 real changes made)
(3,542 real changes made)
(7,400 real changes made)
(29,510 real changes made)
(26,812 missing values generated)
(7,400 real changes made)
(3,858 real changes made)
(5,830 real changes made, 5,830 to missing)
(26,791 missing values generated)
(34,212 missing values generated)
(3,851 real changes made)
(3,570 real changes made)
(3,851 real changes made)
(3,570 real changes made)
(4,656 real changes made)
(34,212 missing values generated)
(3,851 real changes made)
(3,570 real changes made)
(7,421 real changes made)
(29,556 real changes made)
(26,791 missing values generated)
(7,421 real changes made)
(3,851 real changes made)
(5,816 real changes made, 5,816 to missing)
(26,777 missing values generated)
(34,212 missing values generated)
(3,846 real changes made)
(3,589 real changes made)
(3,846 real changes made)
(3,589 real changes made)
(4,717 real changes made)
(34,212 missing values generated)
(3,846 real changes made)
(3,589 real changes made)
(7,435 real changes made)
(29,495 real changes made)
(26,777 missing values generated)
(7,435 real changes made)
(3,846 real changes made)
(5,806 real changes made, 5,806 to missing)
(26,767 missing values generated)
(34,212 missing values generated)
(3,851 real changes made)
(3,594 real changes made)
(3,851 real changes made)
(3,594 real changes made)
(4,712 real changes made)
(34,212 missing values generated)
(3,851 real changes made)
(3,594 real changes made)
(7,445 real changes made)
(29,500 real changes made)
(26,767 missing values generated)
(7,445 real changes made)
(3,851 real changes made)
(5,807 real changes made, 5,807 to missing)
(26,768 missing values generated)
(34,212 missing values generated)
(3,842 real changes made)
(3,602 real changes made)
(3,842 real changes made)
(3,602 real changes made)
(4,716 real changes made)
(34,212 missing values generated)
(3,842 real changes made)
(3,602 real changes made)
(7,444 real changes made)
(29,496 real changes made)
(26,768 missing values generated)
(7,444 real changes made)
(3,842 real changes made)
(5,865 real changes made, 5,865 to missing)
(26,826 missing values generated)
(34,212 missing values generated)
(3,852 real changes made)
(3,534 real changes made)
(3,852 real changes made)
(3,534 real changes made)
(4,718 real changes made)
(34,212 missing values generated)
(3,852 real changes made)
(3,534 real changes made)
(7,386 real changes made)
(29,494 real changes made)
(26,826 missing values generated)
(7,386 real changes made)
(3,852 real changes made)
(5,841 real changes made, 5,841 to missing)
(26,802 missing values generated)
(34,212 missing values generated)
(3,777 real changes made)
(3,633 real changes made)
(3,777 real changes made)
(3,633 real changes made)
(4,709 real changes made)
(34,212 missing values generated)
(3,777 real changes made)
(3,633 real changes made)
(7,410 real changes made)
(29,503 real changes made)
(26,802 missing values generated)
(7,410 real changes made)
(3,777 real changes made)
(5,803 real changes made, 5,803 to missing)
(26,764 missing values generated)
(34,212 missing values generated)
(3,894 real changes made)
(3,554 real changes made)
(3,894 real changes made)
(3,554 real changes made)
(4,751 real changes made)
(34,212 missing values generated)
(3,894 real changes made)
(3,554 real changes made)
(7,448 real changes made)
(29,461 real changes made)
(26,764 missing values generated)
(7,448 real changes made)
(3,894 real changes made)
(5,854 real changes made, 5,854 to missing)
(26,815 missing values generated)
(34,212 missing values generated)
(3,818 real changes made)
(3,579 real changes made)
(3,818 real changes made)
(3,579 real changes made)
(4,747 real changes made)
(34,212 missing values generated)
(3,818 real changes made)
(3,579 real changes made)
(7,397 real changes made)
(29,465 real changes made)
(26,815 missing values generated)
(7,397 real changes made)
(3,818 real changes made)
(5,829 real changes made, 5,829 to missing)
(26,790 missing values generated)
(34,212 missing values generated)
(3,826 real changes made)
(3,596 real changes made)
(3,826 real changes made)
(3,596 real changes made)
(4,793 real changes made)
(34,212 missing values generated)
(3,826 real changes made)
(3,596 real changes made)
(7,422 real changes made)
(29,419 real changes made)
(26,790 missing values generated)
(7,422 real changes made)
(3,826 real changes made)
(5,869 real changes made, 5,869 to missing)
(26,830 missing values generated)
(34,212 missing values generated)
(3,810 real changes made)
(3,572 real changes made)
(3,810 real changes made)
(3,572 real changes made)
(4,697 real changes made)
(34,212 missing values generated)
(3,810 real changes made)
(3,572 real changes made)
(7,382 real changes made)
(29,515 real changes made)
(26,830 missing values generated)
(7,382 real changes made)
(3,810 real changes made)
(5,845 real changes made, 5,845 to missing)
(26,806 missing values generated)
(34,212 missing values generated)
(3,837 real changes made)
(3,569 real changes made)
(3,837 real changes made)
(3,569 real changes made)
(4,718 real changes made)
(34,212 missing values generated)
(3,837 real changes made)
(3,569 real changes made)
(7,406 real changes made)
(29,494 real changes made)
(26,806 missing values generated)
(7,406 real changes made)
(3,837 real changes made)
(5,816 real changes made, 5,816 to missing)
(26,777 missing values generated)
(34,212 missing values generated)
(3,858 real changes made)
(3,577 real changes made)
(3,858 real changes made)
(3,577 real changes made)
(4,650 real changes made)
(34,212 missing values generated)
(3,858 real changes made)
(3,577 real changes made)
(7,435 real changes made)
(29,562 real changes made)
(26,777 missing values generated)
(7,435 real changes made)
(3,858 real changes made)
(5,816 real changes made, 5,816 to missing)
(26,777 missing values generated)
(34,212 missing values generated)
(3,800 real changes made)
(3,635 real changes made)
(3,800 real changes made)
(3,635 real changes made)
(4,702 real changes made)
(34,212 missing values generated)
(3,800 real changes made)
(3,635 real changes made)
(7,435 real changes made)
(29,510 real changes made)
(26,777 missing values generated)
(7,435 real changes made)
(3,800 real changes made)
(5,848 real changes made, 5,848 to missing)
(26,809 missing values generated)
(34,212 missing values generated)
(3,803 real changes made)
(3,600 real changes made)
(3,803 real changes made)
(3,600 real changes made)
(4,703 real changes made)
(34,212 missing values generated)
(3,803 real changes made)
(3,600 real changes made)
(7,403 real changes made)
(29,509 real changes made)
(26,809 missing values generated)
(7,403 real changes made)
(3,803 real changes made)
(5,868 real changes made, 5,868 to missing)
(26,829 missing values generated)
(34,212 missing values generated)
(3,885 real changes made)
(3,498 real changes made)
(3,885 real changes made)
(3,498 real changes made)
(4,676 real changes made)
(34,212 missing values generated)
(3,885 real changes made)
(3,498 real changes made)
(7,383 real changes made)
(29,536 real changes made)
(26,829 missing values generated)
(7,383 real changes made)
(3,885 real changes made)
(5,819 real changes made, 5,819 to missing)
(26,780 missing values generated)
(34,212 missing values generated)
(3,853 real changes made)
(3,579 real changes made)
(3,853 real changes made)
(3,579 real changes made)
(4,717 real changes made)
(34,212 missing values generated)
(3,853 real changes made)
(3,579 real changes made)
(7,432 real changes made)
(29,495 real changes made)
(26,780 missing values generated)
(7,432 real changes made)
(3,853 real changes made)
(5,847 real changes made, 5,847 to missing)
(26,808 missing values generated)
(34,212 missing values generated)
(3,837 real changes made)
(3,567 real changes made)
(3,837 real changes made)
(3,567 real changes made)
(4,668 real changes made)
(34,212 missing values generated)
(3,837 real changes made)
(3,567 real changes made)
(7,404 real changes made)
(29,544 real changes made)
(26,808 missing values generated)
(7,404 real changes made)
(3,837 real changes made)
(5,805 real changes made, 5,805 to missing)
(26,766 missing values generated)
(34,212 missing values generated)
(3,889 real changes made)
(3,557 real changes made)
(3,889 real changes made)
(3,557 real changes made)
(4,684 real changes made)
(34,212 missing values generated)
(3,889 real changes made)
(3,557 real changes made)
(7,446 real changes made)
(29,528 real changes made)
(26,766 missing values generated)
(7,446 real changes made)
(3,889 real changes made)
(5,869 real changes made, 5,869 to missing)
(26,830 missing values generated)
(34,212 missing values generated)
(3,840 real changes made)
(3,542 real changes made)
(3,840 real changes made)
(3,542 real changes made)
(4,768 real changes made)
(34,212 missing values generated)
(3,840 real changes made)
(3,542 real changes made)
(7,382 real changes made)
(29,444 real changes made)
(26,830 missing values generated)
(7,382 real changes made)
(3,840 real changes made)
(5,833 real changes made, 5,833 to missing)
(26,794 missing values generated)
(34,212 missing values generated)
(3,839 real changes made)
(3,579 real changes made)
(3,839 real changes made)
(3,579 real changes made)
(4,745 real changes made)
(34,212 missing values generated)
(3,839 real changes made)
(3,579 real changes made)
(7,418 real changes made)
(29,467 real changes made)
(26,794 missing values generated)
(7,418 real changes made)
(3,839 real changes made)
(5,811 real changes made, 5,811 to missing)
(26,772 missing values generated)
(34,212 missing values generated)
(3,850 real changes made)
(3,590 real changes made)
(3,850 real changes made)
(3,590 real changes made)
(4,637 real changes made)
(34,212 missing values generated)
(3,850 real changes made)
(3,590 real changes made)
(7,440 real changes made)
(29,575 real changes made)
(26,772 missing values generated)
(7,440 real changes made)
(3,850 real changes made)
(5,824 real changes made, 5,824 to missing)
(26,785 missing values generated)
(34,212 missing values generated)
(3,861 real changes made)
(3,566 real changes made)
(3,861 real changes made)
(3,566 real changes made)
(4,690 real changes made)
(34,212 missing values generated)
(3,861 real changes made)
(3,566 real changes made)
(7,427 real changes made)
(29,522 real changes made)
(26,785 missing values generated)
(7,427 real changes made)
(3,861 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)

. gen baseline_egfr=.
(34,212 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(758 real changes made)
(914 real changes made)
(829 real changes made)
(765 real changes made)
(688 real changes made)
(659 real changes made)
(572 real changes made)
(519 real changes made)
(544 real changes made)
(495 real changes made)
(500 real changes made)
(402 real changes made)
(315 real changes made)
(379 real changes made)
(299 real changes made)
(330 real changes made)
(280 real changes made)
(252 real changes made)
(276 real changes made)
(215 real changes made)
(205 real changes made)
(202 real changes made)
(187 real changes made)
(164 real changes made)
(131 real changes made)
(124 real changes made)
(100 real changes made)
(133 real changes made)
(126 real changes made)
(80 real changes made)
(111 real changes made)
(57 real changes made)
(283 real changes made)
(331 real changes made)
(294 real changes made)
(282 real changes made)
(293 real changes made)
(290 real changes made)
(265 real changes made)
(236 real changes made)
(268 real changes made)
(264 real changes made)
(262 real changes made)
(248 real changes made)
(213 real changes made)
(225 real changes made)
(220 real changes made)
(234 real changes made)
(208 real changes made)
(219 real changes made)
(227 real changes made)
(202 real changes made)
(201 real changes made)
(205 real changes made)
(178 real changes made)
(181 real changes made)
(171 real changes made)
(191 real changes made)
(159 real changes made)
(182 real changes made)
(174 real changes made)
(161 real changes made)
(181 real changes made)
(147 real changes made)
(150 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab case baseline_esrd

           | baseline_e
           |    srd
      case |   No ESRD |     Total
-----------+-----------+----------
         0 |    20,961 |    20,961 
         1 |    13,251 |    13,251 
-----------+-----------+----------
     Total |    34,212 |    34,212 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. * Drop COVID-19 cases without any matched historical comparators after further application of exclusion criteria
. generate match_counts1=.
(34,212 missing values generated)

. order patient_id set_id match_counts match_counts1

. bysort set_id: replace match_counts1=_N-1
(34,212 real changes made)

. replace match_counts1=. if case==0
(20,961 real changes made, 20,961 to missing)

. drop match_counts

. rename match_counts1 match_counts

. count if match_counts==0
  5,270

. drop if match_counts==0
(5,270 observations deleted)

. safetab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,961       72.42       72.42
          1 |      7,981       27.58      100.00
------------+-----------------------------------
      Total |     28,942      100.00

. tab match_counts

match_count |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,123       14.07       14.07
          2 |      1,833       22.97       37.04
          3 |      5,025       62.96      100.00
------------+-----------------------------------
      Total |      7,981      100.00

. 
. bysort set_id: egen set_case_mean = mean(case) // if mean of exposure var is 0 then only uncase in set, if 1 then only case in set

. gen valid_set = (set_case_mean>0 & set_case_mean<1) // ==1 is valid set containing both case and uncase

. tab valid_set, miss

  valid_set |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,097        3.79        3.79
          1 |     27,845       96.21      100.00
------------+-----------------------------------
      Total |     28,942      100.00

. tab valid_set case, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |         case
 valid_set |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,097          0 |     1,097 
           |      5.23       0.00 |      3.79 
-----------+----------------------+----------
         1 |    19,864      7,981 |    27,845 
           |     94.77     100.00 |     96.21 
-----------+----------------------+----------
     Total |    20,961      7,981 |    28,942 
           |    100.00     100.00 |    100.00 

. keep if valid_set==1
(1,097 observations deleted)

. drop valid_set set_case_mean

. 
. ** Exposure
. label define case 0 "Historical comparator" ///
>                                   1 "SARS-CoV-2"

. label values case case

. safetab case 

                 case |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,864       71.34       71.34
           SARS-CoV-2 |      7,981       28.66      100.00
----------------------+-----------------------------------
                Total |     27,845      100.00

. 
. * COVID-19 severity
. gen covid_severity = case

. replace covid_severity = 2 if covid_hospitalised==1
(820 real changes made)

. replace covid_severity = 3 if covid_critical_care==1
(389 real changes made)

. replace covid_severity = 3 if covid_critical_days==1
(364 real changes made)

. label define covid_severity     0 "Historical comparator"               ///
>                                                         1 "Non-hospitalised COVID" ///
>                                                         2 "Hospitalised COVID"          ///
>                                                         3 "Critical care COVID"

. label values covid_severity covid_severity

. label var covid_severity "SARS-CoV-2 severity"

. drop covid_critical_care

. drop covid_critical_days

. safetab covid_severity, m

   SARS-CoV-2 severity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
 Historical comparator |     19,864       71.34       71.34
Non-hospitalised COVID |      6,485       23.29       94.63
    Hospitalised COVID |        743        2.67       97.30
   Critical care COVID |        753        2.70      100.00
-----------------------+-----------------------------------
                 Total |     27,845      100.00

. 
. * COVID-19 acute kidney injury
. gen covid_aki = case

. replace covid_aki = 2 if covid_hospitalised==1
(820 real changes made)

. replace covid_aki = 3 if covid_acute_kidney_injury==1
(379 real changes made)

. label define covid_aki  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised COVID"              ///
>                                                 2 "Hospitalised COVID"  ///
>                                                 3 "Hospitalised COVID-AKI"

. label values covid_aki covid_aki

. label var covid_aki "COVID-19 acute kidney injury"

. drop covid_acute_kidney_injury

. safetab covid_aki, m

 COVID-19 acute kidney |
                injury |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
 Historical comparator |     19,864       71.34       71.34
Non-hospitalised COVID |      6,810       24.46       95.79
    Hospitalised COVID |        792        2.84       98.64
Hospitalised COVID-AKI |        379        1.36      100.00
-----------------------+-----------------------------------
                 Total |     27,845      100.00

. 
. * COVID-19 kidney replacement therapy
. gen covid_krt_combined = covid_krt_icd_10
(19,864 missing values generated)

. replace covid_krt_combined = covid_krt_opcs_4 if covid_krt_icd_10==0
(394 real changes made)

. gen covid_krt = case

. replace covid_krt = 2 if covid_hospitalised==1
(820 real changes made)

. replace covid_krt = 3 if covid_krt_combined==1
(811 real changes made)

. label define covid_krt  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised SARS-CoV-2"         ///
>                                                 2 "No KRT hospitalised COVID-19"        ///
>                                                 3 "KRT hospitalised COVID-19"

. label values covid_krt covid_krt

. label var covid_krt "COVID-19 kidney replacement therapy"

. drop covid_krt_icd_10

. drop covid_krt_opcs_4

. safetab covid_krt, m

 COVID-19 kidney replacement |
                     therapy |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
       Historical comparator |     19,864       71.34       71.34
 Non-hospitalised SARS-CoV-2 |      6,421       23.06       94.40
No KRT hospitalised COVID-19 |        749        2.69       97.09
   KRT hospitalised COVID-19 |        811        2.91      100.00
-----------------------------+-----------------------------------
                       Total |     27,845      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(26,267 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(26,233 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(26,266 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(26,216 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(1,629 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(1,256 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(1,016 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(778 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Historical comparator"       ///
>                                                 1 "Pre-vaccination"                     ///
>                                                 2 "1 vaccine dose"                      ///
>                                                 3 "2 vaccine doses"                     ///
>                                                 4 "3 vaccine doses"                     ///
>                                                 5 "4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "Vaccination status"

. safetab covid_vax, m

   Vaccination status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,864       71.34       71.34
      Pre-vaccination |      3,302       11.86       83.20
       1 vaccine dose |        778        2.79       85.99
      2 vaccine doses |      1,016        3.65       89.64
      3 vaccine doses |      1,256        4.51       94.15
      4 vaccine doses |      1,629        5.85      100.00
----------------------+-----------------------------------
                Total |     27,845      100.00

. 
. * COVID-19 wave
. gen wave = case

. replace wave = 2 if index_month=="sep2020"
(357 real changes made)

. replace wave = 2 if index_month=="oct2020"
(365 real changes made)

. replace wave = 2 if index_month=="nov2020"
(331 real changes made)

. replace wave = 2 if index_month=="dec2020"
(347 real changes made)

. replace wave = 2 if index_month=="jan2021"
(281 real changes made)

. replace wave = 2 if index_month=="feb2021"
(236 real changes made)

. replace wave = 2 if index_month=="mar2021"
(283 real changes made)

. replace wave = 2 if index_month=="apr2021"
(203 real changes made)

. replace wave = 2 if index_month=="may2021"
(234 real changes made)

. replace wave = 2 if index_month=="jun2021"
(214 real changes made)

. replace wave = 3 if index_month=="jul2021"
(184 real changes made)

. replace wave = 3 if index_month=="aug2021"
(192 real changes made)

. replace wave = 3 if index_month=="sep2021"
(150 real changes made)

. replace wave = 3 if index_month=="oct2021"
(135 real changes made)

. replace wave = 3 if index_month=="nov2021"
(154 real changes made)

. replace wave = 4 if index_month=="dec2021"
(129 real changes made)

. replace wave = 4 if index_month=="jan2022"
(116 real changes made)

. replace wave = 4 if index_month=="feb2022"
(103 real changes made)

. replace wave = 4 if index_month=="mar2022"
(102 real changes made)

. replace wave = 4 if index_month=="apr2022"
(84 real changes made)

. replace wave = 4 if index_month=="may2022"
(104 real changes made)

. replace wave = 4 if index_month=="jun2022"
(103 real changes made)

. replace wave = 4 if index_month=="jul2022"
(66 real changes made)

. replace wave = 4 if index_month=="aug2022"
(85 real changes made)

. replace wave = 4 if index_month=="sep2022"
(50 real changes made)

. replace wave = 4 if index_month=="oct2022"
(66 real changes made)

. label define wave       0 "Historical comparator"       ///
>                                         1 "Febuary20-August20"  ///
>                                         2 "September20-June21"  ///
>                                         3 "July21-November21"   ///
>                                         4 "December21-October22"        

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m

        COVID-19 wave |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,864       71.34       71.34
   Febuary20-August20 |      3,307       11.88       83.21
   September20-June21 |      2,851       10.24       93.45
    July21-November21 |        815        2.93       96.38
 December21-October22 |      1,008        3.62      100.00
----------------------+-----------------------------------
                Total |     27,845      100.00

. 
. ** Covariates
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         17 |          1        0.00        0.00
         18 |        246        0.88        0.89
         19 |        372        1.34        2.22
         20 |        413        1.48        3.71
         21 |        497        1.78        5.49
         22 |        530        1.90        7.39
         23 |        548        1.97        9.36
         24 |        554        1.99       11.35
         25 |        525        1.89       13.24
         26 |        575        2.07       15.30
         27 |        564        2.03       17.33
         28 |        534        1.92       19.25
         29 |        570        2.05       21.29
         30 |        509        1.83       23.12
         31 |        564        2.03       25.15
         32 |        548        1.97       27.11
         33 |        544        1.95       29.07
         34 |        573        2.06       31.13
         35 |        556        2.00       33.12
         36 |        565        2.03       35.15
         37 |        555        1.99       37.14
         38 |        592        2.13       39.27
         39 |        533        1.91       41.19
         40 |        522        1.87       43.06
         41 |        510        1.83       44.89
         42 |        536        1.92       46.82
         43 |        560        2.01       48.83
         44 |        607        2.18       51.01
         45 |        551        1.98       52.99
         46 |        568        2.04       55.03
         47 |        574        2.06       57.09
         48 |        586        2.10       59.19
         49 |        536        1.92       61.12
         50 |        584        2.10       63.21
         51 |        567        2.04       65.25
         52 |        549        1.97       67.22
         53 |        579        2.08       69.30
         54 |        541        1.94       71.24
         55 |        590        2.12       73.36
         56 |        551        1.98       75.34
         57 |        549        1.97       77.31
         58 |        526        1.89       79.20
         59 |        558        2.00       81.21
         60 |        555        1.99       83.20
         61 |        593        2.13       85.33
         62 |        529        1.90       87.23
         63 |        579        2.08       89.31
         64 |        556        2.00       91.31
         65 |        543        1.95       93.26
         66 |        568        2.04       95.30
         67 |        603        2.17       97.46
         68 |        274        0.98       98.44
         69 |        209        0.75       99.20
         70 |        144        0.52       99.71
         71 |         60        0.22       99.93
         72 |         20        0.07      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. safecount
  27,845

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///                                     
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(27845 differences between age and agegroup)

. 
. label var age "Age"

. label values age age

. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label var agegroup "Age group"

. label values agegroup agegroup

. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex

        Sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,324       51.44       51.44
       Male |     13,521       48.56      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. safecount
  27,845

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(1,076 real changes made)

. replace ethnicity=2 if ethnicity==3
(1,015 real changes made)

. replace ethnicity=3 if ethnicity==4
(1,073 real changes made)

. replace ethnicity=4 if ethnicity==6
(1,076 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///                                             
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                                                               

. label values ethnicity ethnicity

. safetab ethnicity, m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,742       60.13       60.13
South Asian |      1,015        3.65       63.77
      Black |      1,073        3.85       67.62
      Mixed |      1,076        3.86       71.49
      Other |        994        3.57       75.06
          . |      6,945       24.94      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(6,945 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(6,945 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. label var ethnicity1 "Ethnicity"

. safetab ethnicity1, m

  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,742       60.13       60.13
South Asian |      1,015        3.65       63.77
      Black |      1,073        3.85       67.62
      Mixed |      1,076        3.86       71.49
      Other |        994        3.57       75.06
    Unknown |      6,945       24.94      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,764        9.93        9.93
                Urban minor conurbation |      2,773        9.96       19.89
                    Urban city and town |      2,785       10.00       29.89
Urban city and town in a sparse setting |      2,839       10.20       40.08
                  Rural town and fringe |      2,718        9.76       49.84
Rural town and fringe in a sparse setti |      2,853       10.25       60.09
            Rural village and dispersed |      5,543       19.91       80.00
Rural village and dispersed in a sparse |      5,570       20.00      100.00
----------------------------------------+-----------------------------------
                                  Total |     27,845      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(27,845 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(11,161 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(16,684 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                                       rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow  Rural tow  Rural vil  Rural vil |     Total
-----------+----------------------------------------------------------------------------------------+----------
     Rural |         0          0          0          0      2,718      2,853      5,543      5,570 |    16,684 
     Urban |     2,764      2,773      2,785      2,839          0          0          0          0 |    11,161 
-----------+----------------------------------------------------------------------------------------+----------
     Total |     2,764      2,773      2,785      2,839      2,718      2,853      5,543      5,570 |    27,845 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Historical comparator |    11,868      7,996 |    19,864 
           SARS-CoV-2 |     4,816      3,165 |     7,981 
----------------------+----------------------+----------
                Total |    16,684     11,161 |    27,845 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,881 real changes made, 2,881 to missing)

. gen     bmi = .
(27,845 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(1696 changes made to bmi)

. recode  bmi . = 2 if body_mass_index<25
(6308 changes made to bmi)

. recode  bmi . = 3 if body_mass_index<30
(6500 changes made to bmi)

. recode  bmi . = 4 if body_mass_index<35
(5547 changes made to bmi)

. recode  bmi . = 5 if body_mass_index<40
(3234 changes made to bmi)

. recode  bmi . = 6 if body_mass_index<.
(1679 changes made to bmi)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                             

. label values bmi bmi

. label var bmi "Body mass index (BMI)"

. safetab bmi, m

     Body mass index |
               (BMI) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,696        6.09        6.09
  Normal (18.5-24.9) |      6,308       22.65       28.74
Overweight (25-29.9) |      6,500       23.34       52.09
   Obese I (30-34.9) |      5,547       19.92       72.01
  Obese II (35-39.9) |      3,234       11.61       83.62
     Obese III (40+) |      1,679        6.03       89.65
                   . |      2,881       10.35      100.00
---------------------+-----------------------------------
               Total |     27,845      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(24,502 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(511 real changes made)

. replace smoking = 0 if smoking_status=="N"
(1,121 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |      1,121        4.03        4.03
Current/former smoker |      3,854       13.84       17.87
                    . |     22,870       82.13      100.00
----------------------+-----------------------------------
                Total |     27,845      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000)
(12,360 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(15485 changes made to egfr_group)

. label define egfr_group 1 "105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       105 |      4,963       17.82       17.82
     90-104 |      2,165        7.78       25.60
      75-89 |      2,046        7.35       32.95
      60-74 |      2,535        9.10       42.05
      45-59 |      2,460        8.83       50.89
      30-44 |      1,217        4.37       55.26
      15-29 |         99        0.36       55.61
          . |     12,360       44.39      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 15-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(12,360 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(22882 changes made to ckd_stage)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6 "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |     11,709       42.05       42.05
                      CKD 3A |      2,460        8.83       50.89
                      CKD 3B |      1,217        4.37       55.26
                       CKD 4 |         99        0.36       55.61
No baseline eGFR measurement |     12,360       44.39      100.00
-----------------------------+-----------------------------------
                       Total |     27,845      100.00

. 
. * Comorbidities
. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,451       94.99       94.99
          1 |      1,394        5.01      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,288       98.00       98.00
          1 |        557        2.00      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. label var diabetes "Diabetes"

. safetab diabetes

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,277       80.00       80.00
          1 |      5,568       20.00      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,563       98.99       98.99
          1 |        282        1.01      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. safetab heart_failure

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,721       95.96       95.96
          1 |      1,124        4.04      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. safetab hiv

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,286       97.99       97.99
          1 |        559        2.01      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. label var hypertension "Hypertension"

. safetab hypertension

Hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,259       79.94       79.94
          1 |      5,586       20.06      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. label var non_haem_cancer "Cancer (non-haematological)"

. safetab non_haem_cancer

     Cancer |
(non-haemat |
  ological) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,296       98.03       98.03
          1 |        549        1.97      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. safetab myocardial_infarction

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,087       90.10       90.10
          1 |      2,758        9.90      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,274       97.95       97.95
          1 |        571        2.05      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,463       95.04       95.04
          1 |      1,382        4.96      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. safetab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,259       97.90       97.90
          1 |        586        2.10      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,284       97.99       97.99
          1 |        561        2.01      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(1,064 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,520 real changes made)

. replace cardiovascular = 1 if pvd==1
(464 real changes made)

. replace cardiovascular = 1 if stroke==1
(458 real changes made)

. label var cardiovascular "Cardiovascular diseases"

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(550 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,333 real changes made)

. replace immunosuppressed = 1 if lupus==1
(516 real changes made)

. label var immunosuppressed "Immunosuppressive diseases"

. safetab cardiovascular

Cardiovascu |
        lar |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,945       78.81       78.81
          1 |      5,900       21.19      100.00
------------+-----------------------------------
      Total |     27,845      100.00

. safetab immunosuppressed

Immunosuppr |
     essive |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,164       90.37       90.37
          1 |      2,681        9.63      100.00
------------+-----------------------------------
      Total |     27,845      100.00

.  
. **Outcomes
. * Kidney failure
.         * Kidney failure (also known as end-stage renal disease (ESRD)) occurs when individuals require kidney replacement therapy (i.e. dialysis or kidney transplantation), or when their eGFR is <15
.         * eGFR <15 (earliest month) calculated using age, sex and extracted monthly follow-up serum creatinine
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                                 creatinine_mar2017 ///
>                                                                                 creatinine_apr2017 ///
>                                                                                 creatinine_may2017 ///
>                                                                                 creatinine_jun2017 ///
>                                                                                 creatinine_jul2017 ///
>                                                                                 creatinine_aug2017 ///
>                                                                                 creatinine_sep2017 ///
>                                                                                 creatinine_oct2017 ///
>                                                                                 creatinine_nov2017 ///
>                                                                                 creatinine_dec2017 ///
>                                                                                 creatinine_jan2018 ///
>                                                                                 creatinine_feb2018 ///
>                                                                                 creatinine_mar2018 ///
>                                                                                 creatinine_apr2018 ///
>                                                                                 creatinine_may2018 ///
>                                                                                 creatinine_jun2018 ///
>                                                                                 creatinine_jul2018 ///
>                                                                                 creatinine_aug2018 ///
>                                                                                 creatinine_sep2018 ///
>                                                                                 creatinine_oct2018 ///
>                                                                                 creatinine_nov2018 ///
>                                                                                 creatinine_dec2018 ///
>                                                                                 creatinine_jan2019 ///
>                                                                                 creatinine_feb2019 ///
>                                                                                 creatinine_mar2019 ///
>                                                                                 creatinine_apr2019 ///
>                                                                                 creatinine_may2019 ///
>                                                                                 creatinine_jun2019 ///
>                                                                                 creatinine_jul2019 ///
>                                                                                 creatinine_aug2019 ///
>                                                                                 creatinine_sep2019 ///
>                                                                                 creatinine_feb2020 ///
>                                                                                 creatinine_mar2020 ///
>                                                                                 creatinine_apr2020 ///
>                                                                                 creatinine_may2020 ///
>                                                                                 creatinine_jun2020 ///
>                                                                                 creatinine_jul2020 ///
>                                                                                 creatinine_aug2020 ///
>                                                                                 creatinine_sep2020 ///
>                                                                                 creatinine_oct2020 ///
>                                                                                 creatinine_nov2020 ///
>                                                                                 creatinine_dec2020 ///
>                                                                                 creatinine_jan2021 ///
>                                                                                 creatinine_feb2021 ///
>                                                                                 creatinine_mar2021 ///
>                                                                                 creatinine_apr2021 ///
>                                                                                 creatinine_may2021 ///
>                                                                                 creatinine_jun2021 ///
>                                                                                 creatinine_jul2021 ///
>                                                                                 creatinine_aug2021 ///
>                                                                                 creatinine_sep2021 ///
>                                                                                 creatinine_oct2021 ///
>                                                                                 creatinine_nov2021 ///
>                                                                                 creatinine_dec2021 ///
>                                                                                 creatinine_jan2022 ///
>                                                                                 creatinine_feb2022 ///
>                                                                                 creatinine_mar2022 ///
>                                                                                 creatinine_apr2022 ///
>                                                                                 creatinine_may2022 ///
>                                                                                 creatinine_jun2022 ///
>                                                                                 creatinine_jul2022 ///
>                                                                                 creatinine_aug2022 ///
>                                                                                 creatinine_sep2022 ///
>                                                                                 creatinine_oct2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 3000)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex==0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex==1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_monthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(8,713 real changes made, 8,713 to missing)
(16,694 missing values generated)
(27,845 missing values generated)
(5,717 real changes made)
(5,434 real changes made)
(5,717 real changes made)
(5,434 real changes made)
(7,105 real changes made)
(27,845 missing values generated)
(5,717 real changes made)
(5,434 real changes made)
(11,151 real changes made)
(20,740 real changes made)
(16,694 missing values generated)
(11,151 real changes made)
(5,717 real changes made)
(8,708 real changes made, 8,708 to missing)
(16,689 missing values generated)
(27,845 missing values generated)
(5,776 real changes made)
(5,380 real changes made)
(5,776 real changes made)
(5,380 real changes made)
(7,127 real changes made)
(27,845 missing values generated)
(5,776 real changes made)
(5,380 real changes made)
(11,156 real changes made)
(20,718 real changes made)
(16,689 missing values generated)
(11,156 real changes made)
(5,776 real changes made)
(8,771 real changes made, 8,771 to missing)
(16,752 missing values generated)
(27,845 missing values generated)
(5,735 real changes made)
(5,358 real changes made)
(5,735 real changes made)
(5,358 real changes made)
(7,067 real changes made)
(27,845 missing values generated)
(5,735 real changes made)
(5,358 real changes made)
(11,093 real changes made)
(20,778 real changes made)
(16,752 missing values generated)
(11,093 real changes made)
(5,735 real changes made)
(8,707 real changes made, 8,707 to missing)
(16,688 missing values generated)
(27,845 missing values generated)
(5,723 real changes made)
(5,434 real changes made)
(5,723 real changes made)
(5,434 real changes made)
(7,058 real changes made)
(27,845 missing values generated)
(5,723 real changes made)
(5,434 real changes made)
(11,157 real changes made)
(20,787 real changes made)
(16,688 missing values generated)
(11,157 real changes made)
(5,723 real changes made)
(8,773 real changes made, 8,773 to missing)
(16,754 missing values generated)
(27,845 missing values generated)
(5,663 real changes made)
(5,428 real changes made)
(5,663 real changes made)
(5,428 real changes made)
(6,997 real changes made)
(27,845 missing values generated)
(5,663 real changes made)
(5,428 real changes made)
(11,091 real changes made)
(20,848 real changes made)
(16,754 missing values generated)
(11,091 real changes made)
(5,663 real changes made)
(8,787 real changes made, 8,787 to missing)
(16,768 missing values generated)
(27,845 missing values generated)
(5,719 real changes made)
(5,358 real changes made)
(5,719 real changes made)
(5,358 real changes made)
(7,060 real changes made)
(27,845 missing values generated)
(5,719 real changes made)
(5,358 real changes made)
(11,077 real changes made)
(20,785 real changes made)
(16,768 missing values generated)
(11,077 real changes made)
(5,719 real changes made)
(8,747 real changes made, 8,747 to missing)
(16,728 missing values generated)
(27,845 missing values generated)
(5,731 real changes made)
(5,386 real changes made)
(5,731 real changes made)
(5,386 real changes made)
(6,926 real changes made)
(27,845 missing values generated)
(5,731 real changes made)
(5,386 real changes made)
(11,117 real changes made)
(20,919 real changes made)
(16,728 missing values generated)
(11,117 real changes made)
(5,731 real changes made)
(8,730 real changes made, 8,730 to missing)
(16,711 missing values generated)
(27,845 missing values generated)
(5,753 real changes made)
(5,381 real changes made)
(5,753 real changes made)
(5,381 real changes made)
(7,127 real changes made)
(27,845 missing values generated)
(5,753 real changes made)
(5,381 real changes made)
(11,134 real changes made)
(20,718 real changes made)
(16,711 missing values generated)
(11,134 real changes made)
(5,753 real changes made)
(8,761 real changes made, 8,761 to missing)
(16,742 missing values generated)
(27,845 missing values generated)
(5,673 real changes made)
(5,430 real changes made)
(5,673 real changes made)
(5,430 real changes made)
(7,073 real changes made)
(27,845 missing values generated)
(5,673 real changes made)
(5,430 real changes made)
(11,103 real changes made)
(20,772 real changes made)
(16,742 missing values generated)
(11,103 real changes made)
(5,673 real changes made)
(8,773 real changes made, 8,773 to missing)
(16,754 missing values generated)
(27,845 missing values generated)
(5,727 real changes made)
(5,364 real changes made)
(5,727 real changes made)
(5,364 real changes made)
(7,093 real changes made)
(27,845 missing values generated)
(5,727 real changes made)
(5,364 real changes made)
(11,091 real changes made)
(20,752 real changes made)
(16,754 missing values generated)
(11,091 real changes made)
(5,727 real changes made)
(8,732 real changes made, 8,732 to missing)
(16,713 missing values generated)
(27,845 missing values generated)
(5,735 real changes made)
(5,397 real changes made)
(5,735 real changes made)
(5,397 real changes made)
(7,084 real changes made)
(27,845 missing values generated)
(5,735 real changes made)
(5,397 real changes made)
(11,132 real changes made)
(20,761 real changes made)
(16,713 missing values generated)
(11,132 real changes made)
(5,735 real changes made)
(8,720 real changes made, 8,720 to missing)
(16,701 missing values generated)
(27,845 missing values generated)
(5,719 real changes made)
(5,425 real changes made)
(5,719 real changes made)
(5,425 real changes made)
(7,082 real changes made)
(27,845 missing values generated)
(5,719 real changes made)
(5,425 real changes made)
(11,144 real changes made)
(20,763 real changes made)
(16,701 missing values generated)
(11,144 real changes made)
(5,719 real changes made)
(8,763 real changes made, 8,763 to missing)
(16,744 missing values generated)
(27,845 missing values generated)
(5,724 real changes made)
(5,377 real changes made)
(5,724 real changes made)
(5,377 real changes made)
(7,058 real changes made)
(27,845 missing values generated)
(5,724 real changes made)
(5,377 real changes made)
(11,101 real changes made)
(20,787 real changes made)
(16,744 missing values generated)
(11,101 real changes made)
(5,724 real changes made)
(8,766 real changes made, 8,766 to missing)
(16,747 missing values generated)
(27,845 missing values generated)
(5,638 real changes made)
(5,460 real changes made)
(5,638 real changes made)
(5,460 real changes made)
(7,054 real changes made)
(27,845 missing values generated)
(5,638 real changes made)
(5,460 real changes made)
(11,098 real changes made)
(20,791 real changes made)
(16,747 missing values generated)
(11,098 real changes made)
(5,638 real changes made)
(8,762 real changes made, 8,762 to missing)
(16,743 missing values generated)
(27,845 missing values generated)
(5,678 real changes made)
(5,424 real changes made)
(5,678 real changes made)
(5,424 real changes made)
(7,047 real changes made)
(27,845 missing values generated)
(5,678 real changes made)
(5,424 real changes made)
(11,102 real changes made)
(20,798 real changes made)
(16,743 missing values generated)
(11,102 real changes made)
(5,678 real changes made)
(8,731 real changes made, 8,731 to missing)
(16,712 missing values generated)
(27,845 missing values generated)
(5,727 real changes made)
(5,406 real changes made)
(5,727 real changes made)
(5,406 real changes made)
(7,077 real changes made)
(27,845 missing values generated)
(5,727 real changes made)
(5,406 real changes made)
(11,133 real changes made)
(20,768 real changes made)
(16,712 missing values generated)
(11,133 real changes made)
(5,727 real changes made)
(8,704 real changes made, 8,704 to missing)
(16,685 missing values generated)
(27,845 missing values generated)
(5,734 real changes made)
(5,426 real changes made)
(5,734 real changes made)
(5,426 real changes made)
(7,062 real changes made)
(27,845 missing values generated)
(5,734 real changes made)
(5,426 real changes made)
(11,160 real changes made)
(20,783 real changes made)
(16,685 missing values generated)
(11,160 real changes made)
(5,734 real changes made)
(8,747 real changes made, 8,747 to missing)
(16,728 missing values generated)
(27,845 missing values generated)
(5,706 real changes made)
(5,411 real changes made)
(5,706 real changes made)
(5,411 real changes made)
(6,991 real changes made)
(27,845 missing values generated)
(5,706 real changes made)
(5,411 real changes made)
(11,117 real changes made)
(20,854 real changes made)
(16,728 missing values generated)
(11,117 real changes made)
(5,706 real changes made)
(8,797 real changes made, 8,797 to missing)
(16,778 missing values generated)
(27,845 missing values generated)
(5,696 real changes made)
(5,371 real changes made)
(5,696 real changes made)
(5,371 real changes made)
(7,010 real changes made)
(27,845 missing values generated)
(5,696 real changes made)
(5,371 real changes made)
(11,067 real changes made)
(20,835 real changes made)
(16,778 missing values generated)
(11,067 real changes made)
(5,696 real changes made)
(8,738 real changes made, 8,738 to missing)
(16,719 missing values generated)
(27,845 missing values generated)
(5,724 real changes made)
(5,402 real changes made)
(5,724 real changes made)
(5,402 real changes made)
(7,105 real changes made)
(27,845 missing values generated)
(5,724 real changes made)
(5,402 real changes made)
(11,126 real changes made)
(20,740 real changes made)
(16,719 missing values generated)
(11,126 real changes made)
(5,724 real changes made)
(8,784 real changes made, 8,784 to missing)
(16,765 missing values generated)
(27,845 missing values generated)
(5,685 real changes made)
(5,395 real changes made)
(5,685 real changes made)
(5,395 real changes made)
(7,002 real changes made)
(27,845 missing values generated)
(5,685 real changes made)
(5,395 real changes made)
(11,080 real changes made)
(20,843 real changes made)
(16,765 missing values generated)
(11,080 real changes made)
(5,685 real changes made)
(8,732 real changes made, 8,732 to missing)
(16,713 missing values generated)
(27,845 missing values generated)
(5,761 real changes made)
(5,371 real changes made)
(5,761 real changes made)
(5,371 real changes made)
(7,049 real changes made)
(27,845 missing values generated)
(5,761 real changes made)
(5,371 real changes made)
(11,132 real changes made)
(20,796 real changes made)
(16,713 missing values generated)
(11,132 real changes made)
(5,761 real changes made)
(8,782 real changes made, 8,782 to missing)
(16,763 missing values generated)
(27,845 missing values generated)
(5,627 real changes made)
(5,455 real changes made)
(5,627 real changes made)
(5,455 real changes made)
(7,027 real changes made)
(27,845 missing values generated)
(5,627 real changes made)
(5,455 real changes made)
(11,082 real changes made)
(20,818 real changes made)
(16,763 missing values generated)
(11,082 real changes made)
(5,627 real changes made)
(8,769 real changes made, 8,769 to missing)
(16,750 missing values generated)
(27,845 missing values generated)
(5,671 real changes made)
(5,424 real changes made)
(5,671 real changes made)
(5,424 real changes made)
(7,057 real changes made)
(27,845 missing values generated)
(5,671 real changes made)
(5,424 real changes made)
(11,095 real changes made)
(20,788 real changes made)
(16,750 missing values generated)
(11,095 real changes made)
(5,671 real changes made)
(8,737 real changes made, 8,737 to missing)
(16,718 missing values generated)
(27,845 missing values generated)
(5,740 real changes made)
(5,387 real changes made)
(5,740 real changes made)
(5,387 real changes made)
(7,066 real changes made)
(27,845 missing values generated)
(5,740 real changes made)
(5,387 real changes made)
(11,127 real changes made)
(20,779 real changes made)
(16,718 missing values generated)
(11,127 real changes made)
(5,740 real changes made)
(8,722 real changes made, 8,722 to missing)
(16,703 missing values generated)
(27,845 missing values generated)
(5,725 real changes made)
(5,417 real changes made)
(5,725 real changes made)
(5,417 real changes made)
(7,094 real changes made)
(27,845 missing values generated)
(5,725 real changes made)
(5,417 real changes made)
(11,142 real changes made)
(20,751 real changes made)
(16,703 missing values generated)
(11,142 real changes made)
(5,725 real changes made)
(8,717 real changes made, 8,717 to missing)
(16,698 missing values generated)
(27,845 missing values generated)
(5,698 real changes made)
(5,449 real changes made)
(5,698 real changes made)
(5,449 real changes made)
(7,081 real changes made)
(27,845 missing values generated)
(5,698 real changes made)
(5,449 real changes made)
(11,147 real changes made)
(20,764 real changes made)
(16,698 missing values generated)
(11,147 real changes made)
(5,698 real changes made)
(8,767 real changes made, 8,767 to missing)
(16,748 missing values generated)
(27,845 missing values generated)
(5,753 real changes made)
(5,344 real changes made)
(5,753 real changes made)
(5,344 real changes made)
(6,930 real changes made)
(27,845 missing values generated)
(5,753 real changes made)
(5,344 real changes made)
(11,097 real changes made)
(20,915 real changes made)
(16,748 missing values generated)
(11,097 real changes made)
(5,753 real changes made)
(8,741 real changes made, 8,741 to missing)
(16,722 missing values generated)
(27,845 missing values generated)
(5,738 real changes made)
(5,385 real changes made)
(5,738 real changes made)
(5,385 real changes made)
(6,991 real changes made)
(27,845 missing values generated)
(5,738 real changes made)
(5,385 real changes made)
(11,123 real changes made)
(20,854 real changes made)
(16,722 missing values generated)
(11,123 real changes made)
(5,738 real changes made)
(8,782 real changes made, 8,782 to missing)
(16,763 missing values generated)
(27,845 missing values generated)
(5,740 real changes made)
(5,342 real changes made)
(5,740 real changes made)
(5,342 real changes made)
(7,063 real changes made)
(27,845 missing values generated)
(5,740 real changes made)
(5,342 real changes made)
(11,082 real changes made)
(20,782 real changes made)
(16,763 missing values generated)
(11,082 real changes made)
(5,740 real changes made)
(8,766 real changes made, 8,766 to missing)
(16,747 missing values generated)
(27,845 missing values generated)
(5,731 real changes made)
(5,367 real changes made)
(5,731 real changes made)
(5,367 real changes made)
(6,951 real changes made)
(27,845 missing values generated)
(5,731 real changes made)
(5,367 real changes made)
(11,098 real changes made)
(20,894 real changes made)
(16,747 missing values generated)
(11,098 real changes made)
(5,731 real changes made)
(8,685 real changes made, 8,685 to missing)
(16,666 missing values generated)
(27,845 missing values generated)
(5,752 real changes made)
(5,427 real changes made)
(5,752 real changes made)
(5,427 real changes made)
(7,111 real changes made)
(27,845 missing values generated)
(5,752 real changes made)
(5,427 real changes made)
(11,179 real changes made)
(20,734 real changes made)
(16,666 missing values generated)
(11,179 real changes made)
(5,752 real changes made)
(3,503 real changes made, 3,503 to missing)
(23,367 missing values generated)
(27,845 missing values generated)
(2,330 real changes made)
(2,148 real changes made)
(2,330 real changes made)
(2,148 real changes made)
(2,858 real changes made)
(27,845 missing values generated)
(2,330 real changes made)
(2,148 real changes made)
(4,478 real changes made)
(24,987 real changes made)
(23,367 missing values generated)
(4,478 real changes made)
(2,330 real changes made)
(3,498 real changes made, 3,498 to missing)
(23,362 missing values generated)
(27,845 missing values generated)
(2,276 real changes made)
(2,207 real changes made)
(2,276 real changes made)
(2,207 real changes made)
(2,837 real changes made)
(27,845 missing values generated)
(2,276 real changes made)
(2,207 real changes made)
(4,483 real changes made)
(25,008 real changes made)
(23,362 missing values generated)
(4,483 real changes made)
(2,276 real changes made)
(3,495 real changes made, 3,495 to missing)
(23,359 missing values generated)
(27,845 missing values generated)
(2,330 real changes made)
(2,156 real changes made)
(2,330 real changes made)
(2,156 real changes made)
(2,814 real changes made)
(27,845 missing values generated)
(2,330 real changes made)
(2,156 real changes made)
(4,486 real changes made)
(25,031 real changes made)
(23,359 missing values generated)
(4,486 real changes made)
(2,330 real changes made)
(3,457 real changes made, 3,457 to missing)
(23,321 missing values generated)
(27,845 missing values generated)
(2,267 real changes made)
(2,257 real changes made)
(2,267 real changes made)
(2,257 real changes made)
(2,812 real changes made)
(27,845 missing values generated)
(2,267 real changes made)
(2,257 real changes made)
(4,524 real changes made)
(25,033 real changes made)
(23,321 missing values generated)
(4,524 real changes made)
(2,267 real changes made)
(3,495 real changes made, 3,495 to missing)
(23,359 missing values generated)
(27,845 missing values generated)
(2,313 real changes made)
(2,173 real changes made)
(2,313 real changes made)
(2,173 real changes made)
(2,843 real changes made)
(27,845 missing values generated)
(2,313 real changes made)
(2,173 real changes made)
(4,486 real changes made)
(25,002 real changes made)
(23,359 missing values generated)
(4,486 real changes made)
(2,313 real changes made)
(3,481 real changes made, 3,481 to missing)
(23,345 missing values generated)
(27,845 missing values generated)
(2,278 real changes made)
(2,222 real changes made)
(2,278 real changes made)
(2,222 real changes made)
(2,835 real changes made)
(27,845 missing values generated)
(2,278 real changes made)
(2,222 real changes made)
(4,500 real changes made)
(25,010 real changes made)
(23,345 missing values generated)
(4,500 real changes made)
(2,278 real changes made)
(3,480 real changes made, 3,480 to missing)
(23,344 missing values generated)
(27,845 missing values generated)
(2,308 real changes made)
(2,193 real changes made)
(2,308 real changes made)
(2,193 real changes made)
(2,874 real changes made)
(27,845 missing values generated)
(2,308 real changes made)
(2,193 real changes made)
(4,501 real changes made)
(24,971 real changes made)
(23,344 missing values generated)
(4,501 real changes made)
(2,308 real changes made)
(3,546 real changes made, 3,546 to missing)
(23,410 missing values generated)
(27,845 missing values generated)
(2,263 real changes made)
(2,172 real changes made)
(2,263 real changes made)
(2,172 real changes made)
(2,829 real changes made)
(27,845 missing values generated)
(2,263 real changes made)
(2,172 real changes made)
(4,435 real changes made)
(25,016 real changes made)
(23,410 missing values generated)
(4,435 real changes made)
(2,263 real changes made)
(3,530 real changes made, 3,530 to missing)
(23,394 missing values generated)
(27,845 missing values generated)
(2,277 real changes made)
(2,174 real changes made)
(2,277 real changes made)
(2,174 real changes made)
(2,855 real changes made)
(27,845 missing values generated)
(2,277 real changes made)
(2,174 real changes made)
(4,451 real changes made)
(24,990 real changes made)
(23,394 missing values generated)
(4,451 real changes made)
(2,277 real changes made)
(3,523 real changes made, 3,523 to missing)
(23,387 missing values generated)
(27,845 missing values generated)
(2,277 real changes made)
(2,181 real changes made)
(2,277 real changes made)
(2,181 real changes made)
(2,817 real changes made)
(27,845 missing values generated)
(2,277 real changes made)
(2,181 real changes made)
(4,458 real changes made)
(25,028 real changes made)
(23,387 missing values generated)
(4,458 real changes made)
(2,277 real changes made)
(3,538 real changes made, 3,538 to missing)
(23,402 missing values generated)
(27,845 missing values generated)
(2,300 real changes made)
(2,143 real changes made)
(2,300 real changes made)
(2,143 real changes made)
(2,887 real changes made)
(27,845 missing values generated)
(2,300 real changes made)
(2,143 real changes made)
(4,443 real changes made)
(24,958 real changes made)
(23,402 missing values generated)
(4,443 real changes made)
(2,300 real changes made)
(3,521 real changes made, 3,521 to missing)
(23,385 missing values generated)
(27,845 missing values generated)
(2,340 real changes made)
(2,120 real changes made)
(2,340 real changes made)
(2,120 real changes made)
(2,817 real changes made)
(27,845 missing values generated)
(2,340 real changes made)
(2,120 real changes made)
(4,460 real changes made)
(25,028 real changes made)
(23,385 missing values generated)
(4,460 real changes made)
(2,340 real changes made)
(3,511 real changes made, 3,511 to missing)
(23,375 missing values generated)
(27,845 missing values generated)
(2,331 real changes made)
(2,139 real changes made)
(2,331 real changes made)
(2,139 real changes made)
(2,845 real changes made)
(27,845 missing values generated)
(2,331 real changes made)
(2,139 real changes made)
(4,470 real changes made)
(25,000 real changes made)
(23,375 missing values generated)
(4,470 real changes made)
(2,331 real changes made)
(3,427 real changes made, 3,427 to missing)
(23,291 missing values generated)
(27,845 missing values generated)
(2,336 real changes made)
(2,218 real changes made)
(2,336 real changes made)
(2,218 real changes made)
(2,922 real changes made)
(27,845 missing values generated)
(2,336 real changes made)
(2,218 real changes made)
(4,554 real changes made)
(24,923 real changes made)
(23,291 missing values generated)
(4,554 real changes made)
(2,336 real changes made)
(3,528 real changes made, 3,528 to missing)
(23,392 missing values generated)
(27,845 missing values generated)
(2,252 real changes made)
(2,201 real changes made)
(2,252 real changes made)
(2,201 real changes made)
(2,798 real changes made)
(27,845 missing values generated)
(2,252 real changes made)
(2,201 real changes made)
(4,453 real changes made)
(25,047 real changes made)
(23,392 missing values generated)
(4,453 real changes made)
(2,252 real changes made)
(3,536 real changes made, 3,536 to missing)
(23,400 missing values generated)
(27,845 missing values generated)
(2,256 real changes made)
(2,189 real changes made)
(2,256 real changes made)
(2,189 real changes made)
(2,770 real changes made)
(27,845 missing values generated)
(2,256 real changes made)
(2,189 real changes made)
(4,445 real changes made)
(25,075 real changes made)
(23,400 missing values generated)
(4,445 real changes made)
(2,256 real changes made)
(3,518 real changes made, 3,518 to missing)
(23,382 missing values generated)
(27,845 missing values generated)
(2,302 real changes made)
(2,161 real changes made)
(2,302 real changes made)
(2,161 real changes made)
(2,812 real changes made)
(27,845 missing values generated)
(2,302 real changes made)
(2,161 real changes made)
(4,463 real changes made)
(25,033 real changes made)
(23,382 missing values generated)
(4,463 real changes made)
(2,302 real changes made)
(3,540 real changes made, 3,540 to missing)
(23,404 missing values generated)
(27,845 missing values generated)
(2,316 real changes made)
(2,125 real changes made)
(2,316 real changes made)
(2,125 real changes made)
(2,825 real changes made)
(27,845 missing values generated)
(2,316 real changes made)
(2,125 real changes made)
(4,441 real changes made)
(25,020 real changes made)
(23,404 missing values generated)
(4,441 real changes made)
(2,316 real changes made)
(3,543 real changes made, 3,543 to missing)
(23,407 missing values generated)
(27,845 missing values generated)
(2,329 real changes made)
(2,109 real changes made)
(2,329 real changes made)
(2,109 real changes made)
(2,784 real changes made)
(27,845 missing values generated)
(2,329 real changes made)
(2,109 real changes made)
(4,438 real changes made)
(25,061 real changes made)
(23,407 missing values generated)
(4,438 real changes made)
(2,329 real changes made)
(3,464 real changes made, 3,464 to missing)
(23,328 missing values generated)
(27,845 missing values generated)
(2,296 real changes made)
(2,221 real changes made)
(2,296 real changes made)
(2,221 real changes made)
(2,806 real changes made)
(27,845 missing values generated)
(2,296 real changes made)
(2,221 real changes made)
(4,517 real changes made)
(25,039 real changes made)
(23,328 missing values generated)
(4,517 real changes made)
(2,296 real changes made)
(3,488 real changes made, 3,488 to missing)
(23,352 missing values generated)
(27,845 missing values generated)
(2,306 real changes made)
(2,187 real changes made)
(2,306 real changes made)
(2,187 real changes made)
(2,880 real changes made)
(27,845 missing values generated)
(2,306 real changes made)
(2,187 real changes made)
(4,493 real changes made)
(24,965 real changes made)
(23,352 missing values generated)
(4,493 real changes made)
(2,306 real changes made)
(3,490 real changes made, 3,490 to missing)
(23,354 missing values generated)
(27,845 missing values generated)
(2,336 real changes made)
(2,155 real changes made)
(2,336 real changes made)
(2,155 real changes made)
(2,880 real changes made)
(27,845 missing values generated)
(2,336 real changes made)
(2,155 real changes made)
(4,491 real changes made)
(24,965 real changes made)
(23,354 missing values generated)
(4,491 real changes made)
(2,336 real changes made)
(3,478 real changes made, 3,478 to missing)
(23,342 missing values generated)
(27,845 missing values generated)
(2,344 real changes made)
(2,159 real changes made)
(2,344 real changes made)
(2,159 real changes made)
(2,828 real changes made)
(27,845 missing values generated)
(2,344 real changes made)
(2,159 real changes made)
(4,503 real changes made)
(25,017 real changes made)
(23,342 missing values generated)
(4,503 real changes made)
(2,344 real changes made)
(3,540 real changes made, 3,540 to missing)
(23,404 missing values generated)
(27,845 missing values generated)
(2,238 real changes made)
(2,203 real changes made)
(2,238 real changes made)
(2,203 real changes made)
(2,798 real changes made)
(27,845 missing values generated)
(2,238 real changes made)
(2,203 real changes made)
(4,441 real changes made)
(25,047 real changes made)
(23,404 missing values generated)
(4,441 real changes made)
(2,238 real changes made)
(3,497 real changes made, 3,497 to missing)
(23,361 missing values generated)
(27,845 missing values generated)
(2,345 real changes made)
(2,139 real changes made)
(2,345 real changes made)
(2,139 real changes made)
(2,918 real changes made)
(27,845 missing values generated)
(2,345 real changes made)
(2,139 real changes made)
(4,484 real changes made)
(24,927 real changes made)
(23,361 missing values generated)
(4,484 real changes made)
(2,345 real changes made)
(3,497 real changes made, 3,497 to missing)
(23,361 missing values generated)
(27,845 missing values generated)
(2,286 real changes made)
(2,198 real changes made)
(2,286 real changes made)
(2,198 real changes made)
(2,819 real changes made)
(27,845 missing values generated)
(2,286 real changes made)
(2,198 real changes made)
(4,484 real changes made)
(25,026 real changes made)
(23,361 missing values generated)
(4,484 real changes made)
(2,286 real changes made)
(3,512 real changes made, 3,512 to missing)
(23,376 missing values generated)
(27,845 missing values generated)
(2,296 real changes made)
(2,173 real changes made)
(2,296 real changes made)
(2,173 real changes made)
(2,841 real changes made)
(27,845 missing values generated)
(2,296 real changes made)
(2,173 real changes made)
(4,469 real changes made)
(25,004 real changes made)
(23,376 missing values generated)
(4,469 real changes made)
(2,296 real changes made)
(3,490 real changes made, 3,490 to missing)
(23,354 missing values generated)
(27,845 missing values generated)
(2,293 real changes made)
(2,198 real changes made)
(2,293 real changes made)
(2,198 real changes made)
(2,871 real changes made)
(27,845 missing values generated)
(2,293 real changes made)
(2,198 real changes made)
(4,491 real changes made)
(24,974 real changes made)
(23,354 missing values generated)
(4,491 real changes made)
(2,293 real changes made)
(3,494 real changes made, 3,494 to missing)
(23,358 missing values generated)
(27,845 missing values generated)
(2,308 real changes made)
(2,179 real changes made)
(2,308 real changes made)
(2,179 real changes made)
(2,795 real changes made)
(27,845 missing values generated)
(2,308 real changes made)
(2,179 real changes made)
(4,487 real changes made)
(25,050 real changes made)
(23,358 missing values generated)
(4,487 real changes made)
(2,308 real changes made)
(3,555 real changes made, 3,555 to missing)
(23,419 missing values generated)
(27,845 missing values generated)
(2,250 real changes made)
(2,176 real changes made)
(2,250 real changes made)
(2,176 real changes made)
(2,780 real changes made)
(27,845 missing values generated)
(2,250 real changes made)
(2,176 real changes made)
(4,426 real changes made)
(25,065 real changes made)
(23,419 missing values generated)
(4,426 real changes made)
(2,250 real changes made)
(3,506 real changes made, 3,506 to missing)
(23,370 missing values generated)
(27,845 missing values generated)
(2,311 real changes made)
(2,164 real changes made)
(2,311 real changes made)
(2,164 real changes made)
(2,814 real changes made)
(27,845 missing values generated)
(2,311 real changes made)
(2,164 real changes made)
(4,475 real changes made)
(25,031 real changes made)
(23,370 missing values generated)
(4,475 real changes made)
(2,311 real changes made)
(3,479 real changes made, 3,479 to missing)
(23,343 missing values generated)
(27,845 missing values generated)
(2,317 real changes made)
(2,185 real changes made)
(2,317 real changes made)
(2,185 real changes made)
(2,891 real changes made)
(27,845 missing values generated)
(2,317 real changes made)
(2,185 real changes made)
(4,502 real changes made)
(24,954 real changes made)
(23,343 missing values generated)
(4,502 real changes made)
(2,317 real changes made)
(3,524 real changes made, 3,524 to missing)
(23,388 missing values generated)
(27,845 missing values generated)
(2,257 real changes made)
(2,200 real changes made)
(2,257 real changes made)
(2,200 real changes made)
(2,758 real changes made)
(27,845 missing values generated)
(2,257 real changes made)
(2,200 real changes made)
(4,457 real changes made)
(25,087 real changes made)
(23,388 missing values generated)
(4,457 real changes made)
(2,257 real changes made)

. 
.         * The index_date variable is either date of first diagnosis of COVID-19 or corresponding matched date 3 years earlier for matched historical comparators
.         * This date isn't required any longer and so index_date_28 (i.e. start of follow-up) renamed index_date
. replace index_date = index_date_28
(27,845 real changes made)

. drop index_date_28

. gen egfr15_date=.
(27,845 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatinine_`x'<15 & date("01`x'", "DMY")>index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
.         * esrd_date is the date an individual reaches kidney failure (also known as end-stage renal disease (ESRD))
.         * esrd_date is defined by the first recording of either eGFR <15 or a code for kidney replacement therapy during follow-up (whichever is earlier)
. gen esrd_date = egfr15_date
(27,845 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if krt_date < egfr15_date
(2,781 real changes made)

. replace esrd_date = krt_date if esrd_date==.
(0 real changes made)

. gen esrd = 0

. replace esrd = 1 if esrd_date!=.
(2,781 real changes made)

. label var esrd "Kidney failure"

. gen index_date_esrd = index_date

. gen esrd_time = (esrd_date - index_date_esrd)
(25,064 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(25,064 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(2777 changes made to esrd_time_cat)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"                      ///
>                                                         3 "1 to 28 days"        ///
>                                                         4 "20 to 90 days"       ///
>                                                         5 "91 to 180 days"      ///
>                                                         6 "181 to 365 days"     ///
>                                                         7 "366 to 730 days"     ///
>                                                         8 "731 to 973 days"     ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 covid_severity  ///
>                                                                 covid_aki               {
  2.                                                                 by `exposure',sort: sum esrd_time, de
  3.                                                                 tab esrd_time_cat `exposure', m col chi
  4.                                                                 }

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            5              1
10%           47              1       Obs               1,993
25%          160              1       Sum of wgt.       1,993

50%          352                      Mean           373.7797
                        Largest       Std. dev.      253.6135
75%          570            964
90%          743            966       Variance       64319.78
95%          820            976       Skewness       .3468242
99%          934            982       Kurtosis       2.146397

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = SARS-CoV-2

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            7              1
10%           36              1       Obs                 788
25%          135              1       Sum of wgt.         788

50%          323                      Mean           354.0203
                        Largest       Std. dev.      250.3852
75%          547            939
90%          720            942       Variance       62692.76
95%          797            949       Skewness       .3738423
99%          919            952       Kurtosis       2.110428


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Historica  SARS-CoV- |     Total
----------------+----------------------+----------
   1 to 28 days |       160         71 |       231 
                |      0.81       0.89 |      0.83 
----------------+----------------------+----------
  20 to 90 days |       150         76 |       226 
                |      0.76       0.95 |      0.81 
----------------+----------------------+----------
 91 to 180 days |       247         95 |       342 
                |      1.24       1.19 |      1.23 
----------------+----------------------+----------
181 to 365 days |       480        192 |       672 
                |      2.42       2.41 |      2.41 
----------------+----------------------+----------
366 to 730 days |       746        277 |     1,023 
                |      3.76       3.47 |      3.67 
----------------+----------------------+----------
731 to 973 days |       208         77 |       285 
                |      1.05       0.96 |      1.02 
----------------+----------------------+----------
      >973 days |         2          0 |         2 
                |      0.01       0.00 |      0.01 
----------------+----------------------+----------
              . |    17,871      7,193 |    25,064 
                |     89.97      90.13 |     90.01 
----------------+----------------------+----------
          Total |    19,864      7,981 |    27,845 
                |    100.00     100.00 |    100.00 

          Pearson chi2(7) =   5.7989   Pr = 0.563

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            5              1
10%           47              1       Obs               1,993
25%          160              1       Sum of wgt.       1,993

50%          352                      Mean           373.7797
                        Largest       Std. dev.      253.6135
75%          570            964
90%          743            966       Variance       64319.78
95%          820            976       Skewness       .3468242
99%          934            982       Kurtosis       2.146397

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            6              1
10%           30              1       Obs                 615
25%          127              1       Sum of wgt.         615

50%          311                      Mean           343.9854
                        Largest       Std. dev.      248.0892
75%          537            939
90%          712            942       Variance       61548.28
95%          796            949       Skewness       .4256185
99%          915            952       Kurtosis       2.194199

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           28              1
10%           61              8       Obs                  85
25%          153             20       Sum of wgt.          85

50%          359                      Mean           399.4824
                        Largest       Std. dev.      275.6987
75%          659            883
90%          790            899       Variance        76009.8
95%          868            925       Skewness       .2759909
99%          934            934       Kurtosis       1.782702

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Critical care COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           45              1       Obs                  88
25%        195.5              1       Sum of wgt.          88

50%          381                      Mean           380.2386
                        Largest       Std. dev.      236.4887
75%        569.5            764
90%          702            783       Variance       55926.92
95%          761            804       Skewness       .0179941
99%          815            815       Kurtosis       1.921752


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |             SARS-CoV-2 severity
  esrd_time_cat | Historica  Non-hospi  Hospitali  Critical  |     Total
----------------+--------------------------------------------+----------
   1 to 28 days |       160         59          5          7 |       231 
                |      0.81       0.91       0.67       0.93 |      0.83 
----------------+--------------------------------------------+----------
  20 to 90 days |       150         62          8          6 |       226 
                |      0.76       0.96       1.08       0.80 |      0.81 
----------------+--------------------------------------------+----------
 91 to 180 days |       247         75         12          8 |       342 
                |      1.24       1.16       1.62       1.06 |      1.23 
----------------+--------------------------------------------+----------
181 to 365 days |       480        154         18         20 |       672 
                |      2.42       2.37       2.42       2.66 |      2.41 
----------------+--------------------------------------------+----------
366 to 730 days |       746        209         29         39 |     1,023 
                |      3.76       3.22       3.90       5.18 |      3.67 
----------------+--------------------------------------------+----------
731 to 973 days |       208         56         13          8 |       285 
                |      1.05       0.86       1.75       1.06 |      1.02 
----------------+--------------------------------------------+----------
      >973 days |         2          0          0          0 |         2 
                |      0.01       0.00       0.00       0.00 |      0.01 
----------------+--------------------------------------------+----------
              . |    17,871      5,870        658        665 |    25,064 
                |     89.97      90.52      88.56      88.31 |     90.01 
----------------+--------------------------------------------+----------
          Total |    19,864      6,485        743        753 |    27,845 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(21) =  21.3319   Pr = 0.439

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            5              1
10%           47              1       Obs               1,993
25%          160              1       Sum of wgt.       1,993

50%          352                      Mean           373.7797
                        Largest       Std. dev.      253.6135
75%          570            964
90%          743            966       Variance       64319.78
95%          820            976       Skewness       .3468242
99%          934            982       Kurtosis       2.146397

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           29              1       Obs                 659
25%          130              1       Sum of wgt.         659

50%          323                      Mean            348.563
                        Largest       Std. dev.      247.4949
75%          541            919
90%          716            923       Variance       61253.71
95%          792            939       Skewness       .3553043
99%          897            942       Kurtosis       2.100937

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           28              1
10%           62              8       Obs                  95
25%          153             20       Sum of wgt.          95

50%          361                      Mean           395.2842
                        Largest       Std. dev.       267.137
75%          651            883
90%          768            899       Variance       71362.16
95%          868            925       Skewness       .2915009
99%          934            934       Kurtosis       1.867532

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID-AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           45             45
10%           72             54       Obs                  34
25%          158             72       Sum of wgt.          34

50%          265                      Mean              344.5
                        Largest       Std. dev.      254.7579
75%          533            695
90%          695            789       Variance       64901.59
95%          949            949       Skewness       .8155222
99%          952            952       Kurtosis        2.87013


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |        COVID-19 acute kidney injury
  esrd_time_cat | Historica  Non-hospi  Hospitali  Hospitali |     Total
----------------+--------------------------------------------+----------
   1 to 28 days |       160         65          5          1 |       231 
                |      0.81       0.95       0.63       0.26 |      0.83 
----------------+--------------------------------------------+----------
  20 to 90 days |       150         65          8          3 |       226 
                |      0.76       0.95       1.01       0.79 |      0.81 
----------------+--------------------------------------------+----------
 91 to 180 days |       247         74         14          7 |       342 
                |      1.24       1.09       1.77       1.85 |      1.23 
----------------+--------------------------------------------+----------
181 to 365 days |       480        162         21          9 |       672 
                |      2.42       2.38       2.65       2.37 |      2.41 
----------------+--------------------------------------------+----------
366 to 730 days |       746        232         34         11 |     1,023 
                |      3.76       3.41       4.29       2.90 |      3.67 
----------------+--------------------------------------------+----------
731 to 973 days |       208         61         13          3 |       285 
                |      1.05       0.90       1.64       0.79 |      1.02 
----------------+--------------------------------------------+----------
      >973 days |         2          0          0          0 |         2 
                |      0.01       0.00       0.00       0.00 |      0.01 
----------------+--------------------------------------------+----------
              . |    17,871      6,151        697        345 |    25,064 
                |     89.97      90.32      88.01      91.03 |     90.01 
----------------+--------------------------------------------+----------
          Total |    19,864      6,810        792        379 |    27,845 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(21) =  19.3169   Pr = 0.565

. gen exit_date_esrd = esrd_date
(25,064 missing values generated)

. format exit_date_esrd %td

. gen end_date = date("2022-11-30", "YMD") if case==1
(19,864 missing values generated)

. replace end_date = date("2019-11-30", "YMD") if case==0
(19,864 real changes made)

. format end_date %td

. replace exit_date_esrd = min(deregistered_date, death_date, end_date) if esrd_date==.
(25,064 real changes made)

. gen esrd_denominator = 1

. gen follow_up_time_esrd = (exit_date_esrd - index_date_esrd)

. label var follow_up_time_esrd "Follow-up time (Days)"

. gen follow_up_cat_esrd = follow_up_time_esrd

. recode follow_up_cat_esrd       min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0=3                     ///
>                                                 1/365=4         ///
>                                                 366/730=5       ///
>                                                 731/1040=6      ///                                     
>                                                 1041/max=7
(27823 changes made to follow_up_cat_esrd)

. label define follow_up_cat_esrd         1 "<-29 days"   ///
>                                                         2 "-28 to -1 days"              ///
>                                                         3 "0 days"                              ///
>                                                         4 "1 to 365 days"               ///
>                                                         5 "366 to 730 days"     ///
>                                                         6 "731 to 1040 days"    ///
>                                                         7 ">1040 days"

. label values follow_up_cat_esrd follow_up_cat_esrd

. label var follow_up_cat_esrd "Follow_up time"

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,303      6,972      8,589 |    19,864 
           SARS-CoV-2 |     1,811      2,840      3,330 |     7,981 
----------------------+---------------------------------+----------
                Total |     6,114      9,812     11,919 |    27,845 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |          Follow_up time
  replacement therapy | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,303      6,972      8,589 |    19,864 
Non-hospitalised SARS |     1,464      2,259      2,698 |     6,421 
No KRT hospitalised C |       164        270        315 |       749 
KRT hospitalised COVI |       183        311        317 |       811 
----------------------+---------------------------------+----------
                Total |     6,114      9,812     11,919 |    27,845 

. drop if follow_up_time_esrd<1
(0 observations deleted)

. drop if follow_up_time_esrd>1040
(0 observations deleted)

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,303      6,972      8,589 |    19,864 
           SARS-CoV-2 |     1,811      2,840      3,330 |     7,981 
----------------------+---------------------------------+----------
                Total |     6,114      9,812     11,919 |    27,845 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |          Follow_up time
  replacement therapy | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,303      6,972      8,589 |    19,864 
Non-hospitalised SARS |     1,464      2,259      2,698 |     6,421 
No KRT hospitalised C |       164        270        315 |       749 
KRT hospitalised COVI |       183        311        317 |       811 
----------------------+---------------------------------+----------
                Total |     6,114      9,812     11,919 |    27,845 

. gen follow_up_years_esrd = follow_up_time_esrd/365.25

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(27,845 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_half_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>index_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(40 real changes made)
(87 real changes made)
(126 real changes made)
(159 real changes made)
(165 real changes made)
(182 real changes made)
(176 real changes made)
(200 real changes made)
(181 real changes made)
(198 real changes made)
(217 real changes made)
(210 real changes made)
(201 real changes made)
(203 real changes made)
(191 real changes made)
(172 real changes made)
(184 real changes made)
(193 real changes made)
(168 real changes made)
(192 real changes made)
(150 real changes made)
(161 real changes made)
(162 real changes made)
(144 real changes made)
(144 real changes made)
(125 real changes made)
(127 real changes made)
(128 real changes made)
(120 real changes made)
(102 real changes made)
(0 real changes made)
(0 real changes made)
(17 real changes made)
(41 real changes made)
(56 real changes made)
(47 real changes made)
(68 real changes made)
(58 real changes made)
(70 real changes made)
(58 real changes made)
(58 real changes made)
(65 real changes made)
(78 real changes made)
(91 real changes made)
(87 real changes made)
(71 real changes made)
(76 real changes made)
(87 real changes made)
(80 real changes made)
(64 real changes made)
(79 real changes made)
(65 real changes made)
(59 real changes made)
(52 real changes made)
(81 real changes made)
(59 real changes made)
(44 real changes made)
(59 real changes made)
(52 real changes made)
(67 real changes made)
(50 real changes made)
(48 real changes made)
(36 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(2,057 real changes made)

. gen egfr_half = 0

. replace egfr_half = 1 if egfr_half_date!=.
(8,788 real changes made)

. label var egfr_half "50% reduction in eGFR"

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(12,360 real changes made, 12,360 to missing)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(19,057 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date) if egfr_half_date==. & index_date_egfr_half!=.
(7,923 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(12,360 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days)"

. gen egfr_half_denominator = 0

. replace egfr_half_denominator = 1 if index_date_egfr_half!=.
(15,485 real changes made)

. gen follow_up_years_egfr_half = follow_up_time_egfr_half/365.25
(12,360 missing values generated)

. 
. * AKI (or ESRD)
. gen index_date_aki = index_date

. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(25,024 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(2,487 real changes made)

. gen aki = 0

. replace aki = 1 if aki_date!=.
(5,308 real changes made)

. label var aki "Acute kidney injury"

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(22,537 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date)  if aki_date==.
(22,537 real changes made)

. gen aki_denominator = 1

. gen follow_up_time_aki = (exit_date_aki - index_date_aki)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. gen follow_up_years_aki = follow_up_time_aki/365.25

. 
. * Exit date (death)
. gen index_date_death = index_date

. gen exit_date_death = death_date
(26,177 missing values generated)

. gen death = 0

. replace death = 1 if death_date!=.
(1,668 real changes made)

. label var death "Death"

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(26,177 real changes made)

. gen death_denominator = 1

. gen follow_up_time_death = (exit_date_death - index_date_death)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. gen follow_up_years_death = follow_up_time_death/365.25

. 
. stset exit_date_esrd, fail(esrd_date) origin(index_date_esrd) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: esrd_date!=0 & esrd_date<.
Observed time interval: (exit_date_esrd[_n-1], exit_date_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_esrd

--------------------------------------------------------------------------
     27,845  total observations
          0  exclusions
--------------------------------------------------------------------------
     27,845  observations remaining, representing
     27,845  subjects
      2,781  failures in single-failure-per-subject data
 47,102.587  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.748802

. tab _st follow_up_cat_esrd

      1 if |
 record is |
     to be |
   used; 0 |          Follow_up time
 otherwise | 1 to 365   366 to 73  731 to 10 |     Total
-----------+---------------------------------+----------
         1 |     6,114      9,812     11,919 |    27,845 
-----------+---------------------------------+----------
     Total |     6,114      9,812     11,919 |    27,845 

. 
. foreach outcome of varlist esrd egfr_half aki death {
  2.         stset exit_date_`outcome', fail(`outcome'_date) origin(index_date_`outcome') id(unique) scale(365.25)
  3.         bysort case: egen total_follow_up_`outcome' = total(_t)
  4.         forvalues i=0/1 {
  5.         di "Denominator case=`i' `outcome':"
  6.         count if case==`i' & `outcome'_denominator==1
  7.         local denominator = r(N)
  8.         di "Denominator(_st=1) case=`i' `outcome':"
  9.         count if case==`i' & `outcome'_denominator==1 & _st==1
 10.         local st_denominator = r(N)
 11.         di "Events case=`i' `outcome':"
 12.         count if case==`i' & `outcome'==1
 13.         local event = r(N)
 14.         di "Events (_st=1) case=`i' `outcome':"
 15.         count if case==`i' & `outcome'==1 & _st==1
 16.         local st_event = r(N)
 17.         di "Total follow_up case=`i' `outcome':"
 18.         su total_follow_up_`outcome' if case==`i'
 19.         local person_year = r(mean)
 20.         local rate = 100000*(`event'/`person_year')
 21.         di "Rate case=`i' `outcome':"
 22.         di `rate'
 23.         local st_rate = 100000*(`st_event'/`person_year')
 24.         di "Rate (_st=1) case=`i' `outcome':"
 25.         di `st_rate'
 26.         }
 27.         drop total_follow_up_`outcome'
 28. }

Survival-time data settings

           ID variable: unique
         Failure event: esrd_date!=0 & esrd_date<.
Observed time interval: (exit_date_esrd[_n-1], exit_date_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_esrd

--------------------------------------------------------------------------
     27,845  total observations
          0  exclusions
--------------------------------------------------------------------------
     27,845  observations remaining, representing
     27,845  subjects
      2,781  failures in single-failure-per-subject data
 47,102.587  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.748802
Denominator case=0 esrd:
  19,864
Denominator(_st=1) case=0 esrd:
  19,864
Events case=0 esrd:
  1,993
Events (_st=1) case=0 esrd:
  1,993
Total follow_up case=0 esrd:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~d |     19,864    33763.45           0   33763.45   33763.45
Rate case=0 esrd:
5902.8323
Rate (_st=1) case=0 esrd:
5902.8323
Denominator case=1 esrd:
  7,981
Denominator(_st=1) case=1 esrd:
  7,981
Events case=1 esrd:
  788
Events (_st=1) case=1 esrd:
  788
Total follow_up case=1 esrd:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~d |      7,981    13339.13           0   13339.13   13339.13
Rate case=1 esrd:
5907.4296
Rate (_st=1) case=1 esrd:
5907.4296

Survival-time data settings

           ID variable: unique
         Failure event: egfr_half_date!=0 & egfr_half_date<.
Observed time interval: (exit_date_egfr_half[_n-1], exit_date_egfr_half]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_egfr_half

--------------------------------------------------------------------------
     27,845  total observations
     11,134  event time missing (exit_date_egfr_half>=.)    PROBABLE ERROR
      1,226  ignored because never entered
--------------------------------------------------------------------------
     15,485  observations remaining, representing
     15,485  subjects
      7,562  failures in single-failure-per-subject data
 18,262.177  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.748802
Denominator case=0 egfr_half:
  11,031
Denominator(_st=1) case=0 egfr_half:
  11,031
Events case=0 egfr_half:
  6,282
Events (_st=1) case=0 egfr_half:
  5,410
Total follow_up case=0 egfr_half:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~f |     19,864    13044.78           0   13044.78   13044.78
Rate case=0 egfr_half:
48157.193
Rate (_st=1) case=0 egfr_half:
41472.527
Denominator case=1 egfr_half:
  4,454
Denominator(_st=1) case=1 egfr_half:
  4,454
Events case=1 egfr_half:
  2,506
Events (_st=1) case=1 egfr_half:
  2,152
Total follow_up case=1 egfr_half:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~f |      7,981    5217.396           0   5217.396   5217.396
Rate case=1 egfr_half:
48031.619
Rate (_st=1) case=1 egfr_half:
41246.626

Survival-time data settings

           ID variable: unique
         Failure event: aki_date!=0 & aki_date<.
Observed time interval: (exit_date_aki[_n-1], exit_date_aki]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_aki

--------------------------------------------------------------------------
     27,845  total observations
        982  observations end on or before enter()
--------------------------------------------------------------------------
     26,863  observations remaining, representing
     26,863  subjects
      4,326  failures in single-failure-per-subject data
 44,267.567  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.748802
Denominator case=0 aki:
  19,864
Denominator(_st=1) case=0 aki:
  19,149
Events case=0 aki:
  3,786
Events (_st=1) case=0 aki:
  3,071
Total follow_up case=0 aki:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~i |     19,864    31706.75           0   31706.75   31706.75
Rate case=0 aki:
11940.677
Rate (_st=1) case=0 aki:
9685.636
Denominator case=1 aki:
  7,981
Denominator(_st=1) case=1 aki:
  7,714
Events case=1 aki:
  1,522
Events (_st=1) case=1 aki:
  1,255
Total follow_up case=1 aki:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~i |      7,981    12560.82           0   12560.82   12560.82
Rate case=1 aki:
12117.042
Rate (_st=1) case=1 aki:
9991.3849

Survival-time data settings

           ID variable: unique
         Failure event: death_date!=0 & death_date<.
Observed time interval: (exit_date_death[_n-1], exit_date_death]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_death

--------------------------------------------------------------------------
     27,845  total observations
          0  exclusions
--------------------------------------------------------------------------
     27,845  observations remaining, representing
     27,845  subjects
      1,668  failures in single-failure-per-subject data
 49,882.626  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.748802
Denominator case=0 death:
  19,864
Denominator(_st=1) case=0 death:
  19,864
Events case=0 death:
  1,359
Events (_st=1) case=0 death:
  1,359
Total follow_up case=0 death:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~h |     19,864    35705.44           0   35705.44   35705.44
Rate case=0 death:
3806.1426
Rate (_st=1) case=0 death:
3806.1426
Denominator case=1 death:
  7,981
Denominator(_st=1) case=1 death:
  7,981
Events case=1 death:
  309
Events (_st=1) case=1 death:
  309
Total follow_up case=1 death:

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~h |      7,981    14177.18           0   14177.18   14177.18
Rate case=1 death:
2179.5586
Rate (_st=1) case=1 death:
2179.5586

. 
. save ./output/analysis_2017.dta, replace
file ./output/analysis_2017.dta saved

. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_2017.log
  log type:  text
 closed on:  30 Jan 2023, 16:31:20
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
