-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_hospitalised.log
  log type:  text
 opened on:  12 Jan 2023, 10:54:16

. 
. capture noisily import delimited ./output/input_covid_hospitalised.csv, clear
(encoding automatically selected: ISO-8859-9)
(117 vars, 50,000 obs)

. tempfile covid_hospitalised

. save `covid_hospitalised', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_1a44_000003.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_1a44_000003.tmp saved as .dta format

. di "COVID-19 hospitalised:"
COVID-19 hospitalised:

. safecount
  50,000

. 
. capture noisily import delimited ./output/input_pneumonia_hospitalised.csv, clear
(encoding automatically selected: ISO-8859-9)
(113 vars, 50,000 obs)

. tempfile pneumonia_hospitalised

. save `pneumonia_hospitalised', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_1a44_000004.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_1a44_000004.tmp saved as .dta format

. di "Pneumonia hospitalised:"
Pneumonia hospitalised:

. safecount
  50,000

. 
. append using `covid_hospitalised', force

. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      4,954        4.95        4.95
 1 Most deprived |     19,124       19.12       24.08
               2 |     18,905       18.91       42.98
               3 |     18,776       18.78       61.76
               4 |     19,110       19.11       80.87
5 Least deprived |     19,131       19.13      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. drop if imd==0
(4,954 observations deleted)

. safetab imd

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |     19,124       20.12       20.12
               2 |     18,905       19.89       40.01
               3 |     18,776       19.75       59.77
               4 |     19,110       20.11       79.87
5 Least deprived |     19,131       20.13      100.00
-----------------+-----------------------------------
           Total |     95,046      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(95,045 missing values generated)

. replace stp1 = sum(stp1)
(95,045 real changes made)

. drop stp

. rename stp1 stp

. label values stp stp

. label var stp "STP"

. safetab stp

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     95,046      100.00      100.00
------------+-----------------------------------
      Total |     95,046      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(85,590 missing values generated)

. replace region = 2 if region_string=="East"
(9,622 real changes made)

. replace region = 3 if region_string=="London"
(19,069 real changes made)

. replace region = 4 if region_string=="North East"
(9,616 real changes made)

. replace region = 5 if region_string=="North West"
(9,491 real changes made)

. replace region = 6 if region_string=="South East"
(9,520 real changes made)

. replace region = 7 if region_string=="South West"
(9,483 real changes made)

. replace region = 8 if region_string=="West Midlands"
(9,403 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(9,386 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,456        9.95        9.95
                    East |      9,622       10.12       20.07
                  London |     19,069       20.06       40.14
              North East |      9,616       10.12       50.25
              North West |      9,491        9.99       60.24
              South East |      9,520       10.02       70.25
              South West |      9,483        9.98       80.23
           West Midlands |      9,403        9.89       90.12
Yorkshire and The Humber |      9,386        9.88      100.00
-------------------------+-----------------------------------
                   Total |     95,046      100.00

. drop if region==10
(0 observations deleted)

. safetab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,456        9.95        9.95
                    East |      9,622       10.12       20.07
                  London |     19,069       20.06       40.14
              North East |      9,616       10.12       50.25
              North West |      9,491        9.99       60.24
              South East |      9,520       10.02       70.25
              South West |      9,483        9.98       80.23
           West Midlands |      9,403        9.89       90.12
Yorkshire and The Humber |      9,386        9.88      100.00
-------------------------+-----------------------------------
                   Total |     95,046      100.00

. 
. * Exclusions due to deregistration and kidney replacement therapy will be checked (should already have been applied from previous steps in workflow)
. gen index_date = date(patient_index_date, "YMD")
(4,558 missing values generated)

. format index_date %td

. 
. * Deregistered before index_date
. gen deregistered_date = date(date_deregistered, "YMD")
(28,600 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date
(64,256 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(26,458 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(2,188 observations deleted)

. gen index_date_28 = index_date + 28
(1,179 missing values generated)

. format index_date_28 %td

. replace krt_date = index_date_28 if krt_date < index_date_28
(125 real changes made)

. 
. * Death before index_date + 28 days (i.e. only include people who survived 28 days after index_date)
. drop if deceased==1
(294 observations deleted)

. drop deceased

. gen death_date1 = date(death_date, "YMD")
(25,459 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28
(1,727 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased within 28 days of index date"

. label values deceased deceased

. tab covid deceased

           |       deceased
     covid | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,104        999 |    14,103 
-----------+----------------------+----------
     Total |    13,104        999 |    14,103 

. tab pneumonia deceased

           |       deceased
 pneumonia | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,477        728 |    14,205 
-----------+----------------------+----------
     Total |    13,477        728 |    14,205 

. drop if deceased==1
(1,727 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators only
. gen sex1 = 1 if sex=="M"
(13,521 missing values generated)

. replace sex1 = 0 if sex=="F"
(13,521 real changes made)

. drop sex

. rename sex1 sex

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 ///
>                                                                                                 baseline_creatinine_mar2017 ///
>                                                                                                 baseline_creatinine_apr2017 ///
>                                                                                                 baseline_creatinine_may2017 ///
>                                                                                                 baseline_creatinine_jun2017 ///
>                                                                                                 baseline_creatinine_jul2017 ///
>                                                                                                 baseline_creatinine_aug2017 ///
>                                                                                                 baseline_creatinine_sep2017 ///
>                                                                                                 baseline_creatinine_oct2017 ///
>                                                                                                 baseline_creatinine_nov2017 ///
>                                                                                                 baseline_creatinine_dec2017 ///
>                                                                                                 baseline_creatinine_jan2018 ///
>                                                                                                 baseline_creatinine_feb2018 ///
>                                                                                                 baseline_creatinine_mar2018 ///
>                                                                                                 baseline_creatinine_apr2018 ///
>                                                                                                 baseline_creatinine_may2018 ///
>                                                                                                 baseline_creatinine_jun2018 ///
>                                                                                                 baseline_creatinine_jul2018 ///
>                                                                                                 baseline_creatinine_aug2018 ///
>                                                                                                 baseline_creatinine_sep2018 ///
>                                                                                                 baseline_creatinine_oct2018 ///
>                                                                                                 baseline_creatinine_nov2018 ///
>                                                                                                 baseline_creatinine_dec2018 ///
>                                                                                                 baseline_creatinine_jan2019 ///
>                                                                                                 baseline_creatinine_feb2019 ///
>                                                                                                 baseline_creatinine_mar2019 ///
>                                                                                                 baseline_creatinine_apr2019 ///
>                                                                                                 baseline_creatinine_may2019 ///
>                                                                                                 baseline_creatinine_jun2019 ///
>                                                                                                 baseline_creatinine_jul2019 ///
>                                                                                                 baseline_creatinine_aug2019 ///
>                                                                                                 baseline_creatinine_sep2019 ///
>                                                                                                 baseline_creatinine_feb2020 ///
>                                                                                                 baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 ///
>                                                                                                 baseline_creatinine_feb2022 ///
>                                                                                                 baseline_creatinine_mar2022 ///
>                                                                                                 baseline_creatinine_apr2022 ///
>                                                                                                 baseline_creatinine_may2022 ///
>                                                                                                 baseline_creatinine_jun2022 ///
>                                                                                                 baseline_creatinine_jul2022 ///
>                                                                                                 baseline_creatinine_aug2022 ///
>                                                                                                 baseline_creatinine_sep2022 ///
>                                                                                                 baseline_creatinine_oct2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(5,875 real changes made, 5,875 to missing)
(18,979 missing values generated)
(26,581 missing values generated)
(3,903 real changes made)
(3,699 real changes made)
(3,903 real changes made)
(3,699 real changes made)
(4,850 real changes made)
(26,581 missing values generated)
(3,903 real changes made)
(3,699 real changes made)
(7,602 real changes made)
(21,731 real changes made)
(18,979 missing values generated)
(7,513 real changes made)
(3,903 real changes made)
(5,919 real changes made, 5,919 to missing)
(19,023 missing values generated)
(26,581 missing values generated)
(3,852 real changes made)
(3,706 real changes made)
(3,852 real changes made)
(3,706 real changes made)
(4,830 real changes made)
(26,581 missing values generated)
(3,852 real changes made)
(3,706 real changes made)
(7,558 real changes made)
(21,751 real changes made)
(19,023 missing values generated)
(7,465 real changes made)
(3,852 real changes made)
(5,900 real changes made, 5,900 to missing)
(19,004 missing values generated)
(26,581 missing values generated)
(3,891 real changes made)
(3,686 real changes made)
(3,891 real changes made)
(3,686 real changes made)
(4,775 real changes made)
(26,581 missing values generated)
(3,891 real changes made)
(3,686 real changes made)
(7,577 real changes made)
(21,806 real changes made)
(19,004 missing values generated)
(7,482 real changes made)
(3,891 real changes made)
(5,933 real changes made, 5,933 to missing)
(19,037 missing values generated)
(26,581 missing values generated)
(3,846 real changes made)
(3,698 real changes made)
(3,846 real changes made)
(3,698 real changes made)
(4,731 real changes made)
(26,581 missing values generated)
(3,846 real changes made)
(3,698 real changes made)
(7,544 real changes made)
(21,850 real changes made)
(19,037 missing values generated)
(7,460 real changes made)
(3,846 real changes made)
(5,896 real changes made, 5,896 to missing)
(19,000 missing values generated)
(26,581 missing values generated)
(3,827 real changes made)
(3,754 real changes made)
(3,827 real changes made)
(3,754 real changes made)
(4,805 real changes made)
(26,581 missing values generated)
(3,827 real changes made)
(3,754 real changes made)
(7,581 real changes made)
(21,776 real changes made)
(19,000 missing values generated)
(7,494 real changes made)
(3,827 real changes made)
(5,898 real changes made, 5,898 to missing)
(19,002 missing values generated)
(26,581 missing values generated)
(3,884 real changes made)
(3,695 real changes made)
(3,884 real changes made)
(3,695 real changes made)
(4,767 real changes made)
(26,581 missing values generated)
(3,884 real changes made)
(3,695 real changes made)
(7,579 real changes made)
(21,814 real changes made)
(19,002 missing values generated)
(7,487 real changes made)
(3,884 real changes made)
(5,973 real changes made, 5,973 to missing)
(19,077 missing values generated)
(26,581 missing values generated)
(3,835 real changes made)
(3,669 real changes made)
(3,835 real changes made)
(3,669 real changes made)
(4,766 real changes made)
(26,581 missing values generated)
(3,835 real changes made)
(3,669 real changes made)
(7,504 real changes made)
(21,815 real changes made)
(19,077 missing values generated)
(7,418 real changes made)
(3,835 real changes made)
(5,996 real changes made, 5,996 to missing)
(19,100 missing values generated)
(26,581 missing values generated)
(3,793 real changes made)
(3,688 real changes made)
(3,793 real changes made)
(3,688 real changes made)
(4,757 real changes made)
(26,581 missing values generated)
(3,793 real changes made)
(3,688 real changes made)
(7,481 real changes made)
(21,824 real changes made)
(19,100 missing values generated)
(7,395 real changes made)
(3,793 real changes made)
(5,898 real changes made, 5,898 to missing)
(19,002 missing values generated)
(26,581 missing values generated)
(3,876 real changes made)
(3,703 real changes made)
(3,876 real changes made)
(3,703 real changes made)
(4,780 real changes made)
(26,581 missing values generated)
(3,876 real changes made)
(3,703 real changes made)
(7,579 real changes made)
(21,801 real changes made)
(19,002 missing values generated)
(7,487 real changes made)
(3,876 real changes made)
(6,032 real changes made, 6,032 to missing)
(19,136 missing values generated)
(26,581 missing values generated)
(3,791 real changes made)
(3,654 real changes made)
(3,791 real changes made)
(3,654 real changes made)
(4,719 real changes made)
(26,581 missing values generated)
(3,791 real changes made)
(3,654 real changes made)
(7,445 real changes made)
(21,862 real changes made)
(19,136 missing values generated)
(7,361 real changes made)
(3,791 real changes made)
(5,889 real changes made, 5,889 to missing)
(18,993 missing values generated)
(26,581 missing values generated)
(3,911 real changes made)
(3,677 real changes made)
(3,911 real changes made)
(3,677 real changes made)
(4,794 real changes made)
(26,581 missing values generated)
(3,911 real changes made)
(3,677 real changes made)
(7,588 real changes made)
(21,787 real changes made)
(18,993 missing values generated)
(7,496 real changes made)
(3,911 real changes made)
(5,925 real changes made, 5,925 to missing)
(19,029 missing values generated)
(26,581 missing values generated)
(3,831 real changes made)
(3,721 real changes made)
(3,831 real changes made)
(3,721 real changes made)
(4,837 real changes made)
(26,581 missing values generated)
(3,831 real changes made)
(3,721 real changes made)
(7,552 real changes made)
(21,744 real changes made)
(19,029 missing values generated)
(7,462 real changes made)
(3,831 real changes made)
(5,970 real changes made, 5,970 to missing)
(19,074 missing values generated)
(26,581 missing values generated)
(3,839 real changes made)
(3,668 real changes made)
(3,839 real changes made)
(3,668 real changes made)
(4,788 real changes made)
(26,581 missing values generated)
(3,839 real changes made)
(3,668 real changes made)
(7,507 real changes made)
(21,793 real changes made)
(19,074 missing values generated)
(7,418 real changes made)
(3,839 real changes made)
(5,810 real changes made, 5,810 to missing)
(18,914 missing values generated)
(26,581 missing values generated)
(3,921 real changes made)
(3,746 real changes made)
(3,921 real changes made)
(3,746 real changes made)
(4,918 real changes made)
(26,581 missing values generated)
(3,921 real changes made)
(3,746 real changes made)
(7,667 real changes made)
(21,663 real changes made)
(18,914 missing values generated)
(7,573 real changes made)
(3,921 real changes made)
(6,001 real changes made, 6,001 to missing)
(19,105 missing values generated)
(26,581 missing values generated)
(3,870 real changes made)
(3,606 real changes made)
(3,870 real changes made)
(3,606 real changes made)
(4,725 real changes made)
(26,581 missing values generated)
(3,870 real changes made)
(3,606 real changes made)
(7,476 real changes made)
(21,856 real changes made)
(19,105 missing values generated)
(7,375 real changes made)
(3,870 real changes made)
(5,953 real changes made, 5,953 to missing)
(19,057 missing values generated)
(26,581 missing values generated)
(3,848 real changes made)
(3,676 real changes made)
(3,848 real changes made)
(3,676 real changes made)
(4,757 real changes made)
(26,581 missing values generated)
(3,848 real changes made)
(3,676 real changes made)
(7,524 real changes made)
(21,824 real changes made)
(19,057 missing values generated)
(7,437 real changes made)
(3,848 real changes made)
(5,984 real changes made, 5,984 to missing)
(19,088 missing values generated)
(26,581 missing values generated)
(3,839 real changes made)
(3,654 real changes made)
(3,839 real changes made)
(3,654 real changes made)
(4,762 real changes made)
(26,581 missing values generated)
(3,839 real changes made)
(3,654 real changes made)
(7,493 real changes made)
(21,819 real changes made)
(19,088 missing values generated)
(7,394 real changes made)
(3,839 real changes made)
(5,928 real changes made, 5,928 to missing)
(19,032 missing values generated)
(26,581 missing values generated)
(3,859 real changes made)
(3,690 real changes made)
(3,859 real changes made)
(3,690 real changes made)
(4,768 real changes made)
(26,581 missing values generated)
(3,859 real changes made)
(3,690 real changes made)
(7,549 real changes made)
(21,813 real changes made)
(19,032 missing values generated)
(7,462 real changes made)
(3,859 real changes made)
(5,878 real changes made, 5,878 to missing)
(18,982 missing values generated)
(26,581 missing values generated)
(3,880 real changes made)
(3,719 real changes made)
(3,880 real changes made)
(3,719 real changes made)
(4,782 real changes made)
(26,581 missing values generated)
(3,880 real changes made)
(3,719 real changes made)
(7,599 real changes made)
(21,799 real changes made)
(18,982 missing values generated)
(7,512 real changes made)
(3,880 real changes made)
(5,914 real changes made, 5,914 to missing)
(19,018 missing values generated)
(26,581 missing values generated)
(3,853 real changes made)
(3,710 real changes made)
(3,853 real changes made)
(3,710 real changes made)
(4,749 real changes made)
(26,581 missing values generated)
(3,853 real changes made)
(3,710 real changes made)
(7,563 real changes made)
(21,832 real changes made)
(19,018 missing values generated)
(7,468 real changes made)
(3,853 real changes made)
(5,880 real changes made, 5,880 to missing)
(18,984 missing values generated)
(26,581 missing values generated)
(3,884 real changes made)
(3,713 real changes made)
(3,884 real changes made)
(3,713 real changes made)
(4,797 real changes made)
(26,581 missing values generated)
(3,884 real changes made)
(3,713 real changes made)
(7,597 real changes made)
(21,784 real changes made)
(18,984 missing values generated)
(7,512 real changes made)
(3,884 real changes made)
(5,892 real changes made, 5,892 to missing)
(18,996 missing values generated)
(26,581 missing values generated)
(3,882 real changes made)
(3,703 real changes made)
(3,882 real changes made)
(3,703 real changes made)
(4,827 real changes made)
(26,581 missing values generated)
(3,882 real changes made)
(3,703 real changes made)
(7,585 real changes made)
(21,754 real changes made)
(18,996 missing values generated)
(7,494 real changes made)
(3,882 real changes made)
(5,969 real changes made, 5,969 to missing)
(19,073 missing values generated)
(26,581 missing values generated)
(3,826 real changes made)
(3,682 real changes made)
(3,826 real changes made)
(3,682 real changes made)
(4,763 real changes made)
(26,581 missing values generated)
(3,826 real changes made)
(3,682 real changes made)
(7,508 real changes made)
(21,818 real changes made)
(19,073 missing values generated)
(7,424 real changes made)
(3,826 real changes made)
(5,914 real changes made, 5,914 to missing)
(19,018 missing values generated)
(26,581 missing values generated)
(3,877 real changes made)
(3,686 real changes made)
(3,877 real changes made)
(3,686 real changes made)
(4,825 real changes made)
(26,581 missing values generated)
(3,877 real changes made)
(3,686 real changes made)
(7,563 real changes made)
(21,756 real changes made)
(19,018 missing values generated)
(7,471 real changes made)
(3,877 real changes made)
(5,867 real changes made, 5,867 to missing)
(18,971 missing values generated)
(26,581 missing values generated)
(3,882 real changes made)
(3,728 real changes made)
(3,882 real changes made)
(3,728 real changes made)
(4,877 real changes made)
(26,581 missing values generated)
(3,882 real changes made)
(3,728 real changes made)
(7,610 real changes made)
(21,704 real changes made)
(18,971 missing values generated)
(7,524 real changes made)
(3,882 real changes made)
(5,961 real changes made, 5,961 to missing)
(19,065 missing values generated)
(26,581 missing values generated)
(3,814 real changes made)
(3,702 real changes made)
(3,814 real changes made)
(3,702 real changes made)
(4,747 real changes made)
(26,581 missing values generated)
(3,814 real changes made)
(3,702 real changes made)
(7,516 real changes made)
(21,834 real changes made)
(19,065 missing values generated)
(7,430 real changes made)
(3,814 real changes made)
(5,856 real changes made, 5,856 to missing)
(18,960 missing values generated)
(26,581 missing values generated)
(3,890 real changes made)
(3,731 real changes made)
(3,890 real changes made)
(3,731 real changes made)
(4,842 real changes made)
(26,581 missing values generated)
(3,890 real changes made)
(3,731 real changes made)
(7,621 real changes made)
(21,739 real changes made)
(18,960 missing values generated)
(7,529 real changes made)
(3,890 real changes made)
(5,852 real changes made, 5,852 to missing)
(18,956 missing values generated)
(26,581 missing values generated)
(3,891 real changes made)
(3,734 real changes made)
(3,891 real changes made)
(3,734 real changes made)
(4,886 real changes made)
(26,581 missing values generated)
(3,891 real changes made)
(3,734 real changes made)
(7,625 real changes made)
(21,695 real changes made)
(18,956 missing values generated)
(7,524 real changes made)
(3,891 real changes made)
(5,870 real changes made, 5,870 to missing)
(18,974 missing values generated)
(26,581 missing values generated)
(3,945 real changes made)
(3,662 real changes made)
(3,945 real changes made)
(3,662 real changes made)
(4,869 real changes made)
(26,581 missing values generated)
(3,945 real changes made)
(3,662 real changes made)
(7,607 real changes made)
(21,712 real changes made)
(18,974 missing values generated)
(7,522 real changes made)
(3,945 real changes made)
(5,967 real changes made, 5,967 to missing)
(19,071 missing values generated)
(26,581 missing values generated)
(3,817 real changes made)
(3,693 real changes made)
(3,817 real changes made)
(3,693 real changes made)
(4,778 real changes made)
(26,581 missing values generated)
(3,817 real changes made)
(3,693 real changes made)
(7,510 real changes made)
(21,803 real changes made)
(19,071 missing values generated)
(7,423 real changes made)
(3,817 real changes made)
(5,957 real changes made, 5,957 to missing)
(19,061 missing values generated)
(26,581 missing values generated)
(3,840 real changes made)
(3,680 real changes made)
(3,840 real changes made)
(3,680 real changes made)
(4,840 real changes made)
(26,581 missing values generated)
(3,840 real changes made)
(3,680 real changes made)
(7,520 real changes made)
(21,741 real changes made)
(19,061 missing values generated)
(7,434 real changes made)
(3,840 real changes made)
(5,998 real changes made, 5,998 to missing)
(19,102 missing values generated)
(26,581 missing values generated)
(3,803 real changes made)
(3,676 real changes made)
(3,803 real changes made)
(3,676 real changes made)
(4,703 real changes made)
(26,581 missing values generated)
(3,803 real changes made)
(3,676 real changes made)
(7,479 real changes made)
(21,878 real changes made)
(19,102 missing values generated)
(7,382 real changes made)
(3,803 real changes made)
(5,773 real changes made, 5,773 to missing)
(19,250 missing values generated)
(26,581 missing values generated)
(3,717 real changes made)
(3,614 real changes made)
(3,717 real changes made)
(3,614 real changes made)
(4,693 real changes made)
(26,581 missing values generated)
(3,717 real changes made)
(3,614 real changes made)
(7,331 real changes made)
(21,888 real changes made)
(19,250 missing values generated)
(7,250 real changes made)
(3,717 real changes made)
(5,767 real changes made, 5,767 to missing)
(19,244 missing values generated)
(26,581 missing values generated)
(3,713 real changes made)
(3,624 real changes made)
(3,713 real changes made)
(3,624 real changes made)
(4,637 real changes made)
(26,581 missing values generated)
(3,713 real changes made)
(3,624 real changes made)
(7,337 real changes made)
(21,944 real changes made)
(19,244 missing values generated)
(7,266 real changes made)
(3,713 real changes made)
(5,778 real changes made, 5,778 to missing)
(19,255 missing values generated)
(26,581 missing values generated)
(3,729 real changes made)
(3,597 real changes made)
(3,729 real changes made)
(3,597 real changes made)
(4,611 real changes made)
(26,581 missing values generated)
(3,729 real changes made)
(3,597 real changes made)
(7,326 real changes made)
(21,970 real changes made)
(19,255 missing values generated)
(7,250 real changes made)
(3,729 real changes made)
(5,741 real changes made, 5,741 to missing)
(19,218 missing values generated)
(26,581 missing values generated)
(3,738 real changes made)
(3,625 real changes made)
(3,738 real changes made)
(3,625 real changes made)
(4,644 real changes made)
(26,581 missing values generated)
(3,738 real changes made)
(3,625 real changes made)
(7,363 real changes made)
(21,937 real changes made)
(19,218 missing values generated)
(7,283 real changes made)
(3,738 real changes made)
(5,823 real changes made, 5,823 to missing)
(19,300 missing values generated)
(26,581 missing values generated)
(3,669 real changes made)
(3,612 real changes made)
(3,669 real changes made)
(3,612 real changes made)
(4,649 real changes made)
(26,581 missing values generated)
(3,669 real changes made)
(3,612 real changes made)
(7,281 real changes made)
(21,932 real changes made)
(19,300 missing values generated)
(7,203 real changes made)
(3,669 real changes made)
(5,785 real changes made, 5,785 to missing)
(19,262 missing values generated)
(26,581 missing values generated)
(3,713 real changes made)
(3,606 real changes made)
(3,713 real changes made)
(3,606 real changes made)
(4,572 real changes made)
(26,581 missing values generated)
(3,713 real changes made)
(3,606 real changes made)
(7,319 real changes made)
(22,009 real changes made)
(19,262 missing values generated)
(7,246 real changes made)
(3,713 real changes made)
(5,735 real changes made, 5,735 to missing)
(19,212 missing values generated)
(26,581 missing values generated)
(3,763 real changes made)
(3,606 real changes made)
(3,763 real changes made)
(3,606 real changes made)
(4,657 real changes made)
(26,581 missing values generated)
(3,763 real changes made)
(3,606 real changes made)
(7,369 real changes made)
(21,924 real changes made)
(19,212 missing values generated)
(7,300 real changes made)
(3,763 real changes made)
(5,808 real changes made, 5,808 to missing)
(19,285 missing values generated)
(26,581 missing values generated)
(3,721 real changes made)
(3,575 real changes made)
(3,721 real changes made)
(3,575 real changes made)
(4,696 real changes made)
(26,581 missing values generated)
(3,721 real changes made)
(3,575 real changes made)
(7,296 real changes made)
(21,885 real changes made)
(19,285 missing values generated)
(7,224 real changes made)
(3,721 real changes made)
(5,833 real changes made, 5,833 to missing)
(19,310 missing values generated)
(26,581 missing values generated)
(3,708 real changes made)
(3,563 real changes made)
(3,708 real changes made)
(3,563 real changes made)
(4,607 real changes made)
(26,581 missing values generated)
(3,708 real changes made)
(3,563 real changes made)
(7,271 real changes made)
(21,974 real changes made)
(19,310 missing values generated)
(7,202 real changes made)
(3,708 real changes made)
(5,855 real changes made, 5,855 to missing)
(19,332 missing values generated)
(26,581 missing values generated)
(3,693 real changes made)
(3,556 real changes made)
(3,693 real changes made)
(3,556 real changes made)
(4,625 real changes made)
(26,581 missing values generated)
(3,693 real changes made)
(3,556 real changes made)
(7,249 real changes made)
(21,956 real changes made)
(19,332 missing values generated)
(7,178 real changes made)
(3,693 real changes made)
(5,811 real changes made, 5,811 to missing)
(19,288 missing values generated)
(26,581 missing values generated)
(3,664 real changes made)
(3,629 real changes made)
(3,664 real changes made)
(3,629 real changes made)
(4,606 real changes made)
(26,581 missing values generated)
(3,664 real changes made)
(3,629 real changes made)
(7,293 real changes made)
(21,975 real changes made)
(19,288 missing values generated)
(7,223 real changes made)
(3,664 real changes made)
(5,702 real changes made, 5,702 to missing)
(19,179 missing values generated)
(26,581 missing values generated)
(3,775 real changes made)
(3,627 real changes made)
(3,775 real changes made)
(3,627 real changes made)
(4,751 real changes made)
(26,581 missing values generated)
(3,775 real changes made)
(3,627 real changes made)
(7,402 real changes made)
(21,830 real changes made)
(19,179 missing values generated)
(7,331 real changes made)
(3,775 real changes made)
(5,697 real changes made, 5,697 to missing)
(19,174 missing values generated)
(26,581 missing values generated)
(3,773 real changes made)
(3,634 real changes made)
(3,773 real changes made)
(3,634 real changes made)
(4,671 real changes made)
(26,581 missing values generated)
(3,773 real changes made)
(3,634 real changes made)
(7,407 real changes made)
(21,910 real changes made)
(19,174 missing values generated)
(7,327 real changes made)
(3,773 real changes made)
(5,747 real changes made, 5,747 to missing)
(19,224 missing values generated)
(26,581 missing values generated)
(3,710 real changes made)
(3,647 real changes made)
(3,710 real changes made)
(3,647 real changes made)
(4,661 real changes made)
(26,581 missing values generated)
(3,710 real changes made)
(3,647 real changes made)
(7,357 real changes made)
(21,920 real changes made)
(19,224 missing values generated)
(7,280 real changes made)
(3,710 real changes made)
(5,735 real changes made, 5,735 to missing)
(19,212 missing values generated)
(26,581 missing values generated)
(3,722 real changes made)
(3,647 real changes made)
(3,722 real changes made)
(3,647 real changes made)
(4,622 real changes made)
(26,581 missing values generated)
(3,722 real changes made)
(3,647 real changes made)
(7,369 real changes made)
(21,959 real changes made)
(19,212 missing values generated)
(7,284 real changes made)
(3,722 real changes made)
(5,755 real changes made, 5,755 to missing)
(19,232 missing values generated)
(26,581 missing values generated)
(3,755 real changes made)
(3,594 real changes made)
(3,755 real changes made)
(3,594 real changes made)
(4,636 real changes made)
(26,581 missing values generated)
(3,755 real changes made)
(3,594 real changes made)
(7,349 real changes made)
(21,945 real changes made)
(19,232 missing values generated)
(7,279 real changes made)
(3,755 real changes made)
(5,833 real changes made, 5,833 to missing)
(19,310 missing values generated)
(26,581 missing values generated)
(3,650 real changes made)
(3,621 real changes made)
(3,650 real changes made)
(3,621 real changes made)
(4,529 real changes made)
(26,581 missing values generated)
(3,650 real changes made)
(3,621 real changes made)
(7,271 real changes made)
(22,052 real changes made)
(19,310 missing values generated)
(7,202 real changes made)
(3,650 real changes made)
(5,736 real changes made, 5,736 to missing)
(19,213 missing values generated)
(26,581 missing values generated)
(3,747 real changes made)
(3,621 real changes made)
(3,747 real changes made)
(3,621 real changes made)
(4,587 real changes made)
(26,581 missing values generated)
(3,747 real changes made)
(3,621 real changes made)
(7,368 real changes made)
(21,994 real changes made)
(19,213 missing values generated)
(7,290 real changes made)
(3,747 real changes made)
(5,700 real changes made, 5,700 to missing)
(19,177 missing values generated)
(26,581 missing values generated)
(3,764 real changes made)
(3,640 real changes made)
(3,764 real changes made)
(3,640 real changes made)
(4,655 real changes made)
(26,581 missing values generated)
(3,764 real changes made)
(3,640 real changes made)
(7,404 real changes made)
(21,926 real changes made)
(19,177 missing values generated)
(7,322 real changes made)
(3,764 real changes made)
(5,800 real changes made, 5,800 to missing)
(19,277 missing values generated)
(26,581 missing values generated)
(3,704 real changes made)
(3,600 real changes made)
(3,704 real changes made)
(3,600 real changes made)
(4,581 real changes made)
(26,581 missing values generated)
(3,704 real changes made)
(3,600 real changes made)
(7,304 real changes made)
(22,000 real changes made)
(19,277 missing values generated)
(7,237 real changes made)
(3,704 real changes made)
(5,698 real changes made, 5,698 to missing)
(19,175 missing values generated)
(26,581 missing values generated)
(3,732 real changes made)
(3,674 real changes made)
(3,732 real changes made)
(3,674 real changes made)
(4,688 real changes made)
(26,581 missing values generated)
(3,732 real changes made)
(3,674 real changes made)
(7,406 real changes made)
(21,893 real changes made)
(19,175 missing values generated)
(7,338 real changes made)
(3,732 real changes made)
(5,734 real changes made, 5,734 to missing)
(19,211 missing values generated)
(26,581 missing values generated)
(3,711 real changes made)
(3,659 real changes made)
(3,711 real changes made)
(3,659 real changes made)
(4,648 real changes made)
(26,581 missing values generated)
(3,711 real changes made)
(3,659 real changes made)
(7,370 real changes made)
(21,933 real changes made)
(19,211 missing values generated)
(7,287 real changes made)
(3,711 real changes made)
(5,726 real changes made, 5,726 to missing)
(19,203 missing values generated)
(26,581 missing values generated)
(3,719 real changes made)
(3,659 real changes made)
(3,719 real changes made)
(3,659 real changes made)
(4,676 real changes made)
(26,581 missing values generated)
(3,719 real changes made)
(3,659 real changes made)
(7,378 real changes made)
(21,905 real changes made)
(19,203 missing values generated)
(7,294 real changes made)
(3,719 real changes made)
(5,853 real changes made, 5,853 to missing)
(19,330 missing values generated)
(26,581 missing values generated)
(3,655 real changes made)
(3,596 real changes made)
(3,655 real changes made)
(3,596 real changes made)
(4,598 real changes made)
(26,581 missing values generated)
(3,655 real changes made)
(3,596 real changes made)
(7,251 real changes made)
(21,983 real changes made)
(19,330 missing values generated)
(7,181 real changes made)
(3,655 real changes made)
(5,744 real changes made, 5,744 to missing)
(19,221 missing values generated)
(26,581 missing values generated)
(3,753 real changes made)
(3,607 real changes made)
(3,753 real changes made)
(3,607 real changes made)
(4,686 real changes made)
(26,581 missing values generated)
(3,753 real changes made)
(3,607 real changes made)
(7,360 real changes made)
(21,895 real changes made)
(19,221 missing values generated)
(7,295 real changes made)
(3,753 real changes made)
(5,811 real changes made, 5,811 to missing)
(19,288 missing values generated)
(26,581 missing values generated)
(3,698 real changes made)
(3,595 real changes made)
(3,698 real changes made)
(3,595 real changes made)
(4,571 real changes made)
(26,581 missing values generated)
(3,698 real changes made)
(3,595 real changes made)
(7,293 real changes made)
(22,010 real changes made)
(19,288 missing values generated)
(7,219 real changes made)
(3,698 real changes made)
(5,776 real changes made, 5,776 to missing)
(19,253 missing values generated)
(26,581 missing values generated)
(3,718 real changes made)
(3,610 real changes made)
(3,718 real changes made)
(3,610 real changes made)
(4,745 real changes made)
(26,581 missing values generated)
(3,718 real changes made)
(3,610 real changes made)
(7,328 real changes made)
(21,836 real changes made)
(19,253 missing values generated)
(7,257 real changes made)
(3,718 real changes made)
(5,791 real changes made, 5,791 to missing)
(19,268 missing values generated)
(26,581 missing values generated)
(3,719 real changes made)
(3,594 real changes made)
(3,719 real changes made)
(3,594 real changes made)
(4,739 real changes made)
(26,581 missing values generated)
(3,719 real changes made)
(3,594 real changes made)
(7,313 real changes made)
(21,842 real changes made)
(19,268 missing values generated)
(7,238 real changes made)
(3,719 real changes made)
(5,745 real changes made, 5,745 to missing)
(19,222 missing values generated)
(26,581 missing values generated)
(3,730 real changes made)
(3,629 real changes made)
(3,730 real changes made)
(3,629 real changes made)
(4,756 real changes made)
(26,581 missing values generated)
(3,730 real changes made)
(3,629 real changes made)
(7,359 real changes made)
(21,825 real changes made)
(19,222 missing values generated)
(7,291 real changes made)
(3,730 real changes made)
(5,759 real changes made, 5,759 to missing)
(19,236 missing values generated)
(26,581 missing values generated)
(3,693 real changes made)
(3,652 real changes made)
(3,693 real changes made)
(3,652 real changes made)
(4,630 real changes made)
(26,581 missing values generated)
(3,693 real changes made)
(3,652 real changes made)
(7,345 real changes made)
(21,951 real changes made)
(19,236 missing values generated)
(7,275 real changes made)
(3,693 real changes made)
(5,727 real changes made, 5,727 to missing)
(19,204 missing values generated)
(26,581 missing values generated)
(3,760 real changes made)
(3,617 real changes made)
(3,760 real changes made)
(3,617 real changes made)
(4,649 real changes made)
(26,581 missing values generated)
(3,760 real changes made)
(3,617 real changes made)
(7,377 real changes made)
(21,932 real changes made)
(19,204 missing values generated)
(7,310 real changes made)
(3,760 real changes made)
(5,780 real changes made, 5,780 to missing)
(19,257 missing values generated)
(26,581 missing values generated)
(3,731 real changes made)
(3,593 real changes made)
(3,731 real changes made)
(3,593 real changes made)
(4,656 real changes made)
(26,581 missing values generated)
(3,731 real changes made)
(3,593 real changes made)
(7,324 real changes made)
(21,925 real changes made)
(19,257 missing values generated)
(7,249 real changes made)
(3,731 real changes made)
(5,738 real changes made, 5,738 to missing)
(19,215 missing values generated)
(26,581 missing values generated)
(3,723 real changes made)
(3,643 real changes made)
(3,723 real changes made)
(3,643 real changes made)
(4,699 real changes made)
(26,581 missing values generated)
(3,723 real changes made)
(3,643 real changes made)
(7,366 real changes made)
(21,882 real changes made)
(19,215 missing values generated)
(7,290 real changes made)
(3,723 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)
(1,048 missing values generated)

. gen baseline_egfr=.
(26,581 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb
> 2019 mar2019 apr2019 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 
> sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(255 real changes made)
(291 real changes made)
(273 real changes made)
(297 real changes made)
(269 real changes made)
(248 real changes made)
(262 real changes made)
(257 real changes made)
(242 real changes made)
(215 real changes made)
(239 real changes made)
(230 real changes made)
(225 real changes made)
(254 real changes made)
(237 real changes made)
(236 real changes made)
(213 real changes made)
(231 real changes made)
(210 real changes made)
(185 real changes made)
(243 real changes made)
(194 real changes made)
(212 real changes made)
(203 real changes made)
(188 real changes made)
(216 real changes made)
(192 real changes made)
(193 real changes made)
(210 real changes made)
(193 real changes made)
(183 real changes made)
(170 real changes made)
(206 real changes made)
(252 real changes made)
(224 real changes made)
(215 real changes made)
(224 real changes made)
(242 real changes made)
(264 real changes made)
(207 real changes made)
(246 real changes made)
(215 real changes made)
(237 real changes made)
(183 real changes made)
(184 real changes made)
(200 real changes made)
(208 real changes made)
(214 real changes made)
(189 real changes made)
(238 real changes made)
(217 real changes made)
(211 real changes made)
(201 real changes made)
(199 real changes made)
(218 real changes made)
(177 real changes made)
(178 real changes made)
(190 real changes made)
(197 real changes made)
(172 real changes made)
(184 real changes made)
(189 real changes made)
(215 real changes made)
(164 real changes made)
(187 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab covid baseline_esrd

           | baseline_e
           |    srd
     covid |   No ESRD |     Total
-----------+-----------+----------
         1 |    13,104 |    13,104 
-----------+-----------+----------
     Total |    13,104 |    13,104 

. tab pneumonia baseline_esrd

           | baseline_e
           |    srd
 pneumonia |   No ESRD |     Total
-----------+-----------+----------
         1 |    13,477 |    13,477 
-----------+-----------+----------
     Total |    13,477 |    13,477 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. ** Exposure
. gen case = covid
(13,477 missing values generated)

. replace case = 0 if covid==.
(13,477 real changes made)

. label define case 0 "Pneumonia (pre-pandemic)" ///
>                                   1 "COVID-19"

. label values case case

. tab case covid

                      |   covid
                 case |         1 |     Total
----------------------+-----------+----------
             COVID-19 |    13,104 |    13,104 
----------------------+-----------+----------
                Total |    13,104 |    13,104 

. tab case pneumonia

                      | pneumonia
                 case |         1 |     Total
----------------------+-----------+----------
Pneumonia (pre-pandem |    13,477 |    13,477 
----------------------+-----------+----------
                Total |    13,477 |    13,477 

. drop covid

. drop pneumonia

. safetab case 

                    case |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,477       50.70       50.70
                COVID-19 |     13,104       49.30      100.00
-------------------------+-----------------------------------
                   Total |     26,581      100.00

. 
. * Critical care during index admission
. replace critical_care = 1 if critical_days==1
(1,307 real changes made)

. drop critical_days

. label define critical_care      0 "Ward-based"          ///
>                                                         1 "Critical care"

. label values critical_care critical_care

. label var critical_care "Critical care"

. safetab critical_care, m

Critical care |      Freq.     Percent        Cum.
--------------+-----------------------------------
   Ward-based |     23,933       90.04       90.04
Critical care |      2,648        9.96      100.00
--------------+-----------------------------------
        Total |     26,581      100.00

. gen case_critical_care = critical_care

. replace case_critical_care = 2 if case==1
(13,104 real changes made)

. replace case_critical_care = 3 if case==1 &critical_care==1
(1,318 real changes made)

. label define case_critical_care 0 "Ward-based pneumonia (pre-pandemic)"         ///
>                                                                 1 "Critical care pneumonia (pre-pandemic)"      ///
>                                                                 2 "Ward-based COVID-19"                                         ///
>                                                                 3 "Critical care COVID-19"

. label values case_critical_care case_critical_care

. safetab case_critical_care, m

                    case_critical_care |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
   Ward-based pneumonia (pre-pandemic) |     12,147       45.70       45.70
Critical care pneumonia (pre-pandemic) |      1,330        5.00       50.70
                   Ward-based COVID-19 |     11,786       44.34       95.04
                Critical care COVID-19 |      1,318        4.96      100.00
---------------------------------------+-----------------------------------
                                 Total |     26,581      100.00

. 
. * Acute kidney injury during index admission
. label define acute_kidney_injury        0 "No AKI"      ///
>                                                                         1 "AKI"

. label values acute_kidney_injury acute_kidney_injury

. label var acute_kidney_injury "Acute kidney injury"

. safetab acute_kidney_injury, m

      Acute |
     kidney |
     injury |      Freq.     Percent        Cum.
------------+-----------------------------------
     No AKI |     15,902       59.82       59.82
        AKI |     10,679       40.18      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. gen case_acute_kidney_injury = acute_kidney_injury

. replace case_acute_kidney_injury = 2 if case==1
(13,104 real changes made)

. replace case_acute_kidney_injury = 3 if case==1 &acute_kidney_injury==1
(5,318 real changes made)

. label define case_acute_kidney_injury   0 "No AKI pneumonia (pre-pandemic)"     ///
>                                                                                 1 "AKI pneumonia (pre-pandemic)"        ///
>                                                                                 2 "No AKI COVID-19"                             ///
>                                                                                 3 "AKI COVID-19"

. label values case_acute_kidney_injury case_acute_kidney_injury

. safetab case_acute_kidney_injury, m

       case_acute_kidney_injury |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
No AKI pneumonia (pre-pandemic) |      8,116       30.53       30.53
   AKI pneumonia (pre-pandemic) |      5,361       20.17       50.70
                No AKI COVID-19 |      7,786       29.29       79.99
                   AKI COVID-19 |      5,318       20.01      100.00
--------------------------------+-----------------------------------
                          Total |     26,581      100.00

. 
. * Kidney replacement therapy during index admission
. gen krt = acute_kidney_injury

. replace krt = 2 if krt_icd_10==1
(269 real changes made)

. drop krt_icd_10

. replace krt = 2 if krt_opcs_4==1
(276 real changes made)

. drop krt_opcs_4

. label define krt        0 "No AKI"                              ///
>                                         1 "AKI without KRT"             ///
>                                         2 "AKI requiring KRT"

. label values krt krt

. label var krt "Kidney replacement therapy"

. safetab krt, m

           Kidney |
      replacement |
          therapy |      Freq.     Percent        Cum.
------------------+-----------------------------------
           No AKI |     15,566       58.56       58.56
  AKI without KRT |     10,470       39.39       97.95
AKI requiring KRT |        545        2.05      100.00
------------------+-----------------------------------
            Total |     26,581      100.00

. gen case_krt = krt

. replace case_krt = 3 if case==1
(13,104 real changes made)

. replace case_krt = 4 if case==1 &krt==1
(5,212 real changes made)

. replace case_krt = 5 if case==1 &krt==2
(272 real changes made)

. label define case_krt   0 "No AKI pneumonia (pre-pandemic)"                     ///
>                                                 1 "AKI without KRT pneumonia (pre-pandemic)"    ///
>                                                 2 "AKI requiring KRT pneumonia (pre-pandemic)"  ///
>                                                 3 "No AKI COVID-19"                                                             ///
>                                                 4 "AKI without KRT COVID-19"                                    ///
>                                                 5 "AKI requiring KRT COVID-19"

. label values case_krt case_krt

. safetab case_krt, m

                               case_krt |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
        No AKI pneumonia (pre-pandemic) |      7,946       29.89       29.89
AKI without KRT pneumonia (pre-pandemic |      5,258       19.78       49.67
AKI requiring KRT pneumonia (pre-pandem |        273        1.03       50.70
                        No AKI COVID-19 |      7,620       28.67       79.37
               AKI without KRT COVID-19 |      5,212       19.61       98.98
             AKI requiring KRT COVID-19 |        272        1.02      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,581      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(17,526 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(17,472 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(17,377 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(17,402 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(9,179 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(2,744 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(848 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(236 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Pneumonia (pre-pandemic)"    ///
>                                                 1 "COVID pre-vaccination"                       ///
>                                                 2 "COVID 1 vaccine dose"                        ///
>                                                 3 "COVID 2 vaccine doses"                       ///
>                                                 4 "COVID 3 vaccine doses"                       ///
>                                                 5 "COVID 4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "COVID-19 vaccination status"

. safetab covid_vax, m

    COVID-19 vaccination |
                  status |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,477       50.70       50.70
   COVID pre-vaccination |         97        0.36       51.07
    COVID 1 vaccine dose |        236        0.89       51.95
   COVID 2 vaccine doses |        848        3.19       55.14
   COVID 3 vaccine doses |      2,744       10.32       65.47
   COVID 4 vaccine doses |      9,179       34.53      100.00
-------------------------+-----------------------------------
                   Total |     26,581      100.00

. 
. * COVID-19 wave
. gen wave = case

. replace wave = 2 if index_month=="sep2020"
(384 real changes made)

. replace wave = 2 if index_month=="oct2020"
(464 real changes made)

. replace wave = 2 if index_month=="nov2020"
(404 real changes made)

. replace wave = 2 if index_month=="dec2020"
(405 real changes made)

. replace wave = 2 if index_month=="jan2021"
(351 real changes made)

. replace wave = 2 if index_month=="feb2021"
(322 real changes made)

. replace wave = 2 if index_month=="mar2021"
(369 real changes made)

. replace wave = 2 if index_month=="apr2021"
(382 real changes made)

. replace wave = 2 if index_month=="may2021"
(381 real changes made)

. replace wave = 2 if index_month=="jun2021"
(332 real changes made)

. replace wave = 3 if index_month=="jul2021"
(435 real changes made)

. replace wave = 3 if index_month=="aug2021"
(390 real changes made)

. replace wave = 3 if index_month=="sep2021"
(370 real changes made)

. replace wave = 3 if index_month=="oct2021"
(379 real changes made)

. replace wave = 3 if index_month=="nov2021"
(346 real changes made)

. replace wave = 4 if index_month=="dec2021"
(379 real changes made)

. replace wave = 4 if index_month=="jan2022"
(317 real changes made)

. replace wave = 4 if index_month=="feb2022"
(301 real changes made)

. replace wave = 4 if index_month=="mar2022"
(342 real changes made)

. replace wave = 4 if index_month=="apr2022"
(350 real changes made)

. replace wave = 4 if index_month=="may2022"
(331 real changes made)

. replace wave = 4 if index_month=="jun2022"
(342 real changes made)

. replace wave = 4 if index_month=="jul2022"
(348 real changes made)

. replace wave = 4 if index_month=="aug2022"
(371 real changes made)

. replace wave = 4 if index_month=="sep2022"
(328 real changes made)

. replace wave = 4 if index_month=="oct2022"
(319 real changes made)

. label define wave       0 "Pneumonia (pre-pandemic)"    ///
>                                         1 "COVID Feb20-Aug20"   ///
>                                         2 "COVID Sep20-Jun21"   ///
>                                         3 "COVID Jul21-Nov21"   ///
>                                         4 "COVID Dec21-Oct22"   

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m

           COVID-19 wave |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,477       50.70       50.70
       COVID Feb20-Aug20 |      3,662       13.78       64.48
       COVID Sep20-Jun21 |      3,794       14.27       78.75
       COVID Jul21-Nov21 |      1,920        7.22       85.97
       COVID Dec21-Oct22 |      3,728       14.03      100.00
-------------------------+-----------------------------------
                   Total |     26,581      100.00

. 
. * Month
. gen month_string=substr(index_date_string ,3,3)
(1,048 missing values generated)

. gen month = 1 if month_string=="jan"
(25,159 missing values generated)

. replace month = 2 if month_string=="feb"
(2,211 real changes made)

. replace month = 3 if month_string=="mar"
(2,440 real changes made)

. replace month = 4 if month_string=="apr"
(2,370 real changes made)

. replace month = 5 if month_string=="may"
(2,390 real changes made)

. replace month = 6 if month_string=="jun"
(2,263 real changes made)

. replace month = 7 if month_string=="jul"
(2,396 real changes made)

. replace month = 8 if month_string=="aug"
(2,361 real changes made)

. replace month = 9 if month_string=="sep"
(2,228 real changes made)

. replace month = 10 if month_string=="oct"
(2,348 real changes made)

. replace month = 11 if month_string=="nov"
(1,515 real changes made)

. replace month = 12 if month_string=="dec"
(1,589 real changes made)

. drop month_string

. label define month      1 "January"             ///
>                                         2 "February"    ///
>                                         3 "March"               ///
>                                         4 "April"               ///
>                                         5 "May"                 ///
>                                         6 "June"                ///
>                                         7 "July"                ///
>                                         8 "August"              ///
>                                         9 "September"   ///
>                                         10 "October"    ///
>                                         11 "November"   ///
>                                         12 "December"

. label values month month

. safetab month case, m

           |         case
     month | Pneumonia   COVID-19 |     Total
-----------+----------------------+----------
   January |       754        668 |     1,422 
  February |     1,184      1,027 |     2,211 
     March |     1,296      1,144 |     2,440 
     April |     1,223      1,147 |     2,370 
       May |     1,287      1,103 |     2,390 
      June |     1,176      1,087 |     2,263 
      July |     1,169      1,227 |     2,396 
    August |     1,159      1,202 |     2,361 
 September |     1,146      1,082 |     2,228 
   October |     1,186      1,162 |     2,348 
  November |       765        750 |     1,515 
  December |       805        784 |     1,589 
         . |       327        721 |     1,048 
-----------+----------------------+----------
     Total |    13,477     13,104 |    26,581 

. 
. ** Covariates
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        295        1.11        1.11
          1 |        327        1.23        2.34
          2 |        287        1.08        3.42
          3 |        313        1.18        4.60
          4 |        308        1.16        5.76
          5 |        315        1.19        6.94
          6 |        342        1.29        8.23
          7 |        348        1.31        9.54
          8 |        315        1.19       10.72
          9 |        347        1.31       12.03
         10 |        295        1.11       13.14
         11 |        329        1.24       14.37
         12 |        323        1.22       15.59
         13 |        301        1.13       16.72
         14 |        303        1.14       17.86
         15 |        269        1.01       18.87
         16 |        288        1.08       19.96
         17 |        280        1.05       21.01
         18 |        288        1.08       22.09
         19 |        284        1.07       23.16
         20 |        334        1.26       24.42
         21 |        333        1.25       25.67
         22 |        312        1.17       26.85
         23 |        297        1.12       27.96
         24 |        372        1.40       29.36
         25 |        372        1.40       30.76
         26 |        342        1.29       32.05
         27 |        357        1.34       33.39
         28 |        393        1.48       34.87
         29 |        354        1.33       36.20
         30 |        371        1.40       37.60
         31 |        365        1.37       38.97
         32 |        369        1.39       40.36
         33 |        330        1.24       41.60
         34 |        358        1.35       42.95
         35 |        352        1.32       44.27
         36 |        366        1.38       45.65
         37 |        377        1.42       47.07
         38 |        357        1.34       48.41
         39 |        342        1.29       49.70
         40 |        342        1.29       50.98
         41 |        316        1.19       52.17
         42 |        353        1.33       53.50
         43 |        330        1.24       54.74
         44 |        320        1.20       55.95
         45 |        348        1.31       57.26
         46 |        362        1.36       58.62
         47 |        348        1.31       59.93
         48 |        372        1.40       61.33
         49 |        382        1.44       62.76
         50 |        355        1.34       64.10
         51 |        380        1.43       65.53
         52 |        357        1.34       66.87
         53 |        366        1.38       68.25
         54 |        368        1.38       69.63
         55 |        384        1.44       71.08
         56 |        352        1.32       72.40
         57 |        345        1.30       73.70
         58 |        318        1.20       74.90
         59 |        362        1.36       76.26
         60 |        253        0.95       77.21
         61 |        313        1.18       78.39
         62 |        286        1.08       79.46
         63 |        316        1.19       80.65
         64 |        303        1.14       81.79
         65 |        267        1.00       82.80
         66 |        279        1.05       83.85
         67 |        273        1.03       84.87
         68 |        274        1.03       85.90
         69 |        273        1.03       86.93
         70 |        302        1.14       88.07
         71 |        220        0.83       88.89
         72 |        248        0.93       89.83
         73 |        232        0.87       90.70
         74 |        260        0.98       91.68
         75 |        162        0.61       92.29
         76 |        179        0.67       92.96
         77 |        194        0.73       93.69
         78 |        163        0.61       94.30
         79 |        176        0.66       94.97
         80 |        164        0.62       95.58
         81 |        149        0.56       96.14
         82 |        124        0.47       96.61
         83 |        135        0.51       97.12
         84 |        146        0.55       97.67
         85 |         83        0.31       97.98
         86 |         92        0.35       98.33
         87 |         70        0.26       98.59
         88 |         78        0.29       98.88
         89 |         65        0.24       99.13
         90 |         40        0.15       99.28
         91 |         29        0.11       99.39
         92 |         39        0.15       99.53
         93 |         37        0.14       99.67
         94 |         29        0.11       99.78
         95 |         10        0.04       99.82
         96 |         10        0.04       99.86
         97 |          5        0.02       99.88
         98 |         12        0.05       99.92
         99 |          7        0.03       99.95
        100 |          1        0.00       99.95
        101 |          1        0.00       99.95
        102 |          4        0.02       99.97
        105 |          2        0.01       99.98
        106 |          4        0.02       99.99
        107 |          2        0.01      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. safecount
  26,581

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///                                     
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(26254 differences between age and agegroup)

. 
. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label values agegroup agegroup

. label var agegroup "Age group"

. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     13,521       50.87       50.87
       Male |     13,060       49.13      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. safecount
  26,581

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(976 real changes made)

. replace ethnicity=2 if ethnicity==3
(1,008 real changes made)

. replace ethnicity=3 if ethnicity==4
(1,007 real changes made)

. replace ethnicity=4 if ethnicity==6
(976 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///                                             
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                                                               

. label values ethnicity ethnicity

. safetab ethnicity, m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     15,973       60.09       60.09
South Asian |      1,008        3.79       63.88
      Black |      1,007        3.79       67.67
      Mixed |        976        3.67       71.34
      Other |        970        3.65       74.99
          . |      6,647       25.01      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(6,647 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(6,647 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. safetab ethnicity1, m

 ethnicity1 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     15,973       60.09       60.09
South Asian |      1,008        3.79       63.88
      Black |      1,007        3.79       67.67
      Mixed |        976        3.67       71.34
      Other |        970        3.65       74.99
    Unknown |      6,647       25.01      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,669       10.04       10.04
                Urban minor conurbation |      2,665       10.03       20.07
                    Urban city and town |      2,653        9.98       30.05
Urban city and town in a sparse setting |      2,676       10.07       40.12
                  Rural town and fringe |      2,645        9.95       50.07
Rural town and fringe in a sparse setti |      2,649        9.97       60.03
            Rural village and dispersed |      5,260       19.79       79.82
Rural village and dispersed in a sparse |      5,364       20.18      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,581      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(26,581 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(10,663 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(15,918 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                                       rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow  Rural tow  Rural vil  Rural vil |     Total
-----------+----------------------------------------------------------------------------------------+----------
     Rural |         0          0          0          0      2,645      2,649      5,260      5,364 |    15,918 
     Urban |     2,669      2,665      2,653      2,676          0          0          0          0 |    10,663 
-----------+----------------------------------------------------------------------------------------+----------
     Total |     2,669      2,665      2,653      2,676      2,645      2,649      5,260      5,364 |    26,581 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Pneumonia (pre-pandem |     8,074      5,403 |    13,477 
             COVID-19 |     7,844      5,260 |    13,104 
----------------------+----------------------+----------
                Total |    15,918     10,663 |    26,581 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,710 real changes made, 2,710 to missing)

. gen     bmi = .
(26,581 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(1701 changes made to bmi)

. recode  bmi . = 2 if body_mass_index<25
(6028 changes made to bmi)

. recode  bmi . = 3 if body_mass_index<30
(6037 changes made to bmi)

. recode  bmi . = 4 if body_mass_index<35
(5344 changes made to bmi)

. recode  bmi . = 5 if body_mass_index<40
(3153 changes made to bmi)

. recode  bmi . = 6 if body_mass_index<.
(1608 changes made to bmi)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                             

. label values bmi bmi

. safetab bmi, m

                 bmi |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,701        6.40        6.40
  Normal (18.5-24.9) |      6,028       22.68       29.08
Overweight (25-29.9) |      6,037       22.71       51.79
   Obese I (30-34.9) |      5,344       20.10       71.89
  Obese II (35-39.9) |      3,153       11.86       83.76
     Obese III (40+) |      1,608        6.05       89.80
                   . |      2,710       10.20      100.00
---------------------+-----------------------------------
               Total |     26,581      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(15,357 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(1,872 real changes made)

. replace smoking = 0 if smoking_status=="N"
(3,716 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |      3,716       13.98       13.98
Current/former smoker |     13,096       49.27       63.25
                    . |      9,769       36.75      100.00
----------------------+-----------------------------------
                Total |     26,581      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000)
(12,468 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(14113 changes made to egfr_group)

. label define egfr_group 1 "105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       105 |      4,738       17.82       17.82
     90-104 |      1,870        7.04       24.86
      75-89 |      2,015        7.58       32.44
      60-74 |      2,162        8.13       40.57
      45-59 |      2,086        7.85       48.42
      30-44 |      1,107        4.16       52.59
      15-29 |        135        0.51       53.09
          . |     12,468       46.91      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 15-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(12,468 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(21843 changes made to ckd_stage)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6 "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |     10,785       40.57       40.57
                      CKD 3A |      2,086        7.85       48.42
                      CKD 3B |      1,107        4.16       52.59
                       CKD 4 |        135        0.51       53.09
No baseline eGFR measurement |     12,468       46.91      100.00
-----------------------------+-----------------------------------
                       Total |     26,581      100.00

. 
. * Comorbidities
. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,222       94.89       94.89
          1 |      1,359        5.11      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,042       97.97       97.97
          1 |        539        2.03      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. safetab diabetes

   diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,283       80.07       80.07
          1 |      5,298       19.93      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,334       99.07       99.07
          1 |        247        0.93      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. safetab heart_failure

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,509       95.97       95.97
          1 |      1,072        4.03      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. safetab hiv

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,022       97.90       97.90
          1 |        559        2.10      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. safetab hypertension

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,313       80.18       80.18
          1 |      5,268       19.82      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. safetab non_haem_cancer

non_haem_ca |
       ncer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,042       97.97       97.97
          1 |        539        2.03      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. safetab myocardial_infarction

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,916       89.97       89.97
          1 |      2,665       10.03      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,051       98.01       98.01
          1 |        530        1.99      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,221       94.88       94.88
          1 |      1,360        5.12      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. safetab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,036       97.95       97.95
          1 |        545        2.05      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,002       97.82       97.82
          1 |        579        2.18      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(1,013 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,424 real changes made)

. replace cardiovascular = 1 if pvd==1
(440 real changes made)

. replace cardiovascular = 1 if stroke==1
(439 real changes made)

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(555 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,321 real changes made)

. replace immunosuppressed = 1 if lupus==1
(530 real changes made)

. safetab cardiovascular

cardiovascu |
        lar |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,906       78.65       78.65
          1 |      5,675       21.35      100.00
------------+-----------------------------------
      Total |     26,581      100.00

. safetab immunosuppressed

immunosuppr |
      essed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,928       90.02       90.02
          1 |      2,653        9.98      100.00
------------+-----------------------------------
      Total |     26,581      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                                 creatinine_mar2017 ///
>                                                                                 creatinine_apr2017 ///
>                                                                                 creatinine_may2017 ///
>                                                                                 creatinine_jun2017 ///
>                                                                                 creatinine_jul2017 ///
>                                                                                 creatinine_aug2017 ///
>                                                                                 creatinine_sep2017 ///
>                                                                                 creatinine_oct2017 ///
>                                                                                 creatinine_nov2017 ///
>                                                                                 creatinine_dec2017 ///
>                                                                                 creatinine_jan2018 ///
>                                                                                 creatinine_feb2018 ///
>                                                                                 creatinine_mar2018 ///
>                                                                                 creatinine_apr2018 ///
>                                                                                 creatinine_may2018 ///
>                                                                                 creatinine_jun2018 ///
>                                                                                 creatinine_jul2018 ///
>                                                                                 creatinine_aug2018 ///
>                                                                                 creatinine_sep2018 ///
>                                                                                 creatinine_oct2018 ///
>                                                                                 creatinine_nov2018 ///
>                                                                                 creatinine_dec2018 ///
>                                                                                 creatinine_jan2019 ///
>                                                                                 creatinine_feb2019 ///
>                                                                                 creatinine_mar2019 ///
>                                                                                 creatinine_apr2019 ///
>                                                                                 creatinine_may2019 ///
>                                                                                 creatinine_jun2019 ///
>                                                                                 creatinine_jul2019 ///
>                                                                                 creatinine_aug2019 ///
>                                                                                 creatinine_sep2019 ///
>                                                                                 creatinine_feb2020 ///
>                                                                                 creatinine_mar2020 ///
>                                                                                 creatinine_apr2020 ///
>                                                                                 creatinine_may2020 ///
>                                                                                 creatinine_jun2020 ///
>                                                                                 creatinine_jul2020 ///
>                                                                                 creatinine_aug2020 ///
>                                                                                 creatinine_sep2020 ///
>                                                                                 creatinine_oct2020 ///
>                                                                                 creatinine_nov2020 ///
>                                                                                 creatinine_dec2020 ///
>                                                                                 creatinine_jan2021 ///
>                                                                                 creatinine_feb2021 ///
>                                                                                 creatinine_mar2021 ///
>                                                                                 creatinine_apr2021 ///
>                                                                                 creatinine_may2021 ///
>                                                                                 creatinine_jun2021 ///
>                                                                                 creatinine_jul2021 ///
>                                                                                 creatinine_aug2021 ///
>                                                                                 creatinine_sep2021 ///
>                                                                                 creatinine_oct2021 ///
>                                                                                 creatinine_nov2021 ///
>                                                                                 creatinine_dec2021 ///
>                                                                                 creatinine_jan2022 ///
>                                                                                 creatinine_feb2022 ///
>                                                                                 creatinine_mar2022 ///
>                                                                                 creatinine_apr2022 ///
>                                                                                 creatinine_may2022 ///
>                                                                                 creatinine_jun2022 ///
>                                                                                 creatinine_jul2022 ///
>                                                                                 creatinine_aug2022 ///
>                                                                                 creatinine_sep2022 ///
>                                                                                 creatinine_oct2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 3000)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex==0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex==1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_monthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(5,833 real changes made, 5,833 to missing)
(18,937 missing values generated)
(26,581 missing values generated)
(3,914 real changes made)
(3,730 real changes made)
(3,914 real changes made)
(3,730 real changes made)
(4,887 real changes made)
(26,581 missing values generated)
(3,914 real changes made)
(3,730 real changes made)
(7,644 real changes made)
(21,694 real changes made)
(18,937 missing values generated)
(7,558 real changes made)
(3,914 real changes made)
(5,858 real changes made, 5,858 to missing)
(18,962 missing values generated)
(26,581 missing values generated)
(3,872 real changes made)
(3,747 real changes made)
(3,872 real changes made)
(3,747 real changes made)
(4,804 real changes made)
(26,581 missing values generated)
(3,872 real changes made)
(3,747 real changes made)
(7,619 real changes made)
(21,777 real changes made)
(18,962 missing values generated)
(7,536 real changes made)
(3,872 real changes made)
(6,001 real changes made, 6,001 to missing)
(19,105 missing values generated)
(26,581 missing values generated)
(3,842 real changes made)
(3,634 real changes made)
(3,842 real changes made)
(3,634 real changes made)
(4,730 real changes made)
(26,581 missing values generated)
(3,842 real changes made)
(3,634 real changes made)
(7,476 real changes made)
(21,851 real changes made)
(19,105 missing values generated)
(7,391 real changes made)
(3,842 real changes made)
(5,979 real changes made, 5,979 to missing)
(19,083 missing values generated)
(26,581 missing values generated)
(3,878 real changes made)
(3,620 real changes made)
(3,878 real changes made)
(3,620 real changes made)
(4,806 real changes made)
(26,581 missing values generated)
(3,878 real changes made)
(3,620 real changes made)
(7,498 real changes made)
(21,775 real changes made)
(19,083 missing values generated)
(7,417 real changes made)
(3,878 real changes made)
(6,029 real changes made, 6,029 to missing)
(19,133 missing values generated)
(26,581 missing values generated)
(3,840 real changes made)
(3,608 real changes made)
(3,840 real changes made)
(3,608 real changes made)
(4,778 real changes made)
(26,581 missing values generated)
(3,840 real changes made)
(3,608 real changes made)
(7,448 real changes made)
(21,803 real changes made)
(19,133 missing values generated)
(7,350 real changes made)
(3,840 real changes made)
(5,945 real changes made, 5,945 to missing)
(19,049 missing values generated)
(26,581 missing values generated)
(3,855 real changes made)
(3,677 real changes made)
(3,855 real changes made)
(3,677 real changes made)
(4,813 real changes made)
(26,581 missing values generated)
(3,855 real changes made)
(3,677 real changes made)
(7,532 real changes made)
(21,768 real changes made)
(19,049 missing values generated)
(7,456 real changes made)
(3,855 real changes made)
(5,927 real changes made, 5,927 to missing)
(19,031 missing values generated)
(26,581 missing values generated)
(3,899 real changes made)
(3,651 real changes made)
(3,899 real changes made)
(3,651 real changes made)
(4,861 real changes made)
(26,581 missing values generated)
(3,899 real changes made)
(3,651 real changes made)
(7,550 real changes made)
(21,720 real changes made)
(19,031 missing values generated)
(7,463 real changes made)
(3,899 real changes made)
(5,909 real changes made, 5,909 to missing)
(19,013 missing values generated)
(26,581 missing values generated)
(3,916 real changes made)
(3,652 real changes made)
(3,916 real changes made)
(3,652 real changes made)
(4,823 real changes made)
(26,581 missing values generated)
(3,916 real changes made)
(3,652 real changes made)
(7,568 real changes made)
(21,758 real changes made)
(19,013 missing values generated)
(7,471 real changes made)
(3,916 real changes made)
(5,876 real changes made, 5,876 to missing)
(18,980 missing values generated)
(26,581 missing values generated)
(3,868 real changes made)
(3,733 real changes made)
(3,868 real changes made)
(3,733 real changes made)
(4,871 real changes made)
(26,581 missing values generated)
(3,868 real changes made)
(3,733 real changes made)
(7,601 real changes made)
(21,710 real changes made)
(18,980 missing values generated)
(7,498 real changes made)
(3,868 real changes made)
(5,926 real changes made, 5,926 to missing)
(19,030 missing values generated)
(26,581 missing values generated)
(3,904 real changes made)
(3,647 real changes made)
(3,904 real changes made)
(3,647 real changes made)
(4,854 real changes made)
(26,581 missing values generated)
(3,904 real changes made)
(3,647 real changes made)
(7,551 real changes made)
(21,727 real changes made)
(19,030 missing values generated)
(7,469 real changes made)
(3,904 real changes made)
(5,966 real changes made, 5,966 to missing)
(19,070 missing values generated)
(26,581 missing values generated)
(3,831 real changes made)
(3,680 real changes made)
(3,831 real changes made)
(3,680 real changes made)
(4,752 real changes made)
(26,581 missing values generated)
(3,831 real changes made)
(3,680 real changes made)
(7,511 real changes made)
(21,829 real changes made)
(19,070 missing values generated)
(7,413 real changes made)
(3,831 real changes made)
(5,907 real changes made, 5,907 to missing)
(19,011 missing values generated)
(26,581 missing values generated)
(3,873 real changes made)
(3,697 real changes made)
(3,873 real changes made)
(3,697 real changes made)
(4,781 real changes made)
(26,581 missing values generated)
(3,873 real changes made)
(3,697 real changes made)
(7,570 real changes made)
(21,800 real changes made)
(19,011 missing values generated)
(7,489 real changes made)
(3,873 real changes made)
(5,831 real changes made, 5,831 to missing)
(18,935 missing values generated)
(26,581 missing values generated)
(3,893 real changes made)
(3,753 real changes made)
(3,893 real changes made)
(3,753 real changes made)
(4,848 real changes made)
(26,581 missing values generated)
(3,893 real changes made)
(3,753 real changes made)
(7,646 real changes made)
(21,733 real changes made)
(18,935 missing values generated)
(7,556 real changes made)
(3,893 real changes made)
(5,904 real changes made, 5,904 to missing)
(19,008 missing values generated)
(26,581 missing values generated)
(3,862 real changes made)
(3,711 real changes made)
(3,862 real changes made)
(3,711 real changes made)
(4,761 real changes made)
(26,581 missing values generated)
(3,862 real changes made)
(3,711 real changes made)
(7,573 real changes made)
(21,820 real changes made)
(19,008 missing values generated)
(7,489 real changes made)
(3,862 real changes made)
(5,781 real changes made, 5,781 to missing)
(18,885 missing values generated)
(26,581 missing values generated)
(3,903 real changes made)
(3,793 real changes made)
(3,903 real changes made)
(3,793 real changes made)
(4,857 real changes made)
(26,581 missing values generated)
(3,903 real changes made)
(3,793 real changes made)
(7,696 real changes made)
(21,724 real changes made)
(18,885 missing values generated)
(7,597 real changes made)
(3,903 real changes made)
(5,879 real changes made, 5,879 to missing)
(18,983 missing values generated)
(26,581 missing values generated)
(3,880 real changes made)
(3,718 real changes made)
(3,880 real changes made)
(3,718 real changes made)
(4,816 real changes made)
(26,581 missing values generated)
(3,880 real changes made)
(3,718 real changes made)
(7,598 real changes made)
(21,765 real changes made)
(18,983 missing values generated)
(7,510 real changes made)
(3,880 real changes made)
(5,870 real changes made, 5,870 to missing)
(18,974 missing values generated)
(26,581 missing values generated)
(3,913 real changes made)
(3,694 real changes made)
(3,913 real changes made)
(3,694 real changes made)
(4,772 real changes made)
(26,581 missing values generated)
(3,913 real changes made)
(3,694 real changes made)
(7,607 real changes made)
(21,809 real changes made)
(18,974 missing values generated)
(7,508 real changes made)
(3,913 real changes made)
(5,810 real changes made, 5,810 to missing)
(18,914 missing values generated)
(26,581 missing values generated)
(3,887 real changes made)
(3,780 real changes made)
(3,887 real changes made)
(3,780 real changes made)
(4,845 real changes made)
(26,581 missing values generated)
(3,887 real changes made)
(3,780 real changes made)
(7,667 real changes made)
(21,736 real changes made)
(18,914 missing values generated)
(7,573 real changes made)
(3,887 real changes made)
(5,897 real changes made, 5,897 to missing)
(19,001 missing values generated)
(26,581 missing values generated)
(3,890 real changes made)
(3,690 real changes made)
(3,890 real changes made)
(3,690 real changes made)
(4,815 real changes made)
(26,581 missing values generated)
(3,890 real changes made)
(3,690 real changes made)
(7,580 real changes made)
(21,766 real changes made)
(19,001 missing values generated)
(7,479 real changes made)
(3,890 real changes made)
(5,864 real changes made, 5,864 to missing)
(18,968 missing values generated)
(26,581 missing values generated)
(3,846 real changes made)
(3,767 real changes made)
(3,846 real changes made)
(3,767 real changes made)
(4,853 real changes made)
(26,581 missing values generated)
(3,846 real changes made)
(3,767 real changes made)
(7,613 real changes made)
(21,728 real changes made)
(18,968 missing values generated)
(7,511 real changes made)
(3,846 real changes made)
(5,853 real changes made, 5,853 to missing)
(18,957 missing values generated)
(26,581 missing values generated)
(3,913 real changes made)
(3,711 real changes made)
(3,913 real changes made)
(3,711 real changes made)
(4,740 real changes made)
(26,581 missing values generated)
(3,913 real changes made)
(3,711 real changes made)
(7,624 real changes made)
(21,841 real changes made)
(18,957 missing values generated)
(7,541 real changes made)
(3,913 real changes made)
(5,951 real changes made, 5,951 to missing)
(19,055 missing values generated)
(26,581 missing values generated)
(3,853 real changes made)
(3,673 real changes made)
(3,853 real changes made)
(3,673 real changes made)
(4,776 real changes made)
(26,581 missing values generated)
(3,853 real changes made)
(3,673 real changes made)
(7,526 real changes made)
(21,805 real changes made)
(19,055 missing values generated)
(7,439 real changes made)
(3,853 real changes made)
(5,876 real changes made, 5,876 to missing)
(18,980 missing values generated)
(26,581 missing values generated)
(3,865 real changes made)
(3,736 real changes made)
(3,865 real changes made)
(3,736 real changes made)
(4,860 real changes made)
(26,581 missing values generated)
(3,865 real changes made)
(3,736 real changes made)
(7,601 real changes made)
(21,721 real changes made)
(18,980 missing values generated)
(7,521 real changes made)
(3,865 real changes made)
(5,916 real changes made, 5,916 to missing)
(19,020 missing values generated)
(26,581 missing values generated)
(3,837 real changes made)
(3,724 real changes made)
(3,837 real changes made)
(3,724 real changes made)
(4,766 real changes made)
(26,581 missing values generated)
(3,837 real changes made)
(3,724 real changes made)
(7,561 real changes made)
(21,815 real changes made)
(19,020 missing values generated)
(7,478 real changes made)
(3,837 real changes made)
(5,955 real changes made, 5,955 to missing)
(19,059 missing values generated)
(26,581 missing values generated)
(3,843 real changes made)
(3,679 real changes made)
(3,843 real changes made)
(3,679 real changes made)
(4,770 real changes made)
(26,581 missing values generated)
(3,843 real changes made)
(3,679 real changes made)
(7,522 real changes made)
(21,811 real changes made)
(19,059 missing values generated)
(7,437 real changes made)
(3,843 real changes made)
(5,821 real changes made, 5,821 to missing)
(18,925 missing values generated)
(26,581 missing values generated)
(3,877 real changes made)
(3,779 real changes made)
(3,877 real changes made)
(3,779 real changes made)
(4,954 real changes made)
(26,581 missing values generated)
(3,877 real changes made)
(3,779 real changes made)
(7,656 real changes made)
(21,627 real changes made)
(18,925 missing values generated)
(7,547 real changes made)
(3,877 real changes made)
(5,916 real changes made, 5,916 to missing)
(19,020 missing values generated)
(26,581 missing values generated)
(3,875 real changes made)
(3,686 real changes made)
(3,875 real changes made)
(3,686 real changes made)
(4,785 real changes made)
(26,581 missing values generated)
(3,875 real changes made)
(3,686 real changes made)
(7,561 real changes made)
(21,796 real changes made)
(19,020 missing values generated)
(7,464 real changes made)
(3,875 real changes made)
(5,982 real changes made, 5,982 to missing)
(19,086 missing values generated)
(26,581 missing values generated)
(3,826 real changes made)
(3,669 real changes made)
(3,826 real changes made)
(3,669 real changes made)
(4,679 real changes made)
(26,581 missing values generated)
(3,826 real changes made)
(3,669 real changes made)
(7,495 real changes made)
(21,902 real changes made)
(19,086 missing values generated)
(7,398 real changes made)
(3,826 real changes made)
(5,949 real changes made, 5,949 to missing)
(19,053 missing values generated)
(26,581 missing values generated)
(3,839 real changes made)
(3,689 real changes made)
(3,839 real changes made)
(3,689 real changes made)
(4,728 real changes made)
(26,581 missing values generated)
(3,839 real changes made)
(3,689 real changes made)
(7,528 real changes made)
(21,853 real changes made)
(19,053 missing values generated)
(7,439 real changes made)
(3,839 real changes made)
(5,858 real changes made, 5,858 to missing)
(18,962 missing values generated)
(26,581 missing values generated)
(3,902 real changes made)
(3,717 real changes made)
(3,902 real changes made)
(3,717 real changes made)
(4,807 real changes made)
(26,581 missing values generated)
(3,902 real changes made)
(3,717 real changes made)
(7,619 real changes made)
(21,774 real changes made)
(18,962 missing values generated)
(7,535 real changes made)
(3,902 real changes made)
(5,862 real changes made, 5,862 to missing)
(18,966 missing values generated)
(26,581 missing values generated)
(3,882 real changes made)
(3,733 real changes made)
(3,882 real changes made)
(3,733 real changes made)
(4,689 real changes made)
(26,581 missing values generated)
(3,882 real changes made)
(3,733 real changes made)
(7,615 real changes made)
(21,892 real changes made)
(18,966 missing values generated)
(7,505 real changes made)
(3,882 real changes made)
(5,976 real changes made, 5,976 to missing)
(19,080 missing values generated)
(26,581 missing values generated)
(3,829 real changes made)
(3,672 real changes made)
(3,829 real changes made)
(3,672 real changes made)
(4,790 real changes made)
(26,581 missing values generated)
(3,829 real changes made)
(3,672 real changes made)
(7,501 real changes made)
(21,791 real changes made)
(19,080 missing values generated)
(7,407 real changes made)
(3,829 real changes made)
(5,738 real changes made, 5,738 to missing)
(19,215 missing values generated)
(26,581 missing values generated)
(3,708 real changes made)
(3,658 real changes made)
(3,708 real changes made)
(3,658 real changes made)
(4,702 real changes made)
(26,581 missing values generated)
(3,708 real changes made)
(3,658 real changes made)
(7,366 real changes made)
(21,879 real changes made)
(19,215 missing values generated)
(7,286 real changes made)
(3,708 real changes made)
(5,813 real changes made, 5,813 to missing)
(19,290 missing values generated)
(26,581 missing values generated)
(3,672 real changes made)
(3,619 real changes made)
(3,672 real changes made)
(3,619 real changes made)
(4,592 real changes made)
(26,581 missing values generated)
(3,672 real changes made)
(3,619 real changes made)
(7,291 real changes made)
(21,989 real changes made)
(19,290 missing values generated)
(7,215 real changes made)
(3,672 real changes made)
(5,722 real changes made, 5,722 to missing)
(19,199 missing values generated)
(26,581 missing values generated)
(3,769 real changes made)
(3,613 real changes made)
(3,769 real changes made)
(3,613 real changes made)
(4,650 real changes made)
(26,581 missing values generated)
(3,769 real changes made)
(3,613 real changes made)
(7,382 real changes made)
(21,931 real changes made)
(19,199 missing values generated)
(7,311 real changes made)
(3,769 real changes made)
(5,786 real changes made, 5,786 to missing)
(19,263 missing values generated)
(26,581 missing values generated)
(3,712 real changes made)
(3,606 real changes made)
(3,712 real changes made)
(3,606 real changes made)
(4,653 real changes made)
(26,581 missing values generated)
(3,712 real changes made)
(3,606 real changes made)
(7,318 real changes made)
(21,928 real changes made)
(19,263 missing values generated)
(7,244 real changes made)
(3,712 real changes made)
(5,742 real changes made, 5,742 to missing)
(19,219 missing values generated)
(26,581 missing values generated)
(3,754 real changes made)
(3,608 real changes made)
(3,754 real changes made)
(3,608 real changes made)
(4,729 real changes made)
(26,581 missing values generated)
(3,754 real changes made)
(3,608 real changes made)
(7,362 real changes made)
(21,852 real changes made)
(19,219 missing values generated)
(7,286 real changes made)
(3,754 real changes made)
(5,714 real changes made, 5,714 to missing)
(19,191 missing values generated)
(26,581 missing values generated)
(3,751 real changes made)
(3,639 real changes made)
(3,751 real changes made)
(3,639 real changes made)
(4,710 real changes made)
(26,581 missing values generated)
(3,751 real changes made)
(3,639 real changes made)
(7,390 real changes made)
(21,871 real changes made)
(19,191 missing values generated)
(7,317 real changes made)
(3,751 real changes made)
(5,797 real changes made, 5,797 to missing)
(19,274 missing values generated)
(26,581 missing values generated)
(3,766 real changes made)
(3,541 real changes made)
(3,766 real changes made)
(3,541 real changes made)
(4,609 real changes made)
(26,581 missing values generated)
(3,766 real changes made)
(3,541 real changes made)
(7,307 real changes made)
(21,972 real changes made)
(19,274 missing values generated)
(7,227 real changes made)
(3,766 real changes made)
(5,730 real changes made, 5,730 to missing)
(19,207 missing values generated)
(26,581 missing values generated)
(3,753 real changes made)
(3,621 real changes made)
(3,753 real changes made)
(3,621 real changes made)
(4,653 real changes made)
(26,581 missing values generated)
(3,753 real changes made)
(3,621 real changes made)
(7,374 real changes made)
(21,928 real changes made)
(19,207 missing values generated)
(7,293 real changes made)
(3,753 real changes made)
(5,808 real changes made, 5,808 to missing)
(19,285 missing values generated)
(26,581 missing values generated)
(3,706 real changes made)
(3,590 real changes made)
(3,706 real changes made)
(3,590 real changes made)
(4,639 real changes made)
(26,581 missing values generated)
(3,706 real changes made)
(3,590 real changes made)
(7,296 real changes made)
(21,942 real changes made)
(19,285 missing values generated)
(7,231 real changes made)
(3,706 real changes made)
(5,777 real changes made, 5,777 to missing)
(19,254 missing values generated)
(26,581 missing values generated)
(3,720 real changes made)
(3,607 real changes made)
(3,720 real changes made)
(3,607 real changes made)
(4,645 real changes made)
(26,581 missing values generated)
(3,720 real changes made)
(3,607 real changes made)
(7,327 real changes made)
(21,936 real changes made)
(19,254 missing values generated)
(7,251 real changes made)
(3,720 real changes made)
(5,815 real changes made, 5,815 to missing)
(19,292 missing values generated)
(26,581 missing values generated)
(3,660 real changes made)
(3,629 real changes made)
(3,660 real changes made)
(3,629 real changes made)
(4,546 real changes made)
(26,581 missing values generated)
(3,660 real changes made)
(3,629 real changes made)
(7,289 real changes made)
(22,035 real changes made)
(19,292 missing values generated)
(7,217 real changes made)
(3,660 real changes made)
(5,804 real changes made, 5,804 to missing)
(19,281 missing values generated)
(26,581 missing values generated)
(3,748 real changes made)
(3,552 real changes made)
(3,748 real changes made)
(3,552 real changes made)
(4,631 real changes made)
(26,581 missing values generated)
(3,748 real changes made)
(3,552 real changes made)
(7,300 real changes made)
(21,950 real changes made)
(19,281 missing values generated)
(7,220 real changes made)
(3,748 real changes made)
(5,811 real changes made, 5,811 to missing)
(19,288 missing values generated)
(26,581 missing values generated)
(3,731 real changes made)
(3,562 real changes made)
(3,731 real changes made)
(3,562 real changes made)
(4,691 real changes made)
(26,581 missing values generated)
(3,731 real changes made)
(3,562 real changes made)
(7,293 real changes made)
(21,890 real changes made)
(19,288 missing values generated)
(7,225 real changes made)
(3,731 real changes made)
(5,897 real changes made, 5,897 to missing)
(19,374 missing values generated)
(26,581 missing values generated)
(3,698 real changes made)
(3,509 real changes made)
(3,698 real changes made)
(3,509 real changes made)
(4,600 real changes made)
(26,581 missing values generated)
(3,698 real changes made)
(3,509 real changes made)
(7,207 real changes made)
(21,981 real changes made)
(19,374 missing values generated)
(7,140 real changes made)
(3,698 real changes made)
(5,711 real changes made, 5,711 to missing)
(19,188 missing values generated)
(26,581 missing values generated)
(3,762 real changes made)
(3,631 real changes made)
(3,762 real changes made)
(3,631 real changes made)
(4,587 real changes made)
(26,581 missing values generated)
(3,762 real changes made)
(3,631 real changes made)
(7,393 real changes made)
(21,994 real changes made)
(19,188 missing values generated)
(7,308 real changes made)
(3,762 real changes made)
(5,736 real changes made, 5,736 to missing)
(19,213 missing values generated)
(26,581 missing values generated)
(3,724 real changes made)
(3,644 real changes made)
(3,724 real changes made)
(3,644 real changes made)
(4,640 real changes made)
(26,581 missing values generated)
(3,724 real changes made)
(3,644 real changes made)
(7,368 real changes made)
(21,941 real changes made)
(19,213 missing values generated)
(7,291 real changes made)
(3,724 real changes made)
(5,741 real changes made, 5,741 to missing)
(19,218 missing values generated)
(26,581 missing values generated)
(3,791 real changes made)
(3,572 real changes made)
(3,791 real changes made)
(3,572 real changes made)
(4,684 real changes made)
(26,581 missing values generated)
(3,791 real changes made)
(3,572 real changes made)
(7,363 real changes made)
(21,897 real changes made)
(19,218 missing values generated)
(7,288 real changes made)
(3,791 real changes made)
(5,745 real changes made, 5,745 to missing)
(19,222 missing values generated)
(26,581 missing values generated)
(3,708 real changes made)
(3,651 real changes made)
(3,708 real changes made)
(3,651 real changes made)
(4,670 real changes made)
(26,581 missing values generated)
(3,708 real changes made)
(3,651 real changes made)
(7,359 real changes made)
(21,911 real changes made)
(19,222 missing values generated)
(7,282 real changes made)
(3,708 real changes made)
(5,782 real changes made, 5,782 to missing)
(19,259 missing values generated)
(26,581 missing values generated)
(3,717 real changes made)
(3,605 real changes made)
(3,717 real changes made)
(3,605 real changes made)
(4,686 real changes made)
(26,581 missing values generated)
(3,717 real changes made)
(3,605 real changes made)
(7,322 real changes made)
(21,895 real changes made)
(19,259 missing values generated)
(7,254 real changes made)
(3,717 real changes made)
(5,745 real changes made, 5,745 to missing)
(19,222 missing values generated)
(26,581 missing values generated)
(3,749 real changes made)
(3,610 real changes made)
(3,749 real changes made)
(3,610 real changes made)
(4,666 real changes made)
(26,581 missing values generated)
(3,749 real changes made)
(3,610 real changes made)
(7,359 real changes made)
(21,915 real changes made)
(19,222 missing values generated)
(7,289 real changes made)
(3,749 real changes made)
(5,702 real changes made, 5,702 to missing)
(19,179 missing values generated)
(26,581 missing values generated)
(3,776 real changes made)
(3,626 real changes made)
(3,776 real changes made)
(3,626 real changes made)
(4,630 real changes made)
(26,581 missing values generated)
(3,776 real changes made)
(3,626 real changes made)
(7,402 real changes made)
(21,951 real changes made)
(19,179 missing values generated)
(7,315 real changes made)
(3,776 real changes made)
(5,722 real changes made, 5,722 to missing)
(19,199 missing values generated)
(26,581 missing values generated)
(3,708 real changes made)
(3,674 real changes made)
(3,708 real changes made)
(3,674 real changes made)
(4,662 real changes made)
(26,581 missing values generated)
(3,708 real changes made)
(3,674 real changes made)
(7,382 real changes made)
(21,919 real changes made)
(19,199 missing values generated)
(7,302 real changes made)
(3,708 real changes made)
(5,758 real changes made, 5,758 to missing)
(19,235 missing values generated)
(26,581 missing values generated)
(3,714 real changes made)
(3,632 real changes made)
(3,714 real changes made)
(3,632 real changes made)
(4,604 real changes made)
(26,581 missing values generated)
(3,714 real changes made)
(3,632 real changes made)
(7,346 real changes made)
(21,977 real changes made)
(19,235 missing values generated)
(7,267 real changes made)
(3,714 real changes made)
(5,750 real changes made, 5,750 to missing)
(19,227 missing values generated)
(26,581 missing values generated)
(3,702 real changes made)
(3,652 real changes made)
(3,702 real changes made)
(3,652 real changes made)
(4,623 real changes made)
(26,581 missing values generated)
(3,702 real changes made)
(3,652 real changes made)
(7,354 real changes made)
(21,958 real changes made)
(19,227 missing values generated)
(7,277 real changes made)
(3,702 real changes made)
(5,770 real changes made, 5,770 to missing)
(19,247 missing values generated)
(26,581 missing values generated)
(3,677 real changes made)
(3,657 real changes made)
(3,677 real changes made)
(3,657 real changes made)
(4,556 real changes made)
(26,581 missing values generated)
(3,677 real changes made)
(3,657 real changes made)
(7,334 real changes made)
(22,025 real changes made)
(19,247 missing values generated)
(7,258 real changes made)
(3,677 real changes made)
(5,770 real changes made, 5,770 to missing)
(19,247 missing values generated)
(26,581 missing values generated)
(3,714 real changes made)
(3,620 real changes made)
(3,714 real changes made)
(3,620 real changes made)
(4,674 real changes made)
(26,581 missing values generated)
(3,714 real changes made)
(3,620 real changes made)
(7,334 real changes made)
(21,907 real changes made)
(19,247 missing values generated)
(7,261 real changes made)
(3,714 real changes made)
(5,695 real changes made, 5,695 to missing)
(19,172 missing values generated)
(26,581 missing values generated)
(3,792 real changes made)
(3,617 real changes made)
(3,792 real changes made)
(3,617 real changes made)
(4,667 real changes made)
(26,581 missing values generated)
(3,792 real changes made)
(3,617 real changes made)
(7,409 real changes made)
(21,914 real changes made)
(19,172 missing values generated)
(7,334 real changes made)
(3,792 real changes made)
(5,742 real changes made, 5,742 to missing)
(19,219 missing values generated)
(26,581 missing values generated)
(3,742 real changes made)
(3,620 real changes made)
(3,742 real changes made)
(3,620 real changes made)
(4,606 real changes made)
(26,581 missing values generated)
(3,742 real changes made)
(3,620 real changes made)
(7,362 real changes made)
(21,975 real changes made)
(19,219 missing values generated)
(7,288 real changes made)
(3,742 real changes made)
(5,698 real changes made, 5,698 to missing)
(19,175 missing values generated)
(26,581 missing values generated)
(3,751 real changes made)
(3,655 real changes made)
(3,751 real changes made)
(3,655 real changes made)
(4,726 real changes made)
(26,581 missing values generated)
(3,751 real changes made)
(3,655 real changes made)
(7,406 real changes made)
(21,855 real changes made)
(19,175 missing values generated)
(7,331 real changes made)
(3,751 real changes made)
(5,739 real changes made, 5,739 to missing)
(19,216 missing values generated)
(26,581 missing values generated)
(3,711 real changes made)
(3,654 real changes made)
(3,711 real changes made)
(3,654 real changes made)
(4,640 real changes made)
(26,581 missing values generated)
(3,711 real changes made)
(3,654 real changes made)
(7,365 real changes made)
(21,941 real changes made)
(19,216 missing values generated)
(7,300 real changes made)
(3,711 real changes made)
(5,773 real changes made, 5,773 to missing)
(19,250 missing values generated)
(26,581 missing values generated)
(3,706 real changes made)
(3,625 real changes made)
(3,706 real changes made)
(3,625 real changes made)
(4,648 real changes made)
(26,581 missing values generated)
(3,706 real changes made)
(3,625 real changes made)
(7,331 real changes made)
(21,933 real changes made)
(19,250 missing values generated)
(7,249 real changes made)
(3,706 real changes made)
(5,797 real changes made, 5,797 to missing)
(19,274 missing values generated)
(26,581 missing values generated)
(3,722 real changes made)
(3,585 real changes made)
(3,722 real changes made)
(3,585 real changes made)
(4,580 real changes made)
(26,581 missing values generated)
(3,722 real changes made)
(3,585 real changes made)
(7,307 real changes made)
(22,001 real changes made)
(19,274 missing values generated)
(7,242 real changes made)
(3,722 real changes made)
(5,769 real changes made, 5,769 to missing)
(19,246 missing values generated)
(26,581 missing values generated)
(3,756 real changes made)
(3,579 real changes made)
(3,756 real changes made)
(3,579 real changes made)
(4,703 real changes made)
(26,581 missing values generated)
(3,756 real changes made)
(3,579 real changes made)
(7,335 real changes made)
(21,878 real changes made)
(19,246 missing values generated)
(7,257 real changes made)
(3,756 real changes made)

. 
. replace index_date = index_date_28
(25,533 real changes made)

. drop index_date_28

. gen egfr15_date=.
(26,581 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb
> 2019 mar2019 apr2019 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 
> sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatinine_`x'<15 & date("01`x'", "DMY")>=index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen esrd_date = egfr15_date
(26,581 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if esrd_date==.
(2,015 real changes made)

. gen esrd = 0

. replace esrd = 1 if esrd_date!=.
(2,015 real changes made)

. label var esrd "Kidney failure"

. gen esrd_time = (esrd_date - index_date)
(24,566 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(24,566 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(2009 changes made to esrd_time_cat)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"                      ///
>                                                         3 "1 to 28 days"        ///
>                                                         4 "20 to 90 days"       ///
>                                                         5 "91 to 180 days"      ///
>                                                         6 "181 to 365 days"     ///
>                                                         7 "366 to 730 days"     ///
>                                                         8 "731 to 973 days"     ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 critical_care   ///
>                                                                 krt             {
  2.                                                                 by `exposure',sort: sum esrd_time, de
  3.                                                                 tab esrd_time_cat `exposure', m col chi
  4.                                                                 }

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Pneumonia (pre-pandemic)

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           31              0       Obs               1,068
25%        118.5              0       Sum of wgt.       1,068

50%          287                      Mean           323.8708
                        Largest       Std. dev.      242.1958
75%        492.5            929
90%          695            940       Variance       58658.79
95%          772            943       Skewness       .5463775
99%          890            981       Kurtosis       2.325038

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           15              0       Obs                 947
25%           91              0       Sum of wgt.         947

50%          242                      Mean           290.5818
                        Largest       Std. dev.      232.2985
75%          452            889
90%          635            894       Variance        53962.6
95%          738            903       Skewness       .6341355
99%          840            911       Kurtosis       2.420676


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Pneumonia   COVID-19 |     Total
----------------+----------------------+----------
         0 days |        58         64 |       122 
                |      0.43       0.49 |      0.46 
----------------+----------------------+----------
   1 to 28 days |        43         50 |        93 
                |      0.32       0.38 |      0.35 
----------------+----------------------+----------
  20 to 90 days |       115        122 |       237 
                |      0.85       0.93 |      0.89 
----------------+----------------------+----------
 91 to 180 days |       165        144 |       309 
                |      1.22       1.10 |      1.16 
----------------+----------------------+----------
181 to 365 days |       265        251 |       516 
                |      1.97       1.92 |      1.94 
----------------+----------------------+----------
366 to 730 days |       339        268 |       607 
                |      2.52       2.05 |      2.28 
----------------+----------------------+----------
731 to 973 days |        82         48 |       130 
                |      0.61       0.37 |      0.49 
----------------+----------------------+----------
      >973 days |         1          0 |         1 
                |      0.01       0.00 |      0.00 
----------------+----------------------+----------
              . |    12,409     12,157 |    24,566 
                |     92.08      92.77 |     92.42 
----------------+----------------------+----------
          Total |    13,477     13,104 |    26,581 
                |    100.00     100.00 |    100.00 

          Pearson chi2(8) =  18.3873   Pr = 0.019

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> critical_care = Ward-based

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           24              0       Obs               1,802
25%          103              0       Sum of wgt.       1,802

50%        267.5                      Mean           308.5832
                        Largest       Std. dev.      237.9784
75%          477            924
90%          669            929       Variance       56633.72
95%          762            940       Skewness       .5811145
99%          881            981       Kurtosis        2.36446

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> critical_care = Critical care

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           24              0       Obs                 213
25%          110              0       Sum of wgt.         213

50%          253                      Mean           305.2019
                        Largest       Std. dev.      239.8335
75%          465            838
90%          699            870       Variance       57520.11
95%          757            911       Skewness       .6609792
99%          870            943       Kurtosis       2.458224


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |     Critical care
  esrd_time_cat | Ward-base  Critical  |     Total
----------------+----------------------+----------
         0 days |       107         15 |       122 
                |      0.45       0.57 |      0.46 
----------------+----------------------+----------
   1 to 28 days |        85          8 |        93 
                |      0.36       0.30 |      0.35 
----------------+----------------------+----------
  20 to 90 days |       212         25 |       237 
                |      0.89       0.94 |      0.89 
----------------+----------------------+----------
 91 to 180 days |       277         32 |       309 
                |      1.16       1.21 |      1.16 
----------------+----------------------+----------
181 to 365 days |       454         62 |       516 
                |      1.90       2.34 |      1.94 
----------------+----------------------+----------
366 to 730 days |       551         56 |       607 
                |      2.30       2.11 |      2.28 
----------------+----------------------+----------
731 to 973 days |       115         15 |       130 
                |      0.48       0.57 |      0.49 
----------------+----------------------+----------
      >973 days |         1          0 |         1 
                |      0.00       0.00 |      0.00 
----------------+----------------------+----------
              . |    22,131      2,435 |    24,566 
                |     92.47      91.96 |     92.42 
----------------+----------------------+----------
          Total |    23,933      2,648 |    26,581 
                |    100.00     100.00 |    100.00 

          Pearson chi2(8) =   4.4083   Pr = 0.819

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = No AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           23              0       Obs               1,176
25%          103              0       Sum of wgt.       1,176

50%          261                      Mean           309.5196
                        Largest       Std. dev.      239.6554
75%        480.5            924
90%          678            940       Variance       57434.69
95%          759            943       Skewness       .5769416
99%          881            981       Kurtosis       2.329776

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = AKI without KRT

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           29              0       Obs                 799
25%          104              0       Sum of wgt.         799

50%          277                      Mean           308.3955
                        Largest       Std. dev.      236.1374
75%          471            915
90%          662            919       Variance       55760.87
95%          768            924       Skewness        .602061
99%          883            929       Kurtosis       2.442203

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = AKI requiring KRT

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            7              0       Obs                  40
25%         74.5              3       Sum of wgt.          40

50%        208.5                      Mean              266.8
                        Largest       Std. dev.      234.2585
75%        438.5            690
90%          661            738       Variance       54877.04
95%        742.5            747       Skewness       .7349633
99%          773            773       Kurtosis       2.398955


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |    Kidney replacement therapy
  esrd_time_cat |    No AKI  AKI witho  AKI requi |     Total
----------------+---------------------------------+----------
         0 days |        70         49          3 |       122 
                |      0.45       0.47       0.55 |      0.46 
----------------+---------------------------------+----------
   1 to 28 days |        60         30          3 |        93 
                |      0.39       0.29       0.55 |      0.35 
----------------+---------------------------------+----------
  20 to 90 days |       133         98          6 |       237 
                |      0.85       0.94       1.10 |      0.89 
----------------+---------------------------------+----------
 91 to 180 days |       185        117          7 |       309 
                |      1.19       1.12       1.28 |      1.16 
----------------+---------------------------------+----------
181 to 365 days |       289        219          8 |       516 
                |      1.86       2.09       1.47 |      1.94 
----------------+---------------------------------+----------
366 to 730 days |       364        233         10 |       607 
                |      2.34       2.23       1.83 |      2.28 
----------------+---------------------------------+----------
731 to 973 days |        74         53          3 |       130 
                |      0.48       0.51       0.55 |      0.49 
----------------+---------------------------------+----------
      >973 days |         1          0          0 |         1 
                |      0.01       0.00       0.00 |      0.00 
----------------+---------------------------------+----------
              . |    14,390      9,671        505 |    24,566 
                |     92.45      92.37      92.66 |     92.42 
----------------+---------------------------------+----------
          Total |    15,566     10,470        545 |    26,581 
                |    100.00     100.00     100.00 |    100.00 

         Pearson chi2(16) =   7.7655   Pr = 0.956

.         
. * Exit date
. gen exit_date = esrd_date
(24,566 missing values generated)

. format exit_date %td

. gen end_date = date("2022-11-30", "YMD") if case==1
(13,477 missing values generated)

. replace end_date = date("2019-11-30", "YMD") if case==0
(13,477 real changes made)

. format end_date %td

. replace exit_date = min(deregistered_date, death_date, end_date) if esrd_date==.
(24,566 real changes made)

. gen follow_up_time = (exit_date - index_date)
(1,048 missing values generated)

. label var follow_up_time "Follow-up time (Days)"

. gen follow_up_cat = follow_up_time
(1,048 missing values generated)

. recode follow_up_cat    min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0/365=3         ///
>                                                 366/730=4       ///
>                                                 731/1040=5      ///                                     
>                                                 1041/max=6
(25504 changes made to follow_up_cat)

. label define follow_up_cat      1 "<-29 days"           ///
>                                                         2 "-28 to -1 days"      ///
>                                                         3 "0 to 365 days"       ///
>                                                         4 "366 to 730 days" ///
>                                                         5 "731 to 1040 days"    ///
>                                                         6 ">1040 days"

. label values follow_up_cat follow_up_cat

. label var follow_up_cat "Follow_up time"

. tab case follow_up_cat

                      |               Follow_up time
                 case | -28 to -1  0 to 365   366 to 73  731 to 10 |     Total
----------------------+--------------------------------------------+----------
Pneumonia (pre-pandem |        44      5,328      4,627      3,151 |    13,150 
             COVID-19 |        46      5,073      4,333      2,931 |    12,383 
----------------------+--------------------------------------------+----------
                Total |        90     10,401      8,960      6,082 |    25,533 

. drop if follow_up_time<0
(90 observations deleted)

. drop if follow_up_time>1040
(1,048 observations deleted)

. tab case follow_up_cat

                      |          Follow_up time
                 case | 0 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Pneumonia (pre-pandem |     5,328      4,627      3,151 |    13,106 
             COVID-19 |     5,073      4,333      2,931 |    12,337 
----------------------+---------------------------------+----------
                Total |    10,401      8,960      6,082 |    25,443 

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(25,443 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb
> 2019 mar2019 apr2019 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 
> sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_half_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>=index_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(21 real changes made)
(33 real changes made)
(57 real changes made)
(49 real changes made)
(63 real changes made)
(61 real changes made)
(72 real changes made)
(83 real changes made)
(86 real changes made)
(79 real changes made)
(99 real changes made)
(108 real changes made)
(102 real changes made)
(94 real changes made)
(98 real changes made)
(110 real changes made)
(113 real changes made)
(116 real changes made)
(108 real changes made)
(100 real changes made)
(109 real changes made)
(106 real changes made)
(111 real changes made)
(109 real changes made)
(116 real changes made)
(115 real changes made)
(92 real changes made)
(123 real changes made)
(97 real changes made)
(90 real changes made)
(0 real changes made)
(0 real changes made)
(14 real changes made)
(33 real changes made)
(31 real changes made)
(55 real changes made)
(52 real changes made)
(49 real changes made)
(59 real changes made)
(71 real changes made)
(96 real changes made)
(71 real changes made)
(84 real changes made)
(88 real changes made)
(79 real changes made)
(78 real changes made)
(87 real changes made)
(104 real changes made)
(87 real changes made)
(86 real changes made)
(89 real changes made)
(103 real changes made)
(100 real changes made)
(113 real changes made)
(84 real changes made)
(81 real changes made)
(109 real changes made)
(90 real changes made)
(80 real changes made)
(92 real changes made)
(75 real changes made)
(88 real changes made)
(101 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(1,550 real changes made)

. gen egfr_half = 0

. replace egfr_half = 1 if egfr_half_date!=.
(6,699 real changes made)

. label var egfr_half "50% reduction in eGFR"

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(11,376 real changes made, 11,376 to missing)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(18,744 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date) if egfr_half_date==. & index_date_egfr_half!=.
(8,280 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(11,376 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days)"

. 
. * AKI (or ESRD)
. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(22,994 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(1,822 real changes made)

. gen aki = 0

. replace aki = 1 if aki_date!=.
(4,271 real changes made)

. label var aki "Acute kidney injury"

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(21,172 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date)  if aki_date==.
(21,172 real changes made)

. gen follow_up_time_aki = (exit_date_aki - index_date)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. 
. * Exit date (death)
. gen exit_date_death = death_date
(24,324 missing values generated)

. gen death = 0

. replace death = 1 if death_date!=.
(1,119 real changes made)

. label var death "Death"

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(24,324 real changes made)

. gen follow_up_time_death = (exit_date_death - index_date)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. 
. save ./output/analysis_hospitalised.dta, replace
file ./output/analysis_hospitalised.dta saved

. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_hospitalised.log
  log type:  text
 closed on:  12 Jan 2023, 10:54:47
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
