------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_hospitalised.log
  log type:  text
 opened on:  28 Dec 2022, 13:22:56

. 
. capture noisily import delimited ./output/input_covid_hospitalised.csv, clear
(encoding automatically selected: ISO-8859-9)
(117 vars, 50,000 obs)

. tempfile covid_hospitalised

. save `covid_hospitalised', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_1a44_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_1a44_000001.tmp saved as .dta format

. di "COVID-19 hospitalised:"
COVID-19 hospitalised:

. safecount
  50,000

. 
. capture noisily import delimited ./output/input_pneumonia_hospitalised.csv, clear
(encoding automatically selected: ISO-8859-9)
(113 vars, 50,000 obs)

. tempfile pneumonia_hospitalised

. save `pneumonia_hospitalised', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_1a44_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_1a44_000002.tmp saved as .dta format

. di "Pneumonia hospitalised:"
Pneumonia hospitalised:

. safecount
  50,000

. 
. append using `covid_hospitalised', force

. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      5,006        5.01        5.01
 1 Most deprived |     19,136       19.14       24.14
               2 |     18,831       18.83       42.97
               3 |     18,988       18.99       61.96
               4 |     19,062       19.06       81.02
5 Least deprived |     18,977       18.98      100.00
-----------------+-----------------------------------
           Total |    100,000      100.00

. drop if imd==0
(5,006 observations deleted)

. safetab imd

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |     19,136       20.14       20.14
               2 |     18,831       19.82       39.97
               3 |     18,988       19.99       59.96
               4 |     19,062       20.07       80.02
5 Least deprived |     18,977       19.98      100.00
-----------------+-----------------------------------
           Total |     94,994      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(94,993 missing values generated)

. replace stp1 = sum(stp1)
(94,993 real changes made)

. drop stp

. rename stp1 stp

. label values stp stp

. label var stp "STP"

. safetab stp

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     94,994      100.00      100.00
------------+-----------------------------------
      Total |     94,994      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(85,597 missing values generated)

. replace region = 2 if region_string=="East"
(9,399 real changes made)

. replace region = 3 if region_string=="London"
(18,826 real changes made)

. replace region = 4 if region_string=="North East"
(9,468 real changes made)

. replace region = 5 if region_string=="North West"
(9,403 real changes made)

. replace region = 6 if region_string=="South East"
(9,815 real changes made)

. replace region = 7 if region_string=="South West"
(9,614 real changes made)

. replace region = 8 if region_string=="West Midlands"
(9,493 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(9,579 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,397        9.89        9.89
                    East |      9,399        9.89       19.79
                  London |     18,826       19.82       39.60
              North East |      9,468        9.97       49.57
              North West |      9,403        9.90       59.47
              South East |      9,815       10.33       69.80
              South West |      9,614       10.12       79.92
           West Midlands |      9,493        9.99       89.92
Yorkshire and The Humber |      9,579       10.08      100.00
-------------------------+-----------------------------------
                   Total |     94,994      100.00

. drop if region==10
(0 observations deleted)

. safetab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      9,397        9.89        9.89
                    East |      9,399        9.89       19.79
                  London |     18,826       19.82       39.60
              North East |      9,468        9.97       49.57
              North West |      9,403        9.90       59.47
              South East |      9,815       10.33       69.80
              South West |      9,614       10.12       79.92
           West Midlands |      9,493        9.99       89.92
Yorkshire and The Humber |      9,579       10.08      100.00
-------------------------+-----------------------------------
                   Total |     94,994      100.00

. 
. * Exclusions due to deregistration and kidney replacement therapy will be checked (should already have been applied from previous steps in workflow)
. gen index_date = date(patient_index_date, "YMD")
(4,037 missing values generated)

. format index_date %td

. 
. * Deregistered before index_date
. gen deregistered_date = date(date_deregistered, "YMD")
(28,572 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date
(64,131 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(26,535 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(2,166 observations deleted)

. gen index_date_28 = index_date + 28
(1,034 missing values generated)

. format index_date_28 %td

. replace krt_date = index_date_28 if krt_date < index_date_28
(106 real changes made)

. 
. * Death before index_date + 28 days (i.e. only include people who survived 28 days after index_date)
. drop if deceased==1
(284 observations deleted)

. drop deceased

. gen death_date1 = date(death_date, "YMD")
(25,571 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28
(1,732 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased within 28 days of index date"

. label values deceased deceased

. tab covid deceased

           |       deceased
     covid | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,137      1,037 |    14,174 
-----------+----------------------+----------
     Total |    13,137      1,037 |    14,174 

. tab pneumonia deceased

           |       deceased
 pneumonia | Alive at   Deceased  |     Total
-----------+----------------------+----------
         1 |    13,544        695 |    14,239 
-----------+----------------------+----------
     Total |    13,544        695 |    14,239 

. drop if deceased==1
(1,732 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators only
. gen sex1 = 1 if sex=="M"
(13,798 missing values generated)

. replace sex1 = 0 if sex=="F"
(13,798 real changes made)

. drop sex

. rename sex1 sex

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 ///
>                                                                                                 baseline_creatinine_mar2017 ///
>                                                                                                 baseline_creatinine_apr2017 ///
>                                                                                                 baseline_creatinine_may2017 ///
>                                                                                                 baseline_creatinine_jun2017 ///
>                                                                                                 baseline_creatinine_jul2017 ///
>                                                                                                 baseline_creatinine_aug2017 ///
>                                                                                                 baseline_creatinine_sep2017 ///
>                                                                                                 baseline_creatinine_oct2017 ///
>                                                                                                 baseline_creatinine_nov2017 ///
>                                                                                                 baseline_creatinine_dec2017 ///
>                                                                                                 baseline_creatinine_jan2018 ///
>                                                                                                 baseline_creatinine_feb2018 ///
>                                                                                                 baseline_creatinine_mar2018 ///
>                                                                                                 baseline_creatinine_apr2018 ///
>                                                                                                 baseline_creatinine_may2018 ///
>                                                                                                 baseline_creatinine_jun2018 ///
>                                                                                                 baseline_creatinine_jul2018 ///
>                                                                                                 baseline_creatinine_aug2018 ///
>                                                                                                 baseline_creatinine_sep2018 ///
>                                                                                                 baseline_creatinine_oct2018 ///
>                                                                                                 baseline_creatinine_nov2018 ///
>                                                                                                 baseline_creatinine_dec2018 ///
>                                                                                                 baseline_creatinine_jan2019 ///
>                                                                                                 baseline_creatinine_feb2019 ///
>                                                                                                 baseline_creatinine_mar2019 ///
>                                                                                                 baseline_creatinine_apr2019 ///
>                                                                                                 baseline_creatinine_may2019 ///
>                                                                                                 baseline_creatinine_jun2019 ///
>                                                                                                 baseline_creatinine_jul2019 ///
>                                                                                                 baseline_creatinine_aug2019 ///
>                                                                                                 baseline_creatinine_sep2019 ///
>                                                                                                 baseline_creatinine_feb2020 ///
>                                                                                                 baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 ///
>                                                                                                 baseline_creatinine_feb2022 ///
>                                                                                                 baseline_creatinine_mar2022 ///
>                                                                                                 baseline_creatinine_apr2022 ///
>                                                                                                 baseline_creatinine_may2022 ///
>                                                                                                 baseline_creatinine_jun2022 ///
>                                                                                                 baseline_creatinine_jul2022 ///
>                                                                                                 baseline_creatinine_aug2022 ///
>                                                                                                 baseline_creatinine_sep2022 ///
>                                                                                                 baseline_creatinine_oct2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(5,910 real changes made, 5,910 to missing)
(19,047 missing values generated)
(26,681 missing values generated)
(4,000 real changes made)
(3,634 real changes made)
(4,000 real changes made)
(3,634 real changes made)
(4,832 real changes made)
(26,681 missing values generated)
(4,000 real changes made)
(3,634 real changes made)
(7,634 real changes made)
(21,849 real changes made)
(19,047 missing values generated)
(7,539 real changes made)
(4,000 real changes made)
(5,983 real changes made, 5,983 to missing)
(19,120 missing values generated)
(26,681 missing values generated)
(3,946 real changes made)
(3,615 real changes made)
(3,946 real changes made)
(3,615 real changes made)
(4,846 real changes made)
(26,681 missing values generated)
(3,946 real changes made)
(3,615 real changes made)
(7,561 real changes made)
(21,835 real changes made)
(19,120 missing values generated)
(7,470 real changes made)
(3,946 real changes made)
(6,043 real changes made, 6,043 to missing)
(19,180 missing values generated)
(26,681 missing values generated)
(3,921 real changes made)
(3,580 real changes made)
(3,921 real changes made)
(3,580 real changes made)
(4,776 real changes made)
(26,681 missing values generated)
(3,921 real changes made)
(3,580 real changes made)
(7,501 real changes made)
(21,905 real changes made)
(19,180 missing values generated)
(7,422 real changes made)
(3,921 real changes made)
(6,015 real changes made, 6,015 to missing)
(19,152 missing values generated)
(26,681 missing values generated)
(3,895 real changes made)
(3,634 real changes made)
(3,895 real changes made)
(3,634 real changes made)
(4,770 real changes made)
(26,681 missing values generated)
(3,895 real changes made)
(3,634 real changes made)
(7,529 real changes made)
(21,911 real changes made)
(19,152 missing values generated)
(7,448 real changes made)
(3,895 real changes made)
(5,941 real changes made, 5,941 to missing)
(19,078 missing values generated)
(26,681 missing values generated)
(3,967 real changes made)
(3,636 real changes made)
(3,967 real changes made)
(3,636 real changes made)
(4,836 real changes made)
(26,681 missing values generated)
(3,967 real changes made)
(3,636 real changes made)
(7,603 real changes made)
(21,845 real changes made)
(19,078 missing values generated)
(7,507 real changes made)
(3,967 real changes made)
(5,895 real changes made, 5,895 to missing)
(19,032 missing values generated)
(26,681 missing values generated)
(4,000 real changes made)
(3,649 real changes made)
(4,000 real changes made)
(3,649 real changes made)
(4,817 real changes made)
(26,681 missing values generated)
(4,000 real changes made)
(3,649 real changes made)
(7,649 real changes made)
(21,864 real changes made)
(19,032 missing values generated)
(7,560 real changes made)
(4,000 real changes made)
(5,962 real changes made, 5,962 to missing)
(19,099 missing values generated)
(26,681 missing values generated)
(3,982 real changes made)
(3,600 real changes made)
(3,982 real changes made)
(3,600 real changes made)
(4,785 real changes made)
(26,681 missing values generated)
(3,982 real changes made)
(3,600 real changes made)
(7,582 real changes made)
(21,896 real changes made)
(19,099 missing values generated)
(7,485 real changes made)
(3,982 real changes made)
(5,885 real changes made, 5,885 to missing)
(19,022 missing values generated)
(26,681 missing values generated)
(3,980 real changes made)
(3,679 real changes made)
(3,980 real changes made)
(3,679 real changes made)
(4,783 real changes made)
(26,681 missing values generated)
(3,980 real changes made)
(3,679 real changes made)
(7,659 real changes made)
(21,898 real changes made)
(19,022 missing values generated)
(7,567 real changes made)
(3,980 real changes made)
(5,974 real changes made, 5,974 to missing)
(19,111 missing values generated)
(26,681 missing values generated)
(3,986 real changes made)
(3,584 real changes made)
(3,986 real changes made)
(3,584 real changes made)
(4,874 real changes made)
(26,681 missing values generated)
(3,986 real changes made)
(3,584 real changes made)
(7,570 real changes made)
(21,807 real changes made)
(19,111 missing values generated)
(7,463 real changes made)
(3,986 real changes made)
(5,999 real changes made, 5,999 to missing)
(19,136 missing values generated)
(26,681 missing values generated)
(3,906 real changes made)
(3,639 real changes made)
(3,906 real changes made)
(3,639 real changes made)
(4,806 real changes made)
(26,681 missing values generated)
(3,906 real changes made)
(3,639 real changes made)
(7,545 real changes made)
(21,875 real changes made)
(19,136 missing values generated)
(7,446 real changes made)
(3,906 real changes made)
(5,963 real changes made, 5,963 to missing)
(19,100 missing values generated)
(26,681 missing values generated)
(3,944 real changes made)
(3,637 real changes made)
(3,944 real changes made)
(3,637 real changes made)
(4,853 real changes made)
(26,681 missing values generated)
(3,944 real changes made)
(3,637 real changes made)
(7,581 real changes made)
(21,828 real changes made)
(19,100 missing values generated)
(7,483 real changes made)
(3,944 real changes made)
(6,028 real changes made, 6,028 to missing)
(19,165 missing values generated)
(26,681 missing values generated)
(3,936 real changes made)
(3,580 real changes made)
(3,936 real changes made)
(3,580 real changes made)
(4,799 real changes made)
(26,681 missing values generated)
(3,936 real changes made)
(3,580 real changes made)
(7,516 real changes made)
(21,882 real changes made)
(19,165 missing values generated)
(7,420 real changes made)
(3,936 real changes made)
(5,947 real changes made, 5,947 to missing)
(19,084 missing values generated)
(26,681 missing values generated)
(3,962 real changes made)
(3,635 real changes made)
(3,962 real changes made)
(3,635 real changes made)
(4,730 real changes made)
(26,681 missing values generated)
(3,962 real changes made)
(3,635 real changes made)
(7,597 real changes made)
(21,951 real changes made)
(19,084 missing values generated)
(7,499 real changes made)
(3,962 real changes made)
(5,899 real changes made, 5,899 to missing)
(19,036 missing values generated)
(26,681 missing values generated)
(3,990 real changes made)
(3,655 real changes made)
(3,990 real changes made)
(3,655 real changes made)
(4,823 real changes made)
(26,681 missing values generated)
(3,990 real changes made)
(3,655 real changes made)
(7,645 real changes made)
(21,858 real changes made)
(19,036 missing values generated)
(7,555 real changes made)
(3,990 real changes made)
(5,953 real changes made, 5,953 to missing)
(19,090 missing values generated)
(26,681 missing values generated)
(3,967 real changes made)
(3,624 real changes made)
(3,967 real changes made)
(3,624 real changes made)
(4,908 real changes made)
(26,681 missing values generated)
(3,967 real changes made)
(3,624 real changes made)
(7,591 real changes made)
(21,773 real changes made)
(19,090 missing values generated)
(7,494 real changes made)
(3,967 real changes made)
(5,908 real changes made, 5,908 to missing)
(19,045 missing values generated)
(26,681 missing values generated)
(3,988 real changes made)
(3,648 real changes made)
(3,988 real changes made)
(3,648 real changes made)
(4,852 real changes made)
(26,681 missing values generated)
(3,988 real changes made)
(3,648 real changes made)
(7,636 real changes made)
(21,829 real changes made)
(19,045 missing values generated)
(7,555 real changes made)
(3,988 real changes made)
(6,062 real changes made, 6,062 to missing)
(19,199 missing values generated)
(26,681 missing values generated)
(3,856 real changes made)
(3,626 real changes made)
(3,856 real changes made)
(3,626 real changes made)
(4,754 real changes made)
(26,681 missing values generated)
(3,856 real changes made)
(3,626 real changes made)
(7,482 real changes made)
(21,927 real changes made)
(19,199 missing values generated)
(7,394 real changes made)
(3,856 real changes made)
(5,868 real changes made, 5,868 to missing)
(19,005 missing values generated)
(26,681 missing values generated)
(3,963 real changes made)
(3,713 real changes made)
(3,963 real changes made)
(3,713 real changes made)
(4,819 real changes made)
(26,681 missing values generated)
(3,963 real changes made)
(3,713 real changes made)
(7,676 real changes made)
(21,862 real changes made)
(19,005 missing values generated)
(7,589 real changes made)
(3,963 real changes made)
(6,049 real changes made, 6,049 to missing)
(19,186 missing values generated)
(26,681 missing values generated)
(3,882 real changes made)
(3,613 real changes made)
(3,882 real changes made)
(3,613 real changes made)
(4,856 real changes made)
(26,681 missing values generated)
(3,882 real changes made)
(3,613 real changes made)
(7,495 real changes made)
(21,825 real changes made)
(19,186 missing values generated)
(7,397 real changes made)
(3,882 real changes made)
(5,998 real changes made, 5,998 to missing)
(19,135 missing values generated)
(26,681 missing values generated)
(3,949 real changes made)
(3,597 real changes made)
(3,949 real changes made)
(3,597 real changes made)
(4,817 real changes made)
(26,681 missing values generated)
(3,949 real changes made)
(3,597 real changes made)
(7,546 real changes made)
(21,864 real changes made)
(19,135 missing values generated)
(7,449 real changes made)
(3,949 real changes made)
(6,028 real changes made, 6,028 to missing)
(19,165 missing values generated)
(26,681 missing values generated)
(3,878 real changes made)
(3,638 real changes made)
(3,878 real changes made)
(3,638 real changes made)
(4,693 real changes made)
(26,681 missing values generated)
(3,878 real changes made)
(3,638 real changes made)
(7,516 real changes made)
(21,988 real changes made)
(19,165 missing values generated)
(7,431 real changes made)
(3,878 real changes made)
(5,954 real changes made, 5,954 to missing)
(19,091 missing values generated)
(26,681 missing values generated)
(3,960 real changes made)
(3,630 real changes made)
(3,960 real changes made)
(3,630 real changes made)
(4,902 real changes made)
(26,681 missing values generated)
(3,960 real changes made)
(3,630 real changes made)
(7,590 real changes made)
(21,779 real changes made)
(19,091 missing values generated)
(7,501 real changes made)
(3,960 real changes made)
(5,967 real changes made, 5,967 to missing)
(19,104 missing values generated)
(26,681 missing values generated)
(3,908 real changes made)
(3,669 real changes made)
(3,908 real changes made)
(3,669 real changes made)
(4,778 real changes made)
(26,681 missing values generated)
(3,908 real changes made)
(3,669 real changes made)
(7,577 real changes made)
(21,903 real changes made)
(19,104 missing values generated)
(7,486 real changes made)
(3,908 real changes made)
(5,924 real changes made, 5,924 to missing)
(19,061 missing values generated)
(26,681 missing values generated)
(3,988 real changes made)
(3,632 real changes made)
(3,988 real changes made)
(3,632 real changes made)
(4,832 real changes made)
(26,681 missing values generated)
(3,988 real changes made)
(3,632 real changes made)
(7,620 real changes made)
(21,849 real changes made)
(19,061 missing values generated)
(7,523 real changes made)
(3,988 real changes made)
(5,872 real changes made, 5,872 to missing)
(19,009 missing values generated)
(26,681 missing values generated)
(4,050 real changes made)
(3,622 real changes made)
(4,050 real changes made)
(3,622 real changes made)
(4,939 real changes made)
(26,681 missing values generated)
(4,050 real changes made)
(3,622 real changes made)
(7,672 real changes made)
(21,742 real changes made)
(19,009 missing values generated)
(7,574 real changes made)
(4,050 real changes made)
(5,985 real changes made, 5,985 to missing)
(19,122 missing values generated)
(26,681 missing values generated)
(3,930 real changes made)
(3,629 real changes made)
(3,930 real changes made)
(3,629 real changes made)
(4,809 real changes made)
(26,681 missing values generated)
(3,930 real changes made)
(3,629 real changes made)
(7,559 real changes made)
(21,872 real changes made)
(19,122 missing values generated)
(7,475 real changes made)
(3,930 real changes made)
(5,947 real changes made, 5,947 to missing)
(19,084 missing values generated)
(26,681 missing values generated)
(3,985 real changes made)
(3,612 real changes made)
(3,985 real changes made)
(3,612 real changes made)
(4,820 real changes made)
(26,681 missing values generated)
(3,985 real changes made)
(3,612 real changes made)
(7,597 real changes made)
(21,861 real changes made)
(19,084 missing values generated)
(7,506 real changes made)
(3,985 real changes made)
(5,885 real changes made, 5,885 to missing)
(19,022 missing values generated)
(26,681 missing values generated)
(3,950 real changes made)
(3,709 real changes made)
(3,950 real changes made)
(3,709 real changes made)
(4,856 real changes made)
(26,681 missing values generated)
(3,950 real changes made)
(3,709 real changes made)
(7,659 real changes made)
(21,825 real changes made)
(19,022 missing values generated)
(7,568 real changes made)
(3,950 real changes made)
(5,934 real changes made, 5,934 to missing)
(19,071 missing values generated)
(26,681 missing values generated)
(3,970 real changes made)
(3,640 real changes made)
(3,970 real changes made)
(3,640 real changes made)
(4,873 real changes made)
(26,681 missing values generated)
(3,970 real changes made)
(3,640 real changes made)
(7,610 real changes made)
(21,808 real changes made)
(19,071 missing values generated)
(7,512 real changes made)
(3,970 real changes made)
(5,938 real changes made, 5,938 to missing)
(19,075 missing values generated)
(26,681 missing values generated)
(3,995 real changes made)
(3,611 real changes made)
(3,995 real changes made)
(3,611 real changes made)
(4,913 real changes made)
(26,681 missing values generated)
(3,995 real changes made)
(3,611 real changes made)
(7,606 real changes made)
(21,768 real changes made)
(19,075 missing values generated)
(7,514 real changes made)
(3,995 real changes made)
(6,017 real changes made, 6,017 to missing)
(19,154 missing values generated)
(26,681 missing values generated)
(3,983 real changes made)
(3,544 real changes made)
(3,983 real changes made)
(3,544 real changes made)
(4,791 real changes made)
(26,681 missing values generated)
(3,983 real changes made)
(3,544 real changes made)
(7,527 real changes made)
(21,890 real changes made)
(19,154 missing values generated)
(7,440 real changes made)
(3,983 real changes made)
(6,032 real changes made, 6,032 to missing)
(19,169 missing values generated)
(26,681 missing values generated)
(3,962 real changes made)
(3,550 real changes made)
(3,962 real changes made)
(3,550 real changes made)
(4,765 real changes made)
(26,681 missing values generated)
(3,962 real changes made)
(3,550 real changes made)
(7,512 real changes made)
(21,916 real changes made)
(19,169 missing values generated)
(7,418 real changes made)
(3,962 real changes made)
(5,760 real changes made, 5,760 to missing)
(19,304 missing values generated)
(26,681 missing values generated)
(3,776 real changes made)
(3,601 real changes made)
(3,776 real changes made)
(3,601 real changes made)
(4,716 real changes made)
(26,681 missing values generated)
(3,776 real changes made)
(3,601 real changes made)
(7,377 real changes made)
(21,965 real changes made)
(19,304 missing values generated)
(7,279 real changes made)
(3,776 real changes made)
(5,741 real changes made, 5,741 to missing)
(19,285 missing values generated)
(26,681 missing values generated)
(3,769 real changes made)
(3,627 real changes made)
(3,769 real changes made)
(3,627 real changes made)
(4,688 real changes made)
(26,681 missing values generated)
(3,769 real changes made)
(3,627 real changes made)
(7,396 real changes made)
(21,993 real changes made)
(19,285 missing values generated)
(7,326 real changes made)
(3,769 real changes made)
(5,770 real changes made, 5,770 to missing)
(19,314 missing values generated)
(26,681 missing values generated)
(3,781 real changes made)
(3,586 real changes made)
(3,781 real changes made)
(3,586 real changes made)
(4,634 real changes made)
(26,681 missing values generated)
(3,781 real changes made)
(3,586 real changes made)
(7,367 real changes made)
(22,047 real changes made)
(19,314 missing values generated)
(7,290 real changes made)
(3,781 real changes made)
(5,788 real changes made, 5,788 to missing)
(19,332 missing values generated)
(26,681 missing values generated)
(3,788 real changes made)
(3,561 real changes made)
(3,788 real changes made)
(3,561 real changes made)
(4,700 real changes made)
(26,681 missing values generated)
(3,788 real changes made)
(3,561 real changes made)
(7,349 real changes made)
(21,981 real changes made)
(19,332 missing values generated)
(7,263 real changes made)
(3,788 real changes made)
(5,774 real changes made, 5,774 to missing)
(19,318 missing values generated)
(26,681 missing values generated)
(3,776 real changes made)
(3,587 real changes made)
(3,776 real changes made)
(3,587 real changes made)
(4,701 real changes made)
(26,681 missing values generated)
(3,776 real changes made)
(3,587 real changes made)
(7,363 real changes made)
(21,980 real changes made)
(19,318 missing values generated)
(7,279 real changes made)
(3,776 real changes made)
(5,691 real changes made, 5,691 to missing)
(19,235 missing values generated)
(26,681 missing values generated)
(3,803 real changes made)
(3,643 real changes made)
(3,803 real changes made)
(3,643 real changes made)
(4,658 real changes made)
(26,681 missing values generated)
(3,803 real changes made)
(3,643 real changes made)
(7,446 real changes made)
(22,023 real changes made)
(19,235 missing values generated)
(7,359 real changes made)
(3,803 real changes made)
(5,864 real changes made, 5,864 to missing)
(19,408 missing values generated)
(26,681 missing values generated)
(3,707 real changes made)
(3,566 real changes made)
(3,707 real changes made)
(3,566 real changes made)
(4,575 real changes made)
(26,681 missing values generated)
(3,707 real changes made)
(3,566 real changes made)
(7,273 real changes made)
(22,106 real changes made)
(19,408 missing values generated)
(7,184 real changes made)
(3,707 real changes made)
(5,713 real changes made, 5,713 to missing)
(19,257 missing values generated)
(26,681 missing values generated)
(3,834 real changes made)
(3,590 real changes made)
(3,834 real changes made)
(3,590 real changes made)
(4,751 real changes made)
(26,681 missing values generated)
(3,834 real changes made)
(3,590 real changes made)
(7,424 real changes made)
(21,930 real changes made)
(19,257 missing values generated)
(7,341 real changes made)
(3,834 real changes made)
(5,772 real changes made, 5,772 to missing)
(19,316 missing values generated)
(26,681 missing values generated)
(3,734 real changes made)
(3,631 real changes made)
(3,734 real changes made)
(3,631 real changes made)
(4,588 real changes made)
(26,681 missing values generated)
(3,734 real changes made)
(3,631 real changes made)
(7,365 real changes made)
(22,093 real changes made)
(19,316 missing values generated)
(7,286 real changes made)
(3,734 real changes made)
(5,816 real changes made, 5,816 to missing)
(19,360 missing values generated)
(26,681 missing values generated)
(3,784 real changes made)
(3,537 real changes made)
(3,784 real changes made)
(3,537 real changes made)
(4,571 real changes made)
(26,681 missing values generated)
(3,784 real changes made)
(3,537 real changes made)
(7,321 real changes made)
(22,110 real changes made)
(19,360 missing values generated)
(7,231 real changes made)
(3,784 real changes made)
(5,880 real changes made, 5,880 to missing)
(19,424 missing values generated)
(26,681 missing values generated)
(3,740 real changes made)
(3,517 real changes made)
(3,740 real changes made)
(3,517 real changes made)
(4,552 real changes made)
(26,681 missing values generated)
(3,740 real changes made)
(3,517 real changes made)
(7,257 real changes made)
(22,129 real changes made)
(19,424 missing values generated)
(7,180 real changes made)
(3,740 real changes made)
(5,689 real changes made, 5,689 to missing)
(19,233 missing values generated)
(26,681 missing values generated)
(3,813 real changes made)
(3,635 real changes made)
(3,813 real changes made)
(3,635 real changes made)
(4,740 real changes made)
(26,681 missing values generated)
(3,813 real changes made)
(3,635 real changes made)
(7,448 real changes made)
(21,941 real changes made)
(19,233 missing values generated)
(7,358 real changes made)
(3,813 real changes made)
(5,757 real changes made, 5,757 to missing)
(19,301 missing values generated)
(26,681 missing values generated)
(3,770 real changes made)
(3,610 real changes made)
(3,770 real changes made)
(3,610 real changes made)
(4,690 real changes made)
(26,681 missing values generated)
(3,770 real changes made)
(3,610 real changes made)
(7,380 real changes made)
(21,991 real changes made)
(19,301 missing values generated)
(7,295 real changes made)
(3,770 real changes made)
(5,821 real changes made, 5,821 to missing)
(19,365 missing values generated)
(26,681 missing values generated)
(3,777 real changes made)
(3,539 real changes made)
(3,777 real changes made)
(3,539 real changes made)
(4,576 real changes made)
(26,681 missing values generated)
(3,777 real changes made)
(3,539 real changes made)
(7,316 real changes made)
(22,105 real changes made)
(19,365 missing values generated)
(7,235 real changes made)
(3,777 real changes made)
(5,734 real changes made, 5,734 to missing)
(19,278 missing values generated)
(26,681 missing values generated)
(3,837 real changes made)
(3,566 real changes made)
(3,837 real changes made)
(3,566 real changes made)
(4,595 real changes made)
(26,681 missing values generated)
(3,837 real changes made)
(3,566 real changes made)
(7,403 real changes made)
(22,086 real changes made)
(19,278 missing values generated)
(7,325 real changes made)
(3,837 real changes made)
(5,740 real changes made, 5,740 to missing)
(19,284 missing values generated)
(26,681 missing values generated)
(3,801 real changes made)
(3,596 real changes made)
(3,801 real changes made)
(3,596 real changes made)
(4,656 real changes made)
(26,681 missing values generated)
(3,801 real changes made)
(3,596 real changes made)
(7,397 real changes made)
(22,025 real changes made)
(19,284 missing values generated)
(7,317 real changes made)
(3,801 real changes made)
(5,763 real changes made, 5,763 to missing)
(19,307 missing values generated)
(26,681 missing values generated)
(3,801 real changes made)
(3,573 real changes made)
(3,801 real changes made)
(3,573 real changes made)
(4,670 real changes made)
(26,681 missing values generated)
(3,801 real changes made)
(3,573 real changes made)
(7,374 real changes made)
(22,011 real changes made)
(19,307 missing values generated)
(7,290 real changes made)
(3,801 real changes made)
(5,811 real changes made, 5,811 to missing)
(19,355 missing values generated)
(26,681 missing values generated)
(3,791 real changes made)
(3,535 real changes made)
(3,791 real changes made)
(3,535 real changes made)
(4,663 real changes made)
(26,681 missing values generated)
(3,791 real changes made)
(3,535 real changes made)
(7,326 real changes made)
(22,018 real changes made)
(19,355 missing values generated)
(7,245 real changes made)
(3,791 real changes made)
(5,868 real changes made, 5,868 to missing)
(19,412 missing values generated)
(26,681 missing values generated)
(3,707 real changes made)
(3,562 real changes made)
(3,707 real changes made)
(3,562 real changes made)
(4,606 real changes made)
(26,681 missing values generated)
(3,707 real changes made)
(3,562 real changes made)
(7,269 real changes made)
(22,075 real changes made)
(19,412 missing values generated)
(7,180 real changes made)
(3,707 real changes made)
(5,748 real changes made, 5,748 to missing)
(19,292 missing values generated)
(26,681 missing values generated)
(3,778 real changes made)
(3,611 real changes made)
(3,778 real changes made)
(3,611 real changes made)
(4,693 real changes made)
(26,681 missing values generated)
(3,778 real changes made)
(3,611 real changes made)
(7,389 real changes made)
(21,988 real changes made)
(19,292 missing values generated)
(7,301 real changes made)
(3,778 real changes made)
(5,825 real changes made, 5,825 to missing)
(19,369 missing values generated)
(26,681 missing values generated)
(3,758 real changes made)
(3,554 real changes made)
(3,758 real changes made)
(3,554 real changes made)
(4,710 real changes made)
(26,681 missing values generated)
(3,758 real changes made)
(3,554 real changes made)
(7,312 real changes made)
(21,971 real changes made)
(19,369 missing values generated)
(7,237 real changes made)
(3,758 real changes made)
(5,751 real changes made, 5,751 to missing)
(19,295 missing values generated)
(26,681 missing values generated)
(3,803 real changes made)
(3,583 real changes made)
(3,803 real changes made)
(3,583 real changes made)
(4,709 real changes made)
(26,681 missing values generated)
(3,803 real changes made)
(3,583 real changes made)
(7,386 real changes made)
(21,972 real changes made)
(19,295 missing values generated)
(7,307 real changes made)
(3,803 real changes made)
(5,708 real changes made, 5,708 to missing)
(19,252 missing values generated)
(26,681 missing values generated)
(3,801 real changes made)
(3,628 real changes made)
(3,801 real changes made)
(3,628 real changes made)
(4,690 real changes made)
(26,681 missing values generated)
(3,801 real changes made)
(3,628 real changes made)
(7,429 real changes made)
(21,991 real changes made)
(19,252 missing values generated)
(7,343 real changes made)
(3,801 real changes made)
(5,703 real changes made, 5,703 to missing)
(19,247 missing values generated)
(26,681 missing values generated)
(3,787 real changes made)
(3,647 real changes made)
(3,787 real changes made)
(3,647 real changes made)
(4,625 real changes made)
(26,681 missing values generated)
(3,787 real changes made)
(3,647 real changes made)
(7,434 real changes made)
(22,056 real changes made)
(19,247 missing values generated)
(7,347 real changes made)
(3,787 real changes made)
(5,639 real changes made, 5,639 to missing)
(19,183 missing values generated)
(26,681 missing values generated)
(3,824 real changes made)
(3,674 real changes made)
(3,824 real changes made)
(3,674 real changes made)
(4,796 real changes made)
(26,681 missing values generated)
(3,824 real changes made)
(3,674 real changes made)
(7,498 real changes made)
(21,885 real changes made)
(19,183 missing values generated)
(7,405 real changes made)
(3,824 real changes made)
(5,769 real changes made, 5,769 to missing)
(19,313 missing values generated)
(26,681 missing values generated)
(3,699 real changes made)
(3,669 real changes made)
(3,699 real changes made)
(3,669 real changes made)
(4,696 real changes made)
(26,681 missing values generated)
(3,699 real changes made)
(3,669 real changes made)
(7,368 real changes made)
(21,985 real changes made)
(19,313 missing values generated)
(7,287 real changes made)
(3,699 real changes made)
(5,812 real changes made, 5,812 to missing)
(19,356 missing values generated)
(26,681 missing values generated)
(3,771 real changes made)
(3,554 real changes made)
(3,771 real changes made)
(3,554 real changes made)
(4,647 real changes made)
(26,681 missing values generated)
(3,771 real changes made)
(3,554 real changes made)
(7,325 real changes made)
(22,034 real changes made)
(19,356 missing values generated)
(7,242 real changes made)
(3,771 real changes made)
(5,820 real changes made, 5,820 to missing)
(19,364 missing values generated)
(26,681 missing values generated)
(3,770 real changes made)
(3,547 real changes made)
(3,770 real changes made)
(3,547 real changes made)
(4,657 real changes made)
(26,681 missing values generated)
(3,770 real changes made)
(3,547 real changes made)
(7,317 real changes made)
(22,024 real changes made)
(19,364 missing values generated)
(7,231 real changes made)
(3,770 real changes made)
(5,762 real changes made, 5,762 to missing)
(19,306 missing values generated)
(26,681 missing values generated)
(3,757 real changes made)
(3,618 real changes made)
(3,757 real changes made)
(3,618 real changes made)
(4,649 real changes made)
(26,681 missing values generated)
(3,757 real changes made)
(3,618 real changes made)
(7,375 real changes made)
(22,032 real changes made)
(19,306 missing values generated)
(7,293 real changes made)
(3,757 real changes made)
(5,833 real changes made, 5,833 to missing)
(19,377 missing values generated)
(26,681 missing values generated)
(3,751 real changes made)
(3,553 real changes made)
(3,751 real changes made)
(3,553 real changes made)
(4,660 real changes made)
(26,681 missing values generated)
(3,751 real changes made)
(3,553 real changes made)
(7,304 real changes made)
(22,021 real changes made)
(19,377 missing values generated)
(7,224 real changes made)
(3,751 real changes made)
(5,815 real changes made, 5,815 to missing)
(19,359 missing values generated)
(26,681 missing values generated)
(3,737 real changes made)
(3,585 real changes made)
(3,737 real changes made)
(3,585 real changes made)
(4,709 real changes made)
(26,681 missing values generated)
(3,737 real changes made)
(3,585 real changes made)
(7,322 real changes made)
(21,972 real changes made)
(19,359 missing values generated)
(7,232 real changes made)
(3,737 real changes made)
(5,780 real changes made, 5,780 to missing)
(19,324 missing values generated)
(26,681 missing values generated)
(3,768 real changes made)
(3,589 real changes made)
(3,768 real changes made)
(3,589 real changes made)
(4,713 real changes made)
(26,681 missing values generated)
(3,768 real changes made)
(3,589 real changes made)
(7,357 real changes made)
(21,968 real changes made)
(19,324 missing values generated)
(7,278 real changes made)
(3,768 real changes made)
(5,739 real changes made, 5,739 to missing)
(19,283 missing values generated)
(26,681 missing values generated)
(3,787 real changes made)
(3,611 real changes made)
(3,787 real changes made)
(3,611 real changes made)
(4,668 real changes made)
(26,681 missing values generated)
(3,787 real changes made)
(3,611 real changes made)
(7,398 real changes made)
(22,013 real changes made)
(19,283 missing values generated)
(7,323 real changes made)
(3,787 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)
(929 missing values generated)

. gen baseline_egfr=.
(26,681 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(226 real changes made)
(259 real changes made)
(236 real changes made)
(277 real changes made)
(273 real changes made)
(246 real changes made)
(263 real changes made)
(248 real changes made)
(274 real changes made)
(261 real changes made)
(250 real changes made)
(215 real changes made)
(208 real changes made)
(239 real changes made)
(258 real changes made)
(214 real changes made)
(217 real changes made)
(240 real changes made)
(213 real changes made)
(211 real changes made)
(228 real changes made)
(206 real changes made)
(213 real changes made)
(173 real changes made)
(191 real changes made)
(205 real changes made)
(182 real changes made)
(199 real changes made)
(203 real changes made)
(205 real changes made)
(188 real changes made)
(181 real changes made)
(226 real changes made)
(247 real changes made)
(239 real changes made)
(203 real changes made)
(225 real changes made)
(258 real changes made)
(236 real changes made)
(215 real changes made)
(208 real changes made)
(200 real changes made)
(231 real changes made)
(222 real changes made)
(205 real changes made)
(227 real changes made)
(199 real changes made)
(196 real changes made)
(214 real changes made)
(232 real changes made)
(228 real changes made)
(214 real changes made)
(220 real changes made)
(216 real changes made)
(177 real changes made)
(204 real changes made)
(177 real changes made)
(184 real changes made)
(175 real changes made)
(182 real changes made)
(180 real changes made)
(189 real changes made)
(196 real changes made)
(194 real changes made)
(191 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab covid baseline_esrd

           | baseline_e
           |    srd
     covid |   No ESRD |     Total
-----------+-----------+----------
         1 |    13,137 |    13,137 
-----------+-----------+----------
     Total |    13,137 |    13,137 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. ** Exposure
. gen case = covid
(13,544 missing values generated)

. replace case = 0 if covid==.
(13,544 real changes made)

. label define case 0 "Pneumonia (pre-pandemic)" ///
>                                   1 "COVID-19"

. label values case case

. tab case covid

                      |   covid
                 case |         1 |     Total
----------------------+-----------+----------
             COVID-19 |    13,137 |    13,137 
----------------------+-----------+----------
                Total |    13,137 |    13,137 

. tab case pneumonia

                      | pneumonia
                 case |         1 |     Total
----------------------+-----------+----------
Pneumonia (pre-pandem |    13,544 |    13,544 
----------------------+-----------+----------
                Total |    13,544 |    13,544 

. drop covid

. drop pneumonia

. safetab case 

                    case |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,544       50.76       50.76
                COVID-19 |     13,137       49.24      100.00
-------------------------+-----------------------------------
                   Total |     26,681      100.00

. 
. * Critical care during index admission
. replace critical_care = 1 if critical_days==1
(1,232 real changes made)

. drop critical_days

. label define critical_care      0 "Ward-based"          ///
>                                                         1 "Critical care"

. label values critical_care critical_care

. label var critical_care "Critical care"

. safetab critical_care, m

Critical care |      Freq.     Percent        Cum.
--------------+-----------------------------------
   Ward-based |     24,161       90.56       90.56
Critical care |      2,520        9.44      100.00
--------------+-----------------------------------
        Total |     26,681      100.00

. gen case_critical_care = critical_care

. replace case_critical_care = 2 if case==1
(13,137 real changes made)

. replace case_critical_care = 3 if case==1 &critical_care==1
(1,226 real changes made)

. label define case_critical_care 0 "Ward-based pneumonia (pre-pandemic)"         ///
>                                                                 1 "Critical care pneumonia (pre-pandemic)"      ///
>                                                                 2 "Ward-based COVID-19"                                         ///
>                                                                 3 "Critical care COVID-19"

. label values case_critical_care case_critical_care

. 
. * Acute kidney injury during index admission
. label define acute_kidney_injury        0 "No AKI"      ///
>                                                                         1 "AKI"

. label values acute_kidney_injury acute_kidney_injury

. label var acute_kidney_injury "Acute kidney injury"

. safetab acute_kidney_injury, m

      Acute |
     kidney |
     injury |      Freq.     Percent        Cum.
------------+-----------------------------------
     No AKI |     15,899       59.59       59.59
        AKI |     10,782       40.41      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. gen case_acute_kidney_injury = acute_kidney_injury

. replace case_acute_kidney_injury = 2 if case==1
(13,137 real changes made)

. replace case_acute_kidney_injury = 3 if case==1 &acute_kidney_injury==1
(5,220 real changes made)

. label define case_acute_kidney_injury   0 "No AKI pneumonia (pre-pandemic)"     ///
>                                                                                 1 "AKI pneumonia (pre-pandemic)"        ///
>                                                                                 2 "No AKI COVID-19"                             ///
>                                                                                 3 "AKI COVID-19"

. label values case_acute_kidney_injury case_acute_kidney_injury

. 
. * Kidney replacement therapy during index admission
. gen krt = acute_kidney_injury

. replace krt = 2 if krt_icd_10==1
(280 real changes made)

. drop krt_icd_10

. replace krt = 2 if krt_opcs_4==1
(270 real changes made)

. drop krt_opcs_4

. label define krt        0 "No AKI"                              ///
>                                         1 "AKI without KRT"             ///
>                                         2 "AKI requiring KRT"

. label values krt krt

. label var krt "Kidney replacement therapy"

. safetab krt, m

           Kidney |
      replacement |
          therapy |      Freq.     Percent        Cum.
------------------+-----------------------------------
           No AKI |     15,584       58.41       58.41
  AKI without KRT |     10,547       39.53       97.94
AKI requiring KRT |        550        2.06      100.00
------------------+-----------------------------------
            Total |     26,681      100.00

. gen case_krt = krt

. replace case_krt = 3 if case==1
(13,137 real changes made)

. replace case_krt = 4 if case==1 &krt==1
(5,103 real changes made)

. replace case_krt = 5 if case==1 &krt==2
(279 real changes made)

. label define case_krt   0 "No AKI pneumonia (pre-pandemic)"                     ///
>                                                 1 "AKI without KRT pneumonia (pre-pandemic)"    ///
>                                                 2 "AKI requiring KRT pneumonia (pre-pandemic)"  ///
>                                                 3 "No AKI COVID-19"                                                             ///
>                                                 4 "AKI without KRT COVID-19"                                    ///
>                                                 5 "AKI requiring KRT COVID-19"

. label values case_krt case_krt

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(17,531 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(17,544 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(17,421 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(17,454 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(9,227 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(2,754 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(795 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(256 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Pneumonia (pre-pandemic)"    ///
>                                                 1 "Pre-vaccination"                     ///
>                                                 2 "1 vaccine dose"                      ///
>                                                 3 "2 vaccine doses"                     ///
>                                                 4 "3 vaccine doses"                     ///
>                                                 5 "4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "Vaccination status"

. safetab covid_vax, m

      Vaccination status |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,544       50.76       50.76
         Pre-vaccination |        105        0.39       51.16
          1 vaccine dose |        256        0.96       52.12
         2 vaccine doses |        795        2.98       55.10
         3 vaccine doses |      2,754       10.32       65.42
         4 vaccine doses |      9,227       34.58      100.00
-------------------------+-----------------------------------
                   Total |     26,681      100.00

. 
. * COVID-19 wave
. gen wave = case

. replace wave = 2 if index_month=="sep2020"
(393 real changes made)

. replace wave = 2 if index_month=="oct2020"
(412 real changes made)

. replace wave = 2 if index_month=="nov2020"
(397 real changes made)

. replace wave = 2 if index_month=="dec2020"
(421 real changes made)

. replace wave = 2 if index_month=="jan2021"
(421 real changes made)

. replace wave = 2 if index_month=="feb2021"
(360 real changes made)

. replace wave = 2 if index_month=="mar2021"
(405 real changes made)

. replace wave = 2 if index_month=="apr2021"
(357 real changes made)

. replace wave = 2 if index_month=="may2021"
(348 real changes made)

. replace wave = 2 if index_month=="jun2021"
(378 real changes made)

. replace wave = 3 if index_month=="jul2021"
(388 real changes made)

. replace wave = 3 if index_month=="aug2021"
(383 real changes made)

. replace wave = 3 if index_month=="sep2021"
(410 real changes made)

. replace wave = 3 if index_month=="oct2021"
(399 real changes made)

. replace wave = 3 if index_month=="nov2021"
(368 real changes made)

. replace wave = 4 if index_month=="dec2021"
(337 real changes made)

. replace wave = 4 if index_month=="jan2022"
(367 real changes made)

. replace wave = 4 if index_month=="feb2022"
(330 real changes made)

. replace wave = 4 if index_month=="mar2022"
(328 real changes made)

. replace wave = 4 if index_month=="apr2022"
(310 real changes made)

. replace wave = 4 if index_month=="may2022"
(330 real changes made)

. replace wave = 4 if index_month=="jun2022"
(331 real changes made)

. replace wave = 4 if index_month=="jul2022"
(332 real changes made)

. replace wave = 4 if index_month=="aug2022"
(349 real changes made)

. replace wave = 4 if index_month=="sep2022"
(328 real changes made)

. replace wave = 4 if index_month=="oct2022"
(326 real changes made)

. label define wave       0 "Pneumonia (pre-pandemic)"    ///
>                                         1 "Feb20-Aug20" ///
>                                         2 "Sep20-Jun21" ///
>                                         3 "Jul21-Nov21" ///
>                                         4 "Dec21-Oct22" 

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m

           COVID-19 wave |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
Pneumonia (pre-pandemic) |     13,544       50.76       50.76
             Feb20-Aug20 |      3,629       13.60       64.36
             Sep20-Jun21 |      3,892       14.59       78.95
             Jul21-Nov21 |      1,948        7.30       86.25
             Dec21-Oct22 |      3,668       13.75      100.00
-------------------------+-----------------------------------
                   Total |     26,681      100.00

. 
. * Month
. gen month_string=substr(index_date_string ,3,3)
(929 missing values generated)

. gen month = 1 if month_string=="jan"
(25,144 missing values generated)

. replace month = 2 if month_string=="feb"
(2,251 real changes made)

. replace month = 3 if month_string=="mar"
(2,439 real changes made)

. replace month = 4 if month_string=="apr"
(2,337 real changes made)

. replace month = 5 if month_string=="may"
(2,299 real changes made)

. replace month = 6 if month_string=="jun"
(2,365 real changes made)

. replace month = 7 if month_string=="jul"
(2,429 real changes made)

. replace month = 8 if month_string=="aug"
(2,327 real changes made)

. replace month = 9 if month_string=="sep"
(2,290 real changes made)

. replace month = 10 if month_string=="oct"
(2,298 real changes made)

. replace month = 11 if month_string=="nov"
(1,591 real changes made)

. replace month = 12 if month_string=="dec"
(1,589 real changes made)

. drop month_string

. 
. ** Covariates
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        313        1.17        1.17
          1 |        288        1.08        2.25
          2 |        304        1.14        3.39
          3 |        330        1.24        4.63
          4 |        312        1.17        5.80
          5 |        339        1.27        7.07
          6 |        326        1.22        8.29
          7 |        348        1.30        9.59
          8 |        342        1.28       10.88
          9 |        342        1.28       12.16
         10 |        313        1.17       13.33
         11 |        332        1.24       14.58
         12 |        349        1.31       15.88
         13 |        322        1.21       17.09
         14 |        297        1.11       18.20
         15 |        302        1.13       19.34
         16 |        271        1.02       20.35
         17 |        301        1.13       21.48
         18 |        291        1.09       22.57
         19 |        288        1.08       23.65
         20 |        348        1.30       24.95
         21 |        314        1.18       26.13
         22 |        314        1.18       27.31
         23 |        342        1.28       28.59
         24 |        322        1.21       29.80
         25 |        345        1.29       31.09
         26 |        366        1.37       32.46
         27 |        381        1.43       33.89
         28 |        387        1.45       35.34
         29 |        357        1.34       36.68
         30 |        369        1.38       38.06
         31 |        347        1.30       39.36
         32 |        356        1.33       40.70
         33 |        372        1.39       42.09
         34 |        366        1.37       43.46
         35 |        358        1.34       44.80
         36 |        358        1.34       46.15
         37 |        368        1.38       47.52
         38 |        359        1.35       48.87
         39 |        327        1.23       50.10
         40 |        298        1.12       51.21
         41 |        305        1.14       52.36
         42 |        326        1.22       53.58
         43 |        351        1.32       54.89
         44 |        344        1.29       56.18
         45 |        352        1.32       57.50
         46 |        378        1.42       58.92
         47 |        365        1.37       60.29
         48 |        353        1.32       61.61
         49 |        357        1.34       62.95
         50 |        343        1.29       64.23
         51 |        393        1.47       65.71
         52 |        358        1.34       67.05
         53 |        356        1.33       68.38
         54 |        353        1.32       69.71
         55 |        358        1.34       71.05
         56 |        338        1.27       72.31
         57 |        362        1.36       73.67
         58 |        336        1.26       74.93
         59 |        314        1.18       76.11
         60 |        280        1.05       77.16
         61 |        282        1.06       78.21
         62 |        301        1.13       79.34
         63 |        311        1.17       80.51
         64 |        291        1.09       81.60
         65 |        287        1.08       82.67
         66 |        264        0.99       83.66
         67 |        284        1.06       84.73
         68 |        256        0.96       85.69
         69 |        299        1.12       86.81
         70 |        251        0.94       87.75
         71 |        242        0.91       88.65
         72 |        263        0.99       89.64
         73 |        254        0.95       90.59
         74 |        266        1.00       91.59
         75 |        180        0.67       92.26
         76 |        185        0.69       92.96
         77 |        195        0.73       93.69
         78 |        172        0.64       94.33
         79 |        188        0.70       95.04
         80 |        113        0.42       95.46
         81 |        132        0.49       95.96
         82 |        138        0.52       96.47
         83 |        136        0.51       96.98
         84 |        157        0.59       97.57
         85 |         77        0.29       97.86
         86 |         81        0.30       98.16
         87 |         75        0.28       98.44
         88 |         86        0.32       98.77
         89 |         77        0.29       99.06
         90 |         42        0.16       99.21
         91 |         42        0.16       99.37
         92 |         30        0.11       99.48
         93 |         41        0.15       99.64
         94 |         42        0.16       99.79
         95 |          7        0.03       99.82
         96 |         15        0.06       99.88
         97 |          4        0.01       99.89
         98 |          6        0.02       99.91
         99 |          9        0.03       99.95
        100 |          1        0.00       99.95
        101 |          2        0.01       99.96
        102 |          1        0.00       99.96
        103 |          1        0.00       99.97
        104 |          2        0.01       99.97
        105 |          1        0.00       99.98
        106 |          3        0.01       99.99
        108 |          1        0.00       99.99
        109 |          2        0.01      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. safecount
  26,681

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///                                     
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(26393 differences between age and agegroup)

. 
. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label values agegroup agegroup

. label var agegroup "Age group"

. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     13,798       51.71       51.71
       Male |     12,883       48.29      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. safecount
  26,681

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(1,024 real changes made)

. replace ethnicity=2 if ethnicity==3
(1,040 real changes made)

. replace ethnicity=3 if ethnicity==4
(1,009 real changes made)

. replace ethnicity=4 if ethnicity==6
(1,024 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///                                             
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                                                               

. label values ethnicity ethnicity

. safetab ethnicity, m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     15,923       59.68       59.68
South Asian |      1,040        3.90       63.58
      Black |      1,009        3.78       67.36
      Mixed |      1,024        3.84       71.20
      Other |        999        3.74       74.94
          . |      6,686       25.06      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(6,686 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(6,686 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. safetab ethnicity1, m

 ethnicity1 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     15,923       59.68       59.68
South Asian |      1,040        3.90       63.58
      Black |      1,009        3.78       67.36
      Mixed |      1,024        3.84       71.20
      Other |        999        3.74       74.94
    Unknown |      6,686       25.06      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,677       10.03       10.03
                Urban minor conurbation |      2,584        9.68       19.72
                    Urban city and town |      2,740       10.27       29.99
Urban city and town in a sparse setting |      2,746       10.29       40.28
                  Rural town and fringe |      2,702       10.13       50.41
Rural town and fringe in a sparse setti |      2,677       10.03       60.44
            Rural village and dispersed |      5,282       19.80       80.24
Rural village and dispersed in a sparse |      5,273       19.76      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,681      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(26,681 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(10,747 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(15,934 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                                       rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow  Rural tow  Rural vil  Rural vil |     Total
-----------+----------------------------------------------------------------------------------------+----------
     Rural |         0          0          0          0      2,702      2,677      5,282      5,273 |    15,934 
     Urban |     2,677      2,584      2,740      2,746          0          0          0          0 |    10,747 
-----------+----------------------------------------------------------------------------------------+----------
     Total |     2,677      2,584      2,740      2,746      2,702      2,677      5,282      5,273 |    26,681 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Pneumonia (pre-pandem |     8,045      5,499 |    13,544 
             COVID-19 |     7,889      5,248 |    13,137 
----------------------+----------------------+----------
                Total |    15,934     10,747 |    26,681 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,774 real changes made, 2,774 to missing)

. gen     bmi = .
(26,681 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(1625 changes made to bmi)

. recode  bmi . = 2 if body_mass_index<25
(5838 changes made to bmi)

. recode  bmi . = 3 if body_mass_index<30
(6247 changes made to bmi)

. recode  bmi . = 4 if body_mass_index<35
(5316 changes made to bmi)

. recode  bmi . = 5 if body_mass_index<40
(3224 changes made to bmi)

. recode  bmi . = 6 if body_mass_index<.
(1657 changes made to bmi)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                             

. label values bmi bmi

. safetab bmi, m

                 bmi |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,625        6.09        6.09
  Normal (18.5-24.9) |      5,838       21.88       27.97
Overweight (25-29.9) |      6,247       23.41       51.38
   Obese I (30-34.9) |      5,316       19.92       71.31
  Obese II (35-39.9) |      3,224       12.08       83.39
     Obese III (40+) |      1,657        6.21       89.60
                   . |      2,774       10.40      100.00
---------------------+-----------------------------------
               Total |     26,681      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(15,480 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(1,944 real changes made)

. replace smoking = 0 if smoking_status=="N"
(3,747 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |      3,747       14.04       14.04
Current/former smoker |     13,145       49.27       63.31
                    . |      9,789       36.69      100.00
----------------------+-----------------------------------
                Total |     26,681      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000)
(12,569 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(14112 changes made to egfr_group)

. label define egfr_group 1 "≥105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       ≥105 |      4,787       17.94       17.94
     90-104 |      1,866        6.99       24.94
      75-89 |      1,923        7.21       32.14
      60-74 |      2,173        8.14       40.29
      45-59 |      2,082        7.80       48.09
      30-44 |      1,174        4.40       52.49
      15-29 |        107        0.40       52.89
          . |     12,569       47.11      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 15-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(12,569 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(21894 changes made to ckd_stage)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6 "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |     10,749       40.29       40.29
                      CKD 3A |      2,082        7.80       48.09
                      CKD 3B |      1,174        4.40       52.49
                       CKD 4 |        107        0.40       52.89
No baseline eGFR measurement |     12,569       47.11      100.00
-----------------------------+-----------------------------------
                       Total |     26,681      100.00

. 
. * Comorbidities
. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,359       95.05       95.05
          1 |      1,322        4.95      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,140       97.97       97.97
          1 |        541        2.03      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. safetab diabetes

   diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,389       80.17       80.17
          1 |      5,292       19.83      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,421       99.03       99.03
          1 |        260        0.97      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. safetab heart_failure

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,613       96.00       96.00
          1 |      1,068        4.00      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. safetab hiv

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,115       97.88       97.88
          1 |        566        2.12      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. safetab hypertension

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,316       79.89       79.89
          1 |      5,365       20.11      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. safetab non_haem_cancer

non_haem_ca |
       ncer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,183       98.13       98.13
          1 |        498        1.87      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. safetab myocardial_infarction

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,007       89.98       89.98
          1 |      2,674       10.02      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,127       97.92       97.92
          1 |        554        2.08      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,327       94.93       94.93
          1 |      1,354        5.07      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. safetab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,135       97.95       97.95
          1 |        546        2.05      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,169       98.08       98.08
          1 |        512        1.92      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(1,019 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,437 real changes made)

. replace cardiovascular = 1 if pvd==1
(455 real changes made)

. replace cardiovascular = 1 if stroke==1
(458 real changes made)

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(557 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,308 real changes made)

. replace immunosuppressed = 1 if lupus==1
(476 real changes made)

. safetab cardiovascular

cardiovascu |
        lar |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,990       78.67       78.67
          1 |      5,691       21.33      100.00
------------+-----------------------------------
      Total |     26,681      100.00

. safetab immunosuppressed

immunosuppr |
      essed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,080       90.25       90.25
          1 |      2,601        9.75      100.00
------------+-----------------------------------
      Total |     26,681      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                                 creatinine_mar2017 ///
>                                                                                 creatinine_apr2017 ///
>                                                                                 creatinine_may2017 ///
>                                                                                 creatinine_jun2017 ///
>                                                                                 creatinine_jul2017 ///
>                                                                                 creatinine_aug2017 ///
>                                                                                 creatinine_sep2017 ///
>                                                                                 creatinine_oct2017 ///
>                                                                                 creatinine_nov2017 ///
>                                                                                 creatinine_dec2017 ///
>                                                                                 creatinine_jan2018 ///
>                                                                                 creatinine_feb2018 ///
>                                                                                 creatinine_mar2018 ///
>                                                                                 creatinine_apr2018 ///
>                                                                                 creatinine_may2018 ///
>                                                                                 creatinine_jun2018 ///
>                                                                                 creatinine_jul2018 ///
>                                                                                 creatinine_aug2018 ///
>                                                                                 creatinine_sep2018 ///
>                                                                                 creatinine_oct2018 ///
>                                                                                 creatinine_nov2018 ///
>                                                                                 creatinine_dec2018 ///
>                                                                                 creatinine_jan2019 ///
>                                                                                 creatinine_feb2019 ///
>                                                                                 creatinine_mar2019 ///
>                                                                                 creatinine_apr2019 ///
>                                                                                 creatinine_may2019 ///
>                                                                                 creatinine_jun2019 ///
>                                                                                 creatinine_jul2019 ///
>                                                                                 creatinine_aug2019 ///
>                                                                                 creatinine_sep2019 ///
>                                                                                 creatinine_feb2020 ///
>                                                                                 creatinine_mar2020 ///
>                                                                                 creatinine_apr2020 ///
>                                                                                 creatinine_may2020 ///
>                                                                                 creatinine_jun2020 ///
>                                                                                 creatinine_jul2020 ///
>                                                                                 creatinine_aug2020 ///
>                                                                                 creatinine_sep2020 ///
>                                                                                 creatinine_oct2020 ///
>                                                                                 creatinine_nov2020 ///
>                                                                                 creatinine_dec2020 ///
>                                                                                 creatinine_jan2021 ///
>                                                                                 creatinine_feb2021 ///
>                                                                                 creatinine_mar2021 ///
>                                                                                 creatinine_apr2021 ///
>                                                                                 creatinine_may2021 ///
>                                                                                 creatinine_jun2021 ///
>                                                                                 creatinine_jul2021 ///
>                                                                                 creatinine_aug2021 ///
>                                                                                 creatinine_sep2021 ///
>                                                                                 creatinine_oct2021 ///
>                                                                                 creatinine_nov2021 ///
>                                                                                 creatinine_dec2021 ///
>                                                                                 creatinine_jan2022 ///
>                                                                                 creatinine_feb2022 ///
>                                                                                 creatinine_mar2022 ///
>                                                                                 creatinine_apr2022 ///
>                                                                                 creatinine_may2022 ///
>                                                                                 creatinine_jun2022 ///
>                                                                                 creatinine_jul2022 ///
>                                                                                 creatinine_aug2022 ///
>                                                                                 creatinine_sep2022 ///
>                                                                                 creatinine_oct2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 3000)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex==0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex==1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_monthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(6,008 real changes made, 6,008 to missing)
(19,145 missing values generated)
(26,681 missing values generated)
(3,901 real changes made)
(3,635 real changes made)
(3,901 real changes made)
(3,635 real changes made)
(4,773 real changes made)
(26,681 missing values generated)
(3,901 real changes made)
(3,635 real changes made)
(7,536 real changes made)
(21,908 real changes made)
(19,145 missing values generated)
(7,458 real changes made)
(3,901 real changes made)
(5,945 real changes made, 5,945 to missing)
(19,082 missing values generated)
(26,681 missing values generated)
(4,034 real changes made)
(3,565 real changes made)
(4,034 real changes made)
(3,565 real changes made)
(4,876 real changes made)
(26,681 missing values generated)
(4,034 real changes made)
(3,565 real changes made)
(7,599 real changes made)
(21,805 real changes made)
(19,082 missing values generated)
(7,497 real changes made)
(4,034 real changes made)
(5,981 real changes made, 5,981 to missing)
(19,118 missing values generated)
(26,681 missing values generated)
(3,954 real changes made)
(3,609 real changes made)
(3,954 real changes made)
(3,609 real changes made)
(4,789 real changes made)
(26,681 missing values generated)
(3,954 real changes made)
(3,609 real changes made)
(7,563 real changes made)
(21,892 real changes made)
(19,118 missing values generated)
(7,484 real changes made)
(3,954 real changes made)
(5,963 real changes made, 5,963 to missing)
(19,100 missing values generated)
(26,681 missing values generated)
(3,986 real changes made)
(3,595 real changes made)
(3,986 real changes made)
(3,595 real changes made)
(4,815 real changes made)
(26,681 missing values generated)
(3,986 real changes made)
(3,595 real changes made)
(7,581 real changes made)
(21,866 real changes made)
(19,100 missing values generated)
(7,488 real changes made)
(3,986 real changes made)
(5,953 real changes made, 5,953 to missing)
(19,090 missing values generated)
(26,681 missing values generated)
(3,952 real changes made)
(3,639 real changes made)
(3,952 real changes made)
(3,639 real changes made)
(4,835 real changes made)
(26,681 missing values generated)
(3,952 real changes made)
(3,639 real changes made)
(7,591 real changes made)
(21,846 real changes made)
(19,090 missing values generated)
(7,504 real changes made)
(3,952 real changes made)
(5,803 real changes made, 5,803 to missing)
(18,940 missing values generated)
(26,681 missing values generated)
(4,035 real changes made)
(3,706 real changes made)
(4,035 real changes made)
(3,706 real changes made)
(5,006 real changes made)
(26,681 missing values generated)
(4,035 real changes made)
(3,706 real changes made)
(7,741 real changes made)
(21,675 real changes made)
(18,940 missing values generated)
(7,649 real changes made)
(4,035 real changes made)
(5,877 real changes made, 5,877 to missing)
(19,014 missing values generated)
(26,681 missing values generated)
(4,053 real changes made)
(3,614 real changes made)
(4,053 real changes made)
(3,614 real changes made)
(4,843 real changes made)
(26,681 missing values generated)
(4,053 real changes made)
(3,614 real changes made)
(7,667 real changes made)
(21,838 real changes made)
(19,014 missing values generated)
(7,573 real changes made)
(4,053 real changes made)
(5,967 real changes made, 5,967 to missing)
(19,104 missing values generated)
(26,681 missing values generated)
(3,958 real changes made)
(3,619 real changes made)
(3,958 real changes made)
(3,619 real changes made)
(4,778 real changes made)
(26,681 missing values generated)
(3,958 real changes made)
(3,619 real changes made)
(7,577 real changes made)
(21,903 real changes made)
(19,104 missing values generated)
(7,486 real changes made)
(3,958 real changes made)
(5,922 real changes made, 5,922 to missing)
(19,059 missing values generated)
(26,681 missing values generated)
(4,027 real changes made)
(3,595 real changes made)
(4,027 real changes made)
(3,595 real changes made)
(4,837 real changes made)
(26,681 missing values generated)
(4,027 real changes made)
(3,595 real changes made)
(7,622 real changes made)
(21,844 real changes made)
(19,059 missing values generated)
(7,529 real changes made)
(4,027 real changes made)
(6,020 real changes made, 6,020 to missing)
(19,157 missing values generated)
(26,681 missing values generated)
(3,892 real changes made)
(3,632 real changes made)
(3,892 real changes made)
(3,632 real changes made)
(4,776 real changes made)
(26,681 missing values generated)
(3,892 real changes made)
(3,632 real changes made)
(7,524 real changes made)
(21,905 real changes made)
(19,157 missing values generated)
(7,430 real changes made)
(3,892 real changes made)
(6,084 real changes made, 6,084 to missing)
(19,221 missing values generated)
(26,681 missing values generated)
(3,946 real changes made)
(3,514 real changes made)
(3,946 real changes made)
(3,514 real changes made)
(4,719 real changes made)
(26,681 missing values generated)
(3,946 real changes made)
(3,514 real changes made)
(7,460 real changes made)
(21,962 real changes made)
(19,221 missing values generated)
(7,372 real changes made)
(3,946 real changes made)
(5,995 real changes made, 5,995 to missing)
(19,132 missing values generated)
(26,681 missing values generated)
(3,926 real changes made)
(3,623 real changes made)
(3,926 real changes made)
(3,623 real changes made)
(4,816 real changes made)
(26,681 missing values generated)
(3,926 real changes made)
(3,623 real changes made)
(7,549 real changes made)
(21,865 real changes made)
(19,132 missing values generated)
(7,451 real changes made)
(3,926 real changes made)
(5,880 real changes made, 5,880 to missing)
(19,017 missing values generated)
(26,681 missing values generated)
(3,989 real changes made)
(3,675 real changes made)
(3,989 real changes made)
(3,675 real changes made)
(4,901 real changes made)
(26,681 missing values generated)
(3,989 real changes made)
(3,675 real changes made)
(7,664 real changes made)
(21,780 real changes made)
(19,017 missing values generated)
(7,571 real changes made)
(3,989 real changes made)
(5,940 real changes made, 5,940 to missing)
(19,077 missing values generated)
(26,681 missing values generated)
(3,902 real changes made)
(3,702 real changes made)
(3,902 real changes made)
(3,702 real changes made)
(4,899 real changes made)
(26,681 missing values generated)
(3,902 real changes made)
(3,702 real changes made)
(7,604 real changes made)
(21,782 real changes made)
(19,077 missing values generated)
(7,521 real changes made)
(3,902 real changes made)
(5,893 real changes made, 5,893 to missing)
(19,030 missing values generated)
(26,681 missing values generated)
(3,998 real changes made)
(3,653 real changes made)
(3,998 real changes made)
(3,653 real changes made)
(4,797 real changes made)
(26,681 missing values generated)
(3,998 real changes made)
(3,653 real changes made)
(7,651 real changes made)
(21,884 real changes made)
(19,030 missing values generated)
(7,565 real changes made)
(3,998 real changes made)
(5,979 real changes made, 5,979 to missing)
(19,116 missing values generated)
(26,681 missing values generated)
(3,989 real changes made)
(3,576 real changes made)
(3,989 real changes made)
(3,576 real changes made)
(4,790 real changes made)
(26,681 missing values generated)
(3,989 real changes made)
(3,576 real changes made)
(7,565 real changes made)
(21,891 real changes made)
(19,116 missing values generated)
(7,471 real changes made)
(3,989 real changes made)
(6,024 real changes made, 6,024 to missing)
(19,161 missing values generated)
(26,681 missing values generated)
(3,902 real changes made)
(3,618 real changes made)
(3,902 real changes made)
(3,618 real changes made)
(4,754 real changes made)
(26,681 missing values generated)
(3,902 real changes made)
(3,618 real changes made)
(7,520 real changes made)
(21,927 real changes made)
(19,161 missing values generated)
(7,434 real changes made)
(3,902 real changes made)
(5,937 real changes made, 5,937 to missing)
(19,074 missing values generated)
(26,681 missing values generated)
(3,954 real changes made)
(3,653 real changes made)
(3,954 real changes made)
(3,653 real changes made)
(4,812 real changes made)
(26,681 missing values generated)
(3,954 real changes made)
(3,653 real changes made)
(7,607 real changes made)
(21,869 real changes made)
(19,074 missing values generated)
(7,524 real changes made)
(3,954 real changes made)
(6,042 real changes made, 6,042 to missing)
(19,179 missing values generated)
(26,681 missing values generated)
(3,897 real changes made)
(3,605 real changes made)
(3,897 real changes made)
(3,605 real changes made)
(4,832 real changes made)
(26,681 missing values generated)
(3,897 real changes made)
(3,605 real changes made)
(7,502 real changes made)
(21,849 real changes made)
(19,179 missing values generated)
(7,400 real changes made)
(3,897 real changes made)
(6,003 real changes made, 6,003 to missing)
(19,140 missing values generated)
(26,681 missing values generated)
(3,950 real changes made)
(3,591 real changes made)
(3,950 real changes made)
(3,591 real changes made)
(4,793 real changes made)
(26,681 missing values generated)
(3,950 real changes made)
(3,591 real changes made)
(7,541 real changes made)
(21,888 real changes made)
(19,140 missing values generated)
(7,455 real changes made)
(3,950 real changes made)
(6,003 real changes made, 6,003 to missing)
(19,140 missing values generated)
(26,681 missing values generated)
(3,923 real changes made)
(3,618 real changes made)
(3,923 real changes made)
(3,618 real changes made)
(4,770 real changes made)
(26,681 missing values generated)
(3,923 real changes made)
(3,618 real changes made)
(7,541 real changes made)
(21,911 real changes made)
(19,140 missing values generated)
(7,440 real changes made)
(3,923 real changes made)
(5,931 real changes made, 5,931 to missing)
(19,068 missing values generated)
(26,681 missing values generated)
(3,998 real changes made)
(3,615 real changes made)
(3,998 real changes made)
(3,615 real changes made)
(4,805 real changes made)
(26,681 missing values generated)
(3,998 real changes made)
(3,615 real changes made)
(7,613 real changes made)
(21,876 real changes made)
(19,068 missing values generated)
(7,534 real changes made)
(3,998 real changes made)
(5,991 real changes made, 5,991 to missing)
(19,128 missing values generated)
(26,681 missing values generated)
(3,914 real changes made)
(3,639 real changes made)
(3,914 real changes made)
(3,639 real changes made)
(4,743 real changes made)
(26,681 missing values generated)
(3,914 real changes made)
(3,639 real changes made)
(7,553 real changes made)
(21,938 real changes made)
(19,128 missing values generated)
(7,452 real changes made)
(3,914 real changes made)
(5,832 real changes made, 5,832 to missing)
(18,969 missing values generated)
(26,681 missing values generated)
(4,030 real changes made)
(3,682 real changes made)
(4,030 real changes made)
(3,682 real changes made)
(4,859 real changes made)
(26,681 missing values generated)
(4,030 real changes made)
(3,682 real changes made)
(7,712 real changes made)
(21,822 real changes made)
(18,969 missing values generated)
(7,615 real changes made)
(4,030 real changes made)
(5,931 real changes made, 5,931 to missing)
(19,068 missing values generated)
(26,681 missing values generated)
(3,984 real changes made)
(3,629 real changes made)
(3,984 real changes made)
(3,629 real changes made)
(4,832 real changes made)
(26,681 missing values generated)
(3,984 real changes made)
(3,629 real changes made)
(7,613 real changes made)
(21,849 real changes made)
(19,068 missing values generated)
(7,514 real changes made)
(3,984 real changes made)
(5,937 real changes made, 5,937 to missing)
(19,074 missing values generated)
(26,681 missing values generated)
(3,943 real changes made)
(3,664 real changes made)
(3,943 real changes made)
(3,664 real changes made)
(4,788 real changes made)
(26,681 missing values generated)
(3,943 real changes made)
(3,664 real changes made)
(7,607 real changes made)
(21,893 real changes made)
(19,074 missing values generated)
(7,512 real changes made)
(3,943 real changes made)
(5,927 real changes made, 5,927 to missing)
(19,064 missing values generated)
(26,681 missing values generated)
(3,917 real changes made)
(3,700 real changes made)
(3,917 real changes made)
(3,700 real changes made)
(4,851 real changes made)
(26,681 missing values generated)
(3,917 real changes made)
(3,700 real changes made)
(7,617 real changes made)
(21,830 real changes made)
(19,064 missing values generated)
(7,521 real changes made)
(3,917 real changes made)
(5,917 real changes made, 5,917 to missing)
(19,054 missing values generated)
(26,681 missing values generated)
(3,943 real changes made)
(3,684 real changes made)
(3,943 real changes made)
(3,684 real changes made)
(4,867 real changes made)
(26,681 missing values generated)
(3,943 real changes made)
(3,684 real changes made)
(7,627 real changes made)
(21,814 real changes made)
(19,054 missing values generated)
(7,534 real changes made)
(3,943 real changes made)
(5,936 real changes made, 5,936 to missing)
(19,073 missing values generated)
(26,681 missing values generated)
(3,938 real changes made)
(3,670 real changes made)
(3,938 real changes made)
(3,670 real changes made)
(4,804 real changes made)
(26,681 missing values generated)
(3,938 real changes made)
(3,670 real changes made)
(7,608 real changes made)
(21,877 real changes made)
(19,073 missing values generated)
(7,517 real changes made)
(3,938 real changes made)
(5,958 real changes made, 5,958 to missing)
(19,095 missing values generated)
(26,681 missing values generated)
(3,992 real changes made)
(3,594 real changes made)
(3,992 real changes made)
(3,594 real changes made)
(4,791 real changes made)
(26,681 missing values generated)
(3,992 real changes made)
(3,594 real changes made)
(7,586 real changes made)
(21,890 real changes made)
(19,095 missing values generated)
(7,498 real changes made)
(3,992 real changes made)
(5,874 real changes made, 5,874 to missing)
(19,011 missing values generated)
(26,681 missing values generated)
(3,991 real changes made)
(3,679 real changes made)
(3,991 real changes made)
(3,679 real changes made)
(4,851 real changes made)
(26,681 missing values generated)
(3,991 real changes made)
(3,679 real changes made)
(7,670 real changes made)
(21,830 real changes made)
(19,011 missing values generated)
(7,567 real changes made)
(3,991 real changes made)
(5,930 real changes made, 5,930 to missing)
(19,067 missing values generated)
(26,681 missing values generated)
(3,950 real changes made)
(3,664 real changes made)
(3,950 real changes made)
(3,664 real changes made)
(4,833 real changes made)
(26,681 missing values generated)
(3,950 real changes made)
(3,664 real changes made)
(7,614 real changes made)
(21,848 real changes made)
(19,067 missing values generated)
(7,522 real changes made)
(3,950 real changes made)
(5,787 real changes made, 5,787 to missing)
(19,331 missing values generated)
(26,681 missing values generated)
(3,766 real changes made)
(3,584 real changes made)
(3,766 real changes made)
(3,584 real changes made)
(4,677 real changes made)
(26,681 missing values generated)
(3,766 real changes made)
(3,584 real changes made)
(7,350 real changes made)
(22,004 real changes made)
(19,331 missing values generated)
(7,272 real changes made)
(3,766 real changes made)
(5,762 real changes made, 5,762 to missing)
(19,306 missing values generated)
(26,681 missing values generated)
(3,815 real changes made)
(3,560 real changes made)
(3,815 real changes made)
(3,560 real changes made)
(4,669 real changes made)
(26,681 missing values generated)
(3,815 real changes made)
(3,560 real changes made)
(7,375 real changes made)
(22,012 real changes made)
(19,306 missing values generated)
(7,298 real changes made)
(3,815 real changes made)
(5,919 real changes made, 5,919 to missing)
(19,463 missing values generated)
(26,681 missing values generated)
(3,700 real changes made)
(3,518 real changes made)
(3,700 real changes made)
(3,518 real changes made)
(4,496 real changes made)
(26,681 missing values generated)
(3,700 real changes made)
(3,518 real changes made)
(7,218 real changes made)
(22,185 real changes made)
(19,463 missing values generated)
(7,144 real changes made)
(3,700 real changes made)
(5,850 real changes made, 5,850 to missing)
(19,394 missing values generated)
(26,681 missing values generated)
(3,745 real changes made)
(3,542 real changes made)
(3,745 real changes made)
(3,542 real changes made)
(4,585 real changes made)
(26,681 missing values generated)
(3,745 real changes made)
(3,542 real changes made)
(7,287 real changes made)
(22,096 real changes made)
(19,394 missing values generated)
(7,220 real changes made)
(3,745 real changes made)
(5,751 real changes made, 5,751 to missing)
(19,295 missing values generated)
(26,681 missing values generated)
(3,787 real changes made)
(3,599 real changes made)
(3,787 real changes made)
(3,599 real changes made)
(4,619 real changes made)
(26,681 missing values generated)
(3,787 real changes made)
(3,599 real changes made)
(7,386 real changes made)
(22,062 real changes made)
(19,295 missing values generated)
(7,315 real changes made)
(3,787 real changes made)
(5,687 real changes made, 5,687 to missing)
(19,231 missing values generated)
(26,681 missing values generated)
(3,853 real changes made)
(3,597 real changes made)
(3,853 real changes made)
(3,597 real changes made)
(4,707 real changes made)
(26,681 missing values generated)
(3,853 real changes made)
(3,597 real changes made)
(7,450 real changes made)
(21,974 real changes made)
(19,231 missing values generated)
(7,377 real changes made)
(3,853 real changes made)
(5,867 real changes made, 5,867 to missing)
(19,411 missing values generated)
(26,681 missing values generated)
(3,767 real changes made)
(3,503 real changes made)
(3,767 real changes made)
(3,503 real changes made)
(4,662 real changes made)
(26,681 missing values generated)
(3,767 real changes made)
(3,503 real changes made)
(7,270 real changes made)
(22,019 real changes made)
(19,411 missing values generated)
(7,185 real changes made)
(3,767 real changes made)
(5,783 real changes made, 5,783 to missing)
(19,327 missing values generated)
(26,681 missing values generated)
(3,746 real changes made)
(3,608 real changes made)
(3,746 real changes made)
(3,608 real changes made)
(4,694 real changes made)
(26,681 missing values generated)
(3,746 real changes made)
(3,608 real changes made)
(7,354 real changes made)
(21,987 real changes made)
(19,327 missing values generated)
(7,274 real changes made)
(3,746 real changes made)
(5,796 real changes made, 5,796 to missing)
(19,340 missing values generated)
(26,681 missing values generated)
(3,743 real changes made)
(3,598 real changes made)
(3,743 real changes made)
(3,598 real changes made)
(4,679 real changes made)
(26,681 missing values generated)
(3,743 real changes made)
(3,598 real changes made)
(7,341 real changes made)
(22,002 real changes made)
(19,340 missing values generated)
(7,260 real changes made)
(3,743 real changes made)
(5,740 real changes made, 5,740 to missing)
(19,284 missing values generated)
(26,681 missing values generated)
(3,780 real changes made)
(3,617 real changes made)
(3,780 real changes made)
(3,617 real changes made)
(4,703 real changes made)
(26,681 missing values generated)
(3,780 real changes made)
(3,617 real changes made)
(7,397 real changes made)
(21,978 real changes made)
(19,284 missing values generated)
(7,316 real changes made)
(3,780 real changes made)
(5,826 real changes made, 5,826 to missing)
(19,370 missing values generated)
(26,681 missing values generated)
(3,765 real changes made)
(3,546 real changes made)
(3,765 real changes made)
(3,546 real changes made)
(4,625 real changes made)
(26,681 missing values generated)
(3,765 real changes made)
(3,546 real changes made)
(7,311 real changes made)
(22,056 real changes made)
(19,370 missing values generated)
(7,223 real changes made)
(3,765 real changes made)
(5,714 real changes made, 5,714 to missing)
(19,258 missing values generated)
(26,681 missing values generated)
(3,754 real changes made)
(3,669 real changes made)
(3,754 real changes made)
(3,669 real changes made)
(4,749 real changes made)
(26,681 missing values generated)
(3,754 real changes made)
(3,669 real changes made)
(7,423 real changes made)
(21,932 real changes made)
(19,258 missing values generated)
(7,333 real changes made)
(3,754 real changes made)
(5,774 real changes made, 5,774 to missing)
(19,318 missing values generated)
(26,681 missing values generated)
(3,733 real changes made)
(3,630 real changes made)
(3,733 real changes made)
(3,630 real changes made)
(4,677 real changes made)
(26,681 missing values generated)
(3,733 real changes made)
(3,630 real changes made)
(7,363 real changes made)
(22,004 real changes made)
(19,318 missing values generated)
(7,277 real changes made)
(3,733 real changes made)
(5,748 real changes made, 5,748 to missing)
(19,292 missing values generated)
(26,681 missing values generated)
(3,762 real changes made)
(3,627 real changes made)
(3,762 real changes made)
(3,627 real changes made)
(4,717 real changes made)
(26,681 missing values generated)
(3,762 real changes made)
(3,627 real changes made)
(7,389 real changes made)
(21,964 real changes made)
(19,292 missing values generated)
(7,303 real changes made)
(3,762 real changes made)
(5,819 real changes made, 5,819 to missing)
(19,363 missing values generated)
(26,681 missing values generated)
(3,717 real changes made)
(3,601 real changes made)
(3,717 real changes made)
(3,601 real changes made)
(4,589 real changes made)
(26,681 missing values generated)
(3,717 real changes made)
(3,601 real changes made)
(7,318 real changes made)
(22,092 real changes made)
(19,363 missing values generated)
(7,236 real changes made)
(3,717 real changes made)
(5,740 real changes made, 5,740 to missing)
(19,284 missing values generated)
(26,681 missing values generated)
(3,810 real changes made)
(3,587 real changes made)
(3,810 real changes made)
(3,587 real changes made)
(4,662 real changes made)
(26,681 missing values generated)
(3,810 real changes made)
(3,587 real changes made)
(7,397 real changes made)
(22,019 real changes made)
(19,284 missing values generated)
(7,300 real changes made)
(3,810 real changes made)
(5,749 real changes made, 5,749 to missing)
(19,293 missing values generated)
(26,681 missing values generated)
(3,812 real changes made)
(3,576 real changes made)
(3,812 real changes made)
(3,576 real changes made)
(4,674 real changes made)
(26,681 missing values generated)
(3,812 real changes made)
(3,576 real changes made)
(7,388 real changes made)
(22,007 real changes made)
(19,293 missing values generated)
(7,302 real changes made)
(3,812 real changes made)
(5,785 real changes made, 5,785 to missing)
(19,329 missing values generated)
(26,681 missing values generated)
(3,784 real changes made)
(3,568 real changes made)
(3,784 real changes made)
(3,568 real changes made)
(4,664 real changes made)
(26,681 missing values generated)
(3,784 real changes made)
(3,568 real changes made)
(7,352 real changes made)
(22,017 real changes made)
(19,329 missing values generated)
(7,277 real changes made)
(3,784 real changes made)
(5,760 real changes made, 5,760 to missing)
(19,304 missing values generated)
(26,681 missing values generated)
(3,853 real changes made)
(3,524 real changes made)
(3,853 real changes made)
(3,524 real changes made)
(4,612 real changes made)
(26,681 missing values generated)
(3,853 real changes made)
(3,524 real changes made)
(7,377 real changes made)
(22,069 real changes made)
(19,304 missing values generated)
(7,303 real changes made)
(3,853 real changes made)
(5,827 real changes made, 5,827 to missing)
(19,371 missing values generated)
(26,681 missing values generated)
(3,740 real changes made)
(3,570 real changes made)
(3,740 real changes made)
(3,570 real changes made)
(4,673 real changes made)
(26,681 missing values generated)
(3,740 real changes made)
(3,570 real changes made)
(7,310 real changes made)
(22,008 real changes made)
(19,371 missing values generated)
(7,225 real changes made)
(3,740 real changes made)
(5,754 real changes made, 5,754 to missing)
(19,298 missing values generated)
(26,681 missing values generated)
(3,760 real changes made)
(3,623 real changes made)
(3,760 real changes made)
(3,623 real changes made)
(4,685 real changes made)
(26,681 missing values generated)
(3,760 real changes made)
(3,623 real changes made)
(7,383 real changes made)
(21,996 real changes made)
(19,298 missing values generated)
(7,311 real changes made)
(3,760 real changes made)
(5,781 real changes made, 5,781 to missing)
(19,325 missing values generated)
(26,681 missing values generated)
(3,785 real changes made)
(3,571 real changes made)
(3,785 real changes made)
(3,571 real changes made)
(4,678 real changes made)
(26,681 missing values generated)
(3,785 real changes made)
(3,571 real changes made)
(7,356 real changes made)
(22,003 real changes made)
(19,325 missing values generated)
(7,273 real changes made)
(3,785 real changes made)
(5,790 real changes made, 5,790 to missing)
(19,334 missing values generated)
(26,681 missing values generated)
(3,770 real changes made)
(3,577 real changes made)
(3,770 real changes made)
(3,577 real changes made)
(4,717 real changes made)
(26,681 missing values generated)
(3,770 real changes made)
(3,577 real changes made)
(7,347 real changes made)
(21,964 real changes made)
(19,334 missing values generated)
(7,264 real changes made)
(3,770 real changes made)
(5,736 real changes made, 5,736 to missing)
(19,280 missing values generated)
(26,681 missing values generated)
(3,815 real changes made)
(3,586 real changes made)
(3,815 real changes made)
(3,586 real changes made)
(4,680 real changes made)
(26,681 missing values generated)
(3,815 real changes made)
(3,586 real changes made)
(7,401 real changes made)
(22,001 real changes made)
(19,280 missing values generated)
(7,329 real changes made)
(3,815 real changes made)
(5,765 real changes made, 5,765 to missing)
(19,309 missing values generated)
(26,681 missing values generated)
(3,769 real changes made)
(3,603 real changes made)
(3,769 real changes made)
(3,603 real changes made)
(4,704 real changes made)
(26,681 missing values generated)
(3,769 real changes made)
(3,603 real changes made)
(7,372 real changes made)
(21,977 real changes made)
(19,309 missing values generated)
(7,290 real changes made)
(3,769 real changes made)
(5,729 real changes made, 5,729 to missing)
(19,273 missing values generated)
(26,681 missing values generated)
(3,811 real changes made)
(3,597 real changes made)
(3,811 real changes made)
(3,597 real changes made)
(4,684 real changes made)
(26,681 missing values generated)
(3,811 real changes made)
(3,597 real changes made)
(7,408 real changes made)
(21,997 real changes made)
(19,273 missing values generated)
(7,321 real changes made)
(3,811 real changes made)
(5,844 real changes made, 5,844 to missing)
(19,388 missing values generated)
(26,681 missing values generated)
(3,736 real changes made)
(3,557 real changes made)
(3,736 real changes made)
(3,557 real changes made)
(4,582 real changes made)
(26,681 missing values generated)
(3,736 real changes made)
(3,557 real changes made)
(7,293 real changes made)
(22,099 real changes made)
(19,388 missing values generated)
(7,208 real changes made)
(3,736 real changes made)
(5,842 real changes made, 5,842 to missing)
(19,386 missing values generated)
(26,681 missing values generated)
(3,670 real changes made)
(3,625 real changes made)
(3,670 real changes made)
(3,625 real changes made)
(4,643 real changes made)
(26,681 missing values generated)
(3,670 real changes made)
(3,625 real changes made)
(7,295 real changes made)
(22,038 real changes made)
(19,386 missing values generated)
(7,200 real changes made)
(3,670 real changes made)
(5,764 real changes made, 5,764 to missing)
(19,308 missing values generated)
(26,681 missing values generated)
(3,789 real changes made)
(3,584 real changes made)
(3,789 real changes made)
(3,584 real changes made)
(4,624 real changes made)
(26,681 missing values generated)
(3,789 real changes made)
(3,584 real changes made)
(7,373 real changes made)
(22,057 real changes made)
(19,308 missing values generated)
(7,282 real changes made)
(3,789 real changes made)
(5,843 real changes made, 5,843 to missing)
(19,387 missing values generated)
(26,681 missing values generated)
(3,782 real changes made)
(3,512 real changes made)
(3,782 real changes made)
(3,512 real changes made)
(4,720 real changes made)
(26,681 missing values generated)
(3,782 real changes made)
(3,512 real changes made)
(7,294 real changes made)
(21,961 real changes made)
(19,387 missing values generated)
(7,210 real changes made)
(3,782 real changes made)
(5,842 real changes made, 5,842 to missing)
(19,386 missing values generated)
(26,681 missing values generated)
(3,734 real changes made)
(3,561 real changes made)
(3,734 real changes made)
(3,561 real changes made)
(4,699 real changes made)
(26,681 missing values generated)
(3,734 real changes made)
(3,561 real changes made)
(7,295 real changes made)
(21,982 real changes made)
(19,386 missing values generated)
(7,211 real changes made)
(3,734 real changes made)
(5,794 real changes made, 5,794 to missing)
(19,338 missing values generated)
(26,681 missing values generated)
(3,779 real changes made)
(3,564 real changes made)
(3,779 real changes made)
(3,564 real changes made)
(4,586 real changes made)
(26,681 missing values generated)
(3,779 real changes made)
(3,564 real changes made)
(7,343 real changes made)
(22,095 real changes made)
(19,338 missing values generated)
(7,256 real changes made)
(3,779 real changes made)
(5,736 real changes made, 5,736 to missing)
(19,280 missing values generated)
(26,681 missing values generated)
(3,832 real changes made)
(3,569 real changes made)
(3,832 real changes made)
(3,569 real changes made)
(4,661 real changes made)
(26,681 missing values generated)
(3,832 real changes made)
(3,569 real changes made)
(7,401 real changes made)
(22,020 real changes made)
(19,280 missing values generated)
(7,313 real changes made)
(3,832 real changes made)

. 
. replace index_date = index_date_28
(25,752 real changes made)

. drop index_date_28

. gen egfr15_date=.
(26,681 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatinine_`x'<15 & date("01`x'", "DMY")>=index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen esrd_date = egfr15_date
(26,681 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if esrd_date==.
(2,036 real changes made)

. gen esrd_time = (esrd_date - index_date)
(24,645 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(24,645 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(2034 changes made to esrd_time_cat)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"                      ///
>                                                         3 "1 to 28 days"        ///
>                                                         4 "20 to 90 days"       ///
>                                                         5 "91 to 180 days"      ///
>                                                         6 "181 to 365 days"     ///
>                                                         7 "366 to 730 days"     ///
>                                                         8 "731 to 973 days"     ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 critical_care   ///
>                                                                 krt             {
  2.                                                                 by `exposure',sort: sum esrd_time, de
  3.                                                                 tab esrd_time_cat `exposure', m col chi
  4.                                                                 }

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Pneumonia (pre-pandemic)

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            3              0
10%           30              0       Obs               1,034
25%          114              0       Sum of wgt.       1,034

50%        295.5                      Mean           326.7418
                        Largest       Std. dev.      245.6042
75%          505            941
90%          696            945       Variance        60321.4
95%          783            957       Skewness       .4946808
99%          885            964       Kurtosis       2.240238

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%           19              0       Obs               1,002
25%          105              0       Sum of wgt.       1,002

50%          241                      Mean           299.9561
                        Largest       Std. dev.      236.2232
75%          470            895
90%          658            897       Variance       55801.38
95%          752            908       Skewness       .6299622
99%          859            932       Kurtosis       2.398073


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Pneumonia   COVID-19 |     Total
----------------+----------------------+----------
         0 days |        49         49 |        98 
                |      0.36       0.37 |      0.37 
----------------+----------------------+----------
   1 to 28 days |        54         68 |       122 
                |      0.40       0.52 |      0.46 
----------------+----------------------+----------
  20 to 90 days |       124        108 |       232 
                |      0.92       0.82 |      0.87 
----------------+----------------------+----------
 91 to 180 days |       139        172 |       311 
                |      1.03       1.31 |      1.17 
----------------+----------------------+----------
181 to 365 days |       237        256 |       493 
                |      1.75       1.95 |      1.85 
----------------+----------------------+----------
366 to 730 days |       355        286 |       641 
                |      2.62       2.18 |      2.40 
----------------+----------------------+----------
731 to 973 days |        76         63 |       139 
                |      0.56       0.48 |      0.52 
----------------+----------------------+----------
              . |    12,510     12,135 |    24,645 
                |     92.37      92.37 |     92.37 
----------------+----------------------+----------
          Total |    13,544     13,137 |    26,681 
                |    100.00     100.00 |    100.00 

          Pearson chi2(7) =  15.0882   Pr = 0.035

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> critical_care = Ward-based

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            4              0
10%           24              0       Obs               1,848
25%          107              0       Sum of wgt.       1,848

50%          267                      Mean           312.2706
                        Largest       Std. dev.      240.8281
75%          488            932
90%          677            941       Variance       57998.19
95%          761            945       Skewness       .5634466
99%          877            964       Kurtosis       2.300712

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> critical_care = Critical care

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           18              0       Obs                 188
25%        118.5              0       Sum of wgt.         188

50%          305                      Mean           326.2287
                        Largest       Std. dev.      246.6718
75%        484.5            878
90%          713            897       Variance       60846.98
95%          785            906       Skewness        .539074
99%          906            957       Kurtosis       2.400983


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |     Critical care
  esrd_time_cat | Ward-base  Critical  |     Total
----------------+----------------------+----------
         0 days |        86         12 |        98 
                |      0.36       0.48 |      0.37 
----------------+----------------------+----------
   1 to 28 days |       114          8 |       122 
                |      0.47       0.32 |      0.46 
----------------+----------------------+----------
  20 to 90 days |       211         21 |       232 
                |      0.87       0.83 |      0.87 
----------------+----------------------+----------
 91 to 180 days |       289         22 |       311 
                |      1.20       0.87 |      1.17 
----------------+----------------------+----------
181 to 365 days |       440         53 |       493 
                |      1.82       2.10 |      1.85 
----------------+----------------------+----------
366 to 730 days |       585         56 |       641 
                |      2.42       2.22 |      2.40 
----------------+----------------------+----------
731 to 973 days |       123         16 |       139 
                |      0.51       0.63 |      0.52 
----------------+----------------------+----------
              . |    22,313      2,332 |    24,645 
                |     92.35      92.54 |     92.37 
----------------+----------------------+----------
          Total |    24,161      2,520 |    26,681 
                |    100.00     100.00 |    100.00 

          Pearson chi2(7) =   6.2349   Pr = 0.513

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = No AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           20              0       Obs               1,194
25%          103              0       Sum of wgt.       1,194

50%          262                      Mean           309.6893
                        Largest       Std. dev.      241.6838
75%          485            908
90%          680            932       Variance       58411.06
95%          755            941       Skewness       .5793673
99%          885            964       Kurtosis       2.330348

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = AKI without KRT

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            7              0
10%           28              0       Obs                 795
25%          113              0       Sum of wgt.         795

50%          286                      Mean           320.1245
                        Largest       Std. dev.      242.0768
75%          491            893
90%          679            894       Variance       58601.19
95%          784            945       Skewness       .5418121
99%          864            957       Kurtosis       2.286797

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> krt = AKI requiring KRT

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           11              0       Obs                  47
25%          114              5       Sum of wgt.          47

50%          268                      Mean           300.8298
                        Largest       Std. dev.      221.6922
75%          469            649
90%          629            701       Variance       49147.45
95%          701            729       Skewness       .3755201
99%          786            786       Kurtosis       2.100097


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |    Kidney replacement therapy
  esrd_time_cat |    No AKI  AKI witho  AKI requi |     Total
----------------+---------------------------------+----------
         0 days |        64         31          3 |        98 
                |      0.41       0.29       0.55 |      0.37 
----------------+---------------------------------+----------
   1 to 28 days |        69         51          2 |       122 
                |      0.44       0.48       0.36 |      0.46 
----------------+---------------------------------+----------
  20 to 90 days |       141         85          6 |       232 
                |      0.90       0.81       1.09 |      0.87 
----------------+---------------------------------+----------
 91 to 180 days |       179        126          6 |       311 
                |      1.15       1.19       1.09 |      1.17 
----------------+---------------------------------+----------
181 to 365 days |       296        187         10 |       493 
                |      1.90       1.77       1.82 |      1.85 
----------------+---------------------------------+----------
366 to 730 days |       368        254         19 |       641 
                |      2.36       2.41       3.45 |      2.40 
----------------+---------------------------------+----------
731 to 973 days |        77         61          1 |       139 
                |      0.49       0.58       0.18 |      0.52 
----------------+---------------------------------+----------
              . |    14,390      9,752        503 |    24,645 
                |     92.34      92.46      91.45 |     92.37 
----------------+---------------------------------+----------
          Total |    15,584     10,547        550 |    26,681 
                |    100.00     100.00     100.00 |    100.00 

         Pearson chi2(14) =   9.6706   Pr = 0.786

.         
. * Exit date
. gen exit_date = esrd_date
(24,645 missing values generated)

. format exit_date %td

. gen end_date = date("2022-11-30", "YMD") if case==1
(13,544 missing values generated)

. replace end_date = date("2019-11-30", "YMD") if case==0
(13,544 real changes made)

. format end_date %td

. replace exit_date = min(deregistered_date, death_date, end_date) if esrd_date==.
(24,645 real changes made)

. gen follow_up_time = (exit_date - index_date)
(929 missing values generated)

. label var follow_up_time "Follow-up time (Days)"

. gen follow_up_cat = follow_up_time
(929 missing values generated)

. recode follow_up_cat    min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0/365=3         ///
>                                                 366/730=4       ///
>                                                 731/973=5       ///                                     
>                                                 974/max=6
(25723 changes made to follow_up_cat)

. label define follow_up_cat      1 "<-29 days"           ///
>                                                         2 "-28 to -1 days"      ///
>                                                         3 "0 to 365 days"       ///
>                                                         4 "366 to 730 days" ///
>                                                         5 "731 to 973 days"     ///
>                                                         6 ">973 days"

. label values follow_up_cat follow_up_cat

. label var follow_up_cat "Follow_up time"

. tab case follow_up_cat

                      |                     Follow_up time
                 case | -28 to -1  0 to 365   366 to 73  731 to 97  >973 days |     Total
----------------------+-------------------------------------------------------+----------
Pneumonia (pre-pandem |        51      5,339      4,711      2,809        317 |    13,227 
             COVID-19 |        44      5,082      4,477      2,607        315 |    12,525 
----------------------+-------------------------------------------------------+----------
                Total |        95     10,421      9,188      5,416        632 |    25,752 

. drop if follow_up_time<0
(95 observations deleted)

. drop if follow_up_time>972
(1,579 observations deleted)

. tab case follow_up_cat

                      |          Follow_up time
                 case | 0 to 365   366 to 73  731 to 97 |     Total
----------------------+---------------------------------+----------
Pneumonia (pre-pandem |     5,339      4,711      2,799 |    12,849 
             COVID-19 |     5,082      4,477      2,599 |    12,158 
----------------------+---------------------------------+----------
                Total |    10,421      9,188      5,398 |    25,007 

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(25,007 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_half_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>=index_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(9 real changes made)
(15 real changes made)
(30 real changes made)
(45 real changes made)
(48 real changes made)
(59 real changes made)
(70 real changes made)
(81 real changes made)
(92 real changes made)
(82 real changes made)
(96 real changes made)
(98 real changes made)
(98 real changes made)
(111 real changes made)
(93 real changes made)
(75 real changes made)
(103 real changes made)
(88 real changes made)
(109 real changes made)
(103 real changes made)
(89 real changes made)
(100 real changes made)
(119 real changes made)
(92 real changes made)
(99 real changes made)
(103 real changes made)
(112 real changes made)
(125 real changes made)
(129 real changes made)
(105 real changes made)
(0 real changes made)
(0 real changes made)
(5 real changes made)
(22 real changes made)
(27 real changes made)
(33 real changes made)
(55 real changes made)
(50 real changes made)
(64 real changes made)
(63 real changes made)
(62 real changes made)
(70 real changes made)
(68 real changes made)
(81 real changes made)
(100 real changes made)
(86 real changes made)
(88 real changes made)
(93 real changes made)
(98 real changes made)
(69 real changes made)
(104 real changes made)
(96 real changes made)
(99 real changes made)
(108 real changes made)
(87 real changes made)
(109 real changes made)
(89 real changes made)
(113 real changes made)
(92 real changes made)
(95 real changes made)
(94 real changes made)
(102 real changes made)
(115 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(1,579 real changes made)

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(11,315 real changes made, 11,315 to missing)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(18,413 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date) if egfr_half_date==. & index_date_egfr_half!=.
(8,048 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(11,315 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days)"

. 
. * AKI (or ESRD)
. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(22,511 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(1,835 real changes made)

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(20,676 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date)  if aki_date==.
(20,676 real changes made)

. gen follow_up_time_aki = (exit_date_aki - index_date)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. 
. * Exit date (death)
. gen exit_date_death = death_date
(23,898 missing values generated)

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(23,898 real changes made)

. gen follow_up_time_death = (exit_date_death - index_date)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. 
. save ./output/analysis_hospitalised.dta, replace
file ./output/analysis_hospitalised.dta saved

. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_hospitalised.log
  log type:  text
 closed on:  28 Dec 2022, 13:23:17
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
