-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/analysis_2017.log
  log type:  text
 opened on:   5 Apr 2023, 11:33:22

. 
. ** Analysis cohort selection
. capture noisily import delimited ./output/input_covid_matching.csv, clear
(53 vars, 50,000 obs)

. di "Potential COVID-19 cases extracted from OpenSAFELY:"
Potential COVID-19 cases extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/input_2017_matching.csv, clear
(16 vars, 50,000 obs)

. di "Potential historical comparators extracted from OpenSAFELY:"
Potential historical comparators extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/covid_matching_2017.csv, clear
(10 vars, 14,759 obs)

. di "Potential COVID-19 cases after application of exclusion criteria:"
Potential COVID-19 cases after application of exclusion criteria:

. safecount
  14,759

. capture noisily import delimited ./output/2017_matching.csv, clear
(7 vars, 29,013 obs)

. di "Potential historical comparators after application of exclusion criteria:
> "
Potential historical comparators after application of exclusion criteria:

. safecount
  29,013

. * Import COVID-19 dataset comprising individuals matched with historical comp
> arators (limited matching variables only)  
. capture noisily import delimited ./output/input_combined_stps_covid_2017.csv,
>  clear
(13 vars, 13,128 obs)

. * Drop age & covid_diagnosis_date
. keep patient_id death_date date_deregistered stp krt_outcome_date male covid_
> date covid_month set_id case match_counts

. tempfile covid_2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `covid_2017_matched', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. * Number of matched COVID-19 cases
. count
  13,128

. * Import matched historical comparators (limited matching variables only)
. capture noisily import delimited ./output/input_combined_stps_matches_2017.cs
> v, clear
(10 vars, 21,807 obs)

. * Drop age
. keep patient_id death_date date_deregistered stp krt_outcome_date male set_id
>  case covid_date

. tempfile 2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `2017_matched', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. * Number of matched historical comparators
. count
  21,807

. * Merge limited COVID-19 dataset with additional variables
. capture noisily import delimited ./output/input_covid_2017_additional.csv, cl
> ear
(107 vars, 13,128 obs)

. merge 1:1 patient_id using `covid_2017_matched'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            13,128  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile covid_2017_complete

. save `covid_2017_complete', replace
(note: file /tmp/St00015.000003 not found)
file /tmp/St00015.000003 saved

. di "Matched COVID-19 cases:"
Matched COVID-19 cases:

. safecount
  13,128

. * Merge limited historical comparator dataset with additional variables
. capture noisily import delimited ./output/input_2017_additional.csv, clear
(96 vars, 21,807 obs)

. merge 1:1 patient_id using `2017_matched'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            21,807  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile 2017_complete

. save `2017_complete', replace
(note: file /tmp/St00015.000004 not found)
file /tmp/St00015.000004 saved

. di "Matched historical comparators:"
Matched historical comparators:

. safecount
  21,807

. * Append matched COVID-19 cases and historical comparators
. append using `covid_2017_complete', force

. order patient_id set_id match_count case

. gsort set_id -case

. count if case==0
  21,807

. di "Matched COVID-19 cases and historical comparators:"
Matched COVID-19 cases and historical comparators:

. safecount
  34,935

. tab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,807       62.42       62.42
          1 |     13,128       37.58      100.00
------------+-----------------------------------
      Total |     34,935      100.00

. * Save list of matched COVID-19 cases
. preserve

.         keep if case==1
(21,807 observations deleted)

.         keep patient_id

.         tempfile covid_2017_matched_list

.         save `covid_2017_matched_list', replace
(note: file /tmp/St00015.000006 not found)
file /tmp/St00015.000006 saved

. restore

. * Generate list of unmatched COVID-19 cases
. preserve

.         capture noisily import delimited ./output/input_covid_matching.csv, c
> lear
(53 vars, 50,000 obs)

.         * For dummy data, should do nothing in the real data
.         duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

.         tempfile covid_prematching

.         save `covid_prematching', replace
(note: file /tmp/St00015.000008 not found)
file /tmp/St00015.000008 saved

.         use `covid_2017_matched_list', clear

.         merge 1:1 patient_id using `covid_prematching'

    Result                           # of obs.
    -----------------------------------------
    not matched                        36,872
        from master                         0  (_merge==1)
        from using                     36,872  (_merge==2)

    matched                            13,128  (_merge==3)
    -----------------------------------------

.         keep if _merge==2
(13,128 observations deleted)

.         safecount
  36,872

.         save output/covid_unmatched_2017.dta, replace
(note: file output/covid_unmatched_2017.dta not found)
file output/covid_unmatched_2017.dta saved

.         di "Unmatched COVID-19 cases:"
Unmatched COVID-19 cases:

.         safecount
  36,872

. restore

. 
. **ID
. * Need to create unique identifiers as individuals may be in both covid_2017_
> matched and 2017_matched so will have the same patient_id
. gen unique = _n

. label var unique "Unique ID"

. 
. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label var imd "Index of multiple deprivation (IMD)"

. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      1,804        5.16        5.16
 1 Most deprived |      6,602       18.90       24.06
               2 |      6,692       19.16       43.22
               3 |      6,584       18.85       62.06
               4 |      6,666       19.08       81.14
5 Least deprived |      6,587       18.86      100.00
-----------------+-----------------------------------
           Total |     34,935      100.00

. drop if imd==0
(1,804 observations deleted)

. safetab imd
0

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |      6,602       19.93       19.93
               2 |      6,692       20.20       40.13
               3 |      6,584       19.87       60.00
               4 |      6,666       20.12       80.12
5 Least deprived |      6,587       19.88      100.00
-----------------+-----------------------------------
           Total |     33,131      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(33,100 missing values generated)

. replace stp1 = sum(stp1)
(33,130 real changes made)

. drop stp

. rename stp1 stp

. label define stp        1 "1"   ///
>                                         2 "2"   ///
>                                         3 "3"   ///
>                                         4 "4"   ///
>                                         5 "5"   ///
>                                         6 "6"   ///
>                                         7 "7"   ///
>                                         8 "8"   ///
>                                         9 "9"   ///
>                                         10 "10" ///
>                                         11 "11" ///                          
>            
>                                         12 "12" ///
>                                         13 "13" ///
>                                         14 "14" ///
>                                         15 "15" ///
>                                         16 "16" ///
>                                         17 "17" ///
>                                         18 "18" ///
>                                         19 "19" ///
>                                         20 "20" ///
>                                         21 "21" ///                          
>            
>                                         22 "22" ///
>                                         23 "23" ///
>                                         24 "24" ///
>                                         25 "25" ///
>                                         26 "26" ///
>                                         27 "27" ///
>                                         28 "28" ///
>                                         29 "29" ///
>                                         30 "30" ///
>                                         31 "31" 

. label values stp stp

. label var stp "STP"

. safetab stp
0

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,150        3.47        3.47
          2 |      1,072        3.24        6.71
          3 |      1,055        3.18        9.89
          4 |      1,085        3.27       13.17
          5 |      1,080        3.26       16.43
          6 |      1,055        3.18       19.61
          7 |      1,067        3.22       22.83
          8 |      1,052        3.18       26.01
          9 |      1,034        3.12       29.13
         10 |      1,106        3.34       32.47
         11 |      1,043        3.15       35.61
         12 |      1,076        3.25       38.86
         13 |      1,046        3.16       42.02
         14 |      1,073        3.24       45.26
         15 |      1,058        3.19       48.45
         16 |      1,035        3.12       51.57
         17 |      1,117        3.37       54.95
         18 |      1,100        3.32       58.27
         19 |      1,085        3.27       61.54
         20 |      1,063        3.21       64.75
         21 |      1,047        3.16       67.91
         22 |      1,081        3.26       71.17
         23 |      1,049        3.17       74.34
         24 |      1,065        3.21       77.55
         25 |      1,054        3.18       80.73
         26 |      1,086        3.28       84.01
         27 |      1,048        3.16       87.18
         28 |      1,054        3.18       90.36
         29 |      1,047        3.16       93.52
         30 |      1,067        3.22       96.74
         31 |      1,081        3.26      100.00
------------+-----------------------------------
      Total |     33,131      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(29,795 missing values generated)

. replace region = 2 if region_string=="East"
(3,267 real changes made)

. replace region = 3 if region_string=="London"
(6,649 real changes made)

. replace region = 4 if region_string=="North East"
(3,266 real changes made)

. replace region = 5 if region_string=="North West"
(3,263 real changes made)

. replace region = 6 if region_string=="South East"
(3,383 real changes made)

. replace region = 7 if region_string=="South West"
(3,303 real changes made)

. replace region = 8 if region_string=="West Midlands"
(3,397 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(3,267 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,336       10.07       10.07
                    East |      3,267        9.86       19.93
                  London |      6,649       20.07       40.00
              North East |      3,266        9.86       49.86
              North West |      3,263        9.85       59.71
              South East |      3,383       10.21       69.92
              South West |      3,303        9.97       79.89
           West Midlands |      3,397       10.25       90.14
Yorkshire and The Humber |      3,267        9.86      100.00
-------------------------+-----------------------------------
                   Total |     33,131      100.00

. drop if region==10
(0 observations deleted)

. safetab region
0

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,336       10.07       10.07
                    East |      3,267        9.86       19.93
                  London |      6,649       20.07       40.00
              North East |      3,266        9.86       49.86
              North West |      3,263        9.85       59.71
              South East |      3,383       10.21       69.92
              South West |      3,303        9.97       79.89
           West Midlands |      3,397       10.25       90.14
Yorkshire and The Humber |      3,267        9.86      100.00
-------------------------+-----------------------------------
                   Total |     33,131      100.00

. 
. * Create new index date variable 28 days after case_index_date (i.e. to exclu
> de anyone who does not survive to start follow-up)
. gen index_date = date(case_index_date, "YMD")

. format index_date %td

. gen index_date_28 = index_date + 28

. format index_date_28 %td

. 
. * Deregistered before index_date + 29 days
. gen deregistered_date = date(date_deregistered, "YMD")
(32,137 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date_28 + 1
(46 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(30,017 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(0 observations deleted)

. replace krt_date = index_date_28 + 1 if krt_date < index_date_28 + 1
(139 real changes made)

. 
. * Death before index_date + 29 days (i.e. only include people who survived 29
>  days after index_date)
. gen death_date1 = date(death_date, "YMD")
(31,154 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28 + 1
(79 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased withi
> n 28 days of index date"

. label values deceased deceased

. tab case deceased

           |       deceased
      case | Alive at   Deceased  |     Total
-----------+----------------------+----------
         0 |    20,596         59 |    20,655 
         1 |    12,410         20 |    12,430 
-----------+----------------------+----------
     Total |    33,006         79 |    33,085 

. drop if deceased==1
(79 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators
>  only
. gen index_year = yofd(index_date)

. gen age = index_year - year_of_birth

. gen sex = 1 if male == "Male"
(16,677 missing values generated)

. label var sex "Sex"

. replace sex = 0 if male == "Female"
(16,677 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 /
> //
>                                                                              
>                    baseline_creatinine_mar2017 ///
>                                                                              
>                    baseline_creatinine_apr2017 ///
>                                                                              
>                    baseline_creatinine_may2017 ///
>                                                                              
>                    baseline_creatinine_jun2017 ///
>                                                                              
>                    baseline_creatinine_jul2017 ///
>                                                                              
>                    baseline_creatinine_aug2017 ///
>                                                                              
>                    baseline_creatinine_sep2017 ///
>                                                                              
>                    baseline_creatinine_oct2017 ///
>                                                                              
>                    baseline_creatinine_nov2017 ///
>                                                                              
>                    baseline_creatinine_dec2017 ///
>                                                                              
>                    baseline_creatinine_jan2018 ///
>                                                                              
>                    baseline_creatinine_feb2018 ///
>                                                                              
>                    baseline_creatinine_mar2018 ///
>                                                                              
>                    baseline_creatinine_apr2018 ///
>                                                                              
>                    baseline_creatinine_may2018 ///
>                                                                              
>                    baseline_creatinine_jun2018 ///
>                                                                              
>                    baseline_creatinine_jul2018 ///
>                                                                              
>                    baseline_creatinine_aug2018 ///
>                                                                              
>                    baseline_creatinine_sep2018 ///
>                                                                              
>                    baseline_creatinine_oct2018 ///
>                                                                              
>                    baseline_creatinine_nov2018 ///
>                                                                              
>                    baseline_creatinine_dec2018 ///
>                                                                              
>                    baseline_creatinine_jan2019 ///
>                                                                              
>                    baseline_creatinine_feb2019 ///
>                                                                              
>                    baseline_creatinine_mar2019 ///
>                                                                              
>                    baseline_creatinine_apr2019 ///
>                                                                              
>                    baseline_creatinine_may2019 ///
>                                                                              
>                    baseline_creatinine_jun2019 ///
>                                                                              
>                    baseline_creatinine_jul2019 ///
>                                                                              
>                    baseline_creatinine_aug2019 ///
>                                                                              
>                    baseline_creatinine_sep2019 ///
>                                                                              
>                    baseline_creatinine_feb2020 ///
>                                                                              
>                    baseline_creatinine_mar2020 ///
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 ///
>                                                                              
>                    baseline_creatinine_oct2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(9,052 real changes made, 9,052 to missing)
(21,462 missing values generated)
(33,006 missing values generated)
(5,874 real changes made)
(5,670 real changes made)
(5,874 real changes made)
(5,670 real changes made)
(7,344 real changes made)
(33,006 missing values generated)
(5,874 real changes made)
(5,670 real changes made)
(11,544 real changes made)
(25,662 real changes made)
(21,462 missing values generated)
(11,544 real changes made)
(5,874 real changes made)
(9,036 real changes made, 9,036 to missing)
(21,446 missing values generated)
(33,006 missing values generated)
(5,814 real changes made)
(5,746 real changes made)
(5,814 real changes made)
(5,746 real changes made)
(7,363 real changes made)
(33,006 missing values generated)
(5,814 real changes made)
(5,746 real changes made)
(11,560 real changes made)
(25,643 real changes made)
(21,446 missing values generated)
(11,560 real changes made)
(5,814 real changes made)
(9,060 real changes made, 9,060 to missing)
(21,470 missing values generated)
(33,006 missing values generated)
(5,921 real changes made)
(5,615 real changes made)
(5,921 real changes made)
(5,615 real changes made)
(7,406 real changes made)
(33,006 missing values generated)
(5,921 real changes made)
(5,615 real changes made)
(11,536 real changes made)
(25,600 real changes made)
(21,470 missing values generated)
(11,536 real changes made)
(5,921 real changes made)
(9,052 real changes made, 9,052 to missing)
(21,462 missing values generated)
(33,006 missing values generated)
(5,890 real changes made)
(5,654 real changes made)
(5,890 real changes made)
(5,654 real changes made)
(7,327 real changes made)
(33,006 missing values generated)
(5,890 real changes made)
(5,654 real changes made)
(11,544 real changes made)
(25,679 real changes made)
(21,462 missing values generated)
(11,544 real changes made)
(5,890 real changes made)
(9,057 real changes made, 9,057 to missing)
(21,467 missing values generated)
(33,006 missing values generated)
(5,873 real changes made)
(5,666 real changes made)
(5,873 real changes made)
(5,666 real changes made)
(7,259 real changes made)
(33,006 missing values generated)
(5,873 real changes made)
(5,666 real changes made)
(11,539 real changes made)
(25,747 real changes made)
(21,467 missing values generated)
(11,539 real changes made)
(5,873 real changes made)
(9,060 real changes made, 9,060 to missing)
(21,470 missing values generated)
(33,006 missing values generated)
(5,897 real changes made)
(5,639 real changes made)
(5,897 real changes made)
(5,639 real changes made)
(7,304 real changes made)
(33,006 missing values generated)
(5,897 real changes made)
(5,639 real changes made)
(11,536 real changes made)
(25,702 real changes made)
(21,470 missing values generated)
(11,536 real changes made)
(5,897 real changes made)
(9,050 real changes made, 9,050 to missing)
(21,460 missing values generated)
(33,006 missing values generated)
(5,827 real changes made)
(5,719 real changes made)
(5,827 real changes made)
(5,719 real changes made)
(7,264 real changes made)
(33,006 missing values generated)
(5,827 real changes made)
(5,719 real changes made)
(11,546 real changes made)
(25,742 real changes made)
(21,460 missing values generated)
(11,546 real changes made)
(5,827 real changes made)
(9,077 real changes made, 9,077 to missing)
(21,487 missing values generated)
(33,006 missing values generated)
(5,889 real changes made)
(5,630 real changes made)
(5,889 real changes made)
(5,630 real changes made)
(7,401 real changes made)
(33,006 missing values generated)
(5,889 real changes made)
(5,630 real changes made)
(11,519 real changes made)
(25,605 real changes made)
(21,487 missing values generated)
(11,519 real changes made)
(5,889 real changes made)
(9,054 real changes made, 9,054 to missing)
(21,464 missing values generated)
(33,006 missing values generated)
(5,846 real changes made)
(5,696 real changes made)
(5,846 real changes made)
(5,696 real changes made)
(7,351 real changes made)
(33,006 missing values generated)
(5,846 real changes made)
(5,696 real changes made)
(11,542 real changes made)
(25,655 real changes made)
(21,464 missing values generated)
(11,542 real changes made)
(5,846 real changes made)
(9,013 real changes made, 9,013 to missing)
(21,423 missing values generated)
(33,006 missing values generated)
(5,840 real changes made)
(5,743 real changes made)
(5,840 real changes made)
(5,743 real changes made)
(7,348 real changes made)
(33,006 missing values generated)
(5,840 real changes made)
(5,743 real changes made)
(11,583 real changes made)
(25,658 real changes made)
(21,423 missing values generated)
(11,583 real changes made)
(5,840 real changes made)
(9,033 real changes made, 9,033 to missing)
(21,443 missing values generated)
(33,006 missing values generated)
(5,893 real changes made)
(5,670 real changes made)
(5,893 real changes made)
(5,670 real changes made)
(7,364 real changes made)
(33,006 missing values generated)
(5,893 real changes made)
(5,670 real changes made)
(11,563 real changes made)
(25,642 real changes made)
(21,443 missing values generated)
(11,563 real changes made)
(5,893 real changes made)
(9,095 real changes made, 9,095 to missing)
(21,505 missing values generated)
(33,006 missing values generated)
(5,746 real changes made)
(5,755 real changes made)
(5,746 real changes made)
(5,755 real changes made)
(7,300 real changes made)
(33,006 missing values generated)
(5,746 real changes made)
(5,755 real changes made)
(11,501 real changes made)
(25,706 real changes made)
(21,505 missing values generated)
(11,501 real changes made)
(5,746 real changes made)
(8,984 real changes made, 8,984 to missing)
(21,394 missing values generated)
(33,006 missing values generated)
(5,864 real changes made)
(5,748 real changes made)
(5,864 real changes made)
(5,748 real changes made)
(7,364 real changes made)
(33,006 missing values generated)
(5,864 real changes made)
(5,748 real changes made)
(11,612 real changes made)
(25,642 real changes made)
(21,394 missing values generated)
(11,612 real changes made)
(5,864 real changes made)
(9,034 real changes made, 9,034 to missing)
(21,444 missing values generated)
(33,006 missing values generated)
(5,854 real changes made)
(5,708 real changes made)
(5,854 real changes made)
(5,708 real changes made)
(7,307 real changes made)
(33,006 missing values generated)
(5,854 real changes made)
(5,708 real changes made)
(11,562 real changes made)
(25,699 real changes made)
(21,444 missing values generated)
(11,562 real changes made)
(5,854 real changes made)
(9,108 real changes made, 9,108 to missing)
(21,518 missing values generated)
(33,006 missing values generated)
(5,810 real changes made)
(5,678 real changes made)
(5,810 real changes made)
(5,678 real changes made)
(7,239 real changes made)
(33,006 missing values generated)
(5,810 real changes made)
(5,678 real changes made)
(11,488 real changes made)
(25,767 real changes made)
(21,518 missing values generated)
(11,488 real changes made)
(5,810 real changes made)
(9,055 real changes made, 9,055 to missing)
(21,465 missing values generated)
(33,006 missing values generated)
(5,864 real changes made)
(5,677 real changes made)
(5,864 real changes made)
(5,677 real changes made)
(7,325 real changes made)
(33,006 missing values generated)
(5,864 real changes made)
(5,677 real changes made)
(11,541 real changes made)
(25,681 real changes made)
(21,465 missing values generated)
(11,541 real changes made)
(5,864 real changes made)
(9,100 real changes made, 9,100 to missing)
(21,510 missing values generated)
(33,006 missing values generated)
(5,805 real changes made)
(5,691 real changes made)
(5,805 real changes made)
(5,691 real changes made)
(7,184 real changes made)
(33,006 missing values generated)
(5,805 real changes made)
(5,691 real changes made)
(11,496 real changes made)
(25,822 real changes made)
(21,510 missing values generated)
(11,496 real changes made)
(5,805 real changes made)
(9,100 real changes made, 9,100 to missing)
(21,510 missing values generated)
(33,006 missing values generated)
(5,848 real changes made)
(5,648 real changes made)
(5,848 real changes made)
(5,648 real changes made)
(7,364 real changes made)
(33,006 missing values generated)
(5,848 real changes made)
(5,648 real changes made)
(11,496 real changes made)
(25,642 real changes made)
(21,510 missing values generated)
(11,496 real changes made)
(5,848 real changes made)
(9,040 real changes made, 9,040 to missing)
(21,450 missing values generated)
(33,006 missing values generated)
(5,932 real changes made)
(5,624 real changes made)
(5,932 real changes made)
(5,624 real changes made)
(7,373 real changes made)
(33,006 missing values generated)
(5,932 real changes made)
(5,624 real changes made)
(11,556 real changes made)
(25,633 real changes made)
(21,450 missing values generated)
(11,556 real changes made)
(5,932 real changes made)
(9,006 real changes made, 9,006 to missing)
(21,416 missing values generated)
(33,006 missing values generated)
(5,934 real changes made)
(5,656 real changes made)
(5,934 real changes made)
(5,656 real changes made)
(7,286 real changes made)
(33,006 missing values generated)
(5,934 real changes made)
(5,656 real changes made)
(11,590 real changes made)
(25,720 real changes made)
(21,416 missing values generated)
(11,590 real changes made)
(5,934 real changes made)
(9,134 real changes made, 9,134 to missing)
(21,544 missing values generated)
(33,006 missing values generated)
(5,813 real changes made)
(5,649 real changes made)
(5,813 real changes made)
(5,649 real changes made)
(7,202 real changes made)
(33,006 missing values generated)
(5,813 real changes made)
(5,649 real changes made)
(11,462 real changes made)
(25,804 real changes made)
(21,544 missing values generated)
(11,462 real changes made)
(5,813 real changes made)
(9,128 real changes made, 9,128 to missing)
(21,538 missing values generated)
(33,006 missing values generated)
(5,749 real changes made)
(5,719 real changes made)
(5,749 real changes made)
(5,719 real changes made)
(7,198 real changes made)
(33,006 missing values generated)
(5,749 real changes made)
(5,719 real changes made)
(11,468 real changes made)
(25,808 real changes made)
(21,538 missing values generated)
(11,468 real changes made)
(5,749 real changes made)
(9,000 real changes made, 9,000 to missing)
(21,410 missing values generated)
(33,006 missing values generated)
(5,900 real changes made)
(5,696 real changes made)
(5,900 real changes made)
(5,696 real changes made)
(7,303 real changes made)
(33,006 missing values generated)
(5,900 real changes made)
(5,696 real changes made)
(11,596 real changes made)
(25,703 real changes made)
(21,410 missing values generated)
(11,596 real changes made)
(5,900 real changes made)
(9,068 real changes made, 9,068 to missing)
(21,478 missing values generated)
(33,006 missing values generated)
(5,867 real changes made)
(5,661 real changes made)
(5,867 real changes made)
(5,661 real changes made)
(7,305 real changes made)
(33,006 missing values generated)
(5,867 real changes made)
(5,661 real changes made)
(11,528 real changes made)
(25,701 real changes made)
(21,478 missing values generated)
(11,528 real changes made)
(5,867 real changes made)
(9,051 real changes made, 9,051 to missing)
(21,461 missing values generated)
(33,006 missing values generated)
(5,821 real changes made)
(5,724 real changes made)
(5,821 real changes made)
(5,724 real changes made)
(7,272 real changes made)
(33,006 missing values generated)
(5,821 real changes made)
(5,724 real changes made)
(11,545 real changes made)
(25,734 real changes made)
(21,461 missing values generated)
(11,545 real changes made)
(5,821 real changes made)
(9,077 real changes made, 9,077 to missing)
(21,487 missing values generated)
(33,006 missing values generated)
(5,859 real changes made)
(5,660 real changes made)
(5,859 real changes made)
(5,660 real changes made)
(7,332 real changes made)
(33,006 missing values generated)
(5,859 real changes made)
(5,660 real changes made)
(11,519 real changes made)
(25,674 real changes made)
(21,487 missing values generated)
(11,519 real changes made)
(5,859 real changes made)
(8,997 real changes made, 8,997 to missing)
(21,407 missing values generated)
(33,006 missing values generated)
(5,912 real changes made)
(5,687 real changes made)
(5,912 real changes made)
(5,687 real changes made)
(7,357 real changes made)
(33,006 missing values generated)
(5,912 real changes made)
(5,687 real changes made)
(11,599 real changes made)
(25,649 real changes made)
(21,407 missing values generated)
(11,599 real changes made)
(5,912 real changes made)
(9,028 real changes made, 9,028 to missing)
(21,438 missing values generated)
(33,006 missing values generated)
(5,861 real changes made)
(5,707 real changes made)
(5,861 real changes made)
(5,707 real changes made)
(7,331 real changes made)
(33,006 missing values generated)
(5,861 real changes made)
(5,707 real changes made)
(11,568 real changes made)
(25,675 real changes made)
(21,438 missing values generated)
(11,568 real changes made)
(5,861 real changes made)
(9,042 real changes made, 9,042 to missing)
(21,452 missing values generated)
(33,006 missing values generated)
(5,870 real changes made)
(5,684 real changes made)
(5,870 real changes made)
(5,684 real changes made)
(7,250 real changes made)
(33,006 missing values generated)
(5,870 real changes made)
(5,684 real changes made)
(11,554 real changes made)
(25,756 real changes made)
(21,452 missing values generated)
(11,554 real changes made)
(5,870 real changes made)
(9,103 real changes made, 9,103 to missing)
(21,513 missing values generated)
(33,006 missing values generated)
(5,862 real changes made)
(5,631 real changes made)
(5,862 real changes made)
(5,631 real changes made)
(7,178 real changes made)
(33,006 missing values generated)
(5,862 real changes made)
(5,631 real changes made)
(11,493 real changes made)
(25,828 real changes made)
(21,513 missing values generated)
(11,493 real changes made)
(5,862 real changes made)
(9,089 real changes made, 9,089 to missing)
(21,499 missing values generated)
(33,006 missing values generated)
(5,870 real changes made)
(5,637 real changes made)
(5,870 real changes made)
(5,637 real changes made)
(7,317 real changes made)
(33,006 missing values generated)
(5,870 real changes made)
(5,637 real changes made)
(11,507 real changes made)
(25,689 real changes made)
(21,499 missing values generated)
(11,507 real changes made)
(5,870 real changes made)
(9,070 real changes made, 9,070 to missing)
(21,480 missing values generated)
(33,006 missing values generated)
(5,862 real changes made)
(5,664 real changes made)
(5,862 real changes made)
(5,664 real changes made)
(7,299 real changes made)
(33,006 missing values generated)
(5,862 real changes made)
(5,664 real changes made)
(11,526 real changes made)
(25,707 real changes made)
(21,480 missing values generated)
(11,526 real changes made)
(5,862 real changes made)
(5,498 real changes made, 5,498 to missing)
(26,094 missing values generated)
(33,006 missing values generated)
(3,443 real changes made)
(3,469 real changes made)
(3,443 real changes made)
(3,469 real changes made)
(4,385 real changes made)
(33,006 missing values generated)
(3,443 real changes made)
(3,469 real changes made)
(6,912 real changes made)
(28,621 real changes made)
(26,094 missing values generated)
(6,912 real changes made)
(3,443 real changes made)
(5,507 real changes made, 5,507 to missing)
(26,103 missing values generated)
(33,006 missing values generated)
(3,492 real changes made)
(3,411 real changes made)
(3,492 real changes made)
(3,411 real changes made)
(4,332 real changes made)
(33,006 missing values generated)
(3,492 real changes made)
(3,411 real changes made)
(6,903 real changes made)
(28,674 real changes made)
(26,103 missing values generated)
(6,903 real changes made)
(3,492 real changes made)
(5,447 real changes made, 5,447 to missing)
(26,043 missing values generated)
(33,006 missing values generated)
(3,468 real changes made)
(3,495 real changes made)
(3,468 real changes made)
(3,495 real changes made)
(4,378 real changes made)
(33,006 missing values generated)
(3,468 real changes made)
(3,495 real changes made)
(6,963 real changes made)
(28,628 real changes made)
(26,043 missing values generated)
(6,963 real changes made)
(3,468 real changes made)
(5,506 real changes made, 5,506 to missing)
(26,102 missing values generated)
(33,006 missing values generated)
(3,560 real changes made)
(3,344 real changes made)
(3,560 real changes made)
(3,344 real changes made)
(4,352 real changes made)
(33,006 missing values generated)
(3,560 real changes made)
(3,344 real changes made)
(6,904 real changes made)
(28,654 real changes made)
(26,102 missing values generated)
(6,904 real changes made)
(3,560 real changes made)
(5,440 real changes made, 5,440 to missing)
(26,036 missing values generated)
(33,006 missing values generated)
(3,437 real changes made)
(3,533 real changes made)
(3,437 real changes made)
(3,533 real changes made)
(4,441 real changes made)
(33,006 missing values generated)
(3,437 real changes made)
(3,533 real changes made)
(6,970 real changes made)
(28,565 real changes made)
(26,036 missing values generated)
(6,970 real changes made)
(3,437 real changes made)
(5,503 real changes made, 5,503 to missing)
(26,099 missing values generated)
(33,006 missing values generated)
(3,478 real changes made)
(3,429 real changes made)
(3,478 real changes made)
(3,429 real changes made)
(4,363 real changes made)
(33,006 missing values generated)
(3,478 real changes made)
(3,429 real changes made)
(6,907 real changes made)
(28,643 real changes made)
(26,099 missing values generated)
(6,907 real changes made)
(3,478 real changes made)
(5,466 real changes made, 5,466 to missing)
(26,062 missing values generated)
(33,006 missing values generated)
(3,471 real changes made)
(3,473 real changes made)
(3,471 real changes made)
(3,473 real changes made)
(4,366 real changes made)
(33,006 missing values generated)
(3,471 real changes made)
(3,473 real changes made)
(6,944 real changes made)
(28,640 real changes made)
(26,062 missing values generated)
(6,944 real changes made)
(3,471 real changes made)
(5,436 real changes made, 5,436 to missing)
(26,032 missing values generated)
(33,006 missing values generated)
(3,500 real changes made)
(3,474 real changes made)
(3,500 real changes made)
(3,474 real changes made)
(4,465 real changes made)
(33,006 missing values generated)
(3,500 real changes made)
(3,474 real changes made)
(6,974 real changes made)
(28,541 real changes made)
(26,032 missing values generated)
(6,974 real changes made)
(3,500 real changes made)
(5,455 real changes made, 5,455 to missing)
(26,051 missing values generated)
(33,006 missing values generated)
(3,455 real changes made)
(3,500 real changes made)
(3,455 real changes made)
(3,500 real changes made)
(4,385 real changes made)
(33,006 missing values generated)
(3,455 real changes made)
(3,500 real changes made)
(6,955 real changes made)
(28,621 real changes made)
(26,051 missing values generated)
(6,955 real changes made)
(3,455 real changes made)
(5,456 real changes made, 5,456 to missing)
(26,052 missing values generated)
(33,006 missing values generated)
(3,476 real changes made)
(3,478 real changes made)
(3,476 real changes made)
(3,478 real changes made)
(4,487 real changes made)
(33,006 missing values generated)
(3,476 real changes made)
(3,478 real changes made)
(6,954 real changes made)
(28,519 real changes made)
(26,052 missing values generated)
(6,954 real changes made)
(3,476 real changes made)
(5,468 real changes made, 5,468 to missing)
(26,064 missing values generated)
(33,006 missing values generated)
(3,460 real changes made)
(3,482 real changes made)
(3,460 real changes made)
(3,482 real changes made)
(4,380 real changes made)
(33,006 missing values generated)
(3,460 real changes made)
(3,482 real changes made)
(6,942 real changes made)
(28,626 real changes made)
(26,064 missing values generated)
(6,942 real changes made)
(3,460 real changes made)
(5,472 real changes made, 5,472 to missing)
(26,068 missing values generated)
(33,006 missing values generated)
(3,508 real changes made)
(3,430 real changes made)
(3,508 real changes made)
(3,430 real changes made)
(4,474 real changes made)
(33,006 missing values generated)
(3,508 real changes made)
(3,430 real changes made)
(6,938 real changes made)
(28,532 real changes made)
(26,068 missing values generated)
(6,938 real changes made)
(3,508 real changes made)
(5,461 real changes made, 5,461 to missing)
(26,057 missing values generated)
(33,006 missing values generated)
(3,526 real changes made)
(3,423 real changes made)
(3,526 real changes made)
(3,423 real changes made)
(4,427 real changes made)
(33,006 missing values generated)
(3,526 real changes made)
(3,423 real changes made)
(6,949 real changes made)
(28,579 real changes made)
(26,057 missing values generated)
(6,949 real changes made)
(3,526 real changes made)
(5,452 real changes made, 5,452 to missing)
(26,048 missing values generated)
(33,006 missing values generated)
(3,473 real changes made)
(3,485 real changes made)
(3,473 real changes made)
(3,485 real changes made)
(4,362 real changes made)
(33,006 missing values generated)
(3,473 real changes made)
(3,485 real changes made)
(6,958 real changes made)
(28,644 real changes made)
(26,048 missing values generated)
(6,958 real changes made)
(3,473 real changes made)
(5,495 real changes made, 5,495 to missing)
(26,091 missing values generated)
(33,006 missing values generated)
(3,449 real changes made)
(3,466 real changes made)
(3,449 real changes made)
(3,466 real changes made)
(4,382 real changes made)
(33,006 missing values generated)
(3,449 real changes made)
(3,466 real changes made)
(6,915 real changes made)
(28,624 real changes made)
(26,091 missing values generated)
(6,915 real changes made)
(3,449 real changes made)
(5,449 real changes made, 5,449 to missing)
(26,045 missing values generated)
(33,006 missing values generated)
(3,524 real changes made)
(3,437 real changes made)
(3,524 real changes made)
(3,437 real changes made)
(4,487 real changes made)
(33,006 missing values generated)
(3,524 real changes made)
(3,437 real changes made)
(6,961 real changes made)
(28,519 real changes made)
(26,045 missing values generated)
(6,961 real changes made)
(3,524 real changes made)
(5,476 real changes made, 5,476 to missing)
(26,072 missing values generated)
(33,006 missing values generated)
(3,478 real changes made)
(3,456 real changes made)
(3,478 real changes made)
(3,456 real changes made)
(4,361 real changes made)
(33,006 missing values generated)
(3,478 real changes made)
(3,456 real changes made)
(6,934 real changes made)
(28,645 real changes made)
(26,072 missing values generated)
(6,934 real changes made)
(3,478 real changes made)
(5,463 real changes made, 5,463 to missing)
(26,059 missing values generated)
(33,006 missing values generated)
(3,484 real changes made)
(3,463 real changes made)
(3,484 real changes made)
(3,463 real changes made)
(4,396 real changes made)
(33,006 missing values generated)
(3,484 real changes made)
(3,463 real changes made)
(6,947 real changes made)
(28,610 real changes made)
(26,059 missing values generated)
(6,947 real changes made)
(3,484 real changes made)
(5,481 real changes made, 5,481 to missing)
(26,077 missing values generated)
(33,006 missing values generated)
(3,451 real changes made)
(3,478 real changes made)
(3,451 real changes made)
(3,478 real changes made)
(4,341 real changes made)
(33,006 missing values generated)
(3,451 real changes made)
(3,478 real changes made)
(6,929 real changes made)
(28,665 real changes made)
(26,077 missing values generated)
(6,929 real changes made)
(3,451 real changes made)
(5,521 real changes made, 5,521 to missing)
(26,117 missing values generated)
(33,006 missing values generated)
(3,469 real changes made)
(3,420 real changes made)
(3,469 real changes made)
(3,420 real changes made)
(4,326 real changes made)
(33,006 missing values generated)
(3,469 real changes made)
(3,420 real changes made)
(6,889 real changes made)
(28,680 real changes made)
(26,117 missing values generated)
(6,889 real changes made)
(3,469 real changes made)
(5,454 real changes made, 5,454 to missing)
(26,050 missing values generated)
(33,006 missing values generated)
(3,530 real changes made)
(3,426 real changes made)
(3,530 real changes made)
(3,426 real changes made)
(4,420 real changes made)
(33,006 missing values generated)
(3,530 real changes made)
(3,426 real changes made)
(6,956 real changes made)
(28,586 real changes made)
(26,050 missing values generated)
(6,956 real changes made)
(3,530 real changes made)
(5,447 real changes made, 5,447 to missing)
(26,043 missing values generated)
(33,006 missing values generated)
(3,450 real changes made)
(3,513 real changes made)
(3,450 real changes made)
(3,513 real changes made)
(4,417 real changes made)
(33,006 missing values generated)
(3,450 real changes made)
(3,513 real changes made)
(6,963 real changes made)
(28,589 real changes made)
(26,043 missing values generated)
(6,963 real changes made)
(3,450 real changes made)
(5,511 real changes made, 5,511 to missing)
(26,107 missing values generated)
(33,006 missing values generated)
(3,487 real changes made)
(3,412 real changes made)
(3,487 real changes made)
(3,412 real changes made)
(4,265 real changes made)
(33,006 missing values generated)
(3,487 real changes made)
(3,412 real changes made)
(6,899 real changes made)
(28,741 real changes made)
(26,107 missing values generated)
(6,899 real changes made)
(3,487 real changes made)
(5,437 real changes made, 5,437 to missing)
(26,033 missing values generated)
(33,006 missing values generated)
(3,522 real changes made)
(3,451 real changes made)
(3,522 real changes made)
(3,451 real changes made)
(4,440 real changes made)
(33,006 missing values generated)
(3,522 real changes made)
(3,451 real changes made)
(6,973 real changes made)
(28,566 real changes made)
(26,033 missing values generated)
(6,973 real changes made)
(3,522 real changes made)
(5,481 real changes made, 5,481 to missing)
(26,077 missing values generated)
(33,006 missing values generated)
(3,419 real changes made)
(3,510 real changes made)
(3,419 real changes made)
(3,510 real changes made)
(4,403 real changes made)
(33,006 missing values generated)
(3,419 real changes made)
(3,510 real changes made)
(6,929 real changes made)
(28,603 real changes made)
(26,077 missing values generated)
(6,929 real changes made)
(3,419 real changes made)
(5,476 real changes made, 5,476 to missing)
(26,072 missing values generated)
(33,006 missing values generated)
(3,472 real changes made)
(3,462 real changes made)
(3,472 real changes made)
(3,462 real changes made)
(4,419 real changes made)
(33,006 missing values generated)
(3,472 real changes made)
(3,462 real changes made)
(6,934 real changes made)
(28,587 real changes made)
(26,072 missing values generated)
(6,934 real changes made)
(3,472 real changes made)
(5,446 real changes made, 5,446 to missing)
(26,042 missing values generated)
(33,006 missing values generated)
(3,468 real changes made)
(3,496 real changes made)
(3,468 real changes made)
(3,496 real changes made)
(4,451 real changes made)
(33,006 missing values generated)
(3,468 real changes made)
(3,496 real changes made)
(6,964 real changes made)
(28,555 real changes made)
(26,042 missing values generated)
(6,964 real changes made)
(3,468 real changes made)
(5,475 real changes made, 5,475 to missing)
(26,071 missing values generated)
(33,006 missing values generated)
(3,452 real changes made)
(3,483 real changes made)
(3,452 real changes made)
(3,483 real changes made)
(4,346 real changes made)
(33,006 missing values generated)
(3,452 real changes made)
(3,483 real changes made)
(6,935 real changes made)
(28,660 real changes made)
(26,071 missing values generated)
(6,935 real changes made)
(3,452 real changes made)
(5,454 real changes made, 5,454 to missing)
(26,050 missing values generated)
(33,006 missing values generated)
(3,462 real changes made)
(3,494 real changes made)
(3,462 real changes made)
(3,494 real changes made)
(4,427 real changes made)
(33,006 missing values generated)
(3,462 real changes made)
(3,494 real changes made)
(6,956 real changes made)
(28,579 real changes made)
(26,050 missing values generated)
(6,956 real changes made)
(3,462 real changes made)
(5,504 real changes made, 5,504 to missing)
(26,100 missing values generated)
(33,006 missing values generated)
(3,493 real changes made)
(3,413 real changes made)
(3,493 real changes made)
(3,413 real changes made)
(4,390 real changes made)
(33,006 missing values generated)
(3,493 real changes made)
(3,413 real changes made)
(6,906 real changes made)
(28,616 real changes made)
(26,100 missing values generated)
(6,906 real changes made)
(3,493 real changes made)
(5,442 real changes made, 5,442 to missing)
(26,038 missing values generated)
(33,006 missing values generated)
(3,492 real changes made)
(3,476 real changes made)
(3,492 real changes made)
(3,476 real changes made)
(4,352 real changes made)
(33,006 missing values generated)
(3,492 real changes made)
(3,476 real changes made)
(6,968 real changes made)
(28,654 real changes made)
(26,038 missing values generated)
(6,968 real changes made)
(3,492 real changes made)
(5,446 real changes made, 5,446 to missing)
(26,042 missing values generated)
(33,006 missing values generated)
(3,478 real changes made)
(3,486 real changes made)
(3,478 real changes made)
(3,486 real changes made)
(4,448 real changes made)
(33,006 missing values generated)
(3,478 real changes made)
(3,486 real changes made)
(6,964 real changes made)
(28,558 real changes made)
(26,042 missing values generated)
(6,964 real changes made)
(3,478 real changes made)
(5,434 real changes made, 5,434 to missing)
(26,030 missing values generated)
(33,006 missing values generated)
(3,461 real changes made)
(3,515 real changes made)
(3,461 real changes made)
(3,515 real changes made)
(4,447 real changes made)
(33,006 missing values generated)
(3,461 real changes made)
(3,515 real changes made)
(6,976 real changes made)
(28,559 real changes made)
(26,030 missing values generated)
(6,976 real changes made)
(3,461 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)

. gen baseline_egfr=.
(33,006 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(694 real changes made)
(739 real changes made)
(656 real changes made)
(692 real changes made)
(618 real changes made)
(608 real changes made)
(533 real changes made)
(544 real changes made)
(493 real changes made)
(433 real changes made)
(512 real changes made)
(396 real changes made)
(369 real changes made)
(382 real changes made)
(352 real changes made)
(295 real changes made)
(280 real changes made)
(321 real changes made)
(253 real changes made)
(217 real changes made)
(197 real changes made)
(203 real changes made)
(240 real changes made)
(188 real changes made)
(120 real changes made)
(171 real changes made)
(131 real changes made)
(156 real changes made)
(141 real changes made)
(104 real changes made)
(98 real changes made)
(83 real changes made)
(228 real changes made)
(273 real changes made)
(249 real changes made)
(279 real changes made)
(256 real changes made)
(282 real changes made)
(244 real changes made)
(247 real changes made)
(238 real changes made)
(203 real changes made)
(268 real changes made)
(219 real changes made)
(233 real changes made)
(228 real changes made)
(204 real changes made)
(217 real changes made)
(196 real changes made)
(219 real changes made)
(185 real changes made)
(175 real changes made)
(203 real changes made)
(207 real changes made)
(218 real changes made)
(181 real changes made)
(151 real changes made)
(210 real changes made)
(180 real changes made)
(188 real changes made)
(178 real changes made)
(165 real changes made)
(155 real changes made)
(138 real changes made)
(143 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab case baseline_esrd

           | baseline_e
           |    srd
      case |   No ESRD |     Total
-----------+-----------+----------
         0 |    20,596 |    20,596 
         1 |    12,410 |    12,410 
-----------+-----------+----------
     Total |    33,006 |    33,006 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. * Drop COVID-19 cases without any matched historical comparators after furthe
> r application of exclusion criteria
. generate match_counts1=.
(33,006 missing values generated)

. order patient_id set_id match_counts match_counts1

. bysort set_id: replace match_counts1=_N-1
(33006 real changes made)

. replace match_counts1=. if case==0
(20,596 real changes made, 20,596 to missing)

. drop match_counts

. rename match_counts1 match_counts

. count if match_counts==0
  4,671

. drop if match_counts==0
(4,671 observations deleted)

. safetab case
0

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,596       72.69       72.69
          1 |      7,739       27.31      100.00
------------+-----------------------------------
      Total |     28,335      100.00

. tab match_counts

match_count |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        975       12.60       12.60
          2 |      1,779       22.99       35.59
          3 |      4,985       64.41      100.00
------------+-----------------------------------
      Total |      7,739      100.00

. 
. bysort set_id: egen set_case_mean = mean(case) // if mean of exposure var is 
> 0 then only uncase in set, if 1 then only case in set

. gen valid_set = (set_case_mean>0 & set_case_mean<1) // ==1 is valid set conta
> ining both case and uncase

. tab valid_set, miss

  valid_set |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,108        3.91        3.91
          1 |     27,227       96.09      100.00
------------+-----------------------------------
      Total |     28,335      100.00

. tab valid_set case, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |         case
 valid_set |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,108          0 |     1,108 
           |      5.38       0.00 |      3.91 
-----------+----------------------+----------
         1 |    19,488      7,739 |    27,227 
           |     94.62     100.00 |     96.09 
-----------+----------------------+----------
     Total |    20,596      7,739 |    28,335 
           |    100.00     100.00 |    100.00 

. keep if valid_set==1
(1,108 observations deleted)

. drop valid_set set_case_mean

. 
. ** Exposure
. label define case 0 "Historical comparator" ///
>                                   1 "SARS-CoV-2"

. label values case case

. safetab case 
0

                 case |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,488       71.58       71.58
           SARS-CoV-2 |      7,739       28.42      100.00
----------------------+-----------------------------------
                Total |     27,227      100.00

. 
. * COVID-19 severity
. gen covid_severity = case

. replace covid_severity = 2 if covid_hospitalised==1
(774 real changes made)

. replace covid_severity = 3 if covid_critical_care==1
(392 real changes made)

. replace covid_severity = 3 if covid_critical_days==1
(385 real changes made)

. label define covid_severity     0 "Historical comparator"               ///
>                                                         1 "Non-hospitalised C
> OVID" ///
>                                                         2 "Hospitalised COVID
> "          ///
>                                                         3 "Critical care COVI
> D"

. label values covid_severity covid_severity

. label var covid_severity "SARS-CoV-2 severity"

. drop covid_critical_care

. drop covid_critical_days

. safetab covid_severity, m
15

   SARS-CoV-2 severity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
 Historical comparator |     19,488       71.58       71.58
Non-hospitalised COVID |      6,260       22.99       94.57
    Hospitalised COVID |        702        2.58       97.15
   Critical care COVID |        777        2.85      100.00
-----------------------+-----------------------------------
                 Total |     27,227      100.00

. 
. * COVID-19 acute kidney injury
. gen covid_aki = case

. replace covid_aki = 2 if covid_hospitalised==1
(774 real changes made)

. replace covid_aki = 3 if covid_acute_kidney_injury==1
(371 real changes made)

. label define covid_aki  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised COVID"   
>            ///
>                                                 2 "Hospitalised COVID"  ///
>                                                 3 "Hospitalised COVID-AKI"

. label values covid_aki covid_aki

. label var covid_aki "COVID-19 acute kidney injury"

. drop covid_acute_kidney_injury

. safetab covid_aki, m
10

 COVID-19 acute kidney |
                injury |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
 Historical comparator |     19,488       71.58       71.58
Non-hospitalised COVID |      6,621       24.32       95.89
    Hospitalised COVID |        747        2.74       98.64
Hospitalised COVID-AKI |        371        1.36      100.00
-----------------------+-----------------------------------
                 Total |     27,227      100.00

. 
. * COVID-19 kidney replacement therapy
. gen covid_krt_combined = covid_krt_icd_10
(19,488 missing values generated)

. replace covid_krt_combined = covid_krt_opcs_4 if covid_krt_icd_10==0
(359 real changes made)

. gen covid_krt = case

. replace covid_krt = 2 if covid_hospitalised==1
(774 real changes made)

. replace covid_krt = 3 if covid_krt_combined==1
(720 real changes made)

. label define covid_krt  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised SARS-CoV-
> 2"         ///
>                                                 2 "No KRT hospitalised COVID-
> 19"        ///
>                                                 3 "KRT hospitalised COVID-19"

. label values covid_krt covid_krt

. label var covid_krt "COVID-19 kidney replacement therapy"

. drop covid_krt_icd_10

. drop covid_krt_opcs_4

. safetab covid_krt, m
10

 COVID-19 kidney replacement |
                     therapy |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
       Historical comparator |     19,488       71.58       71.58
 Non-hospitalised SARS-CoV-2 |      6,313       23.19       94.76
No KRT hospitalised COVID-19 |        706        2.59       97.36
   KRT hospitalised COVID-19 |        720        2.64      100.00
-----------------------------+-----------------------------------
                       Total |     27,227      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(25,663 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(25,724 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(25,687 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(25,650 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(1,577 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(1,230 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(962 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(833 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Historical comparator"       ///
>                                                 1 "Pre-vaccination"          
>            ///
>                                                 2 "1 vaccine dose"           
>            ///
>                                                 3 "2 vaccine doses"          
>            ///
>                                                 4 "3 vaccine doses"          
>            ///
>                                                 5 "4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "Vaccination status"

. safetab covid_vax, m
10

   Vaccination status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,488       71.58       71.58
      Pre-vaccination |      3,137       11.52       83.10
       1 vaccine dose |        833        3.06       86.16
      2 vaccine doses |        962        3.53       89.69
      3 vaccine doses |      1,230        4.52       94.21
      4 vaccine doses |      1,577        5.79      100.00
----------------------+-----------------------------------
                Total |     27,227      100.00

. 
. * COVID-19 wave
. gen wave = case

. replace wave = 2 if index_month=="sep2020"
(361 real changes made)

. replace wave = 2 if index_month=="oct2020"
(329 real changes made)

. replace wave = 2 if index_month=="nov2020"
(292 real changes made)

. replace wave = 2 if index_month=="dec2020"
(355 real changes made)

. replace wave = 2 if index_month=="jan2021"
(269 real changes made)

. replace wave = 2 if index_month=="feb2021"
(253 real changes made)

. replace wave = 2 if index_month=="mar2021"
(266 real changes made)

. replace wave = 2 if index_month=="apr2021"
(240 real changes made)

. replace wave = 2 if index_month=="may2021"
(216 real changes made)

. replace wave = 2 if index_month=="jun2021"
(180 real changes made)

. replace wave = 3 if index_month=="jul2021"
(210 real changes made)

. replace wave = 3 if index_month=="aug2021"
(176 real changes made)

. replace wave = 3 if index_month=="sep2021"
(153 real changes made)

. replace wave = 3 if index_month=="oct2021"
(151 real changes made)

. replace wave = 3 if index_month=="nov2021"
(147 real changes made)

. replace wave = 4 if index_month=="dec2021"
(169 real changes made)

. replace wave = 4 if index_month=="jan2022"
(130 real changes made)

. replace wave = 4 if index_month=="feb2022"
(90 real changes made)

. replace wave = 4 if index_month=="mar2022"
(133 real changes made)

. replace wave = 4 if index_month=="apr2022"
(110 real changes made)

. replace wave = 4 if index_month=="may2022"
(113 real changes made)

. replace wave = 4 if index_month=="jun2022"
(92 real changes made)

. replace wave = 4 if index_month=="jul2022"
(80 real changes made)

. replace wave = 4 if index_month=="aug2022"
(79 real changes made)

. replace wave = 4 if index_month=="sep2022"
(62 real changes made)

. replace wave = 4 if index_month=="oct2022"
(83 real changes made)

. label define wave       0 "Historical comparator"       ///
>                                         1 "Febuary20-August20"  ///
>                                         2 "September20-June21"  ///
>                                         3 "July21-November21"   ///
>                                         4 "December21-October22"        

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m
5

        COVID-19 wave |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,488       71.58       71.58
   Febuary20-August20 |      3,000       11.02       82.59
   September20-June21 |      2,761       10.14       92.74
    July21-November21 |        837        3.07       95.81
 December21-October22 |      1,141        4.19      100.00
----------------------+-----------------------------------
                Total |     27,227      100.00

. 
. ** Covariates
. 
. * Check of GP consultations by groups
. sum gp_count, detail

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -5
 5%            0             -4
10%            0             -4       Obs              27,227
25%            0             -4       Sum of Wgt.      27,227

50%            3                      Mean           3.291035
                        Largest       Std. Dev.      3.548438
75%            6             17
90%            8             17       Variance       12.59141
95%           10             17       Skewness        .653134
99%           12             20       Kurtosis        2.33336

. bysort case: sum gp_count, detail

-------------------------------------------------------------------------------
-> case = Historical comparator

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -5
 5%            0             -4
10%            0             -4       Obs              19,488
25%            0             -4       Sum of Wgt.      19,488

50%            3                      Mean           3.300493
                        Largest       Std. Dev.      3.555831
75%            6             16
90%            8             17       Variance       12.64393
95%           10             17       Skewness       .6459235
99%           12             17       Kurtosis        2.31758

-------------------------------------------------------------------------------
-> case = SARS-CoV-2

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -3
 5%            0             -3
10%            0             -3       Obs               7,739
25%            0             -3       Sum of Wgt.       7,739

50%            3                      Mean           3.267218
                        Largest       Std. Dev.      3.529871
75%            6             15
90%            8             15       Variance       12.45999
95%           10             16       Skewness        .671421
99%           12             20       Kurtosis       2.374133


. 
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        260        0.95        0.95
         19 |        292        1.07        2.03
         20 |        395        1.45        3.48
         21 |        485        1.78        5.26
         22 |        563        2.07        7.33
         23 |        507        1.86        9.19
         24 |        547        2.01       11.20
         25 |        565        2.08       13.27
         26 |        533        1.96       15.23
         27 |        562        2.06       17.30
         28 |        538        1.98       19.27
         29 |        539        1.98       21.25
         30 |        529        1.94       23.19
         31 |        530        1.95       25.14
         32 |        542        1.99       27.13
         33 |        546        2.01       29.14
         34 |        583        2.14       31.28
         35 |        529        1.94       33.22
         36 |        509        1.87       35.09
         37 |        520        1.91       37.00
         38 |        549        2.02       39.02
         39 |        562        2.06       41.08
         40 |        576        2.12       43.20
         41 |        543        1.99       45.19
         42 |        525        1.93       47.12
         43 |        600        2.20       49.32
         44 |        548        2.01       51.34
         45 |        552        2.03       53.36
         46 |        567        2.08       55.44
         47 |        532        1.95       57.40
         48 |        566        2.08       59.48
         49 |        544        2.00       61.48
         50 |        555        2.04       63.51
         51 |        541        1.99       65.50
         52 |        514        1.89       67.39
         53 |        527        1.94       69.32
         54 |        538        1.98       71.30
         55 |        541        1.99       73.29
         56 |        524        1.92       75.21
         57 |        543        1.99       77.21
         58 |        575        2.11       79.32
         59 |        557        2.05       81.36
         60 |        533        1.96       83.32
         61 |        541        1.99       85.31
         62 |        542        1.99       87.30
         63 |        531        1.95       89.25
         64 |        541        1.99       91.24
         65 |        573        2.10       93.34
         66 |        556        2.04       95.38
         67 |        501        1.84       97.22
         68 |        309        1.13       98.36
         69 |        208        0.76       99.12
         70 |        154        0.57       99.69
         71 |         70        0.26       99.94
         72 |         15        0.06      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. safecount
  27,227

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///          
>                            
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(27227 differences between age and agegroup)

. 
. label var age "Age"

. label values age age

. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label var agegroup "Age group"

. label values agegroup agegroup

. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex
0

        Sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     13,822       50.77       50.77
       Male |     13,405       49.23      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. safecount
  27,227

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(1,005 real changes made)

. replace ethnicity=2 if ethnicity==3
(1,029 real changes made)

. replace ethnicity=3 if ethnicity==4
(1,058 real changes made)

. replace ethnicity=4 if ethnicity==6
(1,005 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///          
>                                    
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                    
>                                            

. label values ethnicity ethnicity

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,287       59.82       59.82
South Asian |      1,029        3.78       63.60
      Black |      1,058        3.89       67.48
      Mixed |      1,005        3.69       71.18
      Other |      1,038        3.81       74.99
          . |      6,810       25.01      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(6,810 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(6,810 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. label var ethnicity1 "Ethnicity"

. safetab ethnicity1, m
11

  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,287       59.82       59.82
South Asian |      1,029        3.78       63.60
      Black |      1,058        3.89       67.48
      Mixed |      1,005        3.69       71.18
      Other |      1,038        3.81       74.99
    Unknown |      6,810       25.01      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,701        9.92        9.92
                Urban minor conurbation |      2,715        9.97       19.89
                    Urban city and town |      2,679        9.84       29.73
Urban city and town in a sparse setting |      2,797       10.27       40.00
                  Rural town and fringe |      2,782       10.22       50.22
Rural town and fringe in a sparse setti |      2,759       10.13       60.36
            Rural village and dispersed |      5,420       19.91       80.26
Rural village and dispersed in a sparse |      5,374       19.74      100.00
----------------------------------------+-----------------------------------
                                  Total |     27,227      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(27,227 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(10,892 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(16,335 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                      rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0      2,782 |    16,335 
     Urban |     2,701      2,715      2,679      2,797          0 |    10,892 
-----------+-------------------------------------------------------+----------
     Total |     2,701      2,715      2,679      2,797      2,782 |    27,227 


Urban/rura |           rural_urban
         l | Rural tow  Rural vil  Rural vil |     Total
-----------+---------------------------------+----------
     Rural |     2,759      5,420      5,374 |    16,335 
     Urban |         0          0          0 |    10,892 
-----------+---------------------------------+----------
     Total |     2,759      5,420      5,374 |    27,227 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Historical comparator |    11,677      7,811 |    19,488 
           SARS-CoV-2 |     4,658      3,081 |     7,739 
----------------------+----------------------+----------
                Total |    16,335     10,892 |    27,227 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,772 real changes made, 2,772 to missing)

. gen     bmi = .
(27,227 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(bmi: 1664 changes made)

. recode  bmi . = 2 if body_mass_index<25
(bmi: 6094 changes made)

. recode  bmi . = 3 if body_mass_index<30
(bmi: 6268 changes made)

. recode  bmi . = 4 if body_mass_index<35
(bmi: 5562 changes made)

. recode  bmi . = 5 if body_mass_index<40
(bmi: 3250 changes made)

. recode  bmi . = 6 if body_mass_index<.
(bmi: 1617 changes made)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>            

. label values bmi bmi

. label var bmi "Body mass index (BMI)"

. safetab bmi, m
4

     Body mass index |
               (BMI) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,664        6.11        6.11
  Normal (18.5-24.9) |      6,094       22.38       28.49
Overweight (25-29.9) |      6,268       23.02       51.52
   Obese I (30-34.9) |      5,562       20.43       71.94
  Obese II (35-39.9) |      3,250       11.94       83.88
     Obese III (40+) |      1,617        5.94       89.82
                   . |      2,772       10.18      100.00
---------------------+-----------------------------------
               Total |     27,227      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(23,960 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(546 real changes made)

. replace smoking = 0 if smoking_status=="N"
(1,108 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m
8

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |      1,108        4.07        4.07
Current/former smoker |      3,813       14.00       18.07
                    . |     22,306       81.93      100.00
----------------------+-----------------------------------
                Total |     27,227      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000
> )
(12260 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(egfr_group: 14967 changes made)

. label define egfr_group 1 "105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "
> 30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m
11

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       105 |      4,850       17.81       17.81
     90-104 |      2,116        7.77       25.58
      75-89 |      1,919        7.05       32.63
      60-74 |      2,382        8.75       41.38
      45-59 |      2,379        8.74       50.12
      30-44 |      1,221        4.48       54.60
      15-29 |        100        0.37       54.97
          . |     12,260       45.03      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 1
> 5-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(12,260 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(ckd_stage: 22377 changes made)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6
>  "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m
10

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |     11,267       41.38       41.38
                      CKD 3A |      2,379        8.74       50.12
                      CKD 3B |      1,221        4.48       54.60
                       CKD 4 |        100        0.37       54.97
No baseline eGFR measurement |     12,260       45.03      100.00
-----------------------------+-----------------------------------
                       Total |     27,227      100.00

. 
. * Comorbidities
. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib
0

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,874       95.03       95.03
          1 |      1,353        4.97      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver
0

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,669       97.95       97.95
          1 |        558        2.05      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. label var diabetes "Diabetes"

. safetab diabetes
0

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,793       80.04       80.04
          1 |      5,434       19.96      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer
0

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,953       98.99       98.99
          1 |        274        1.01      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. safetab heart_failure
0

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,127       95.96       95.96
          1 |      1,100        4.04      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. safetab hiv
0

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,693       98.04       98.04
          1 |        534        1.96      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. label var hypertension "Hypertension"

. safetab hypertension
0

Hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,838       80.21       80.21
          1 |      5,389       19.79      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. label var non_haem_cancer "Cancer (non-haematological)"

. safetab non_haem_cancer
0

     Cancer |
(non-haemat |
  ological) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,708       98.09       98.09
          1 |        519        1.91      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. safetab myocardial_infarction
0

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,484       89.93       89.93
          1 |      2,743       10.07      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd
0

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,672       97.96       97.96
          1 |        555        2.04      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid
0

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,874       95.03       95.03
          1 |      1,353        4.97      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. safetab stroke
0

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,676       97.98       97.98
          1 |        551        2.02      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus
0

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,683       98.00       98.00
          1 |        544        2.00      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(1,030 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,500 real changes made)

. replace cardiovascular = 1 if pvd==1
(468 real changes made)

. replace cardiovascular = 1 if stroke==1
(436 real changes made)

. label var cardiovascular "Cardiovascular diseases"

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(523 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,307 real changes made)

. replace immunosuppressed = 1 if lupus==1
(515 real changes made)

. label var immunosuppressed "Immunosuppressive diseases"

. safetab cardiovascular
0

Cardiovascu |
        lar |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,440       78.75       78.75
          1 |      5,787       21.25      100.00
------------+-----------------------------------
      Total |     27,227      100.00

. safetab immunosuppressed
0

Immunosuppr |
     essive |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,608       90.38       90.38
          1 |      2,619        9.62      100.00
------------+-----------------------------------
      Total |     27,227      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                              
>    creatinine_mar2017 ///
>                                                                              
>    creatinine_apr2017 ///
>                                                                              
>    creatinine_may2017 ///
>                                                                              
>    creatinine_jun2017 ///
>                                                                              
>    creatinine_jul2017 ///
>                                                                              
>    creatinine_aug2017 ///
>                                                                              
>    creatinine_sep2017 ///
>                                                                              
>    creatinine_oct2017 ///
>                                                                              
>    creatinine_nov2017 ///
>                                                                              
>    creatinine_dec2017 ///
>                                                                              
>    creatinine_jan2018 ///
>                                                                              
>    creatinine_feb2018 ///
>                                                                              
>    creatinine_mar2018 ///
>                                                                              
>    creatinine_apr2018 ///
>                                                                              
>    creatinine_may2018 ///
>                                                                              
>    creatinine_jun2018 ///
>                                                                              
>    creatinine_jul2018 ///
>                                                                              
>    creatinine_aug2018 ///
>                                                                              
>    creatinine_sep2018 ///
>                                                                              
>    creatinine_oct2018 ///
>                                                                              
>    creatinine_nov2018 ///
>                                                                              
>    creatinine_dec2018 ///
>                                                                              
>    creatinine_jan2019 ///
>                                                                              
>    creatinine_feb2019 ///
>                                                                              
>    creatinine_mar2019 ///
>                                                                              
>    creatinine_apr2019 ///
>                                                                              
>    creatinine_may2019 ///
>                                                                              
>    creatinine_jun2019 ///
>                                                                              
>    creatinine_jul2019 ///
>                                                                              
>    creatinine_aug2019 ///
>                                                                              
>    creatinine_sep2019 ///
>                                                                              
>    creatinine_feb2020 ///
>                                                                              
>    creatinine_mar2020 ///
>                                                                              
>    creatinine_apr2020 ///
>                                                                              
>    creatinine_may2020 ///
>                                                                              
>    creatinine_jun2020 ///
>                                                                              
>    creatinine_jul2020 ///
>                                                                              
>    creatinine_aug2020 ///
>                                                                              
>    creatinine_sep2020 ///
>                                                                              
>    creatinine_oct2020 ///
>                                                                              
>    creatinine_nov2020 ///
>                                                                              
>    creatinine_dec2020 ///
>                                                                              
>    creatinine_jan2021 ///
>                                                                              
>    creatinine_feb2021 ///
>                                                                              
>    creatinine_mar2021 ///
>                                                                              
>    creatinine_apr2021 ///
>                                                                              
>    creatinine_may2021 ///
>                                                                              
>    creatinine_jun2021 ///
>                                                                              
>    creatinine_jul2021 ///
>                                                                              
>    creatinine_aug2021 ///
>                                                                              
>    creatinine_sep2021 ///
>                                                                              
>    creatinine_oct2021 ///
>                                                                              
>    creatinine_nov2021 ///
>                                                                              
>    creatinine_dec2021 ///
>                                                                              
>    creatinine_jan2022 ///
>                                                                              
>    creatinine_feb2022 ///
>                                                                              
>    creatinine_mar2022 ///
>                                                                              
>    creatinine_apr2022 ///
>                                                                              
>    creatinine_may2022 ///
>                                                                              
>    creatinine_jun2022 ///
>                                                                              
>    creatinine_jul2022 ///
>                                                                              
>    creatinine_aug2022 ///
>                                                                              
>    creatinine_sep2022 ///
>                                                                              
>    creatinine_oct2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 300
> 0)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex=
> =0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex=
> =1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_m
> onthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex
> ==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(8,539 real changes made, 8,539 to missing)
(16,278 missing values generated)
(27,227 missing values generated)
(5,533 real changes made)
(5,416 real changes made)
(5,533 real changes made)
(5,416 real changes made)
(6,864 real changes made)
(27,227 missing values generated)
(5,533 real changes made)
(5,416 real changes made)
(10,949 real changes made)
(20,363 real changes made)
(16,278 missing values generated)
(10,949 real changes made)
(5,533 real changes made)
(8,535 real changes made, 8,535 to missing)
(16,274 missing values generated)
(27,227 missing values generated)
(5,537 real changes made)
(5,416 real changes made)
(5,537 real changes made)
(5,416 real changes made)
(7,010 real changes made)
(27,227 missing values generated)
(5,537 real changes made)
(5,416 real changes made)
(10,953 real changes made)
(20,217 real changes made)
(16,274 missing values generated)
(10,953 real changes made)
(5,537 real changes made)
(8,551 real changes made, 8,551 to missing)
(16,290 missing values generated)
(27,227 missing values generated)
(5,599 real changes made)
(5,338 real changes made)
(5,599 real changes made)
(5,338 real changes made)
(6,973 real changes made)
(27,227 missing values generated)
(5,599 real changes made)
(5,338 real changes made)
(10,937 real changes made)
(20,254 real changes made)
(16,290 missing values generated)
(10,937 real changes made)
(5,599 real changes made)
(8,529 real changes made, 8,529 to missing)
(16,268 missing values generated)
(27,227 missing values generated)
(5,527 real changes made)
(5,432 real changes made)
(5,527 real changes made)
(5,432 real changes made)
(6,938 real changes made)
(27,227 missing values generated)
(5,527 real changes made)
(5,432 real changes made)
(10,959 real changes made)
(20,289 real changes made)
(16,268 missing values generated)
(10,959 real changes made)
(5,527 real changes made)
(8,614 real changes made, 8,614 to missing)
(16,353 missing values generated)
(27,227 missing values generated)
(5,514 real changes made)
(5,360 real changes made)
(5,514 real changes made)
(5,360 real changes made)
(6,818 real changes made)
(27,227 missing values generated)
(5,514 real changes made)
(5,360 real changes made)
(10,874 real changes made)
(20,409 real changes made)
(16,353 missing values generated)
(10,874 real changes made)
(5,514 real changes made)
(8,608 real changes made, 8,608 to missing)
(16,347 missing values generated)
(27,227 missing values generated)
(5,568 real changes made)
(5,312 real changes made)
(5,568 real changes made)
(5,312 real changes made)
(6,904 real changes made)
(27,227 missing values generated)
(5,568 real changes made)
(5,312 real changes made)
(10,880 real changes made)
(20,323 real changes made)
(16,347 missing values generated)
(10,880 real changes made)
(5,568 real changes made)
(8,498 real changes made, 8,498 to missing)
(16,237 missing values generated)
(27,227 missing values generated)
(5,541 real changes made)
(5,449 real changes made)
(5,541 real changes made)
(5,449 real changes made)
(6,900 real changes made)
(27,227 missing values generated)
(5,541 real changes made)
(5,449 real changes made)
(10,990 real changes made)
(20,327 real changes made)
(16,237 missing values generated)
(10,990 real changes made)
(5,541 real changes made)
(8,606 real changes made, 8,606 to missing)
(16,345 missing values generated)
(27,227 missing values generated)
(5,557 real changes made)
(5,325 real changes made)
(5,557 real changes made)
(5,325 real changes made)
(6,839 real changes made)
(27,227 missing values generated)
(5,557 real changes made)
(5,325 real changes made)
(10,882 real changes made)
(20,388 real changes made)
(16,345 missing values generated)
(10,882 real changes made)
(5,557 real changes made)
(8,592 real changes made, 8,592 to missing)
(16,331 missing values generated)
(27,227 missing values generated)
(5,522 real changes made)
(5,374 real changes made)
(5,522 real changes made)
(5,374 real changes made)
(6,845 real changes made)
(27,227 missing values generated)
(5,522 real changes made)
(5,374 real changes made)
(10,896 real changes made)
(20,382 real changes made)
(16,331 missing values generated)
(10,896 real changes made)
(5,522 real changes made)
(8,645 real changes made, 8,645 to missing)
(16,384 missing values generated)
(27,227 missing values generated)
(5,520 real changes made)
(5,323 real changes made)
(5,520 real changes made)
(5,323 real changes made)
(6,782 real changes made)
(27,227 missing values generated)
(5,520 real changes made)
(5,323 real changes made)
(10,843 real changes made)
(20,445 real changes made)
(16,384 missing values generated)
(10,843 real changes made)
(5,520 real changes made)
(8,553 real changes made, 8,553 to missing)
(16,292 missing values generated)
(27,227 missing values generated)
(5,602 real changes made)
(5,333 real changes made)
(5,602 real changes made)
(5,333 real changes made)
(6,939 real changes made)
(27,227 missing values generated)
(5,602 real changes made)
(5,333 real changes made)
(10,935 real changes made)
(20,288 real changes made)
(16,292 missing values generated)
(10,935 real changes made)
(5,602 real changes made)
(8,620 real changes made, 8,620 to missing)
(16,359 missing values generated)
(27,227 missing values generated)
(5,495 real changes made)
(5,373 real changes made)
(5,495 real changes made)
(5,373 real changes made)
(6,914 real changes made)
(27,227 missing values generated)
(5,495 real changes made)
(5,373 real changes made)
(10,868 real changes made)
(20,313 real changes made)
(16,359 missing values generated)
(10,868 real changes made)
(5,495 real changes made)
(8,563 real changes made, 8,563 to missing)
(16,302 missing values generated)
(27,227 missing values generated)
(5,517 real changes made)
(5,408 real changes made)
(5,517 real changes made)
(5,408 real changes made)
(6,907 real changes made)
(27,227 missing values generated)
(5,517 real changes made)
(5,408 real changes made)
(10,925 real changes made)
(20,320 real changes made)
(16,302 missing values generated)
(10,925 real changes made)
(5,517 real changes made)
(8,618 real changes made, 8,618 to missing)
(16,357 missing values generated)
(27,227 missing values generated)
(5,522 real changes made)
(5,348 real changes made)
(5,522 real changes made)
(5,348 real changes made)
(6,825 real changes made)
(27,227 missing values generated)
(5,522 real changes made)
(5,348 real changes made)
(10,870 real changes made)
(20,402 real changes made)
(16,357 missing values generated)
(10,870 real changes made)
(5,522 real changes made)
(8,592 real changes made, 8,592 to missing)
(16,331 missing values generated)
(27,227 missing values generated)
(5,532 real changes made)
(5,364 real changes made)
(5,532 real changes made)
(5,364 real changes made)
(6,918 real changes made)
(27,227 missing values generated)
(5,532 real changes made)
(5,364 real changes made)
(10,896 real changes made)
(20,309 real changes made)
(16,331 missing values generated)
(10,896 real changes made)
(5,532 real changes made)
(8,620 real changes made, 8,620 to missing)
(16,359 missing values generated)
(27,227 missing values generated)
(5,503 real changes made)
(5,365 real changes made)
(5,503 real changes made)
(5,365 real changes made)
(6,876 real changes made)
(27,227 missing values generated)
(5,503 real changes made)
(5,365 real changes made)
(10,868 real changes made)
(20,351 real changes made)
(16,359 missing values generated)
(10,868 real changes made)
(5,503 real changes made)
(8,565 real changes made, 8,565 to missing)
(16,304 missing values generated)
(27,227 missing values generated)
(5,569 real changes made)
(5,354 real changes made)
(5,569 real changes made)
(5,354 real changes made)
(6,919 real changes made)
(27,227 missing values generated)
(5,569 real changes made)
(5,354 real changes made)
(10,923 real changes made)
(20,308 real changes made)
(16,304 missing values generated)
(10,923 real changes made)
(5,569 real changes made)
(8,583 real changes made, 8,583 to missing)
(16,322 missing values generated)
(27,227 missing values generated)
(5,536 real changes made)
(5,369 real changes made)
(5,536 real changes made)
(5,369 real changes made)
(6,863 real changes made)
(27,227 missing values generated)
(5,536 real changes made)
(5,369 real changes made)
(10,905 real changes made)
(20,364 real changes made)
(16,322 missing values generated)
(10,905 real changes made)
(5,536 real changes made)
(8,538 real changes made, 8,538 to missing)
(16,277 missing values generated)
(27,227 missing values generated)
(5,592 real changes made)
(5,358 real changes made)
(5,592 real changes made)
(5,358 real changes made)
(6,971 real changes made)
(27,227 missing values generated)
(5,592 real changes made)
(5,358 real changes made)
(10,950 real changes made)
(20,256 real changes made)
(16,277 missing values generated)
(10,950 real changes made)
(5,592 real changes made)
(8,563 real changes made, 8,563 to missing)
(16,302 missing values generated)
(27,227 missing values generated)
(5,580 real changes made)
(5,345 real changes made)
(5,580 real changes made)
(5,345 real changes made)
(6,990 real changes made)
(27,227 missing values generated)
(5,580 real changes made)
(5,345 real changes made)
(10,925 real changes made)
(20,237 real changes made)
(16,302 missing values generated)
(10,925 real changes made)
(5,580 real changes made)
(8,602 real changes made, 8,602 to missing)
(16,341 missing values generated)
(27,227 missing values generated)
(5,528 real changes made)
(5,358 real changes made)
(5,528 real changes made)
(5,358 real changes made)
(6,996 real changes made)
(27,227 missing values generated)
(5,528 real changes made)
(5,358 real changes made)
(10,886 real changes made)
(20,231 real changes made)
(16,341 missing values generated)
(10,886 real changes made)
(5,528 real changes made)
(8,630 real changes made, 8,630 to missing)
(16,369 missing values generated)
(27,227 missing values generated)
(5,489 real changes made)
(5,369 real changes made)
(5,489 real changes made)
(5,369 real changes made)
(6,946 real changes made)
(27,227 missing values generated)
(5,489 real changes made)
(5,369 real changes made)
(10,858 real changes made)
(20,281 real changes made)
(16,369 missing values generated)
(10,858 real changes made)
(5,489 real changes made)
(8,587 real changes made, 8,587 to missing)
(16,326 missing values generated)
(27,227 missing values generated)
(5,480 real changes made)
(5,421 real changes made)
(5,480 real changes made)
(5,421 real changes made)
(6,837 real changes made)
(27,227 missing values generated)
(5,480 real changes made)
(5,421 real changes made)
(10,901 real changes made)
(20,390 real changes made)
(16,326 missing values generated)
(10,901 real changes made)
(5,480 real changes made)
(8,622 real changes made, 8,622 to missing)
(16,361 missing values generated)
(27,227 missing values generated)
(5,502 real changes made)
(5,364 real changes made)
(5,502 real changes made)
(5,364 real changes made)
(6,830 real changes made)
(27,227 missing values generated)
(5,502 real changes made)
(5,364 real changes made)
(10,866 real changes made)
(20,397 real changes made)
(16,361 missing values generated)
(10,866 real changes made)
(5,502 real changes made)
(8,643 real changes made, 8,643 to missing)
(16,382 missing values generated)
(27,227 missing values generated)
(5,558 real changes made)
(5,287 real changes made)
(5,558 real changes made)
(5,287 real changes made)
(6,913 real changes made)
(27,227 missing values generated)
(5,558 real changes made)
(5,287 real changes made)
(10,845 real changes made)
(20,314 real changes made)
(16,382 missing values generated)
(10,845 real changes made)
(5,558 real changes made)
(8,593 real changes made, 8,593 to missing)
(16,332 missing values generated)
(27,227 missing values generated)
(5,529 real changes made)
(5,366 real changes made)
(5,529 real changes made)
(5,366 real changes made)
(6,887 real changes made)
(27,227 missing values generated)
(5,529 real changes made)
(5,366 real changes made)
(10,895 real changes made)
(20,340 real changes made)
(16,332 missing values generated)
(10,895 real changes made)
(5,529 real changes made)
(8,604 real changes made, 8,604 to missing)
(16,343 missing values generated)
(27,227 missing values generated)
(5,513 real changes made)
(5,371 real changes made)
(5,513 real changes made)
(5,371 real changes made)
(6,866 real changes made)
(27,227 missing values generated)
(5,513 real changes made)
(5,371 real changes made)
(10,884 real changes made)
(20,361 real changes made)
(16,343 missing values generated)
(10,884 real changes made)
(5,513 real changes made)
(8,546 real changes made, 8,546 to missing)
(16,285 missing values generated)
(27,227 missing values generated)
(5,561 real changes made)
(5,381 real changes made)
(5,561 real changes made)
(5,381 real changes made)
(6,818 real changes made)
(27,227 missing values generated)
(5,561 real changes made)
(5,381 real changes made)
(10,942 real changes made)
(20,409 real changes made)
(16,285 missing values generated)
(10,942 real changes made)
(5,561 real changes made)
(8,476 real changes made, 8,476 to missing)
(16,215 missing values generated)
(27,227 missing values generated)
(5,577 real changes made)
(5,435 real changes made)
(5,577 real changes made)
(5,435 real changes made)
(6,971 real changes made)
(27,227 missing values generated)
(5,577 real changes made)
(5,435 real changes made)
(11,012 real changes made)
(20,256 real changes made)
(16,215 missing values generated)
(11,012 real changes made)
(5,577 real changes made)
(8,581 real changes made, 8,581 to missing)
(16,320 missing values generated)
(27,227 missing values generated)
(5,506 real changes made)
(5,401 real changes made)
(5,506 real changes made)
(5,401 real changes made)
(6,938 real changes made)
(27,227 missing values generated)
(5,506 real changes made)
(5,401 real changes made)
(10,907 real changes made)
(20,289 real changes made)
(16,320 missing values generated)
(10,907 real changes made)
(5,506 real changes made)
(8,543 real changes made, 8,543 to missing)
(16,282 missing values generated)
(27,227 missing values generated)
(5,524 real changes made)
(5,421 real changes made)
(5,524 real changes made)
(5,421 real changes made)
(6,989 real changes made)
(27,227 missing values generated)
(5,524 real changes made)
(5,421 real changes made)
(10,945 real changes made)
(20,238 real changes made)
(16,282 missing values generated)
(10,945 real changes made)
(5,524 real changes made)
(8,616 real changes made, 8,616 to missing)
(16,355 missing values generated)
(27,227 missing values generated)
(5,547 real changes made)
(5,325 real changes made)
(5,547 real changes made)
(5,325 real changes made)
(6,993 real changes made)
(27,227 missing values generated)
(5,547 real changes made)
(5,325 real changes made)
(10,872 real changes made)
(20,234 real changes made)
(16,355 missing values generated)
(10,872 real changes made)
(5,547 real changes made)
(3,365 real changes made, 3,365 to missing)
(22,853 missing values generated)
(27,227 missing values generated)
(2,247 real changes made)
(2,127 real changes made)
(2,247 real changes made)
(2,127 real changes made)
(2,795 real changes made)
(27,227 missing values generated)
(2,247 real changes made)
(2,127 real changes made)
(4,374 real changes made)
(24,432 real changes made)
(22,853 missing values generated)
(4,374 real changes made)
(2,247 real changes made)
(3,415 real changes made, 3,415 to missing)
(22,903 missing values generated)
(27,227 missing values generated)
(2,170 real changes made)
(2,154 real changes made)
(2,170 real changes made)
(2,154 real changes made)
(2,714 real changes made)
(27,227 missing values generated)
(2,170 real changes made)
(2,154 real changes made)
(4,324 real changes made)
(24,513 real changes made)
(22,903 missing values generated)
(4,324 real changes made)
(2,170 real changes made)
(3,388 real changes made, 3,388 to missing)
(22,876 missing values generated)
(27,227 missing values generated)
(2,212 real changes made)
(2,139 real changes made)
(2,212 real changes made)
(2,139 real changes made)
(2,686 real changes made)
(27,227 missing values generated)
(2,212 real changes made)
(2,139 real changes made)
(4,351 real changes made)
(24,541 real changes made)
(22,876 missing values generated)
(4,351 real changes made)
(2,212 real changes made)
(3,456 real changes made, 3,456 to missing)
(22,944 missing values generated)
(27,227 missing values generated)
(2,152 real changes made)
(2,131 real changes made)
(2,152 real changes made)
(2,131 real changes made)
(2,735 real changes made)
(27,227 missing values generated)
(2,152 real changes made)
(2,131 real changes made)
(4,283 real changes made)
(24,492 real changes made)
(22,944 missing values generated)
(4,283 real changes made)
(2,152 real changes made)
(3,380 real changes made, 3,380 to missing)
(22,868 missing values generated)
(27,227 missing values generated)
(2,184 real changes made)
(2,175 real changes made)
(2,184 real changes made)
(2,175 real changes made)
(2,777 real changes made)
(27,227 missing values generated)
(2,184 real changes made)
(2,175 real changes made)
(4,359 real changes made)
(24,450 real changes made)
(22,868 missing values generated)
(4,359 real changes made)
(2,184 real changes made)
(3,425 real changes made, 3,425 to missing)
(22,913 missing values generated)
(27,227 missing values generated)
(2,213 real changes made)
(2,101 real changes made)
(2,213 real changes made)
(2,101 real changes made)
(2,733 real changes made)
(27,227 missing values generated)
(2,213 real changes made)
(2,101 real changes made)
(4,314 real changes made)
(24,494 real changes made)
(22,913 missing values generated)
(4,314 real changes made)
(2,213 real changes made)
(3,436 real changes made, 3,436 to missing)
(22,924 missing values generated)
(27,227 missing values generated)
(2,143 real changes made)
(2,160 real changes made)
(2,143 real changes made)
(2,160 real changes made)
(2,723 real changes made)
(27,227 missing values generated)
(2,143 real changes made)
(2,160 real changes made)
(4,303 real changes made)
(24,504 real changes made)
(22,924 missing values generated)
(4,303 real changes made)
(2,143 real changes made)
(3,439 real changes made, 3,439 to missing)
(22,927 missing values generated)
(27,227 missing values generated)
(2,159 real changes made)
(2,141 real changes made)
(2,159 real changes made)
(2,141 real changes made)
(2,708 real changes made)
(27,227 missing values generated)
(2,159 real changes made)
(2,141 real changes made)
(4,300 real changes made)
(24,519 real changes made)
(22,927 missing values generated)
(4,300 real changes made)
(2,159 real changes made)
(3,392 real changes made, 3,392 to missing)
(22,880 missing values generated)
(27,227 missing values generated)
(2,184 real changes made)
(2,163 real changes made)
(2,184 real changes made)
(2,163 real changes made)
(2,779 real changes made)
(27,227 missing values generated)
(2,184 real changes made)
(2,163 real changes made)
(4,347 real changes made)
(24,448 real changes made)
(22,880 missing values generated)
(4,347 real changes made)
(2,184 real changes made)
(3,404 real changes made, 3,404 to missing)
(22,892 missing values generated)
(27,227 missing values generated)
(2,224 real changes made)
(2,111 real changes made)
(2,224 real changes made)
(2,111 real changes made)
(2,786 real changes made)
(27,227 missing values generated)
(2,224 real changes made)
(2,111 real changes made)
(4,335 real changes made)
(24,441 real changes made)
(22,892 missing values generated)
(4,335 real changes made)
(2,224 real changes made)
(3,388 real changes made, 3,388 to missing)
(22,876 missing values generated)
(27,227 missing values generated)
(2,228 real changes made)
(2,123 real changes made)
(2,228 real changes made)
(2,123 real changes made)
(2,745 real changes made)
(27,227 missing values generated)
(2,228 real changes made)
(2,123 real changes made)
(4,351 real changes made)
(24,482 real changes made)
(22,876 missing values generated)
(4,351 real changes made)
(2,228 real changes made)
(3,409 real changes made, 3,409 to missing)
(22,897 missing values generated)
(27,227 missing values generated)
(2,163 real changes made)
(2,167 real changes made)
(2,163 real changes made)
(2,167 real changes made)
(2,721 real changes made)
(27,227 missing values generated)
(2,163 real changes made)
(2,167 real changes made)
(4,330 real changes made)
(24,506 real changes made)
(22,897 missing values generated)
(4,330 real changes made)
(2,163 real changes made)
(3,399 real changes made, 3,399 to missing)
(22,887 missing values generated)
(27,227 missing values generated)
(2,203 real changes made)
(2,137 real changes made)
(2,203 real changes made)
(2,137 real changes made)
(2,730 real changes made)
(27,227 missing values generated)
(2,203 real changes made)
(2,137 real changes made)
(4,340 real changes made)
(24,497 real changes made)
(22,887 missing values generated)
(4,340 real changes made)
(2,203 real changes made)
(3,433 real changes made, 3,433 to missing)
(22,921 missing values generated)
(27,227 missing values generated)
(2,183 real changes made)
(2,123 real changes made)
(2,183 real changes made)
(2,123 real changes made)
(2,763 real changes made)
(27,227 missing values generated)
(2,183 real changes made)
(2,123 real changes made)
(4,306 real changes made)
(24,464 real changes made)
(22,921 missing values generated)
(4,306 real changes made)
(2,183 real changes made)
(3,421 real changes made, 3,421 to missing)
(22,909 missing values generated)
(27,227 missing values generated)
(2,185 real changes made)
(2,133 real changes made)
(2,185 real changes made)
(2,133 real changes made)
(2,756 real changes made)
(27,227 missing values generated)
(2,185 real changes made)
(2,133 real changes made)
(4,318 real changes made)
(24,471 real changes made)
(22,909 missing values generated)
(4,318 real changes made)
(2,185 real changes made)
(3,436 real changes made, 3,436 to missing)
(22,924 missing values generated)
(27,227 missing values generated)
(2,192 real changes made)
(2,111 real changes made)
(2,192 real changes made)
(2,111 real changes made)
(2,728 real changes made)
(27,227 missing values generated)
(2,192 real changes made)
(2,111 real changes made)
(4,303 real changes made)
(24,499 real changes made)
(22,924 missing values generated)
(4,303 real changes made)
(2,192 real changes made)
(3,386 real changes made, 3,386 to missing)
(22,874 missing values generated)
(27,227 missing values generated)
(2,178 real changes made)
(2,175 real changes made)
(2,178 real changes made)
(2,175 real changes made)
(2,716 real changes made)
(27,227 missing values generated)
(2,178 real changes made)
(2,175 real changes made)
(4,353 real changes made)
(24,511 real changes made)
(22,874 missing values generated)
(4,353 real changes made)
(2,178 real changes made)
(3,425 real changes made, 3,425 to missing)
(22,913 missing values generated)
(27,227 missing values generated)
(2,193 real changes made)
(2,121 real changes made)
(2,193 real changes made)
(2,121 real changes made)
(2,711 real changes made)
(27,227 missing values generated)
(2,193 real changes made)
(2,121 real changes made)
(4,314 real changes made)
(24,516 real changes made)
(22,913 missing values generated)
(4,314 real changes made)
(2,193 real changes made)
(3,405 real changes made, 3,405 to missing)
(22,893 missing values generated)
(27,227 missing values generated)
(2,179 real changes made)
(2,155 real changes made)
(2,179 real changes made)
(2,155 real changes made)
(2,740 real changes made)
(27,227 missing values generated)
(2,179 real changes made)
(2,155 real changes made)
(4,334 real changes made)
(24,487 real changes made)
(22,893 missing values generated)
(4,334 real changes made)
(2,179 real changes made)
(3,364 real changes made, 3,364 to missing)
(22,852 missing values generated)
(27,227 missing values generated)
(2,221 real changes made)
(2,154 real changes made)
(2,221 real changes made)
(2,154 real changes made)
(2,714 real changes made)
(27,227 missing values generated)
(2,221 real changes made)
(2,154 real changes made)
(4,375 real changes made)
(24,513 real changes made)
(22,852 missing values generated)
(4,375 real changes made)
(2,221 real changes made)
(3,487 real changes made, 3,487 to missing)
(22,975 missing values generated)
(27,227 missing values generated)
(2,158 real changes made)
(2,094 real changes made)
(2,158 real changes made)
(2,094 real changes made)
(2,680 real changes made)
(27,227 missing values generated)
(2,158 real changes made)
(2,094 real changes made)
(4,252 real changes made)
(24,547 real changes made)
(22,975 missing values generated)
(4,252 real changes made)
(2,158 real changes made)
(3,392 real changes made, 3,392 to missing)
(22,880 missing values generated)
(27,227 missing values generated)
(2,180 real changes made)
(2,167 real changes made)
(2,180 real changes made)
(2,167 real changes made)
(2,764 real changes made)
(27,227 missing values generated)
(2,180 real changes made)
(2,167 real changes made)
(4,347 real changes made)
(24,463 real changes made)
(22,880 missing values generated)
(4,347 real changes made)
(2,180 real changes made)
(3,350 real changes made, 3,350 to missing)
(22,838 missing values generated)
(27,227 missing values generated)
(2,246 real changes made)
(2,143 real changes made)
(2,246 real changes made)
(2,143 real changes made)
(2,772 real changes made)
(27,227 missing values generated)
(2,246 real changes made)
(2,143 real changes made)
(4,389 real changes made)
(24,455 real changes made)
(22,838 missing values generated)
(4,389 real changes made)
(2,246 real changes made)
(3,423 real changes made, 3,423 to missing)
(22,911 missing values generated)
(27,227 missing values generated)
(2,181 real changes made)
(2,135 real changes made)
(2,181 real changes made)
(2,135 real changes made)
(2,765 real changes made)
(27,227 missing values generated)
(2,181 real changes made)
(2,135 real changes made)
(4,316 real changes made)
(24,462 real changes made)
(22,911 missing values generated)
(4,316 real changes made)
(2,181 real changes made)
(3,358 real changes made, 3,358 to missing)
(22,846 missing values generated)
(27,227 missing values generated)
(2,213 real changes made)
(2,168 real changes made)
(2,213 real changes made)
(2,168 real changes made)
(2,769 real changes made)
(27,227 missing values generated)
(2,213 real changes made)
(2,168 real changes made)
(4,381 real changes made)
(24,458 real changes made)
(22,846 missing values generated)
(4,381 real changes made)
(2,213 real changes made)
(3,433 real changes made, 3,433 to missing)
(22,921 missing values generated)
(27,227 missing values generated)
(2,171 real changes made)
(2,135 real changes made)
(2,171 real changes made)
(2,135 real changes made)
(2,688 real changes made)
(27,227 missing values generated)
(2,171 real changes made)
(2,135 real changes made)
(4,306 real changes made)
(24,539 real changes made)
(22,921 missing values generated)
(4,306 real changes made)
(2,171 real changes made)
(3,370 real changes made, 3,370 to missing)
(22,858 missing values generated)
(27,227 missing values generated)
(2,206 real changes made)
(2,163 real changes made)
(2,206 real changes made)
(2,163 real changes made)
(2,726 real changes made)
(27,227 missing values generated)
(2,206 real changes made)
(2,163 real changes made)
(4,369 real changes made)
(24,501 real changes made)
(22,858 missing values generated)
(4,369 real changes made)
(2,206 real changes made)
(3,387 real changes made, 3,387 to missing)
(22,875 missing values generated)
(27,227 missing values generated)
(2,194 real changes made)
(2,158 real changes made)
(2,194 real changes made)
(2,158 real changes made)
(2,729 real changes made)
(27,227 missing values generated)
(2,194 real changes made)
(2,158 real changes made)
(4,352 real changes made)
(24,498 real changes made)
(22,875 missing values generated)
(4,352 real changes made)
(2,194 real changes made)
(3,442 real changes made, 3,442 to missing)
(22,930 missing values generated)
(27,227 missing values generated)
(2,145 real changes made)
(2,152 real changes made)
(2,145 real changes made)
(2,152 real changes made)
(2,766 real changes made)
(27,227 missing values generated)
(2,145 real changes made)
(2,152 real changes made)
(4,297 real changes made)
(24,461 real changes made)
(22,930 missing values generated)
(4,297 real changes made)
(2,145 real changes made)
(3,414 real changes made, 3,414 to missing)
(22,902 missing values generated)
(27,227 missing values generated)
(2,146 real changes made)
(2,179 real changes made)
(2,146 real changes made)
(2,179 real changes made)
(2,714 real changes made)
(27,227 missing values generated)
(2,146 real changes made)
(2,179 real changes made)
(4,325 real changes made)
(24,513 real changes made)
(22,902 missing values generated)
(4,325 real changes made)
(2,146 real changes made)
(3,418 real changes made, 3,418 to missing)
(22,906 missing values generated)
(27,227 missing values generated)
(2,201 real changes made)
(2,120 real changes made)
(2,201 real changes made)
(2,120 real changes made)
(2,724 real changes made)
(27,227 missing values generated)
(2,201 real changes made)
(2,120 real changes made)
(4,321 real changes made)
(24,503 real changes made)
(22,906 missing values generated)
(4,321 real changes made)
(2,201 real changes made)
(3,400 real changes made, 3,400 to missing)
(22,888 missing values generated)
(27,227 missing values generated)
(2,185 real changes made)
(2,154 real changes made)
(2,185 real changes made)
(2,154 real changes made)
(2,756 real changes made)
(27,227 missing values generated)
(2,185 real changes made)
(2,154 real changes made)
(4,339 real changes made)
(24,471 real changes made)
(22,888 missing values generated)
(4,339 real changes made)
(2,185 real changes made)
(3,423 real changes made, 3,423 to missing)
(22,911 missing values generated)
(27,227 missing values generated)
(2,200 real changes made)
(2,116 real changes made)
(2,200 real changes made)
(2,116 real changes made)
(2,747 real changes made)
(27,227 missing values generated)
(2,200 real changes made)
(2,116 real changes made)
(4,316 real changes made)
(24,480 real changes made)
(22,911 missing values generated)
(4,316 real changes made)
(2,200 real changes made)

. 
. replace index_date = index_date_28
(27,227 real changes made)

. drop index_date_28

. gen egfr15_date=.
(27,227 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatin
> ine_`x'<15 & date("01`x'", "DMY")>index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen index_date_esrd = index_date

. gen esrd_date = egfr15_date
(27,227 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if esrd_date==.
(2,680 real changes made)

. gen esrd = 0

. replace esrd = 1 if esrd_date!=.
(2,680 real changes made)

. label var esrd "Kidney failure"

. gen esrd_time = (esrd_date - index_date_esrd)
(24,547 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(24,547 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(esrd_time_cat: 2676 changes made)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"           
>            ///
>                                                         3 "1 to 28 days"     
>    ///
>                                                         4 "20 to 90 days"    
>    ///
>                                                         5 "91 to 180 days"   
>    ///
>                                                         6 "181 to 365 days"  
>    ///
>                                                         7 "366 to 730 days"  
>    ///
>                                                         8 "731 to 973 days"  
>    ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 covid_severit
> y  ///
>                                                                 covid_aki    
>            {
  2.                                                                 by `exposu
> re',sort: sum esrd_time, de
  3.                                                                 tab esrd_t
> ime_cat `exposure', m col chi
  4.                                                                 }

-------------------------------------------------------------------------------
-> case = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            5              1
10%           33              1       Obs               1,926
25%          146              1       Sum of Wgt.       1,926

50%          345                      Mean           368.3951
                        Largest       Std. Dev.      258.7314
75%          570            963
90%          741            968       Variance       66941.93
95%          817            974       Skewness       .3320581
99%          921            978       Kurtosis       2.036181

-------------------------------------------------------------------------------
-> case = SARS-CoV-2

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           10              1
10%           35              1       Obs                 754
25%          142              1       Sum of Wgt.         754

50%          322                      Mean           358.1936
                        Largest       Std. Dev.      252.7035
75%          552            908
90%          725            912       Variance       63859.04
95%          817            935       Skewness       .3695984
99%          896            948       Kurtosis       2.075365


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Historica  SARS-CoV- |     Total
----------------+----------------------+----------
   1 to 28 days |       170         64 |       234 
                |      0.87       0.83 |      0.86 
----------------+----------------------+----------
  20 to 90 days |       181         73 |       254 
                |      0.93       0.94 |      0.93 
----------------+----------------------+----------
 91 to 180 days |       230         92 |       322 
                |      1.18       1.19 |      1.18 
----------------+----------------------+----------
181 to 365 days |       431        181 |       612 
                |      2.21       2.34 |      2.25 
----------------+----------------------+----------
366 to 730 days |       703        272 |       975 
                |      3.61       3.51 |      3.58 
----------------+----------------------+----------
731 to 973 days |       209         72 |       281 
                |      1.07       0.93 |      1.03 
----------------+----------------------+----------
      >973 days |         2          0 |         2 
                |      0.01       0.00 |      0.01 
----------------+----------------------+----------
              . |    17,562      6,985 |    24,547 
                |     90.12      90.26 |     90.16 
----------------+----------------------+----------
          Total |    19,488      7,739 |    27,227 
                |    100.00     100.00 |    100.00 

          Pearson chi2(7) =   2.5701   Pr = 0.922

-------------------------------------------------------------------------------
-> covid_severity = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            5              1
10%           33              1       Obs               1,926
25%          146              1       Sum of Wgt.       1,926

50%          345                      Mean           368.3951
                        Largest       Std. Dev.      258.7314
75%          570            963
90%          741            968       Variance       66941.93
95%          817            974       Skewness       .3320581
99%          921            978       Kurtosis       2.036181

-------------------------------------------------------------------------------
-> covid_severity = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           12              1
10%         35.5              1       Obs                 610
25%          138              1       Sum of Wgt.         610

50%        313.5                      Mean           354.8754
                        Largest       Std. Dev.      253.1475
75%          549            908
90%        727.5            912       Variance       64083.67
95%          815            935       Skewness       .3930829
99%          894            948       Kurtosis         2.0771

-------------------------------------------------------------------------------
-> covid_severity = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           43              1       Obs                  63
25%          176              1       Sum of Wgt.          63

50%          328                      Mean           354.2222
                        Largest       Std. Dev.       232.394
75%          537            743
90%          670            772       Variance       54006.98
95%          743            809       Skewness       .2569626
99%          840            840       Kurtosis       2.102159

-------------------------------------------------------------------------------
-> covid_severity = Critical care COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            9              1
10%           24              1       Obs                  81
25%          166              1       Sum of Wgt.          81

50%          369                      Mean           386.2716
                        Largest       Std. Dev.      265.4925
75%          556            882
90%          725            890       Variance       70486.25
95%          856            896       Skewness       .2427392
99%          898            898       Kurtosis       2.008543


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |             SARS-CoV-2 severity
  esrd_time_cat | Historica  Non-hospi  Hospitali  Critical  |     Total
----------------+--------------------------------------------+----------
   1 to 28 days |       170         49          6          9 |       234 
                |      0.87       0.78       0.85       1.16 |      0.86 
----------------+--------------------------------------------+----------
  20 to 90 days |       181         63          4          6 |       254 
                |      0.93       1.01       0.57       0.77 |      0.93 
----------------+--------------------------------------------+----------
 91 to 180 days |       230         79          7          6 |       322 
                |      1.18       1.26       1.00       0.77 |      1.18 
----------------+--------------------------------------------+----------
181 to 365 days |       431        144         18         19 |       612 
                |      2.21       2.30       2.56       2.45 |      2.25 
----------------+--------------------------------------------+----------
366 to 730 days |       703        215         24         33 |       975 
                |      3.61       3.43       3.42       4.25 |      3.58 
----------------+--------------------------------------------+----------
731 to 973 days |       209         60          4          8 |       281 
                |      1.07       0.96       0.57       1.03 |      1.03 
----------------+--------------------------------------------+----------
      >973 days |         2          0          0          0 |         2 
                |      0.01       0.00       0.00       0.00 |      0.01 
----------------+--------------------------------------------+----------
              . |    17,562      5,650        639        696 |    24,547 
                |     90.12      90.26      91.03      89.58 |     90.16 
----------------+--------------------------------------------+----------
          Total |    19,488      6,260        702        777 |    27,227 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(21) =   9.5394   Pr = 0.984

-------------------------------------------------------------------------------
-> covid_aki = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            5              1
10%           33              1       Obs               1,926
25%          146              1       Sum of Wgt.       1,926

50%          345                      Mean           368.3951
                        Largest       Std. Dev.      258.7314
75%          570            963
90%          741            968       Variance       66941.93
95%          817            974       Skewness       .3320581
99%          921            978       Kurtosis       2.036181

-------------------------------------------------------------------------------
-> covid_aki = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           10              1
10%           34              1       Obs                 647
25%          131              1       Sum of Wgt.         647

50%          308                      Mean           349.8594
                        Largest       Std. Dev.      253.7311
75%          544            901
90%          725            912       Variance       64379.47
95%          813            935       Skewness       .4163773
99%          894            948       Kurtosis       2.091502

-------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            2              1
10%           48              1       Obs                  65
25%          205              2       Sum of Wgt.          65

50%          340                      Mean              359.2
                        Largest       Std. Dev.      221.0139
75%          537            743
90%          668            772       Variance       48847.13
95%          743            809       Skewness       .2170085
99%          840            840       Kurtosis       2.223092

-------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID-AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           49              1
10%          114             49       Obs                  42
25%          284            104       Sum of Wgt.          42

50%          494                      Mean           485.0238
                        Largest       Std. Dev.      254.2271
75%          662            861
90%          822            865       Variance       64631.44
95%          865            898       Skewness      -.1715255
99%          908            908       Kurtosis       2.144531


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |        COVID-19 acute kidney injury
  esrd_time_cat | Historica  Non-hospi  Hospitali  Hospitali |     Total
----------------+--------------------------------------------+----------
   1 to 28 days |       170         57          5          2 |       234 
                |      0.87       0.86       0.67       0.54 |      0.86 
----------------+--------------------------------------------+----------
  20 to 90 days |       181         68          4          1 |       254 
                |      0.93       1.03       0.54       0.27 |      0.93 
----------------+--------------------------------------------+----------
 91 to 180 days |       230         83          6          3 |       322 
                |      1.18       1.25       0.80       0.81 |      1.18 
----------------+--------------------------------------------+----------
181 to 365 days |       431        155         20          6 |       612 
                |      2.21       2.34       2.68       1.62 |      2.25 
----------------+--------------------------------------------+----------
366 to 730 days |       703        223         26         23 |       975 
                |      3.61       3.37       3.48       6.20 |      3.58 
----------------+--------------------------------------------+----------
731 to 973 days |       209         61          4          7 |       281 
                |      1.07       0.92       0.54       1.89 |      1.03 
----------------+--------------------------------------------+----------
      >973 days |         2          0          0          0 |         2 
                |      0.01       0.00       0.00       0.00 |      0.01 
----------------+--------------------------------------------+----------
              . |    17,562      5,974        682        329 |    24,547 
                |     90.12      90.23      91.30      88.68 |     90.16 
----------------+--------------------------------------------+----------
          Total |    19,488      6,621        747        371 |    27,227 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(21) =  22.2178   Pr = 0.387

. gen exit_date_esrd = esrd_date
(24,547 missing values generated)

. format exit_date_esrd %td

. gen end_date = date("2022-11-30", "YMD") if case==1
(19,488 missing values generated)

. replace end_date = date("2019-11-30", "YMD") if case==0
(19,488 real changes made)

. format end_date %td

. replace exit_date_esrd = min(deregistered_date, death_date, end_date) if esrd
> _date==.
(24,547 real changes made)

. gen esrd_denominator = 1

. gen follow_up_time_esrd = (exit_date_esrd - index_date_esrd)

. label var follow_up_time_esrd "Follow-up time (Days)"

. gen follow_up_cat_esrd = follow_up_time_esrd

. recode follow_up_cat_esrd       min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0=3                     ///
>                                                 1/365=4         ///
>                                                 366/730=5       ///
>                                                 731/1040=6      ///          
>                            
>                                                 1041/max=7
(follow_up_cat_esrd: 27219 changes made)

. label define follow_up_cat_esrd         1 "<-29 days"   ///
>                                                         2 "-28 to -1 days"   
>            ///
>                                                         3 "0 days"           
>                    ///
>                                                         4 "1 to 365 days"    
>            ///
>                                                         5 "366 to 730 days"  
>    ///
>                                                         6 "731 to 1040 days" 
>    ///
>                                                         7 ">1040 days"

. label values follow_up_cat_esrd follow_up_cat_esrd

. label var follow_up_cat_esrd "Follow_up time"

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,659      6,980      7,849 |    19,488 
           SARS-CoV-2 |     1,873      2,822      3,044 |     7,739 
----------------------+---------------------------------+----------
                Total |     6,532      9,802     10,893 |    27,227 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |          Follow_up time
  replacement therapy | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,659      6,980      7,849 |    19,488 
Non-hospitalised SARS |     1,550      2,307      2,456 |     6,313 
No KRT hospitalised C |       167        252        287 |       706 
KRT hospitalised COVI |       156        263        301 |       720 
----------------------+---------------------------------+----------
                Total |     6,532      9,802     10,893 |    27,227 

. drop if follow_up_time_esrd<1
(0 observations deleted)

. drop if follow_up_time_esrd>1040
(0 observations deleted)

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,659      6,980      7,849 |    19,488 
           SARS-CoV-2 |     1,873      2,822      3,044 |     7,739 
----------------------+---------------------------------+----------
                Total |     6,532      9,802     10,893 |    27,227 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |          Follow_up time
  replacement therapy | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,659      6,980      7,849 |    19,488 
Non-hospitalised SARS |     1,550      2,307      2,456 |     6,313 
No KRT hospitalised C |       167        252        287 |       706 
KRT hospitalised COVI |       156        263        301 |       720 
----------------------+---------------------------------+----------
                Total |     6,532      9,802     10,893 |    27,227 

. gen follow_up_years_esrd = follow_up_time_esrd/365.25

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(27,227 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_h
> alf_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>ind
> ex_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(36 real changes made)
(78 real changes made)
(93 real changes made)
(137 real changes made)
(149 real changes made)
(157 real changes made)
(189 real changes made)
(165 real changes made)
(190 real changes made)
(171 real changes made)
(163 real changes made)
(196 real changes made)
(181 real changes made)
(170 real changes made)
(183 real changes made)
(189 real changes made)
(173 real changes made)
(166 real changes made)
(167 real changes made)
(147 real changes made)
(164 real changes made)
(135 real changes made)
(143 real changes made)
(142 real changes made)
(148 real changes made)
(134 real changes made)
(120 real changes made)
(135 real changes made)
(124 real changes made)
(130 real changes made)
(0 real changes made)
(0 real changes made)
(17 real changes made)
(35 real changes made)
(46 real changes made)
(33 real changes made)
(51 real changes made)
(58 real changes made)
(69 real changes made)
(55 real changes made)
(68 real changes made)
(68 real changes made)
(84 real changes made)
(79 real changes made)
(82 real changes made)
(68 real changes made)
(69 real changes made)
(70 real changes made)
(61 real changes made)
(73 real changes made)
(54 real changes made)
(68 real changes made)
(64 real changes made)
(66 real changes made)
(61 real changes made)
(64 real changes made)
(61 real changes made)
(61 real changes made)
(53 real changes made)
(61 real changes made)
(59 real changes made)
(47 real changes made)
(60 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(1,984 real changes made)

. gen egfr_half = 0

. replace egfr_half = 1 if egfr_half_date!=.
(8,324 real changes made)

. label var egfr_half "50% reduction in eGFR"

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(12,260 real changes made, 12,260 to missing)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(18,903 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date) if e
> gfr_half_date==. & index_date_egfr_half!=.
(7,826 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(12,260 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days
> )"

. gen egfr_half_denominator = 0

. replace egfr_half_denominator = 1 if index_date_egfr_half!=.
(14,967 real changes made)

. gen follow_up_years_egfr_half = follow_up_time_egfr_half/365.25
(12,260 missing values generated)

. 
. * AKI (or ESRD)
. gen index_date_aki = index_date

. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(24,500 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(2,412 real changes made)

. gen aki = 0

. replace aki = 1 if aki_date!=.
(5,139 real changes made)

. label var aki "Acute kidney injury"

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(22,088 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date)  if aki_da
> te==.
(22,088 real changes made)

. gen aki_denominator = 1

. gen follow_up_time_aki = (exit_date_aki - index_date_aki)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. gen follow_up_years_aki = follow_up_time_aki/365.25

. 
. * Exit date (death)
. gen index_date_death = index_date

. gen exit_date_death = death_date
(25,546 missing values generated)

. gen death = 0

. replace death = 1 if death_date!=.
(1,681 real changes made)

. label var death "Death"

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(25,546 real changes made)

. gen death_denominator = 1

. gen follow_up_time_death = (exit_date_death - index_date_death)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. gen follow_up_years_death = follow_up_time_death/365.25

. 
. stset exit_date_esrd, fail(esrd_date) origin(index_date_esrd) id(unique) scal
> e(365.25)

                id:  unique
     failure event:  esrd_date != 0 & esrd_date < .
obs. time interval:  (exit_date_esrd[_n-1], exit_date_esrd]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_esrd

------------------------------------------------------------------------------
     27,227  total observations
          0  exclusions
------------------------------------------------------------------------------
     27,227  observations remaining, representing
     27,227  subjects
      2,680  failures in single-failure-per-subject data
 44,634.366  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  2.748802

. tab _st follow_up_cat_esrd

      1 if |
 record is |
     to be |
   used; 0 |          Follow_up time
 otherwise | 1 to 365   366 to 73  731 to 10 |     Total
-----------+---------------------------------+----------
         1 |     6,532      9,802     10,893 |    27,227 
-----------+---------------------------------+----------
     Total |     6,532      9,802     10,893 |    27,227 

. 
. foreach outcome of varlist esrd egfr_half aki death {
  2.         stset exit_date_`outcome', fail(`outcome'_date) origin(index_date_
> `outcome') id(unique) scale(365.25)
  3.         bysort case: egen total_follow_up_`outcome' = total(_t)
  4.         forvalues i=0/1 {
  5.         di "Denominator case=`i' `outcome':"
  6.         count if case==`i' & `outcome'_denominator==1
  7.         local denominator = r(N)
  8.         di "Denominator(_st=1) case=`i' `outcome':"
  9.         count if case==`i' & `outcome'_denominator==1 & _st==1
 10.         local st_denominator = r(N)
 11.         di "Events case=`i' `outcome':"
 12.         count if case==`i' & `outcome'==1
 13.         local event = r(N)
 14.         di "Events (_st=1) case=`i' `outcome':"
 15.         count if case==`i' & `outcome'==1 & _st==1
 16.         local st_event = r(N)
 17.         di "Total follow_up case=`i' `outcome':"
 18.         su total_follow_up_`outcome' if case==`i'
 19.         local person_year = r(mean)
 20.         local rate = 100000*(`event'/`person_year')
 21.         di "Rate case=`i' `outcome':"
 22.         di `rate'
 23.         local st_rate = 100000*(`st_event'/`person_year')
 24.         di "Rate (_st=1) case=`i' `outcome':"
 25.         di `st_rate'
 26.         }
 27.         drop total_follow_up_`outcome'
 28. }

                id:  unique
     failure event:  esrd_date != 0 & esrd_date < .
obs. time interval:  (exit_date_esrd[_n-1], exit_date_esrd]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_esrd

------------------------------------------------------------------------------
     27,227  total observations
          0  exclusions
------------------------------------------------------------------------------
     27,227  observations remaining, representing
     27,227  subjects
      2,680  failures in single-failure-per-subject data
 44,634.366  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  2.748802
Denominator case=0 esrd:
  19,488
Denominator(_st=1) case=0 esrd:
  19,488
Events case=0 esrd:
  1,926
Events (_st=1) case=0 esrd:
  1,926
Total follow_up case=0 esrd:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~d |     19,488    32007.37           0   32007.37   32007.37
Rate case=0 esrd:
6017.3639
Rate (_st=1) case=0 esrd:
6017.3639
Denominator case=1 esrd:
  7,739
Denominator(_st=1) case=1 esrd:
  7,739
Events case=1 esrd:
  754
Events (_st=1) case=1 esrd:
  754
Total follow_up case=1 esrd:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~d |      7,739       12627           0      12627      12627
Rate case=1 esrd:
5971.3336
Rate (_st=1) case=1 esrd:
5971.3336

                id:  unique
     failure event:  egfr_half_date != 0 & egfr_half_date < .
obs. time interval:  (exit_date_egfr_half[_n-1], exit_date_egfr_half]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_egfr_half

------------------------------------------------------------------------------
     27,227  total observations
     11,077  event time missing (exit_date_egfr_half>=.)        PROBABLE ERROR
      1,183  ignored because never entered
------------------------------------------------------------------------------
     14,967  observations remaining, representing
     14,967  subjects
      7,141  failures in single-failure-per-subject data
 17,131.113  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  2.748802
Denominator case=0 egfr_half:
  10,623
Denominator(_st=1) case=0 egfr_half:
  10,623
Events case=0 egfr_half:
  5,924
Events (_st=1) case=0 egfr_half:
  5,060
Total follow_up case=0 egfr_half:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~f |     19,488    12220.77           0   12220.77   12220.77
Rate case=0 egfr_half:
48474.852
Rate (_st=1) case=0 egfr_half:
41404.921
Denominator case=1 egfr_half:
  4,344
Denominator(_st=1) case=1 egfr_half:
  4,344
Events case=1 egfr_half:
  2,400
Events (_st=1) case=1 egfr_half:
  2,081
Total follow_up case=1 egfr_half:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~f |      7,739    4910.344           0   4910.344   4910.344
Rate case=1 egfr_half:
48876.415
Rate (_st=1) case=1 egfr_half:
42379.925

                id:  unique
     failure event:  aki_date != 0 & aki_date < .
obs. time interval:  (exit_date_aki[_n-1], exit_date_aki]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_aki

------------------------------------------------------------------------------
     27,227  total observations
        895  observations end on or before enter()
------------------------------------------------------------------------------
     26,332  observations remaining, representing
     26,332  subjects
      4,244  failures in single-failure-per-subject data
 41,926.908  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  2.748802
Denominator case=0 aki:
  19,488
Denominator(_st=1) case=0 aki:
  18,845
Events case=0 aki:
  3,680
Events (_st=1) case=0 aki:
  3,037
Total follow_up case=0 aki:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~i |     19,488     30027.8           0    30027.8    30027.8
Rate case=0 aki:
12255.308
Rate (_st=1) case=0 aki:
10113.959
Denominator case=1 aki:
  7,739
Denominator(_st=1) case=1 aki:
  7,487
Events case=1 aki:
  1,459
Events (_st=1) case=1 aki:
  1,207
Total follow_up case=1 aki:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~i |      7,739     11899.1           0    11899.1    11899.1
Rate case=1 aki:
12261.43
Rate (_st=1) case=1 aki:
10143.623

                id:  unique
     failure event:  death_date != 0 & death_date < .
obs. time interval:  (exit_date_death[_n-1], exit_date_death]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_death

------------------------------------------------------------------------------
     27,227  total observations
          0  exclusions
------------------------------------------------------------------------------
     27,227  observations remaining, representing
     27,227  subjects
      1,681  failures in single-failure-per-subject data
 47,242.459  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  2.748802
Denominator case=0 death:
  19,488
Denominator(_st=1) case=0 death:
  19,488
Events case=0 death:
  1,374
Events (_st=1) case=0 death:
  1,374
Total follow_up case=0 death:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~h |     19,488    33851.55           0   33851.55   33851.55
Rate case=0 death:
4058.8978
Rate (_st=1) case=0 death:
4058.8978
Denominator case=1 death:
  7,739
Denominator(_st=1) case=1 death:
  7,739
Events case=1 death:
  307
Events (_st=1) case=1 death:
  307
Total follow_up case=1 death:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~h |      7,739     13390.9           0    13390.9    13390.9
Rate case=1 death:
2292.6013
Rate (_st=1) case=1 death:
2292.6013

. 
. save ./output/analysis_2017.dta, replace
(note: file ./output/analysis_2017.dta not found)
file ./output/analysis_2017.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/analysis_2017.log
  log type:  text
 closed on:   5 Apr 2023, 11:33:37
-------------------------------------------------------------------------------
