-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/analysis_2017.log
  log type:  text
 opened on:  12 May 2023, 09:48:58

. 
. ** Analysis cohort selection
. capture noisily import delimited ./output/input_covid_matching.csv, clear
(53 vars, 50,000 obs)

. di "Potential COVID-19 cases extracted from OpenSAFELY:"
Potential COVID-19 cases extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/input_2017_matching.csv, clear
(16 vars, 50,000 obs)

. di "Potential historical comparators extracted from OpenSAFELY:"
Potential historical comparators extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/covid_matching_2017.csv, clear
(10 vars, 14,296 obs)

. di "Potential COVID-19 cases after application of exclusion criteria:"
Potential COVID-19 cases after application of exclusion criteria:

. safecount
  14,296

. capture noisily import delimited ./output/2017_matching.csv, clear
(7 vars, 28,727 obs)

. di "Potential historical comparators after application of exclusion criteria:
> "
Potential historical comparators after application of exclusion criteria:

. safecount
  28,727

. * Import COVID-19 dataset comprising individuals matched with historical comp
> arators (limited matching variables only)  
. capture noisily import delimited ./output/input_combined_stps_covid_2017.csv,
>  clear
(13 vars, 12,688 obs)

. * Drop age & covid_diagnosis_date
. keep patient_id death_date date_deregistered stp krt_outcome_date male covid_
> date covid_month set_id case match_counts

. tempfile covid_2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `covid_2017_matched', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. * Number of matched COVID-19 cases
. count
  12,688

. * Import matched historical comparators (limited matching variables only)
. capture noisily import delimited ./output/input_combined_stps_matches_2017.cs
> v, clear
(10 vars, 21,348 obs)

. * Drop age
. keep patient_id death_date date_deregistered stp krt_outcome_date male set_id
>  case covid_date

. tempfile 2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `2017_matched', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. * Number of matched historical comparators
. count
  21,348

. * Merge limited COVID-19 dataset with additional variables
. capture noisily import delimited ./output/input_covid_2017_additional.csv, cl
> ear
(107 vars, 12,688 obs)

. merge 1:1 patient_id using `covid_2017_matched'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            12,688  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile covid_2017_complete

. save `covid_2017_complete', replace
(note: file /tmp/St00015.000003 not found)
file /tmp/St00015.000003 saved

. di "Matched COVID-19 cases:"
Matched COVID-19 cases:

. safecount
  12,688

. * Merge limited historical comparator dataset with additional variables
. capture noisily import delimited ./output/input_2017_additional.csv, clear
(96 vars, 21,348 obs)

. merge 1:1 patient_id using `2017_matched'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            21,348  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile 2017_complete

. save `2017_complete', replace
(note: file /tmp/St00015.000004 not found)
file /tmp/St00015.000004 saved

. di "Matched historical comparators:"
Matched historical comparators:

. safecount
  21,348

. * Append matched COVID-19 cases and historical comparators
. append using `covid_2017_complete', force

. order patient_id set_id match_count case

. gsort set_id -case

. count if case==0
  21,348

. di "Matched COVID-19 cases and historical comparators:"
Matched COVID-19 cases and historical comparators:

. safecount
  34,036

. tab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,348       62.72       62.72
          1 |     12,688       37.28      100.00
------------+-----------------------------------
      Total |     34,036      100.00

. * Save list of matched COVID-19 cases
. preserve

.         keep if case==1
(21,348 observations deleted)

.         keep patient_id

.         tempfile covid_2017_matched_list

.         save `covid_2017_matched_list', replace
(note: file /tmp/St00015.000006 not found)
file /tmp/St00015.000006 saved

. restore

. * Generate list of unmatched COVID-19 cases
. preserve

.         capture noisily import delimited ./output/input_covid_matching.csv, c
> lear
(53 vars, 50,000 obs)

.         * For dummy data, should do nothing in the real data
.         duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

.         tempfile covid_prematching

.         save `covid_prematching', replace
(note: file /tmp/St00015.000008 not found)
file /tmp/St00015.000008 saved

.         use `covid_2017_matched_list', clear

.         merge 1:1 patient_id using `covid_prematching'

    Result                           # of obs.
    -----------------------------------------
    not matched                        37,312
        from master                         0  (_merge==1)
        from using                     37,312  (_merge==2)

    matched                            12,688  (_merge==3)
    -----------------------------------------

.         keep if _merge==2
(12,688 observations deleted)

.         safecount
  37,312

.         save output/covid_unmatched_2017.dta, replace
(note: file output/covid_unmatched_2017.dta not found)
file output/covid_unmatched_2017.dta saved

.         di "Unmatched COVID-19 cases:"
Unmatched COVID-19 cases:

.         safecount
  37,312

. restore

. 
. **ID
. * Need to create unique identifiers as individuals may be in both covid_2017_
> matched and 2017_matched so will have the same patient_id
. gen unique = _n

. label var unique "Unique ID"

. 
. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label var imd "Index of multiple deprivation (IMD)"

. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      1,744        5.12        5.12
 1 Most deprived |      6,489       19.07       24.19
               2 |      6,496       19.09       43.27
               3 |      6,408       18.83       62.10
               4 |      6,434       18.90       81.01
5 Least deprived |      6,465       18.99      100.00
-----------------+-----------------------------------
           Total |     34,036      100.00

. drop if imd==0
(1,744 observations deleted)

. safetab imd
0

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |      6,489       20.09       20.09
               2 |      6,496       20.12       40.21
               3 |      6,408       19.84       60.06
               4 |      6,434       19.92       79.98
5 Least deprived |      6,465       20.02      100.00
-----------------+-----------------------------------
           Total |     32,292      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(32,261 missing values generated)

. replace stp1 = sum(stp1)
(32,291 real changes made)

. drop stp

. rename stp1 stp

. label define stp        1 "1"   ///
>                                         2 "2"   ///
>                                         3 "3"   ///
>                                         4 "4"   ///
>                                         5 "5"   ///
>                                         6 "6"   ///
>                                         7 "7"   ///
>                                         8 "8"   ///
>                                         9 "9"   ///
>                                         10 "10" ///
>                                         11 "11" ///                          
>            
>                                         12 "12" ///
>                                         13 "13" ///
>                                         14 "14" ///
>                                         15 "15" ///
>                                         16 "16" ///
>                                         17 "17" ///
>                                         18 "18" ///
>                                         19 "19" ///
>                                         20 "20" ///
>                                         21 "21" ///                          
>            
>                                         22 "22" ///
>                                         23 "23" ///
>                                         24 "24" ///
>                                         25 "25" ///
>                                         26 "26" ///
>                                         27 "27" ///
>                                         28 "28" ///
>                                         29 "29" ///
>                                         30 "30" ///
>                                         31 "31" 

. label values stp stp

. label var stp "STP"

. safetab stp
0

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,123        3.48        3.48
          2 |      1,047        3.24        6.72
          3 |      1,051        3.25        9.97
          4 |      1,011        3.13       13.11
          5 |      1,058        3.28       16.38
          6 |      1,033        3.20       19.58
          7 |      1,037        3.21       22.79
          8 |      1,062        3.29       26.08
          9 |      1,026        3.18       29.26
         10 |      1,017        3.15       32.41
         11 |        995        3.08       35.49
         12 |      1,035        3.21       38.69
         13 |      1,049        3.25       41.94
         14 |      1,017        3.15       45.09
         15 |      1,034        3.20       48.29
         16 |      1,032        3.20       51.49
         17 |      1,052        3.26       54.75
         18 |      1,027        3.18       57.93
         19 |      1,057        3.27       61.20
         20 |      1,037        3.21       64.41
         21 |      1,033        3.20       67.61
         22 |      1,052        3.26       70.87
         23 |      1,049        3.25       74.12
         24 |      1,062        3.29       77.41
         25 |      1,025        3.17       80.58
         26 |      1,067        3.30       83.88
         27 |      1,014        3.14       87.02
         28 |      1,059        3.28       90.30
         29 |      1,070        3.31       93.62
         30 |      1,005        3.11       96.73
         31 |      1,056        3.27      100.00
------------+-----------------------------------
      Total |     32,292      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(29,075 missing values generated)

. replace region = 2 if region_string=="East"
(3,220 real changes made)

. replace region = 3 if region_string=="London"
(6,327 real changes made)

. replace region = 4 if region_string=="North East"
(3,268 real changes made)

. replace region = 5 if region_string=="North West"
(3,212 real changes made)

. replace region = 6 if region_string=="South East"
(3,290 real changes made)

. replace region = 7 if region_string=="South West"
(3,248 real changes made)

. replace region = 8 if region_string=="West Midlands"
(3,262 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(3,248 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,217        9.96        9.96
                    East |      3,220        9.97       19.93
                  London |      6,327       19.59       39.53
              North East |      3,268       10.12       49.65
              North West |      3,212        9.95       59.59
              South East |      3,290       10.19       69.78
              South West |      3,248       10.06       79.84
           West Midlands |      3,262       10.10       89.94
Yorkshire and The Humber |      3,248       10.06      100.00
-------------------------+-----------------------------------
                   Total |     32,292      100.00

. drop if region==10
(0 observations deleted)

. safetab region
0

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,217        9.96        9.96
                    East |      3,220        9.97       19.93
                  London |      6,327       19.59       39.53
              North East |      3,268       10.12       49.65
              North West |      3,212        9.95       59.59
              South East |      3,290       10.19       69.78
              South West |      3,248       10.06       79.84
           West Midlands |      3,262       10.10       89.94
Yorkshire and The Humber |      3,248       10.06      100.00
-------------------------+-----------------------------------
                   Total |     32,292      100.00

. 
. * Create new index date variable 28 days after case_index_date (i.e. to exclu
> de anyone who does not survive to start follow-up)
. gen index_date = date(case_index_date, "YMD")

. format index_date %td

. gen index_date_28 = index_date + 28

. format index_date_28 %td

. 
. * Deregistered before index_date + 29 days
. gen deregistered_date = date(date_deregistered, "YMD")
(31,284 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date_28 + 1
(36 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(29,225 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(0 observations deleted)

. replace krt_date = index_date_28 + 1 if krt_date < index_date_28 + 1
(160 real changes made)

. 
. * Death before index_date + 29 days (i.e. only include people who survived 29
>  days after index_date)
. gen death_date1 = date(death_date, "YMD")
(30,431 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28 + 1
(73 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased withi
> n 28 days of index date"

. label values deceased deceased

. tab case deceased

           |       deceased
      case | Alive at   Deceased  |     Total
-----------+----------------------+----------
         0 |    20,154         54 |    20,208 
         1 |    12,029         19 |    12,048 
-----------+----------------------+----------
     Total |    32,183         73 |    32,256 

. drop if deceased==1
(73 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators
>  only
. gen index_year = yofd(index_date)

. gen age = index_year - year_of_birth

. gen sex = 1 if male == "Male"
(16,597 missing values generated)

. label var sex "Sex"

. replace sex = 0 if male == "Female"
(16,597 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 /
> //
>                                                                              
>                    baseline_creatinine_mar2017 ///
>                                                                              
>                    baseline_creatinine_apr2017 ///
>                                                                              
>                    baseline_creatinine_may2017 ///
>                                                                              
>                    baseline_creatinine_jun2017 ///
>                                                                              
>                    baseline_creatinine_jul2017 ///
>                                                                              
>                    baseline_creatinine_aug2017 ///
>                                                                              
>                    baseline_creatinine_sep2017 ///
>                                                                              
>                    baseline_creatinine_oct2017 ///
>                                                                              
>                    baseline_creatinine_nov2017 ///
>                                                                              
>                    baseline_creatinine_dec2017 ///
>                                                                              
>                    baseline_creatinine_jan2018 ///
>                                                                              
>                    baseline_creatinine_feb2018 ///
>                                                                              
>                    baseline_creatinine_mar2018 ///
>                                                                              
>                    baseline_creatinine_apr2018 ///
>                                                                              
>                    baseline_creatinine_may2018 ///
>                                                                              
>                    baseline_creatinine_jun2018 ///
>                                                                              
>                    baseline_creatinine_jul2018 ///
>                                                                              
>                    baseline_creatinine_aug2018 ///
>                                                                              
>                    baseline_creatinine_sep2018 ///
>                                                                              
>                    baseline_creatinine_oct2018 ///
>                                                                              
>                    baseline_creatinine_nov2018 ///
>                                                                              
>                    baseline_creatinine_dec2018 ///
>                                                                              
>                    baseline_creatinine_jan2019 ///
>                                                                              
>                    baseline_creatinine_feb2019 ///
>                                                                              
>                    baseline_creatinine_mar2019 ///
>                                                                              
>                    baseline_creatinine_apr2019 ///
>                                                                              
>                    baseline_creatinine_may2019 ///
>                                                                              
>                    baseline_creatinine_jun2019 ///
>                                                                              
>                    baseline_creatinine_jul2019 ///
>                                                                              
>                    baseline_creatinine_aug2019 ///
>                                                                              
>                    baseline_creatinine_sep2019 ///
>                                                                              
>                    baseline_creatinine_feb2020 ///
>                                                                              
>                    baseline_creatinine_mar2020 ///
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 ///
>                                                                              
>                    baseline_creatinine_oct2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(8,919 real changes made, 8,919 to missing)
(20,948 missing values generated)
(32,183 missing values generated)
(5,797 real changes made)
(5,438 real changes made)
(5,797 real changes made)
(5,438 real changes made)
(7,163 real changes made)
(32,183 missing values generated)
(5,797 real changes made)
(5,438 real changes made)
(11,235 real changes made)
(25,020 real changes made)
(20,948 missing values generated)
(11,235 real changes made)
(5,797 real changes made)
(8,823 real changes made, 8,823 to missing)
(20,852 missing values generated)
(32,183 missing values generated)
(5,839 real changes made)
(5,492 real changes made)
(5,839 real changes made)
(5,492 real changes made)
(7,137 real changes made)
(32,183 missing values generated)
(5,839 real changes made)
(5,492 real changes made)
(11,331 real changes made)
(25,046 real changes made)
(20,852 missing values generated)
(11,331 real changes made)
(5,839 real changes made)
(8,885 real changes made, 8,885 to missing)
(20,914 missing values generated)
(32,183 missing values generated)
(5,841 real changes made)
(5,428 real changes made)
(5,841 real changes made)
(5,428 real changes made)
(7,232 real changes made)
(32,183 missing values generated)
(5,841 real changes made)
(5,428 real changes made)
(11,269 real changes made)
(24,951 real changes made)
(20,914 missing values generated)
(11,269 real changes made)
(5,841 real changes made)
(8,886 real changes made, 8,886 to missing)
(20,915 missing values generated)
(32,183 missing values generated)
(5,864 real changes made)
(5,404 real changes made)
(5,864 real changes made)
(5,404 real changes made)
(7,177 real changes made)
(32,183 missing values generated)
(5,864 real changes made)
(5,404 real changes made)
(11,268 real changes made)
(25,006 real changes made)
(20,915 missing values generated)
(11,268 real changes made)
(5,864 real changes made)
(8,855 real changes made, 8,855 to missing)
(20,884 missing values generated)
(32,183 missing values generated)
(5,799 real changes made)
(5,500 real changes made)
(5,799 real changes made)
(5,500 real changes made)
(7,297 real changes made)
(32,183 missing values generated)
(5,799 real changes made)
(5,500 real changes made)
(11,299 real changes made)
(24,886 real changes made)
(20,884 missing values generated)
(11,299 real changes made)
(5,799 real changes made)
(8,903 real changes made, 8,903 to missing)
(20,932 missing values generated)
(32,183 missing values generated)
(5,826 real changes made)
(5,425 real changes made)
(5,826 real changes made)
(5,425 real changes made)
(7,134 real changes made)
(32,183 missing values generated)
(5,826 real changes made)
(5,425 real changes made)
(11,251 real changes made)
(25,049 real changes made)
(20,932 missing values generated)
(11,251 real changes made)
(5,826 real changes made)
(8,897 real changes made, 8,897 to missing)
(20,926 missing values generated)
(32,183 missing values generated)
(5,803 real changes made)
(5,454 real changes made)
(5,803 real changes made)
(5,454 real changes made)
(7,134 real changes made)
(32,183 missing values generated)
(5,803 real changes made)
(5,454 real changes made)
(11,257 real changes made)
(25,049 real changes made)
(20,926 missing values generated)
(11,257 real changes made)
(5,803 real changes made)
(8,896 real changes made, 8,896 to missing)
(20,925 missing values generated)
(32,183 missing values generated)
(5,863 real changes made)
(5,395 real changes made)
(5,863 real changes made)
(5,395 real changes made)
(7,134 real changes made)
(32,183 missing values generated)
(5,863 real changes made)
(5,395 real changes made)
(11,258 real changes made)
(25,049 real changes made)
(20,925 missing values generated)
(11,258 real changes made)
(5,863 real changes made)
(8,880 real changes made, 8,880 to missing)
(20,909 missing values generated)
(32,183 missing values generated)
(5,904 real changes made)
(5,370 real changes made)
(5,904 real changes made)
(5,370 real changes made)
(7,259 real changes made)
(32,183 missing values generated)
(5,904 real changes made)
(5,370 real changes made)
(11,274 real changes made)
(24,924 real changes made)
(20,909 missing values generated)
(11,274 real changes made)
(5,904 real changes made)
(8,856 real changes made, 8,856 to missing)
(20,885 missing values generated)
(32,183 missing values generated)
(5,819 real changes made)
(5,479 real changes made)
(5,819 real changes made)
(5,479 real changes made)
(7,156 real changes made)
(32,183 missing values generated)
(5,819 real changes made)
(5,479 real changes made)
(11,298 real changes made)
(25,027 real changes made)
(20,885 missing values generated)
(11,298 real changes made)
(5,819 real changes made)
(8,878 real changes made, 8,878 to missing)
(20,907 missing values generated)
(32,183 missing values generated)
(5,853 real changes made)
(5,423 real changes made)
(5,853 real changes made)
(5,423 real changes made)
(7,131 real changes made)
(32,183 missing values generated)
(5,853 real changes made)
(5,423 real changes made)
(11,276 real changes made)
(25,052 real changes made)
(20,907 missing values generated)
(11,276 real changes made)
(5,853 real changes made)
(8,899 real changes made, 8,899 to missing)
(20,928 missing values generated)
(32,183 missing values generated)
(5,787 real changes made)
(5,468 real changes made)
(5,787 real changes made)
(5,468 real changes made)
(7,132 real changes made)
(32,183 missing values generated)
(5,787 real changes made)
(5,468 real changes made)
(11,255 real changes made)
(25,051 real changes made)
(20,928 missing values generated)
(11,255 real changes made)
(5,787 real changes made)
(8,902 real changes made, 8,902 to missing)
(20,931 missing values generated)
(32,183 missing values generated)
(5,847 real changes made)
(5,405 real changes made)
(5,847 real changes made)
(5,405 real changes made)
(7,222 real changes made)
(32,183 missing values generated)
(5,847 real changes made)
(5,405 real changes made)
(11,252 real changes made)
(24,961 real changes made)
(20,931 missing values generated)
(11,252 real changes made)
(5,847 real changes made)
(8,864 real changes made, 8,864 to missing)
(20,893 missing values generated)
(32,183 missing values generated)
(5,843 real changes made)
(5,447 real changes made)
(5,843 real changes made)
(5,447 real changes made)
(7,179 real changes made)
(32,183 missing values generated)
(5,843 real changes made)
(5,447 real changes made)
(11,290 real changes made)
(25,004 real changes made)
(20,893 missing values generated)
(11,290 real changes made)
(5,843 real changes made)
(8,900 real changes made, 8,900 to missing)
(20,929 missing values generated)
(32,183 missing values generated)
(5,811 real changes made)
(5,443 real changes made)
(5,811 real changes made)
(5,443 real changes made)
(7,162 real changes made)
(32,183 missing values generated)
(5,811 real changes made)
(5,443 real changes made)
(11,254 real changes made)
(25,021 real changes made)
(20,929 missing values generated)
(11,254 real changes made)
(5,811 real changes made)
(8,890 real changes made, 8,890 to missing)
(20,919 missing values generated)
(32,183 missing values generated)
(5,772 real changes made)
(5,492 real changes made)
(5,772 real changes made)
(5,492 real changes made)
(7,094 real changes made)
(32,183 missing values generated)
(5,772 real changes made)
(5,492 real changes made)
(11,264 real changes made)
(25,089 real changes made)
(20,919 missing values generated)
(11,264 real changes made)
(5,772 real changes made)
(8,877 real changes made, 8,877 to missing)
(20,906 missing values generated)
(32,183 missing values generated)
(5,867 real changes made)
(5,410 real changes made)
(5,867 real changes made)
(5,410 real changes made)
(7,145 real changes made)
(32,183 missing values generated)
(5,867 real changes made)
(5,410 real changes made)
(11,277 real changes made)
(25,038 real changes made)
(20,906 missing values generated)
(11,277 real changes made)
(5,867 real changes made)
(8,844 real changes made, 8,844 to missing)
(20,873 missing values generated)
(32,183 missing values generated)
(5,815 real changes made)
(5,495 real changes made)
(5,815 real changes made)
(5,495 real changes made)
(7,164 real changes made)
(32,183 missing values generated)
(5,815 real changes made)
(5,495 real changes made)
(11,310 real changes made)
(25,019 real changes made)
(20,873 missing values generated)
(11,310 real changes made)
(5,815 real changes made)
(8,830 real changes made, 8,830 to missing)
(20,859 missing values generated)
(32,183 missing values generated)
(5,841 real changes made)
(5,483 real changes made)
(5,841 real changes made)
(5,483 real changes made)
(7,256 real changes made)
(32,183 missing values generated)
(5,841 real changes made)
(5,483 real changes made)
(11,324 real changes made)
(24,927 real changes made)
(20,859 missing values generated)
(11,324 real changes made)
(5,841 real changes made)
(8,836 real changes made, 8,836 to missing)
(20,865 missing values generated)
(32,183 missing values generated)
(5,860 real changes made)
(5,458 real changes made)
(5,860 real changes made)
(5,458 real changes made)
(7,190 real changes made)
(32,183 missing values generated)
(5,860 real changes made)
(5,458 real changes made)
(11,318 real changes made)
(24,993 real changes made)
(20,865 missing values generated)
(11,318 real changes made)
(5,860 real changes made)
(8,821 real changes made, 8,821 to missing)
(20,850 missing values generated)
(32,183 missing values generated)
(5,881 real changes made)
(5,452 real changes made)
(5,881 real changes made)
(5,452 real changes made)
(7,203 real changes made)
(32,183 missing values generated)
(5,881 real changes made)
(5,452 real changes made)
(11,333 real changes made)
(24,980 real changes made)
(20,850 missing values generated)
(11,333 real changes made)
(5,881 real changes made)
(8,841 real changes made, 8,841 to missing)
(20,870 missing values generated)
(32,183 missing values generated)
(5,886 real changes made)
(5,427 real changes made)
(5,886 real changes made)
(5,427 real changes made)
(7,216 real changes made)
(32,183 missing values generated)
(5,886 real changes made)
(5,427 real changes made)
(11,313 real changes made)
(24,967 real changes made)
(20,870 missing values generated)
(11,313 real changes made)
(5,886 real changes made)
(8,865 real changes made, 8,865 to missing)
(20,894 missing values generated)
(32,183 missing values generated)
(5,798 real changes made)
(5,491 real changes made)
(5,798 real changes made)
(5,491 real changes made)
(7,242 real changes made)
(32,183 missing values generated)
(5,798 real changes made)
(5,491 real changes made)
(11,289 real changes made)
(24,941 real changes made)
(20,894 missing values generated)
(11,289 real changes made)
(5,798 real changes made)
(8,910 real changes made, 8,910 to missing)
(20,939 missing values generated)
(32,183 missing values generated)
(5,794 real changes made)
(5,450 real changes made)
(5,794 real changes made)
(5,450 real changes made)
(7,145 real changes made)
(32,183 missing values generated)
(5,794 real changes made)
(5,450 real changes made)
(11,244 real changes made)
(25,038 real changes made)
(20,939 missing values generated)
(11,244 real changes made)
(5,794 real changes made)
(8,904 real changes made, 8,904 to missing)
(20,933 missing values generated)
(32,183 missing values generated)
(5,782 real changes made)
(5,468 real changes made)
(5,782 real changes made)
(5,468 real changes made)
(7,145 real changes made)
(32,183 missing values generated)
(5,782 real changes made)
(5,468 real changes made)
(11,250 real changes made)
(25,038 real changes made)
(20,933 missing values generated)
(11,250 real changes made)
(5,782 real changes made)
(8,903 real changes made, 8,903 to missing)
(20,932 missing values generated)
(32,183 missing values generated)
(5,786 real changes made)
(5,465 real changes made)
(5,786 real changes made)
(5,465 real changes made)
(7,155 real changes made)
(32,183 missing values generated)
(5,786 real changes made)
(5,465 real changes made)
(11,251 real changes made)
(25,028 real changes made)
(20,932 missing values generated)
(11,251 real changes made)
(5,786 real changes made)
(8,893 real changes made, 8,893 to missing)
(20,922 missing values generated)
(32,183 missing values generated)
(5,837 real changes made)
(5,424 real changes made)
(5,837 real changes made)
(5,424 real changes made)
(7,124 real changes made)
(32,183 missing values generated)
(5,837 real changes made)
(5,424 real changes made)
(11,261 real changes made)
(25,059 real changes made)
(20,922 missing values generated)
(11,261 real changes made)
(5,837 real changes made)
(8,890 real changes made, 8,890 to missing)
(20,919 missing values generated)
(32,183 missing values generated)
(5,831 real changes made)
(5,433 real changes made)
(5,831 real changes made)
(5,433 real changes made)
(7,146 real changes made)
(32,183 missing values generated)
(5,831 real changes made)
(5,433 real changes made)
(11,264 real changes made)
(25,037 real changes made)
(20,919 missing values generated)
(11,264 real changes made)
(5,831 real changes made)
(8,861 real changes made, 8,861 to missing)
(20,890 missing values generated)
(32,183 missing values generated)
(5,805 real changes made)
(5,488 real changes made)
(5,805 real changes made)
(5,488 real changes made)
(7,077 real changes made)
(32,183 missing values generated)
(5,805 real changes made)
(5,488 real changes made)
(11,293 real changes made)
(25,106 real changes made)
(20,890 missing values generated)
(11,293 real changes made)
(5,805 real changes made)
(8,887 real changes made, 8,887 to missing)
(20,916 missing values generated)
(32,183 missing values generated)
(5,801 real changes made)
(5,466 real changes made)
(5,801 real changes made)
(5,466 real changes made)
(7,218 real changes made)
(32,183 missing values generated)
(5,801 real changes made)
(5,466 real changes made)
(11,267 real changes made)
(24,965 real changes made)
(20,916 missing values generated)
(11,267 real changes made)
(5,801 real changes made)
(8,932 real changes made, 8,932 to missing)
(20,961 missing values generated)
(32,183 missing values generated)
(5,779 real changes made)
(5,443 real changes made)
(5,779 real changes made)
(5,443 real changes made)
(7,122 real changes made)
(32,183 missing values generated)
(5,779 real changes made)
(5,443 real changes made)
(11,222 real changes made)
(25,061 real changes made)
(20,961 missing values generated)
(11,222 real changes made)
(5,779 real changes made)
(8,898 real changes made, 8,898 to missing)
(20,927 missing values generated)
(32,183 missing values generated)
(5,801 real changes made)
(5,455 real changes made)
(5,801 real changes made)
(5,455 real changes made)
(7,072 real changes made)
(32,183 missing values generated)
(5,801 real changes made)
(5,455 real changes made)
(11,256 real changes made)
(25,111 real changes made)
(20,927 missing values generated)
(11,256 real changes made)
(5,801 real changes made)
(5,298 real changes made, 5,298 to missing)
(25,452 missing values generated)
(32,183 missing values generated)
(3,431 real changes made)
(3,300 real changes made)
(3,431 real changes made)
(3,300 real changes made)
(4,331 real changes made)
(32,183 missing values generated)
(3,431 real changes made)
(3,300 real changes made)
(6,731 real changes made)
(27,852 real changes made)
(25,452 missing values generated)
(6,731 real changes made)
(3,431 real changes made)
(5,309 real changes made, 5,309 to missing)
(25,463 missing values generated)
(32,183 missing values generated)
(3,417 real changes made)
(3,303 real changes made)
(3,417 real changes made)
(3,303 real changes made)
(4,198 real changes made)
(32,183 missing values generated)
(3,417 real changes made)
(3,303 real changes made)
(6,720 real changes made)
(27,985 real changes made)
(25,463 missing values generated)
(6,720 real changes made)
(3,417 real changes made)
(5,306 real changes made, 5,306 to missing)
(25,460 missing values generated)
(32,183 missing values generated)
(3,491 real changes made)
(3,232 real changes made)
(3,491 real changes made)
(3,232 real changes made)
(4,315 real changes made)
(32,183 missing values generated)
(3,491 real changes made)
(3,232 real changes made)
(6,723 real changes made)
(27,868 real changes made)
(25,460 missing values generated)
(6,723 real changes made)
(3,491 real changes made)
(5,275 real changes made, 5,275 to missing)
(25,429 missing values generated)
(32,183 missing values generated)
(3,494 real changes made)
(3,260 real changes made)
(3,494 real changes made)
(3,260 real changes made)
(4,318 real changes made)
(32,183 missing values generated)
(3,494 real changes made)
(3,260 real changes made)
(6,754 real changes made)
(27,865 real changes made)
(25,429 missing values generated)
(6,754 real changes made)
(3,494 real changes made)
(5,273 real changes made, 5,273 to missing)
(25,427 missing values generated)
(32,183 missing values generated)
(3,515 real changes made)
(3,241 real changes made)
(3,515 real changes made)
(3,241 real changes made)
(4,330 real changes made)
(32,183 missing values generated)
(3,515 real changes made)
(3,241 real changes made)
(6,756 real changes made)
(27,853 real changes made)
(25,427 missing values generated)
(6,756 real changes made)
(3,515 real changes made)
(5,303 real changes made, 5,303 to missing)
(25,457 missing values generated)
(32,183 missing values generated)
(3,428 real changes made)
(3,298 real changes made)
(3,428 real changes made)
(3,298 real changes made)
(4,284 real changes made)
(32,183 missing values generated)
(3,428 real changes made)
(3,298 real changes made)
(6,726 real changes made)
(27,899 real changes made)
(25,457 missing values generated)
(6,726 real changes made)
(3,428 real changes made)
(5,267 real changes made, 5,267 to missing)
(25,421 missing values generated)
(32,183 missing values generated)
(3,448 real changes made)
(3,314 real changes made)
(3,448 real changes made)
(3,314 real changes made)
(4,232 real changes made)
(32,183 missing values generated)
(3,448 real changes made)
(3,314 real changes made)
(6,762 real changes made)
(27,951 real changes made)
(25,421 missing values generated)
(6,762 real changes made)
(3,448 real changes made)
(5,401 real changes made, 5,401 to missing)
(25,555 missing values generated)
(32,183 missing values generated)
(3,415 real changes made)
(3,213 real changes made)
(3,415 real changes made)
(3,213 real changes made)
(4,200 real changes made)
(32,183 missing values generated)
(3,415 real changes made)
(3,213 real changes made)
(6,628 real changes made)
(27,983 real changes made)
(25,555 missing values generated)
(6,628 real changes made)
(3,415 real changes made)
(5,304 real changes made, 5,304 to missing)
(25,458 missing values generated)
(32,183 missing values generated)
(3,463 real changes made)
(3,262 real changes made)
(3,463 real changes made)
(3,262 real changes made)
(4,269 real changes made)
(32,183 missing values generated)
(3,463 real changes made)
(3,262 real changes made)
(6,725 real changes made)
(27,914 real changes made)
(25,458 missing values generated)
(6,725 real changes made)
(3,463 real changes made)
(5,325 real changes made, 5,325 to missing)
(25,479 missing values generated)
(32,183 missing values generated)
(3,474 real changes made)
(3,230 real changes made)
(3,474 real changes made)
(3,230 real changes made)
(4,322 real changes made)
(32,183 missing values generated)
(3,474 real changes made)
(3,230 real changes made)
(6,704 real changes made)
(27,861 real changes made)
(25,479 missing values generated)
(6,704 real changes made)
(3,474 real changes made)
(5,262 real changes made, 5,262 to missing)
(25,416 missing values generated)
(32,183 missing values generated)
(3,509 real changes made)
(3,258 real changes made)
(3,509 real changes made)
(3,258 real changes made)
(4,266 real changes made)
(32,183 missing values generated)
(3,509 real changes made)
(3,258 real changes made)
(6,767 real changes made)
(27,917 real changes made)
(25,416 missing values generated)
(6,767 real changes made)
(3,509 real changes made)
(5,267 real changes made, 5,267 to missing)
(25,421 missing values generated)
(32,183 missing values generated)
(3,483 real changes made)
(3,279 real changes made)
(3,483 real changes made)
(3,279 real changes made)
(4,317 real changes made)
(32,183 missing values generated)
(3,483 real changes made)
(3,279 real changes made)
(6,762 real changes made)
(27,866 real changes made)
(25,421 missing values generated)
(6,762 real changes made)
(3,483 real changes made)
(5,263 real changes made, 5,263 to missing)
(25,417 missing values generated)
(32,183 missing values generated)
(3,455 real changes made)
(3,311 real changes made)
(3,455 real changes made)
(3,311 real changes made)
(4,330 real changes made)
(32,183 missing values generated)
(3,455 real changes made)
(3,311 real changes made)
(6,766 real changes made)
(27,853 real changes made)
(25,417 missing values generated)
(6,766 real changes made)
(3,455 real changes made)
(5,320 real changes made, 5,320 to missing)
(25,474 missing values generated)
(32,183 missing values generated)
(3,405 real changes made)
(3,304 real changes made)
(3,405 real changes made)
(3,304 real changes made)
(4,227 real changes made)
(32,183 missing values generated)
(3,405 real changes made)
(3,304 real changes made)
(6,709 real changes made)
(27,956 real changes made)
(25,474 missing values generated)
(6,709 real changes made)
(3,405 real changes made)
(5,307 real changes made, 5,307 to missing)
(25,461 missing values generated)
(32,183 missing values generated)
(3,479 real changes made)
(3,243 real changes made)
(3,479 real changes made)
(3,243 real changes made)
(4,255 real changes made)
(32,183 missing values generated)
(3,479 real changes made)
(3,243 real changes made)
(6,722 real changes made)
(27,928 real changes made)
(25,461 missing values generated)
(6,722 real changes made)
(3,479 real changes made)
(5,325 real changes made, 5,325 to missing)
(25,479 missing values generated)
(32,183 missing values generated)
(3,432 real changes made)
(3,272 real changes made)
(3,432 real changes made)
(3,272 real changes made)
(4,278 real changes made)
(32,183 missing values generated)
(3,432 real changes made)
(3,272 real changes made)
(6,704 real changes made)
(27,905 real changes made)
(25,479 missing values generated)
(6,704 real changes made)
(3,432 real changes made)
(5,327 real changes made, 5,327 to missing)
(25,481 missing values generated)
(32,183 missing values generated)
(3,424 real changes made)
(3,278 real changes made)
(3,424 real changes made)
(3,278 real changes made)
(4,234 real changes made)
(32,183 missing values generated)
(3,424 real changes made)
(3,278 real changes made)
(6,702 real changes made)
(27,949 real changes made)
(25,481 missing values generated)
(6,702 real changes made)
(3,424 real changes made)
(5,281 real changes made, 5,281 to missing)
(25,435 missing values generated)
(32,183 missing values generated)
(3,481 real changes made)
(3,267 real changes made)
(3,481 real changes made)
(3,267 real changes made)
(4,264 real changes made)
(32,183 missing values generated)
(3,481 real changes made)
(3,267 real changes made)
(6,748 real changes made)
(27,919 real changes made)
(25,435 missing values generated)
(6,748 real changes made)
(3,481 real changes made)
(5,301 real changes made, 5,301 to missing)
(25,455 missing values generated)
(32,183 missing values generated)
(3,482 real changes made)
(3,246 real changes made)
(3,482 real changes made)
(3,246 real changes made)
(4,331 real changes made)
(32,183 missing values generated)
(3,482 real changes made)
(3,246 real changes made)
(6,728 real changes made)
(27,852 real changes made)
(25,455 missing values generated)
(6,728 real changes made)
(3,482 real changes made)
(5,332 real changes made, 5,332 to missing)
(25,486 missing values generated)
(32,183 missing values generated)
(3,452 real changes made)
(3,245 real changes made)
(3,452 real changes made)
(3,245 real changes made)
(4,294 real changes made)
(32,183 missing values generated)
(3,452 real changes made)
(3,245 real changes made)
(6,697 real changes made)
(27,889 real changes made)
(25,486 missing values generated)
(6,697 real changes made)
(3,452 real changes made)
(5,279 real changes made, 5,279 to missing)
(25,433 missing values generated)
(32,183 missing values generated)
(3,464 real changes made)
(3,286 real changes made)
(3,464 real changes made)
(3,286 real changes made)
(4,312 real changes made)
(32,183 missing values generated)
(3,464 real changes made)
(3,286 real changes made)
(6,750 real changes made)
(27,871 real changes made)
(25,433 missing values generated)
(6,750 real changes made)
(3,464 real changes made)
(5,305 real changes made, 5,305 to missing)
(25,459 missing values generated)
(32,183 missing values generated)
(3,451 real changes made)
(3,273 real changes made)
(3,451 real changes made)
(3,273 real changes made)
(4,167 real changes made)
(32,183 missing values generated)
(3,451 real changes made)
(3,273 real changes made)
(6,724 real changes made)
(28,016 real changes made)
(25,459 missing values generated)
(6,724 real changes made)
(3,451 real changes made)
(5,301 real changes made, 5,301 to missing)
(25,455 missing values generated)
(32,183 missing values generated)
(3,477 real changes made)
(3,251 real changes made)
(3,477 real changes made)
(3,251 real changes made)
(4,297 real changes made)
(32,183 missing values generated)
(3,477 real changes made)
(3,251 real changes made)
(6,728 real changes made)
(27,886 real changes made)
(25,455 missing values generated)
(6,728 real changes made)
(3,477 real changes made)
(5,306 real changes made, 5,306 to missing)
(25,460 missing values generated)
(32,183 missing values generated)
(3,457 real changes made)
(3,266 real changes made)
(3,457 real changes made)
(3,266 real changes made)
(4,285 real changes made)
(32,183 missing values generated)
(3,457 real changes made)
(3,266 real changes made)
(6,723 real changes made)
(27,898 real changes made)
(25,460 missing values generated)
(6,723 real changes made)
(3,457 real changes made)
(5,296 real changes made, 5,296 to missing)
(25,450 missing values generated)
(32,183 missing values generated)
(3,485 real changes made)
(3,248 real changes made)
(3,485 real changes made)
(3,248 real changes made)
(4,280 real changes made)
(32,183 missing values generated)
(3,485 real changes made)
(3,248 real changes made)
(6,733 real changes made)
(27,903 real changes made)
(25,450 missing values generated)
(6,733 real changes made)
(3,485 real changes made)
(5,276 real changes made, 5,276 to missing)
(25,430 missing values generated)
(32,183 missing values generated)
(3,439 real changes made)
(3,314 real changes made)
(3,439 real changes made)
(3,314 real changes made)
(4,268 real changes made)
(32,183 missing values generated)
(3,439 real changes made)
(3,314 real changes made)
(6,753 real changes made)
(27,915 real changes made)
(25,430 missing values generated)
(6,753 real changes made)
(3,439 real changes made)
(5,278 real changes made, 5,278 to missing)
(25,432 missing values generated)
(32,183 missing values generated)
(3,485 real changes made)
(3,266 real changes made)
(3,485 real changes made)
(3,266 real changes made)
(4,319 real changes made)
(32,183 missing values generated)
(3,485 real changes made)
(3,266 real changes made)
(6,751 real changes made)
(27,864 real changes made)
(25,432 missing values generated)
(6,751 real changes made)
(3,485 real changes made)
(5,262 real changes made, 5,262 to missing)
(25,416 missing values generated)
(32,183 missing values generated)
(3,465 real changes made)
(3,302 real changes made)
(3,465 real changes made)
(3,302 real changes made)
(4,305 real changes made)
(32,183 missing values generated)
(3,465 real changes made)
(3,302 real changes made)
(6,767 real changes made)
(27,878 real changes made)
(25,416 missing values generated)
(6,767 real changes made)
(3,465 real changes made)
(5,272 real changes made, 5,272 to missing)
(25,426 missing values generated)
(32,183 missing values generated)
(3,470 real changes made)
(3,287 real changes made)
(3,470 real changes made)
(3,287 real changes made)
(4,300 real changes made)
(32,183 missing values generated)
(3,470 real changes made)
(3,287 real changes made)
(6,757 real changes made)
(27,883 real changes made)
(25,426 missing values generated)
(6,757 real changes made)
(3,470 real changes made)
(5,308 real changes made, 5,308 to missing)
(25,462 missing values generated)
(32,183 missing values generated)
(3,448 real changes made)
(3,273 real changes made)
(3,448 real changes made)
(3,273 real changes made)
(4,276 real changes made)
(32,183 missing values generated)
(3,448 real changes made)
(3,273 real changes made)
(6,721 real changes made)
(27,907 real changes made)
(25,462 missing values generated)
(6,721 real changes made)
(3,448 real changes made)
(5,257 real changes made, 5,257 to missing)
(25,411 missing values generated)
(32,183 missing values generated)
(3,465 real changes made)
(3,307 real changes made)
(3,465 real changes made)
(3,307 real changes made)
(4,220 real changes made)
(32,183 missing values generated)
(3,465 real changes made)
(3,307 real changes made)
(6,772 real changes made)
(27,963 real changes made)
(25,411 missing values generated)
(6,772 real changes made)
(3,465 real changes made)
(5,317 real changes made, 5,317 to missing)
(25,471 missing values generated)
(32,183 missing values generated)
(3,439 real changes made)
(3,273 real changes made)
(3,439 real changes made)
(3,273 real changes made)
(4,255 real changes made)
(32,183 missing values generated)
(3,439 real changes made)
(3,273 real changes made)
(6,712 real changes made)
(27,928 real changes made)
(25,471 missing values generated)
(6,712 real changes made)
(3,439 real changes made)
(5,251 real changes made, 5,251 to missing)
(25,405 missing values generated)
(32,183 missing values generated)
(3,516 real changes made)
(3,262 real changes made)
(3,516 real changes made)
(3,262 real changes made)
(4,380 real changes made)
(32,183 missing values generated)
(3,516 real changes made)
(3,262 real changes made)
(6,778 real changes made)
(27,803 real changes made)
(25,405 missing values generated)
(6,778 real changes made)
(3,516 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)

. gen baseline_egfr=.
(32,183 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(726 real changes made)
(737 real changes made)
(666 real changes made)
(706 real changes made)
(639 real changes made)
(610 real changes made)
(564 real changes made)
(527 real changes made)
(487 real changes made)
(484 real changes made)
(417 real changes made)
(463 real changes made)
(325 real changes made)
(354 real changes made)
(303 real changes made)
(320 real changes made)
(266 real changes made)
(297 real changes made)
(221 real changes made)
(232 real changes made)
(222 real changes made)
(214 real changes made)
(181 real changes made)
(194 real changes made)
(170 real changes made)
(145 real changes made)
(145 real changes made)
(114 real changes made)
(106 real changes made)
(119 real changes made)
(94 real changes made)
(85 real changes made)
(285 real changes made)
(275 real changes made)
(251 real changes made)
(273 real changes made)
(246 real changes made)
(251 real changes made)
(247 real changes made)
(239 real changes made)
(216 real changes made)
(242 real changes made)
(225 real changes made)
(230 real changes made)
(184 real changes made)
(214 real changes made)
(208 real changes made)
(214 real changes made)
(196 real changes made)
(215 real changes made)
(172 real changes made)
(198 real changes made)
(178 real changes made)
(180 real changes made)
(176 real changes made)
(185 real changes made)
(169 real changes made)
(162 real changes made)
(157 real changes made)
(177 real changes made)
(159 real changes made)
(179 real changes made)
(157 real changes made)
(140 real changes made)
(141 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab case baseline_esrd

           | baseline_e
           |    srd
      case |   No ESRD |     Total
-----------+-----------+----------
         0 |    20,154 |    20,154 
         1 |    12,029 |    12,029 
-----------+-----------+----------
     Total |    32,183 |    32,183 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. * Drop COVID-19 cases without any matched historical comparators after furthe
> r application of exclusion criteria
. generate match_counts1=.
(32,183 missing values generated)

. order patient_id set_id match_counts match_counts1

. bysort set_id: replace match_counts1=_N-1
(32183 real changes made)

. replace match_counts1=. if case==0
(20,154 real changes made, 20,154 to missing)

. drop match_counts

. rename match_counts1 match_counts

. count if match_counts==0
  4,398

. drop if match_counts==0
(4,398 observations deleted)

. safetab case
0

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,154       72.54       72.54
          1 |      7,631       27.46      100.00
------------+-----------------------------------
      Total |     27,785      100.00

. tab match_counts

match_count |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,040       13.63       13.63
          2 |      1,723       22.58       36.21
          3 |      4,868       63.79      100.00
------------+-----------------------------------
      Total |      7,631      100.00

. 
. bysort set_id: egen set_case_mean = mean(case) // if mean of exposure var is 
> 0 then only uncase in set, if 1 then only case in set

. gen valid_set = (set_case_mean>0 & set_case_mean<1) // ==1 is valid set conta
> ining both case and uncase

. tab valid_set, miss

  valid_set |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,064        3.83        3.83
          1 |     26,721       96.17      100.00
------------+-----------------------------------
      Total |     27,785      100.00

. tab valid_set case, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |         case
 valid_set |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,064          0 |     1,064 
           |      5.28       0.00 |      3.83 
-----------+----------------------+----------
         1 |    19,090      7,631 |    26,721 
           |     94.72     100.00 |     96.17 
-----------+----------------------+----------
     Total |    20,154      7,631 |    27,785 
           |    100.00     100.00 |    100.00 

. keep if valid_set==1
(1,064 observations deleted)

. drop valid_set set_case_mean

. 
. ** Exposure
. label define case 0 "Historical comparator" ///
>                                   1 "SARS-CoV-2"

. label values case case

. safetab case 
0

                 case |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,090       71.44       71.44
           SARS-CoV-2 |      7,631       28.56      100.00
----------------------+-----------------------------------
                Total |     26,721      100.00

. 
. * COVID-19 severity
. gen covid_severity = case

. replace covid_severity = 2 if covid_hospitalised==1
(768 real changes made)

. replace covid_severity = 3 if covid_critical_care==1
(397 real changes made)

. replace covid_severity = 3 if covid_critical_days==1
(370 real changes made)

. label define covid_severity     0 "Historical comparator"               ///
>                                                         1 "Non-hospitalised C
> OVID" ///
>                                                         2 "Hospitalised COVID
> "          ///
>                                                         3 "Critical care COVI
> D"

. label values covid_severity covid_severity

. label var covid_severity "SARS-CoV-2 severity"

. drop covid_critical_care

. drop covid_critical_days

. safetab covid_severity, m
15

   SARS-CoV-2 severity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
 Historical comparator |     19,090       71.44       71.44
Non-hospitalised COVID |      6,167       23.08       94.52
    Hospitalised COVID |        697        2.61       97.13
   Critical care COVID |        767        2.87      100.00
-----------------------+-----------------------------------
                 Total |     26,721      100.00

. 
. * COVID-19 acute kidney injury
. gen covid_aki = case

. replace covid_aki = 2 if covid_hospitalised==1
(768 real changes made)

. replace covid_aki = 3 if covid_acute_kidney_injury==1
(374 real changes made)

. label define covid_aki  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised COVID"   
>            ///
>                                                 2 "Hospitalised COVID"  ///
>                                                 3 "Hospitalised COVID-AKI"

. label values covid_aki covid_aki

. label var covid_aki "COVID-19 acute kidney injury"

. drop covid_acute_kidney_injury

. safetab covid_aki, m
10

 COVID-19 acute kidney |
                injury |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
 Historical comparator |     19,090       71.44       71.44
Non-hospitalised COVID |      6,523       24.41       95.85
    Hospitalised COVID |        734        2.75       98.60
Hospitalised COVID-AKI |        374        1.40      100.00
-----------------------+-----------------------------------
                 Total |     26,721      100.00

. 
. * COVID-19 kidney replacement therapy
. gen covid_krt_combined = covid_krt_icd_10
(19,090 missing values generated)

. replace covid_krt_combined = covid_krt_opcs_4 if covid_krt_icd_10==0
(372 real changes made)

. gen covid_krt = case

. replace covid_krt = 2 if covid_hospitalised==1
(768 real changes made)

. replace covid_krt = 3 if covid_krt_combined==1
(770 real changes made)

. label define covid_krt  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised SARS-CoV-
> 2"         ///
>                                                 2 "No KRT hospitalised COVID-
> 19"        ///
>                                                 3 "KRT hospitalised COVID-19"

. label values covid_krt covid_krt

. label var covid_krt "COVID-19 kidney replacement therapy"

. drop covid_krt_icd_10

. drop covid_krt_opcs_4

. safetab covid_krt, m
10

 COVID-19 kidney replacement |
                     therapy |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
       Historical comparator |     19,090       71.44       71.44
 Non-hospitalised SARS-CoV-2 |      6,168       23.08       94.52
No KRT hospitalised COVID-19 |        693        2.59       97.12
   KRT hospitalised COVID-19 |        770        2.88      100.00
-----------------------------+-----------------------------------
                       Total |     26,721      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(25,166 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(25,167 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(25,169 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(25,184 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(1,537 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(1,222 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(1,016 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(792 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Historical comparator"       ///
>                                                 1 "Pre-vaccination"          
>            ///
>                                                 2 "1 vaccine dose"           
>            ///
>                                                 3 "2 vaccine doses"          
>            ///
>                                                 4 "3 vaccine doses"          
>            ///
>                                                 5 "4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "Vaccination status"

. safetab covid_vax, m
10

   Vaccination status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,090       71.44       71.44
      Pre-vaccination |      3,064       11.47       82.91
       1 vaccine dose |        792        2.96       85.87
      2 vaccine doses |      1,016        3.80       89.67
      3 vaccine doses |      1,222        4.57       94.25
      4 vaccine doses |      1,537        5.75      100.00
----------------------+-----------------------------------
                Total |     26,721      100.00

. 
. * COVID-19 wave
. gen wave = case

. replace wave = 2 if index_month=="sep2020"
(348 real changes made)

. replace wave = 2 if index_month=="oct2020"
(320 real changes made)

. replace wave = 2 if index_month=="nov2020"
(323 real changes made)

. replace wave = 2 if index_month=="dec2020"
(281 real changes made)

. replace wave = 2 if index_month=="jan2021"
(310 real changes made)

. replace wave = 2 if index_month=="feb2021"
(230 real changes made)

. replace wave = 2 if index_month=="mar2021"
(235 real changes made)

. replace wave = 2 if index_month=="apr2021"
(218 real changes made)

. replace wave = 2 if index_month=="may2021"
(227 real changes made)

. replace wave = 2 if index_month=="jun2021"
(178 real changes made)

. replace wave = 3 if index_month=="jul2021"
(207 real changes made)

. replace wave = 3 if index_month=="aug2021"
(160 real changes made)

. replace wave = 3 if index_month=="sep2021"
(168 real changes made)

. replace wave = 3 if index_month=="oct2021"
(162 real changes made)

. replace wave = 3 if index_month=="nov2021"
(153 real changes made)

. replace wave = 4 if index_month=="dec2021"
(132 real changes made)

. replace wave = 4 if index_month=="jan2022"
(137 real changes made)

. replace wave = 4 if index_month=="feb2022"
(122 real changes made)

. replace wave = 4 if index_month=="mar2022"
(112 real changes made)

. replace wave = 4 if index_month=="apr2022"
(107 real changes made)

. replace wave = 4 if index_month=="may2022"
(98 real changes made)

. replace wave = 4 if index_month=="jun2022"
(92 real changes made)

. replace wave = 4 if index_month=="jul2022"
(104 real changes made)

. replace wave = 4 if index_month=="aug2022"
(82 real changes made)

. replace wave = 4 if index_month=="sep2022"
(70 real changes made)

. replace wave = 4 if index_month=="oct2022"
(69 real changes made)

. label define wave       0 "Historical comparator"       ///
>                                         1 "Febuary20-August20"  ///
>                                         2 "September20-June21"  ///
>                                         3 "July21-November21"   ///
>                                         4 "December21-October22"        

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m
5

        COVID-19 wave |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,090       71.44       71.44
   Febuary20-August20 |      2,986       11.17       82.62
   September20-June21 |      2,670        9.99       92.61
    July21-November21 |        850        3.18       95.79
 December21-October22 |      1,125        4.21      100.00
----------------------+-----------------------------------
                Total |     26,721      100.00

. 
. ** Covariates
. * Check of GP consultations by groups
. sum gp_count, detail

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -5
 5%            0             -4
10%            0             -4       Obs              26,721
25%            0             -4       Sum of Wgt.      26,721

50%            3                      Mean           3.328057
                        Largest       Std. Dev.      3.535535
75%            6             16
90%            8             16       Variance       12.50001
95%           10             17       Skewness       .6226338
99%           12             18       Kurtosis       2.254994

. bysort case: sum gp_count, detail

-------------------------------------------------------------------------------
-> case = Historical comparator

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -5
 5%            0             -4
10%            0             -4       Obs              19,090
25%            0             -4       Sum of Wgt.      19,090

50%            3                      Mean           3.319906
                        Largest       Std. Dev.      3.528465
75%            6             16
90%            8             16       Variance       12.45007
95%           10             16       Skewness        .621153
99%           12             17       Kurtosis       2.242778

-------------------------------------------------------------------------------
-> case = SARS-CoV-2

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -4
 5%            0             -3
10%            0             -3       Obs               7,631
25%            0             -3       Sum of Wgt.       7,631

50%            3                      Mean           3.348447
                        Largest       Std. Dev.       3.55331
75%            6             15
90%            8             16       Variance       12.62601
95%           10             16       Skewness       .6260336
99%           12             18       Kurtosis       2.283928


. 
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         17 |          1        0.00        0.00
         18 |        218        0.82        0.82
         19 |        320        1.20        2.02
         20 |        405        1.52        3.53
         21 |        461        1.73        5.26
         22 |        530        1.98        7.24
         23 |        581        2.17        9.42
         24 |        523        1.96       11.37
         25 |        510        1.91       13.28
         26 |        535        2.00       15.28
         27 |        516        1.93       17.21
         28 |        575        2.15       19.37
         29 |        523        1.96       21.32
         30 |        541        2.02       23.35
         31 |        542        2.03       25.38
         32 |        513        1.92       27.30
         33 |        537        2.01       29.31
         34 |        552        2.07       31.37
         35 |        578        2.16       33.54
         36 |        531        1.99       35.52
         37 |        512        1.92       37.44
         38 |        538        2.01       39.45
         39 |        507        1.90       41.35
         40 |        555        2.08       43.43
         41 |        507        1.90       45.32
         42 |        506        1.89       47.22
         43 |        522        1.95       49.17
         44 |        533        1.99       51.17
         45 |        514        1.92       53.09
         46 |        542        2.03       55.12
         47 |        538        2.01       57.13
         48 |        504        1.89       59.02
         49 |        548        2.05       61.07
         50 |        503        1.88       62.95
         51 |        548        2.05       65.00
         52 |        556        2.08       67.08
         53 |        552        2.07       69.15
         54 |        585        2.19       71.34
         55 |        549        2.05       73.39
         56 |        564        2.11       75.50
         57 |        529        1.98       77.48
         58 |        523        1.96       79.44
         59 |        511        1.91       81.35
         60 |        521        1.95       83.30
         61 |        551        2.06       85.36
         62 |        493        1.84       87.21
         63 |        501        1.87       89.08
         64 |        530        1.98       91.07
         65 |        545        2.04       93.11
         66 |        543        2.03       95.14
         67 |        566        2.12       97.26
         68 |        321        1.20       98.46
         69 |        193        0.72       99.18
         70 |        125        0.47       99.65
         71 |         79        0.30       99.94
         72 |         15        0.06      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. safecount
  26,721

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///          
>                            
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(26721 differences between age and agegroup)

. 
. label var age "Age"

. label values age age

. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label var agegroup "Age group"

. label values agegroup agegroup

. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex
0

        Sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     13,772       51.54       51.54
       Male |     12,949       48.46      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. safecount
  26,721

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(1,035 real changes made)

. replace ethnicity=2 if ethnicity==3
(999 real changes made)

. replace ethnicity=3 if ethnicity==4
(904 real changes made)

. replace ethnicity=4 if ethnicity==6
(1,035 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///          
>                                    
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                    
>                                            

. label values ethnicity ethnicity

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,094       60.23       60.23
South Asian |        999        3.74       63.97
      Black |        904        3.38       67.35
      Mixed |      1,035        3.87       71.22
      Other |        998        3.73       74.96
          . |      6,691       25.04      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(6,691 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(6,691 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. label var ethnicity1 "Ethnicity"

. safetab ethnicity1, m
11

  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,094       60.23       60.23
South Asian |        999        3.74       63.97
      Black |        904        3.38       67.35
      Mixed |      1,035        3.87       71.22
      Other |        998        3.73       74.96
    Unknown |      6,691       25.04      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,702       10.11       10.11
                Urban minor conurbation |      2,640        9.88       19.99
                    Urban city and town |      2,687       10.06       30.05
Urban city and town in a sparse setting |      2,597        9.72       39.77
                  Rural town and fringe |      2,793       10.45       50.22
Rural town and fringe in a sparse setti |      2,734       10.23       60.45
            Rural village and dispersed |      5,258       19.68       80.13
Rural village and dispersed in a sparse |      5,310       19.87      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,721      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(26,721 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(10,626 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(16,095 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                      rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0      2,793 |    16,095 
     Urban |     2,702      2,640      2,687      2,597          0 |    10,626 
-----------+-------------------------------------------------------+----------
     Total |     2,702      2,640      2,687      2,597      2,793 |    26,721 


Urban/rura |           rural_urban
         l | Rural tow  Rural vil  Rural vil |     Total
-----------+---------------------------------+----------
     Rural |     2,734      5,258      5,310 |    16,095 
     Urban |         0          0          0 |    10,626 
-----------+---------------------------------+----------
     Total |     2,734      5,258      5,310 |    26,721 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Historical comparator |    11,489      7,601 |    19,090 
           SARS-CoV-2 |     4,606      3,025 |     7,631 
----------------------+----------------------+----------
                Total |    16,095     10,626 |    26,721 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,733 real changes made, 2,733 to missing)

. gen     bmi = .
(26,721 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(bmi: 1703 changes made)

. recode  bmi . = 2 if body_mass_index<25
(bmi: 5973 changes made)

. recode  bmi . = 3 if body_mass_index<30
(bmi: 6219 changes made)

. recode  bmi . = 4 if body_mass_index<35
(bmi: 5340 changes made)

. recode  bmi . = 5 if body_mass_index<40
(bmi: 3129 changes made)

. recode  bmi . = 6 if body_mass_index<.
(bmi: 1624 changes made)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>            

. label values bmi bmi

. label var bmi "Body mass index (BMI)"

. safetab bmi, m
4

     Body mass index |
               (BMI) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,703        6.37        6.37
  Normal (18.5-24.9) |      5,973       22.35       28.73
Overweight (25-29.9) |      6,219       23.27       52.00
   Obese I (30-34.9) |      5,340       19.98       71.98
  Obese II (35-39.9) |      3,129       11.71       83.69
     Obese III (40+) |      1,624        6.08       89.77
                   . |      2,733       10.23      100.00
---------------------+-----------------------------------
               Total |     26,721      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(23,482 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(542 real changes made)

. replace smoking = 0 if smoking_status=="N"
(1,103 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m
8

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |      1,103        4.13        4.13
Current/former smoker |      3,781       14.15       18.28
                    . |     21,837       81.72      100.00
----------------------+-----------------------------------
                Total |     26,721      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000
> )
(11900 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(egfr_group: 14821 changes made)

. label define egfr_group 1 "≥105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "
> 30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m
11

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       ≥105 |      4,814       18.02       18.02
     90-104 |      1,989        7.44       25.46
      75-89 |      1,948        7.29       32.75
      60-74 |      2,336        8.74       41.49
      45-59 |      2,394        8.96       50.45
      30-44 |      1,240        4.64       55.09
      15-29 |        100        0.37       55.47
          . |     11,900       44.53      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 1
> 5-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(11,900 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(ckd_stage: 21907 changes made)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6
>  "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m
10

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |     11,087       41.49       41.49
                      CKD 3A |      2,394        8.96       50.45
                      CKD 3B |      1,240        4.64       55.09
                       CKD 4 |        100        0.37       55.47
No baseline eGFR measurement |     11,900       44.53      100.00
-----------------------------+-----------------------------------
                       Total |     26,721      100.00

. 
. * Comorbidities
. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib
0

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,402       95.06       95.06
          1 |      1,319        4.94      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver
0

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,187       98.00       98.00
          1 |        534        2.00      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. label var diabetes "Diabetes"

. safetab diabetes
0

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,343       79.87       79.87
          1 |      5,378       20.13      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer
0

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,462       99.03       99.03
          1 |        259        0.97      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. safetab heart_failure
0

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,651       96.00       96.00
          1 |      1,070        4.00      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. safetab hiv
0

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,191       98.02       98.02
          1 |        530        1.98      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. label var hypertension "Hypertension"

. safetab hypertension
0

Hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,405       80.11       80.11
          1 |      5,316       19.89      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. label var non_haem_cancer "Cancer (non-haematological)"

. safetab non_haem_cancer
0

     Cancer |
(non-haemat |
  ological) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,185       97.99       97.99
          1 |        536        2.01      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. safetab myocardial_infarction
0

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,066       90.06       90.06
          1 |      2,655        9.94      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd
0

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,199       98.05       98.05
          1 |        522        1.95      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid
0

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,371       94.95       94.95
          1 |      1,350        5.05      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. safetab stroke
0

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,183       97.99       97.99
          1 |        538        2.01      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus
0

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,183       97.99       97.99
          1 |        538        2.01      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(1,031 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,424 real changes made)

. replace cardiovascular = 1 if pvd==1
(429 real changes made)

. replace cardiovascular = 1 if stroke==1
(446 real changes made)

. label var cardiovascular "Cardiovascular diseases"

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(526 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,309 real changes made)

. replace immunosuppressed = 1 if lupus==1
(494 real changes made)

. label var immunosuppressed "Immunosuppressive diseases"

. safetab cardiovascular
0

Cardiovascu |
        lar |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,072       78.86       78.86
          1 |      5,649       21.14      100.00
------------+-----------------------------------
      Total |     26,721      100.00

. safetab immunosuppressed
0

Immunosuppr |
     essive |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,133       90.31       90.31
          1 |      2,588        9.69      100.00
------------+-----------------------------------
      Total |     26,721      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                              
>    creatinine_mar2017 ///
>                                                                              
>    creatinine_apr2017 ///
>                                                                              
>    creatinine_may2017 ///
>                                                                              
>    creatinine_jun2017 ///
>                                                                              
>    creatinine_jul2017 ///
>                                                                              
>    creatinine_aug2017 ///
>                                                                              
>    creatinine_sep2017 ///
>                                                                              
>    creatinine_oct2017 ///
>                                                                              
>    creatinine_nov2017 ///
>                                                                              
>    creatinine_dec2017 ///
>                                                                              
>    creatinine_jan2018 ///
>                                                                              
>    creatinine_feb2018 ///
>                                                                              
>    creatinine_mar2018 ///
>                                                                              
>    creatinine_apr2018 ///
>                                                                              
>    creatinine_may2018 ///
>                                                                              
>    creatinine_jun2018 ///
>                                                                              
>    creatinine_jul2018 ///
>                                                                              
>    creatinine_aug2018 ///
>                                                                              
>    creatinine_sep2018 ///
>                                                                              
>    creatinine_oct2018 ///
>                                                                              
>    creatinine_nov2018 ///
>                                                                              
>    creatinine_dec2018 ///
>                                                                              
>    creatinine_jan2019 ///
>                                                                              
>    creatinine_feb2019 ///
>                                                                              
>    creatinine_mar2019 ///
>                                                                              
>    creatinine_apr2019 ///
>                                                                              
>    creatinine_may2019 ///
>                                                                              
>    creatinine_jun2019 ///
>                                                                              
>    creatinine_jul2019 ///
>                                                                              
>    creatinine_aug2019 ///
>                                                                              
>    creatinine_sep2019 ///
>                                                                              
>    creatinine_feb2020 ///
>                                                                              
>    creatinine_mar2020 ///
>                                                                              
>    creatinine_apr2020 ///
>                                                                              
>    creatinine_may2020 ///
>                                                                              
>    creatinine_jun2020 ///
>                                                                              
>    creatinine_jul2020 ///
>                                                                              
>    creatinine_aug2020 ///
>                                                                              
>    creatinine_sep2020 ///
>                                                                              
>    creatinine_oct2020 ///
>                                                                              
>    creatinine_nov2020 ///
>                                                                              
>    creatinine_dec2020 ///
>                                                                              
>    creatinine_jan2021 ///
>                                                                              
>    creatinine_feb2021 ///
>                                                                              
>    creatinine_mar2021 ///
>                                                                              
>    creatinine_apr2021 ///
>                                                                              
>    creatinine_may2021 ///
>                                                                              
>    creatinine_jun2021 ///
>                                                                              
>    creatinine_jul2021 ///
>                                                                              
>    creatinine_aug2021 ///
>                                                                              
>    creatinine_sep2021 ///
>                                                                              
>    creatinine_oct2021 ///
>                                                                              
>    creatinine_nov2021 ///
>                                                                              
>    creatinine_dec2021 ///
>                                                                              
>    creatinine_jan2022 ///
>                                                                              
>    creatinine_feb2022 ///
>                                                                              
>    creatinine_mar2022 ///
>                                                                              
>    creatinine_apr2022 ///
>                                                                              
>    creatinine_may2022 ///
>                                                                              
>    creatinine_jun2022 ///
>                                                                              
>    creatinine_jul2022 ///
>                                                                              
>    creatinine_aug2022 ///
>                                                                              
>    creatinine_sep2022 ///
>                                                                              
>    creatinine_oct2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 300
> 0)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex=
> =0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex=
> =1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_m
> onthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex
> ==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(8,406 real changes made, 8,406 to missing)
(16,037 missing values generated)
(26,721 missing values generated)
(5,521 real changes made)
(5,163 real changes made)
(5,521 real changes made)
(5,163 real changes made)
(6,855 real changes made)
(26,721 missing values generated)
(5,521 real changes made)
(5,163 real changes made)
(10,684 real changes made)
(19,866 real changes made)
(16,037 missing values generated)
(10,684 real changes made)
(5,521 real changes made)
(8,370 real changes made, 8,370 to missing)
(16,001 missing values generated)
(26,721 missing values generated)
(5,563 real changes made)
(5,157 real changes made)
(5,563 real changes made)
(5,157 real changes made)
(6,841 real changes made)
(26,721 missing values generated)
(5,563 real changes made)
(5,157 real changes made)
(10,720 real changes made)
(19,880 real changes made)
(16,001 missing values generated)
(10,720 real changes made)
(5,563 real changes made)
(8,424 real changes made, 8,424 to missing)
(16,055 missing values generated)
(26,721 missing values generated)
(5,496 real changes made)
(5,170 real changes made)
(5,496 real changes made)
(5,170 real changes made)
(6,818 real changes made)
(26,721 missing values generated)
(5,496 real changes made)
(5,170 real changes made)
(10,666 real changes made)
(19,903 real changes made)
(16,055 missing values generated)
(10,666 real changes made)
(5,496 real changes made)
(8,378 real changes made, 8,378 to missing)
(16,009 missing values generated)
(26,721 missing values generated)
(5,510 real changes made)
(5,202 real changes made)
(5,510 real changes made)
(5,202 real changes made)
(6,864 real changes made)
(26,721 missing values generated)
(5,510 real changes made)
(5,202 real changes made)
(10,712 real changes made)
(19,857 real changes made)
(16,009 missing values generated)
(10,712 real changes made)
(5,510 real changes made)
(8,425 real changes made, 8,425 to missing)
(16,056 missing values generated)
(26,721 missing values generated)
(5,543 real changes made)
(5,122 real changes made)
(5,543 real changes made)
(5,122 real changes made)
(6,798 real changes made)
(26,721 missing values generated)
(5,543 real changes made)
(5,122 real changes made)
(10,665 real changes made)
(19,923 real changes made)
(16,056 missing values generated)
(10,665 real changes made)
(5,543 real changes made)
(8,417 real changes made, 8,417 to missing)
(16,048 missing values generated)
(26,721 missing values generated)
(5,527 real changes made)
(5,146 real changes made)
(5,527 real changes made)
(5,146 real changes made)
(6,766 real changes made)
(26,721 missing values generated)
(5,527 real changes made)
(5,146 real changes made)
(10,673 real changes made)
(19,955 real changes made)
(16,048 missing values generated)
(10,673 real changes made)
(5,527 real changes made)
(8,401 real changes made, 8,401 to missing)
(16,032 missing values generated)
(26,721 missing values generated)
(5,548 real changes made)
(5,141 real changes made)
(5,548 real changes made)
(5,141 real changes made)
(6,795 real changes made)
(26,721 missing values generated)
(5,548 real changes made)
(5,141 real changes made)
(10,689 real changes made)
(19,926 real changes made)
(16,032 missing values generated)
(10,689 real changes made)
(5,548 real changes made)
(8,384 real changes made, 8,384 to missing)
(16,015 missing values generated)
(26,721 missing values generated)
(5,508 real changes made)
(5,198 real changes made)
(5,508 real changes made)
(5,198 real changes made)
(6,853 real changes made)
(26,721 missing values generated)
(5,508 real changes made)
(5,198 real changes made)
(10,706 real changes made)
(19,868 real changes made)
(16,015 missing values generated)
(10,706 real changes made)
(5,508 real changes made)
(8,427 real changes made, 8,427 to missing)
(16,058 missing values generated)
(26,721 missing values generated)
(5,471 real changes made)
(5,192 real changes made)
(5,471 real changes made)
(5,192 real changes made)
(6,709 real changes made)
(26,721 missing values generated)
(5,471 real changes made)
(5,192 real changes made)
(10,663 real changes made)
(20,012 real changes made)
(16,058 missing values generated)
(10,663 real changes made)
(5,471 real changes made)
(8,387 real changes made, 8,387 to missing)
(16,018 missing values generated)
(26,721 missing values generated)
(5,478 real changes made)
(5,225 real changes made)
(5,478 real changes made)
(5,225 real changes made)
(6,815 real changes made)
(26,721 missing values generated)
(5,478 real changes made)
(5,225 real changes made)
(10,703 real changes made)
(19,906 real changes made)
(16,018 missing values generated)
(10,703 real changes made)
(5,478 real changes made)
(8,406 real changes made, 8,406 to missing)
(16,037 missing values generated)
(26,721 missing values generated)
(5,460 real changes made)
(5,224 real changes made)
(5,460 real changes made)
(5,224 real changes made)
(6,880 real changes made)
(26,721 missing values generated)
(5,460 real changes made)
(5,224 real changes made)
(10,684 real changes made)
(19,841 real changes made)
(16,037 missing values generated)
(10,684 real changes made)
(5,460 real changes made)
(8,354 real changes made, 8,354 to missing)
(15,985 missing values generated)
(26,721 missing values generated)
(5,465 real changes made)
(5,271 real changes made)
(5,465 real changes made)
(5,271 real changes made)
(6,842 real changes made)
(26,721 missing values generated)
(5,465 real changes made)
(5,271 real changes made)
(10,736 real changes made)
(19,879 real changes made)
(15,985 missing values generated)
(10,736 real changes made)
(5,465 real changes made)
(8,462 real changes made, 8,462 to missing)
(16,093 missing values generated)
(26,721 missing values generated)
(5,468 real changes made)
(5,160 real changes made)
(5,468 real changes made)
(5,160 real changes made)
(6,728 real changes made)
(26,721 missing values generated)
(5,468 real changes made)
(5,160 real changes made)
(10,628 real changes made)
(19,993 real changes made)
(16,093 missing values generated)
(10,628 real changes made)
(5,468 real changes made)
(8,421 real changes made, 8,421 to missing)
(16,052 missing values generated)
(26,721 missing values generated)
(5,510 real changes made)
(5,159 real changes made)
(5,510 real changes made)
(5,159 real changes made)
(6,725 real changes made)
(26,721 missing values generated)
(5,510 real changes made)
(5,159 real changes made)
(10,669 real changes made)
(19,996 real changes made)
(16,052 missing values generated)
(10,669 real changes made)
(5,510 real changes made)
(8,377 real changes made, 8,377 to missing)
(16,008 missing values generated)
(26,721 missing values generated)
(5,482 real changes made)
(5,231 real changes made)
(5,482 real changes made)
(5,231 real changes made)
(6,711 real changes made)
(26,721 missing values generated)
(5,482 real changes made)
(5,231 real changes made)
(10,713 real changes made)
(20,010 real changes made)
(16,008 missing values generated)
(10,713 real changes made)
(5,482 real changes made)
(8,374 real changes made, 8,374 to missing)
(16,005 missing values generated)
(26,721 missing values generated)
(5,560 real changes made)
(5,156 real changes made)
(5,560 real changes made)
(5,156 real changes made)
(6,782 real changes made)
(26,721 missing values generated)
(5,560 real changes made)
(5,156 real changes made)
(10,716 real changes made)
(19,939 real changes made)
(16,005 missing values generated)
(10,716 real changes made)
(5,560 real changes made)
(8,422 real changes made, 8,422 to missing)
(16,053 missing values generated)
(26,721 missing values generated)
(5,454 real changes made)
(5,214 real changes made)
(5,454 real changes made)
(5,214 real changes made)
(6,768 real changes made)
(26,721 missing values generated)
(5,454 real changes made)
(5,214 real changes made)
(10,668 real changes made)
(19,953 real changes made)
(16,053 missing values generated)
(10,668 real changes made)
(5,454 real changes made)
(8,438 real changes made, 8,438 to missing)
(16,069 missing values generated)
(26,721 missing values generated)
(5,500 real changes made)
(5,152 real changes made)
(5,500 real changes made)
(5,152 real changes made)
(6,797 real changes made)
(26,721 missing values generated)
(5,500 real changes made)
(5,152 real changes made)
(10,652 real changes made)
(19,924 real changes made)
(16,069 missing values generated)
(10,652 real changes made)
(5,500 real changes made)
(8,405 real changes made, 8,405 to missing)
(16,036 missing values generated)
(26,721 missing values generated)
(5,577 real changes made)
(5,108 real changes made)
(5,577 real changes made)
(5,108 real changes made)
(6,791 real changes made)
(26,721 missing values generated)
(5,577 real changes made)
(5,108 real changes made)
(10,685 real changes made)
(19,930 real changes made)
(16,036 missing values generated)
(10,685 real changes made)
(5,577 real changes made)
(8,380 real changes made, 8,380 to missing)
(16,011 missing values generated)
(26,721 missing values generated)
(5,509 real changes made)
(5,201 real changes made)
(5,509 real changes made)
(5,201 real changes made)
(6,801 real changes made)
(26,721 missing values generated)
(5,509 real changes made)
(5,201 real changes made)
(10,710 real changes made)
(19,920 real changes made)
(16,011 missing values generated)
(10,710 real changes made)
(5,509 real changes made)
(8,413 real changes made, 8,413 to missing)
(16,044 missing values generated)
(26,721 missing values generated)
(5,482 real changes made)
(5,195 real changes made)
(5,482 real changes made)
(5,195 real changes made)
(6,751 real changes made)
(26,721 missing values generated)
(5,482 real changes made)
(5,195 real changes made)
(10,677 real changes made)
(19,970 real changes made)
(16,044 missing values generated)
(10,677 real changes made)
(5,482 real changes made)
(8,432 real changes made, 8,432 to missing)
(16,063 missing values generated)
(26,721 missing values generated)
(5,515 real changes made)
(5,143 real changes made)
(5,515 real changes made)
(5,143 real changes made)
(6,742 real changes made)
(26,721 missing values generated)
(5,515 real changes made)
(5,143 real changes made)
(10,658 real changes made)
(19,979 real changes made)
(16,063 missing values generated)
(10,658 real changes made)
(5,515 real changes made)
(8,404 real changes made, 8,404 to missing)
(16,035 missing values generated)
(26,721 missing values generated)
(5,445 real changes made)
(5,241 real changes made)
(5,445 real changes made)
(5,241 real changes made)
(6,732 real changes made)
(26,721 missing values generated)
(5,445 real changes made)
(5,241 real changes made)
(10,686 real changes made)
(19,989 real changes made)
(16,035 missing values generated)
(10,686 real changes made)
(5,445 real changes made)
(8,403 real changes made, 8,403 to missing)
(16,034 missing values generated)
(26,721 missing values generated)
(5,519 real changes made)
(5,168 real changes made)
(5,519 real changes made)
(5,168 real changes made)
(6,762 real changes made)
(26,721 missing values generated)
(5,519 real changes made)
(5,168 real changes made)
(10,687 real changes made)
(19,959 real changes made)
(16,034 missing values generated)
(10,687 real changes made)
(5,519 real changes made)
(8,340 real changes made, 8,340 to missing)
(15,971 missing values generated)
(26,721 missing values generated)
(5,525 real changes made)
(5,225 real changes made)
(5,525 real changes made)
(5,225 real changes made)
(6,808 real changes made)
(26,721 missing values generated)
(5,525 real changes made)
(5,225 real changes made)
(10,750 real changes made)
(19,913 real changes made)
(15,971 missing values generated)
(10,750 real changes made)
(5,525 real changes made)
(8,371 real changes made, 8,371 to missing)
(16,002 missing values generated)
(26,721 missing values generated)
(5,548 real changes made)
(5,171 real changes made)
(5,548 real changes made)
(5,171 real changes made)
(6,776 real changes made)
(26,721 missing values generated)
(5,548 real changes made)
(5,171 real changes made)
(10,719 real changes made)
(19,945 real changes made)
(16,002 missing values generated)
(10,719 real changes made)
(5,548 real changes made)
(8,375 real changes made, 8,375 to missing)
(16,006 missing values generated)
(26,721 missing values generated)
(5,548 real changes made)
(5,167 real changes made)
(5,548 real changes made)
(5,167 real changes made)
(6,813 real changes made)
(26,721 missing values generated)
(5,548 real changes made)
(5,167 real changes made)
(10,715 real changes made)
(19,908 real changes made)
(16,006 missing values generated)
(10,715 real changes made)
(5,548 real changes made)
(8,435 real changes made, 8,435 to missing)
(16,066 missing values generated)
(26,721 missing values generated)
(5,464 real changes made)
(5,191 real changes made)
(5,464 real changes made)
(5,191 real changes made)
(6,717 real changes made)
(26,721 missing values generated)
(5,464 real changes made)
(5,191 real changes made)
(10,655 real changes made)
(20,004 real changes made)
(16,066 missing values generated)
(10,655 real changes made)
(5,464 real changes made)
(8,424 real changes made, 8,424 to missing)
(16,055 missing values generated)
(26,721 missing values generated)
(5,481 real changes made)
(5,185 real changes made)
(5,481 real changes made)
(5,185 real changes made)
(6,766 real changes made)
(26,721 missing values generated)
(5,481 real changes made)
(5,185 real changes made)
(10,666 real changes made)
(19,955 real changes made)
(16,055 missing values generated)
(10,666 real changes made)
(5,481 real changes made)
(8,427 real changes made, 8,427 to missing)
(16,058 missing values generated)
(26,721 missing values generated)
(5,450 real changes made)
(5,213 real changes made)
(5,450 real changes made)
(5,213 real changes made)
(6,758 real changes made)
(26,721 missing values generated)
(5,450 real changes made)
(5,213 real changes made)
(10,663 real changes made)
(19,963 real changes made)
(16,058 missing values generated)
(10,663 real changes made)
(5,450 real changes made)
(8,453 real changes made, 8,453 to missing)
(16,084 missing values generated)
(26,721 missing values generated)
(5,540 real changes made)
(5,097 real changes made)
(5,540 real changes made)
(5,097 real changes made)
(6,827 real changes made)
(26,721 missing values generated)
(5,540 real changes made)
(5,097 real changes made)
(10,637 real changes made)
(19,894 real changes made)
(16,084 missing values generated)
(10,637 real changes made)
(5,540 real changes made)
(8,425 real changes made, 8,425 to missing)
(16,056 missing values generated)
(26,721 missing values generated)
(5,485 real changes made)
(5,180 real changes made)
(5,485 real changes made)
(5,180 real changes made)
(6,718 real changes made)
(26,721 missing values generated)
(5,485 real changes made)
(5,180 real changes made)
(10,665 real changes made)
(20,003 real changes made)
(16,056 missing values generated)
(10,665 real changes made)
(5,485 real changes made)
(3,357 real changes made, 3,357 to missing)
(22,447 missing values generated)
(26,721 missing values generated)
(2,224 real changes made)
(2,050 real changes made)
(2,224 real changes made)
(2,050 real changes made)
(2,705 real changes made)
(26,721 missing values generated)
(2,224 real changes made)
(2,050 real changes made)
(4,274 real changes made)
(24,016 real changes made)
(22,447 missing values generated)
(4,274 real changes made)
(2,224 real changes made)
(3,399 real changes made, 3,399 to missing)
(22,489 missing values generated)
(26,721 missing values generated)
(2,161 real changes made)
(2,071 real changes made)
(2,161 real changes made)
(2,071 real changes made)
(2,660 real changes made)
(26,721 missing values generated)
(2,161 real changes made)
(2,071 real changes made)
(4,232 real changes made)
(24,061 real changes made)
(22,489 missing values generated)
(4,232 real changes made)
(2,161 real changes made)
(3,367 real changes made, 3,367 to missing)
(22,457 missing values generated)
(26,721 missing values generated)
(2,233 real changes made)
(2,031 real changes made)
(2,233 real changes made)
(2,031 real changes made)
(2,761 real changes made)
(26,721 missing values generated)
(2,233 real changes made)
(2,031 real changes made)
(4,264 real changes made)
(23,960 real changes made)
(22,457 missing values generated)
(4,264 real changes made)
(2,233 real changes made)
(3,384 real changes made, 3,384 to missing)
(22,474 missing values generated)
(26,721 missing values generated)
(2,191 real changes made)
(2,056 real changes made)
(2,191 real changes made)
(2,056 real changes made)
(2,700 real changes made)
(26,721 missing values generated)
(2,191 real changes made)
(2,056 real changes made)
(4,247 real changes made)
(24,021 real changes made)
(22,474 missing values generated)
(4,247 real changes made)
(2,191 real changes made)
(3,382 real changes made, 3,382 to missing)
(22,472 missing values generated)
(26,721 missing values generated)
(2,198 real changes made)
(2,051 real changes made)
(2,198 real changes made)
(2,051 real changes made)
(2,732 real changes made)
(26,721 missing values generated)
(2,198 real changes made)
(2,051 real changes made)
(4,249 real changes made)
(23,989 real changes made)
(22,472 missing values generated)
(4,249 real changes made)
(2,198 real changes made)
(3,336 real changes made, 3,336 to missing)
(22,426 missing values generated)
(26,721 missing values generated)
(2,194 real changes made)
(2,101 real changes made)
(2,194 real changes made)
(2,101 real changes made)
(2,729 real changes made)
(26,721 missing values generated)
(2,194 real changes made)
(2,101 real changes made)
(4,295 real changes made)
(23,992 real changes made)
(22,426 missing values generated)
(4,295 real changes made)
(2,194 real changes made)
(3,338 real changes made, 3,338 to missing)
(22,428 missing values generated)
(26,721 missing values generated)
(2,230 real changes made)
(2,063 real changes made)
(2,230 real changes made)
(2,063 real changes made)
(2,669 real changes made)
(26,721 missing values generated)
(2,230 real changes made)
(2,063 real changes made)
(4,293 real changes made)
(24,052 real changes made)
(22,428 missing values generated)
(4,293 real changes made)
(2,230 real changes made)
(3,305 real changes made, 3,305 to missing)
(22,395 missing values generated)
(26,721 missing values generated)
(2,226 real changes made)
(2,100 real changes made)
(2,226 real changes made)
(2,100 real changes made)
(2,788 real changes made)
(26,721 missing values generated)
(2,226 real changes made)
(2,100 real changes made)
(4,326 real changes made)
(23,933 real changes made)
(22,395 missing values generated)
(4,326 real changes made)
(2,226 real changes made)
(3,353 real changes made, 3,353 to missing)
(22,443 missing values generated)
(26,721 missing values generated)
(2,218 real changes made)
(2,060 real changes made)
(2,218 real changes made)
(2,060 real changes made)
(2,771 real changes made)
(26,721 missing values generated)
(2,218 real changes made)
(2,060 real changes made)
(4,278 real changes made)
(23,950 real changes made)
(22,443 missing values generated)
(4,278 real changes made)
(2,218 real changes made)
(3,394 real changes made, 3,394 to missing)
(22,484 missing values generated)
(26,721 missing values generated)
(2,124 real changes made)
(2,113 real changes made)
(2,124 real changes made)
(2,113 real changes made)
(2,664 real changes made)
(26,721 missing values generated)
(2,124 real changes made)
(2,113 real changes made)
(4,237 real changes made)
(24,057 real changes made)
(22,484 missing values generated)
(4,237 real changes made)
(2,124 real changes made)
(3,339 real changes made, 3,339 to missing)
(22,429 missing values generated)
(26,721 missing values generated)
(2,216 real changes made)
(2,076 real changes made)
(2,216 real changes made)
(2,076 real changes made)
(2,766 real changes made)
(26,721 missing values generated)
(2,216 real changes made)
(2,076 real changes made)
(4,292 real changes made)
(23,955 real changes made)
(22,429 missing values generated)
(4,292 real changes made)
(2,216 real changes made)
(3,360 real changes made, 3,360 to missing)
(22,450 missing values generated)
(26,721 missing values generated)
(2,194 real changes made)
(2,077 real changes made)
(2,194 real changes made)
(2,077 real changes made)
(2,736 real changes made)
(26,721 missing values generated)
(2,194 real changes made)
(2,077 real changes made)
(4,271 real changes made)
(23,985 real changes made)
(22,450 missing values generated)
(4,271 real changes made)
(2,194 real changes made)
(3,371 real changes made, 3,371 to missing)
(22,461 missing values generated)
(26,721 missing values generated)
(2,183 real changes made)
(2,077 real changes made)
(2,183 real changes made)
(2,077 real changes made)
(2,681 real changes made)
(26,721 missing values generated)
(2,183 real changes made)
(2,077 real changes made)
(4,260 real changes made)
(24,040 real changes made)
(22,461 missing values generated)
(4,260 real changes made)
(2,183 real changes made)
(3,344 real changes made, 3,344 to missing)
(22,434 missing values generated)
(26,721 missing values generated)
(2,198 real changes made)
(2,089 real changes made)
(2,198 real changes made)
(2,089 real changes made)
(2,744 real changes made)
(26,721 missing values generated)
(2,198 real changes made)
(2,089 real changes made)
(4,287 real changes made)
(23,977 real changes made)
(22,434 missing values generated)
(4,287 real changes made)
(2,198 real changes made)
(3,365 real changes made, 3,365 to missing)
(22,455 missing values generated)
(26,721 missing values generated)
(2,185 real changes made)
(2,081 real changes made)
(2,185 real changes made)
(2,081 real changes made)
(2,704 real changes made)
(26,721 missing values generated)
(2,185 real changes made)
(2,081 real changes made)
(4,266 real changes made)
(24,017 real changes made)
(22,455 missing values generated)
(4,266 real changes made)
(2,185 real changes made)
(3,403 real changes made, 3,403 to missing)
(22,493 missing values generated)
(26,721 missing values generated)
(2,198 real changes made)
(2,030 real changes made)
(2,198 real changes made)
(2,030 real changes made)
(2,704 real changes made)
(26,721 missing values generated)
(2,198 real changes made)
(2,030 real changes made)
(4,228 real changes made)
(24,017 real changes made)
(22,493 missing values generated)
(4,228 real changes made)
(2,198 real changes made)
(3,370 real changes made, 3,370 to missing)
(22,460 missing values generated)
(26,721 missing values generated)
(2,172 real changes made)
(2,089 real changes made)
(2,172 real changes made)
(2,089 real changes made)
(2,681 real changes made)
(26,721 missing values generated)
(2,172 real changes made)
(2,089 real changes made)
(4,261 real changes made)
(24,040 real changes made)
(22,460 missing values generated)
(4,261 real changes made)
(2,172 real changes made)
(3,337 real changes made, 3,337 to missing)
(22,427 missing values generated)
(26,721 missing values generated)
(2,244 real changes made)
(2,050 real changes made)
(2,244 real changes made)
(2,050 real changes made)
(2,729 real changes made)
(26,721 missing values generated)
(2,244 real changes made)
(2,050 real changes made)
(4,294 real changes made)
(23,992 real changes made)
(22,427 missing values generated)
(4,294 real changes made)
(2,244 real changes made)
(3,333 real changes made, 3,333 to missing)
(22,423 missing values generated)
(26,721 missing values generated)
(2,229 real changes made)
(2,069 real changes made)
(2,229 real changes made)
(2,069 real changes made)
(2,769 real changes made)
(26,721 missing values generated)
(2,229 real changes made)
(2,069 real changes made)
(4,298 real changes made)
(23,952 real changes made)
(22,423 missing values generated)
(4,298 real changes made)
(2,229 real changes made)
(3,363 real changes made, 3,363 to missing)
(22,453 missing values generated)
(26,721 missing values generated)
(2,172 real changes made)
(2,096 real changes made)
(2,172 real changes made)
(2,096 real changes made)
(2,698 real changes made)
(26,721 missing values generated)
(2,172 real changes made)
(2,096 real changes made)
(4,268 real changes made)
(24,023 real changes made)
(22,453 missing values generated)
(4,268 real changes made)
(2,172 real changes made)
(3,352 real changes made, 3,352 to missing)
(22,442 missing values generated)
(26,721 missing values generated)
(2,190 real changes made)
(2,089 real changes made)
(2,190 real changes made)
(2,089 real changes made)
(2,670 real changes made)
(26,721 missing values generated)
(2,190 real changes made)
(2,089 real changes made)
(4,279 real changes made)
(24,051 real changes made)
(22,442 missing values generated)
(4,279 real changes made)
(2,190 real changes made)
(3,341 real changes made, 3,341 to missing)
(22,431 missing values generated)
(26,721 missing values generated)
(2,197 real changes made)
(2,093 real changes made)
(2,197 real changes made)
(2,093 real changes made)
(2,701 real changes made)
(26,721 missing values generated)
(2,197 real changes made)
(2,093 real changes made)
(4,290 real changes made)
(24,020 real changes made)
(22,431 missing values generated)
(4,290 real changes made)
(2,197 real changes made)
(3,352 real changes made, 3,352 to missing)
(22,442 missing values generated)
(26,721 missing values generated)
(2,235 real changes made)
(2,044 real changes made)
(2,235 real changes made)
(2,044 real changes made)
(2,711 real changes made)
(26,721 missing values generated)
(2,235 real changes made)
(2,044 real changes made)
(4,279 real changes made)
(24,010 real changes made)
(22,442 missing values generated)
(4,279 real changes made)
(2,235 real changes made)
(3,372 real changes made, 3,372 to missing)
(22,462 missing values generated)
(26,721 missing values generated)
(2,192 real changes made)
(2,067 real changes made)
(2,192 real changes made)
(2,067 real changes made)
(2,692 real changes made)
(26,721 missing values generated)
(2,192 real changes made)
(2,067 real changes made)
(4,259 real changes made)
(24,029 real changes made)
(22,462 missing values generated)
(4,259 real changes made)
(2,192 real changes made)
(3,348 real changes made, 3,348 to missing)
(22,438 missing values generated)
(26,721 missing values generated)
(2,181 real changes made)
(2,102 real changes made)
(2,181 real changes made)
(2,102 real changes made)
(2,719 real changes made)
(26,721 missing values generated)
(2,181 real changes made)
(2,102 real changes made)
(4,283 real changes made)
(24,002 real changes made)
(22,438 missing values generated)
(4,283 real changes made)
(2,181 real changes made)
(3,341 real changes made, 3,341 to missing)
(22,431 missing values generated)
(26,721 missing values generated)
(2,221 real changes made)
(2,069 real changes made)
(2,221 real changes made)
(2,069 real changes made)
(2,780 real changes made)
(26,721 missing values generated)
(2,221 real changes made)
(2,069 real changes made)
(4,290 real changes made)
(23,941 real changes made)
(22,431 missing values generated)
(4,290 real changes made)
(2,221 real changes made)
(3,345 real changes made, 3,345 to missing)
(22,435 missing values generated)
(26,721 missing values generated)
(2,173 real changes made)
(2,113 real changes made)
(2,173 real changes made)
(2,113 real changes made)
(2,664 real changes made)
(26,721 missing values generated)
(2,173 real changes made)
(2,113 real changes made)
(4,286 real changes made)
(24,057 real changes made)
(22,435 missing values generated)
(4,286 real changes made)
(2,173 real changes made)
(3,408 real changes made, 3,408 to missing)
(22,498 missing values generated)
(26,721 missing values generated)
(2,147 real changes made)
(2,076 real changes made)
(2,147 real changes made)
(2,076 real changes made)
(2,692 real changes made)
(26,721 missing values generated)
(2,147 real changes made)
(2,076 real changes made)
(4,223 real changes made)
(24,029 real changes made)
(22,498 missing values generated)
(4,223 real changes made)
(2,147 real changes made)
(3,371 real changes made, 3,371 to missing)
(22,461 missing values generated)
(26,721 missing values generated)
(2,150 real changes made)
(2,110 real changes made)
(2,150 real changes made)
(2,110 real changes made)
(2,675 real changes made)
(26,721 missing values generated)
(2,150 real changes made)
(2,110 real changes made)
(4,260 real changes made)
(24,046 real changes made)
(22,461 missing values generated)
(4,260 real changes made)
(2,150 real changes made)
(3,328 real changes made, 3,328 to missing)
(22,418 missing values generated)
(26,721 missing values generated)
(2,167 real changes made)
(2,136 real changes made)
(2,167 real changes made)
(2,136 real changes made)
(2,733 real changes made)
(26,721 missing values generated)
(2,167 real changes made)
(2,136 real changes made)
(4,303 real changes made)
(23,988 real changes made)
(22,418 missing values generated)
(4,303 real changes made)
(2,167 real changes made)
(3,385 real changes made, 3,385 to missing)
(22,475 missing values generated)
(26,721 missing values generated)
(2,178 real changes made)
(2,068 real changes made)
(2,178 real changes made)
(2,068 real changes made)
(2,722 real changes made)
(26,721 missing values generated)
(2,178 real changes made)
(2,068 real changes made)
(4,246 real changes made)
(23,999 real changes made)
(22,475 missing values generated)
(4,246 real changes made)
(2,178 real changes made)
(3,339 real changes made, 3,339 to missing)
(22,429 missing values generated)
(26,721 missing values generated)
(2,166 real changes made)
(2,126 real changes made)
(2,166 real changes made)
(2,126 real changes made)
(2,727 real changes made)
(26,721 missing values generated)
(2,166 real changes made)
(2,126 real changes made)
(4,292 real changes made)
(23,994 real changes made)
(22,429 missing values generated)
(4,292 real changes made)
(2,166 real changes made)
(3,356 real changes made, 3,356 to missing)
(22,446 missing values generated)
(26,721 missing values generated)
(2,195 real changes made)
(2,080 real changes made)
(2,195 real changes made)
(2,080 real changes made)
(2,705 real changes made)
(26,721 missing values generated)
(2,195 real changes made)
(2,080 real changes made)
(4,275 real changes made)
(24,016 real changes made)
(22,446 missing values generated)
(4,275 real changes made)
(2,195 real changes made)

. 
. replace index_date = index_date_28
(26,721 real changes made)

. drop index_date_28

. gen egfr15_date=.
(26,721 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatin
> ine_`x'<15 & date("01`x'", "DMY")>index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen index_date_esrd = index_date

. gen esrd_date = egfr15_date
(26,721 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if esrd_date==.
(2,645 real changes made)

. gen esrd = 0

. replace esrd = 1 if esrd_date!=.
(2,645 real changes made)

. label var esrd "Kidney failure"

. gen esrd_time = (esrd_date - index_date_esrd)
(24,076 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(24,076 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(esrd_time_cat: 2641 changes made)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"           
>            ///
>                                                         3 "1 to 28 days"     
>    ///
>                                                         4 "20 to 90 days"    
>    ///
>                                                         5 "91 to 180 days"   
>    ///
>                                                         6 "181 to 365 days"  
>    ///
>                                                         7 "366 to 730 days"  
>    ///
>                                                         8 "731 to 973 days"  
>    ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 covid_severit
> y  ///
>                                                                 covid_aki    
>            {
  2.                                                                 by `exposu
> re',sort: sum esrd_time, de
  3.                                                                 tab esrd_t
> ime_cat `exposure', m col chi
  4.                                                                 }

-------------------------------------------------------------------------------
-> case = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%           36              1       Obs               1,941
25%          148              1       Sum of Wgt.       1,941

50%          333                      Mean           358.0263
                        Largest       Std. Dev.      248.2678
75%          542            966
90%          722            970       Variance       61636.89
95%          796            978       Skewness        .348835
99%          916            981       Kurtosis       2.132902

-------------------------------------------------------------------------------
-> case = SARS-CoV-2

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            4              1
10%           34              1       Obs                 704
25%          143              1       Sum of Wgt.         704

50%          314                      Mean           344.4176
                        Largest       Std. Dev.      244.0183
75%        539.5            912
90%          708            925       Variance       59544.95
95%          775            931       Skewness       .3994292
99%          852            965       Kurtosis       2.070929


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Historica  SARS-CoV- |     Total
----------------+----------------------+----------
   1 to 28 days |       171         68 |       239 
                |      0.90       0.89 |      0.89 
----------------+----------------------+----------
  20 to 90 days |       170         53 |       223 
                |      0.89       0.69 |      0.83 
----------------+----------------------+----------
 91 to 180 days |       233         99 |       332 
                |      1.22       1.30 |      1.24 
----------------+----------------------+----------
181 to 365 days |       474        193 |       667 
                |      2.48       2.53 |      2.50 
----------------+----------------------+----------
366 to 730 days |       713        238 |       951 
                |      3.73       3.12 |      3.56 
----------------+----------------------+----------
731 to 973 days |       178         53 |       231 
                |      0.93       0.69 |      0.86 
----------------+----------------------+----------
      >973 days |         2          0 |         2 
                |      0.01       0.00 |      0.01 
----------------+----------------------+----------
              . |    17,149      6,927 |    24,076 
                |     89.83      90.77 |     90.10 
----------------+----------------------+----------
          Total |    19,090      7,631 |    26,721 
                |    100.00     100.00 |    100.00 

          Pearson chi2(7) =  13.5353   Pr = 0.060

-------------------------------------------------------------------------------
-> covid_severity = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%           36              1       Obs               1,941
25%          148              1       Sum of Wgt.       1,941

50%          333                      Mean           358.0263
                        Largest       Std. Dev.      248.2678
75%          542            966
90%          722            970       Variance       61636.89
95%          796            978       Skewness        .348835
99%          916            981       Kurtosis       2.132902

-------------------------------------------------------------------------------
-> covid_severity = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           34              1       Obs                 571
25%          141              1       Sum of Wgt.         571

50%          305                      Mean           341.8511
                        Largest       Std. Dev.      245.0011
75%          539            912
90%          708            925       Variance       60025.55
95%          770            931       Skewness       .4238466
99%          869            965       Kurtosis       2.078049

-------------------------------------------------------------------------------
-> covid_severity = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            5              1
10%           10              4       Obs                  61
25%          155              5       Sum of Wgt.          61

50%          266                      Mean           324.6393
                        Largest       Std. Dev.      238.3023
75%          533            773
90%          661            777       Variance       56787.97
95%          773            793       Skewness       .4578762
99%          852            852       Kurtosis       2.139123

-------------------------------------------------------------------------------
-> covid_severity = Critical care COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           24              1
10%           49              1       Obs                  72
25%        186.5             24       Sum of Wgt.          72

50%        374.5                      Mean           381.5278
                        Largest       Std. Dev.      240.6411
75%          558            804
90%          710            834       Variance       57908.14
95%          804            846       Skewness       .1661586
99%          847            847       Kurtosis       2.065983


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |             SARS-CoV-2 severity
  esrd_time_cat | Historica  Non-hospi  Hospitali  Critical  |     Total
----------------+--------------------------------------------+----------
   1 to 28 days |       171         55          7          6 |       239 
                |      0.90       0.89       1.00       0.78 |      0.89 
----------------+--------------------------------------------+----------
  20 to 90 days |       170         45          4          4 |       223 
                |      0.89       0.73       0.57       0.52 |      0.83 
----------------+--------------------------------------------+----------
 91 to 180 days |       233         83          9          7 |       332 
                |      1.22       1.35       1.29       0.91 |      1.24 
----------------+--------------------------------------------+----------
181 to 365 days |       474        157         18         18 |       667 
                |      2.48       2.55       2.58       2.35 |      2.50 
----------------+--------------------------------------------+----------
366 to 730 days |       713        189         19         30 |       951 
                |      3.73       3.06       2.73       3.91 |      3.56 
----------------+--------------------------------------------+----------
731 to 973 days |       178         42          4          7 |       231 
                |      0.93       0.68       0.57       0.91 |      0.86 
----------------+--------------------------------------------+----------
      >973 days |         2          0          0          0 |         2 
                |      0.01       0.00       0.00       0.00 |      0.01 
----------------+--------------------------------------------+----------
              . |    17,149      5,596        636        695 |    24,076 
                |     89.83      90.74      91.25      90.61 |     90.10 
----------------+--------------------------------------------+----------
          Total |    19,090      6,167        697        767 |    26,721 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(21) =  17.6519   Pr = 0.671

-------------------------------------------------------------------------------
-> covid_aki = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%           36              1       Obs               1,941
25%          148              1       Sum of Wgt.       1,941

50%          333                      Mean           358.0263
                        Largest       Std. Dev.      248.2678
75%          542            966
90%          722            970       Variance       61636.89
95%          796            978       Skewness        .348835
99%          916            981       Kurtosis       2.132902

-------------------------------------------------------------------------------
-> covid_aki = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%         31.5              1       Obs                 610
25%          141              1       Sum of Wgt.         610

50%          313                      Mean            343.882
                        Largest       Std. Dev.      245.3804
75%          539            912
90%        708.5            925       Variance       60211.52
95%          779            931       Skewness       .4081052
99%          859            965       Kurtosis       2.082155

-------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            7              4
10%           42              5       Obs                  67
25%          167              7       Sum of Wgt.          67

50%          310                      Mean           339.3582
                        Largest       Std. Dev.      237.8021
75%          544            773
90%          702            777       Variance       56549.84
95%          773            793       Skewness       .3874273
99%          852            852       Kurtosis       2.053639

-------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID-AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%          106            106       Obs                  27
25%          189            121       Sum of Wgt.          27

50%          353                      Mean           369.0741
                        Largest       Std. Dev.      235.3956
75%          651            704
90%          713            713       Variance       55411.07
95%          715            715       Skewness        .226596
99%          746            746       Kurtosis       1.813504


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |        COVID-19 acute kidney injury
  esrd_time_cat | Historica  Non-hospi  Hospitali  Hospitali |     Total
----------------+--------------------------------------------+----------
   1 to 28 days |       171         60          6          2 |       239 
                |      0.90       0.92       0.82       0.53 |      0.89 
----------------+--------------------------------------------+----------
  20 to 90 days |       170         48          5          0 |       223 
                |      0.89       0.74       0.68       0.00 |      0.83 
----------------+--------------------------------------------+----------
 91 to 180 days |       233         85         10          4 |       332 
                |      1.22       1.30       1.36       1.07 |      1.24 
----------------+--------------------------------------------+----------
181 to 365 days |       474        165         19          9 |       667 
                |      2.48       2.53       2.59       2.41 |      2.50 
----------------+--------------------------------------------+----------
366 to 730 days |       713        205         22         11 |       951 
                |      3.73       3.14       3.00       2.94 |      3.56 
----------------+--------------------------------------------+----------
731 to 973 days |       178         47          5          1 |       231 
                |      0.93       0.72       0.68       0.27 |      0.86 
----------------+--------------------------------------------+----------
      >973 days |         2          0          0          0 |         2 
                |      0.01       0.00       0.00       0.00 |      0.01 
----------------+--------------------------------------------+----------
              . |    17,149      5,913        667        347 |    24,076 
                |     89.83      90.65      90.87      92.78 |     90.10 
----------------+--------------------------------------------+----------
          Total |    19,090      6,523        734        374 |    26,721 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(21) =  17.7790   Pr = 0.663

. gen exit_date_esrd = esrd_date
(24,076 missing values generated)

. format exit_date_esrd %td

. gen end_date = date("2022-11-30", "YMD") if case==1
(19,090 missing values generated)

. replace end_date = date("2019-11-30", "YMD") if case==0
(19,090 real changes made)

. format end_date %td

. replace exit_date_esrd = min(deregistered_date, death_date, end_date) if esrd
> _date==.
(24,076 real changes made)

. gen esrd_denominator = 1

. gen follow_up_time_esrd = (exit_date_esrd - index_date_esrd)

. label var follow_up_time_esrd "Follow-up time (Days)"

. gen follow_up_cat_esrd = follow_up_time_esrd

. recode follow_up_cat_esrd       min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0=3                     ///
>                                                 1/365=4         ///
>                                                 366/730=5       ///
>                                                 731/1040=6      ///          
>                            
>                                                 1041/max=7
(follow_up_cat_esrd: 26703 changes made)

. label define follow_up_cat_esrd         1 "<-29 days"   ///
>                                                         2 "-28 to -1 days"   
>            ///
>                                                         3 "0 days"           
>                    ///
>                                                         4 "1 to 365 days"    
>            ///
>                                                         5 "366 to 730 days"  
>    ///
>                                                         6 "731 to 1040 days" 
>    ///
>                                                         7 ">1040 days"

. label values follow_up_cat_esrd follow_up_cat_esrd

. label var follow_up_cat_esrd "Follow_up time"

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,561      6,813      7,716 |    19,090 
           SARS-CoV-2 |     1,874      2,727      3,030 |     7,631 
----------------------+---------------------------------+----------
                Total |     6,435      9,540     10,746 |    26,721 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |          Follow_up time
  replacement therapy | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,561      6,813      7,716 |    19,090 
Non-hospitalised SARS |     1,521      2,191      2,456 |     6,168 
No KRT hospitalised C |       167        247        279 |       693 
KRT hospitalised COVI |       186        289        295 |       770 
----------------------+---------------------------------+----------
                Total |     6,435      9,540     10,746 |    26,721 

. drop if follow_up_time_esrd<1
(0 observations deleted)

. drop if follow_up_time_esrd>1040
(0 observations deleted)

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,561      6,813      7,716 |    19,090 
           SARS-CoV-2 |     1,874      2,727      3,030 |     7,631 
----------------------+---------------------------------+----------
                Total |     6,435      9,540     10,746 |    26,721 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |          Follow_up time
  replacement therapy | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,561      6,813      7,716 |    19,090 
Non-hospitalised SARS |     1,521      2,191      2,456 |     6,168 
No KRT hospitalised C |       167        247        279 |       693 
KRT hospitalised COVI |       186        289        295 |       770 
----------------------+---------------------------------+----------
                Total |     6,435      9,540     10,746 |    26,721 

. gen follow_up_years_esrd = follow_up_time_esrd/365.25

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(26,721 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep
> 2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 
> jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr20
> 19 may2019 jun2019 jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 ju
> n2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021
>  apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2
> 022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_h
> alf_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>ind
> ex_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(41 real changes made)
(83 real changes made)
(126 real changes made)
(134 real changes made)
(140 real changes made)
(152 real changes made)
(161 real changes made)
(182 real changes made)
(182 real changes made)
(229 real changes made)
(181 real changes made)
(199 real changes made)
(161 real changes made)
(184 real changes made)
(173 real changes made)
(166 real changes made)
(156 real changes made)
(176 real changes made)
(163 real changes made)
(178 real changes made)
(144 real changes made)
(153 real changes made)
(150 real changes made)
(134 real changes made)
(129 real changes made)
(121 real changes made)
(144 real changes made)
(102 real changes made)
(143 real changes made)
(104 real changes made)
(0 real changes made)
(0 real changes made)
(22 real changes made)
(28 real changes made)
(54 real changes made)
(42 real changes made)
(43 real changes made)
(55 real changes made)
(68 real changes made)
(74 real changes made)
(73 real changes made)
(77 real changes made)
(74 real changes made)
(56 real changes made)
(69 real changes made)
(83 real changes made)
(60 real changes made)
(76 real changes made)
(64 real changes made)
(54 real changes made)
(68 real changes made)
(55 real changes made)
(63 real changes made)
(56 real changes made)
(62 real changes made)
(59 real changes made)
(50 real changes made)
(51 real changes made)
(57 real changes made)
(50 real changes made)
(51 real changes made)
(53 real changes made)
(37 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(1,938 real changes made)

. gen egfr_half = 0

. replace egfr_half = 1 if egfr_half_date!=.
(8,213 real changes made)

. label var egfr_half "50% reduction in eGFR"

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(11,900 real changes made, 11,900 to missing)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(18,508 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date) if e
> gfr_half_date==. & index_date_egfr_half!=.
(7,782 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(11,900 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days
> )"

. gen egfr_half_denominator = 0

. replace egfr_half_denominator = 1 if index_date_egfr_half!=.
(14,821 real changes made)

. gen follow_up_years_egfr_half = follow_up_time_egfr_half/365.25
(11,900 missing values generated)

. 
. * AKI (or ESRD)
. gen index_date_aki = index_date

. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(24,054 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(2,398 real changes made)

. gen aki = 0

. replace aki = 1 if aki_date!=.
(5,065 real changes made)

. label var aki "Acute kidney injury"

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(21,656 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date)  if aki_da
> te==.
(21,656 real changes made)

. gen aki_denominator = 1

. gen follow_up_time_aki = (exit_date_aki - index_date_aki)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. gen follow_up_years_aki = follow_up_time_aki/365.25

. 
. * Exit date (death)
. gen index_date_death = index_date

. gen exit_date_death = death_date
(25,137 missing values generated)

. gen death = 0

. replace death = 1 if death_date!=.
(1,584 real changes made)

. label var death "Death"

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(25,137 real changes made)

. gen death_denominator = 1

. gen follow_up_time_death = (exit_date_death - index_date_death)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. gen follow_up_years_death = follow_up_time_death/365.25

. 
. stset exit_date_esrd, fail(esrd_date) origin(index_date_esrd) id(unique) scal
> e(365.25)

                id:  unique
     failure event:  esrd_date != 0 & esrd_date < .
obs. time interval:  (exit_date_esrd[_n-1], exit_date_esrd]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_esrd

------------------------------------------------------------------------------
     26,721  total observations
          0  exclusions
------------------------------------------------------------------------------
     26,721  observations remaining, representing
     26,721  subjects
      2,645  failures in single-failure-per-subject data
 43,834.574  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  2.748802

. tab _st follow_up_cat_esrd

      1 if |
 record is |
     to be |
   used; 0 |          Follow_up time
 otherwise | 1 to 365   366 to 73  731 to 10 |     Total
-----------+---------------------------------+----------
         1 |     6,435      9,540     10,746 |    26,721 
-----------+---------------------------------+----------
     Total |     6,435      9,540     10,746 |    26,721 

. 
. foreach outcome of varlist esrd egfr_half aki death {
  2.         stset exit_date_`outcome', fail(`outcome'_date) origin(index_date_
> `outcome') id(unique) scale(365.25)
  3.         bysort case: egen total_follow_up_`outcome' = total(_t)
  4.         forvalues i=0/1 {
  5.         di "Denominator case=`i' `outcome':"
  6.         count if case==`i' & `outcome'_denominator==1
  7.         local denominator = r(N)
  8.         di "Denominator(_st=1) case=`i' `outcome':"
  9.         count if case==`i' & `outcome'_denominator==1 & _st==1
 10.         local st_denominator = r(N)
 11.         di "Events case=`i' `outcome':"
 12.         count if case==`i' & `outcome'==1
 13.         local event = r(N)
 14.         di "Events (_st=1) case=`i' `outcome':"
 15.         count if case==`i' & `outcome'==1 & _st==1
 16.         local st_event = r(N)
 17.         di "Total follow_up case=`i' `outcome':"
 18.         su total_follow_up_`outcome' if case==`i'
 19.         local person_year = r(mean)
 20.         local rate = 100000*(`event'/`person_year')
 21.         di "Rate case=`i' `outcome':"
 22.         di `rate'
 23.         local st_rate = 100000*(`st_event'/`person_year')
 24.         di "Rate (_st=1) case=`i' `outcome':"
 25.         di `st_rate'
 26.         }
 27.         drop total_follow_up_`outcome'
 28. }

                id:  unique
     failure event:  esrd_date != 0 & esrd_date < .
obs. time interval:  (exit_date_esrd[_n-1], exit_date_esrd]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_esrd

------------------------------------------------------------------------------
     26,721  total observations
          0  exclusions
------------------------------------------------------------------------------
     26,721  observations remaining, representing
     26,721  subjects
      2,645  failures in single-failure-per-subject data
 43,834.574  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  2.748802
Denominator case=0 esrd:
  19,090
Denominator(_st=1) case=0 esrd:
  19,090
Events case=0 esrd:
  1,941
Events (_st=1) case=0 esrd:
  1,941
Total follow_up case=0 esrd:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~d |     19,090    31366.49           0   31366.49   31366.49
Rate case=0 esrd:
6188.1333
Rate (_st=1) case=0 esrd:
6188.1333
Denominator case=1 esrd:
  7,631
Denominator(_st=1) case=1 esrd:
  7,631
Events case=1 esrd:
  704
Events (_st=1) case=1 esrd:
  704
Total follow_up case=1 esrd:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~d |      7,631    12468.09           0   12468.09   12468.09
Rate case=1 esrd:
5646.4151
Rate (_st=1) case=1 esrd:
5646.4151

                id:  unique
     failure event:  egfr_half_date != 0 & egfr_half_date < .
obs. time interval:  (exit_date_egfr_half[_n-1], exit_date_egfr_half]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_egfr_half

------------------------------------------------------------------------------
     26,721  total observations
     10,726  event time missing (exit_date_egfr_half>=.)        PROBABLE ERROR
      1,174  ignored because never entered
------------------------------------------------------------------------------
     14,821  observations remaining, representing
     14,821  subjects
      7,039  failures in single-failure-per-subject data
 17,056.348  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  2.748802
Denominator case=0 egfr_half:
  10,554
Denominator(_st=1) case=0 egfr_half:
  10,554
Events case=0 egfr_half:
  5,928
Events (_st=1) case=0 egfr_half:
  5,063
Total follow_up case=0 egfr_half:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~f |     19,090    12162.66           0   12162.66   12162.66
Rate case=0 egfr_half:
48739.334
Rate (_st=1) case=0 egfr_half:
41627.403
Denominator case=1 egfr_half:
  4,267
Denominator(_st=1) case=1 egfr_half:
  4,267
Events case=1 egfr_half:
  2,285
Events (_st=1) case=1 egfr_half:
  1,976
Total follow_up case=1 egfr_half:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~f |      7,631    4893.687           0   4893.687   4893.687
Rate case=1 egfr_half:
46692.815
Rate (_st=1) case=1 egfr_half:
40378.557

                id:  unique
     failure event:  aki_date != 0 & aki_date < .
obs. time interval:  (exit_date_aki[_n-1], exit_date_aki]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_aki

------------------------------------------------------------------------------
     26,721  total observations
        935  observations end on or before enter()
------------------------------------------------------------------------------
     25,786  observations remaining, representing
     25,786  subjects
      4,130  failures in single-failure-per-subject data
 41,226.932  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  2.748802
Denominator case=0 aki:
  19,090
Denominator(_st=1) case=0 aki:
  18,420
Events case=0 aki:
  3,661
Events (_st=1) case=0 aki:
  2,991
Total follow_up case=0 aki:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~i |     19,090    29443.16           0   29443.16   29443.16
Rate case=0 aki:
12434.127
Rate (_st=1) case=0 aki:
10158.556
Denominator case=1 aki:
  7,631
Denominator(_st=1) case=1 aki:
  7,366
Events case=1 aki:
  1,404
Events (_st=1) case=1 aki:
  1,139
Total follow_up case=1 aki:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~i |      7,631    11783.77           0   11783.77   11783.77
Rate case=1 aki:
11914.69
Rate (_st=1) case=1 aki:
9665.835

                id:  unique
     failure event:  death_date != 0 & death_date < .
obs. time interval:  (exit_date_death[_n-1], exit_date_death]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_death

------------------------------------------------------------------------------
     26,721  total observations
          0  exclusions
------------------------------------------------------------------------------
     26,721  observations remaining, representing
     26,721  subjects
      1,584  failures in single-failure-per-subject data
 46,469.459  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  2.748802
Denominator case=0 death:
  19,090
Denominator(_st=1) case=0 death:
  19,090
Events case=0 death:
  1,285
Events (_st=1) case=0 death:
  1,285
Total follow_up case=0 death:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~h |     19,090    33275.38           0   33275.38   33275.38
Rate case=0 death:
3861.7146
Rate (_st=1) case=0 death:
3861.7146
Denominator case=1 death:
  7,631
Denominator(_st=1) case=1 death:
  7,631
Events case=1 death:
  299
Events (_st=1) case=1 death:
  299
Total follow_up case=1 death:

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~h |      7,631    13194.08           0   13194.08   13194.08
Rate case=1 death:
2266.1672
Rate (_st=1) case=1 death:
2266.1672

. 
. save ./output/analysis_2017.dta, replace
(note: file ./output/analysis_2017.dta not found)
file ./output/analysis_2017.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/analysis_2017.log
  log type:  text
 closed on:  12 May 2023, 09:49:17
-------------------------------------------------------------------------------
