------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_2017.log
  log type:  text
 opened on:  28 Nov 2022, 12:33:21

. 
. ** Analysis cohort selection
. capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-9)
(52 vars, 50,000 obs)

. di "Potential COVID-19 cases extracted from OpenSAFELY:"
Potential COVID-19 cases extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/input_2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(16 vars, 50,000 obs)

. di "Potential historical comparators extracted from OpenSAFELY:"
Potential historical comparators extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/covid_matching_2017.csv, clear
(encoding automatically selected: ISO-8859-2)
(10 vars, 15,673 obs)

. di "Potential COVID-19 cases after application of exclusion criteria:"
Potential COVID-19 cases after application of exclusion criteria:

. safecount
  15,673

. capture noisily import delimited ./output/2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(7 vars, 28,967 obs)

. di "Potential historical comparators after application of exclusion criteria:"
Potential historical comparators after application of exclusion criteria:

. safecount
  28,967

. * Import COVID-19 dataset comprising individuals matched with historical comparators (limited matching variables only)
. capture noisily import delimited ./output/input_combined_stps_covid_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(13 vars, 14,020 obs)

. * Drop age & covid_diagnosis_date
. keep patient_id death_date date_deregistered stp krt_outcome_date male covid_date covid_month set_id case match_counts

. tempfile covid_2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `covid_2017_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000001.tmp saved as .dta format

. * Number of matched COVID-19 cases
. count
  14,020

. * Import matched historical comparators (limited matching variables only)
. capture noisily import delimited ./output/input_combined_stps_matches_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 24,508 obs)

. * Drop age
. keep patient_id death_date date_deregistered stp krt_outcome_date male set_id case covid_date

. tempfile 2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `2017_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000002.tmp saved as .dta format

. * Number of matched historical comparators
. count
  24,508

. * Merge limited COVID-19 dataset with additional variables
. capture noisily import delimited ./output/input_covid_2017_additional.csv, clear
(encoding automatically selected: ISO-8859-9)
(103 vars, 14,020 obs)

. merge 1:1 patient_id using `covid_2017_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            14,020  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile covid_2017_complete

. save `covid_2017_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000003.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000003.tmp saved as .dta format

. di "Matched COVID-19 cases:"
Matched COVID-19 cases:

. safecount
  14,020

. * Merge limited historical comparator dataset with additional variables
. capture noisily import delimited ./output/input_2017_additional.csv, clear
(encoding automatically selected: ISO-8859-9)
(92 vars, 24,508 obs)

. merge 1:1 patient_id using `2017_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            24,508  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile 2017_complete

. save `2017_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000004.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000004.tmp saved as .dta format

. di "Matched historical comparators:"
Matched historical comparators:

. safecount
  24,508

. * Append matched COVID-19 cases and historical comparators
. append using `covid_2017_complete', force

. order patient_id set_id match_count case

. gsort set_id -case

. count if case==0
  24,508

. di "Matched COVID-19 cases and historical comparators:"
Matched COVID-19 cases and historical comparators:

. safecount
  38,528

. tab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,508       63.61       63.61
          1 |     14,020       36.39      100.00
------------+-----------------------------------
      Total |     38,528      100.00

. * Save list of matched COVID-19 cases
. preserve

.         keep if case==1
(24,508 observations deleted)

.         keep patient_id

.         tempfile covid_2017_matched_list

.         save `covid_2017_matched_list', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000006.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000006.tmp saved as .dta format

. restore

. * Generate list of unmatched COVID-19 cases
. preserve

.         capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-9)
(52 vars, 50,000 obs)

.         * For dummy data, should do nothing in the real data
.         duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

.         tempfile covid_prematching

.         save `covid_prematching', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000008.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000008.tmp saved as .dta format

.         use `covid_2017_matched_list', clear

.         merge 1:1 patient_id using `covid_prematching'

    Result                      Number of obs
    -----------------------------------------
    Not matched                        35,980
        from master                         0  (_merge==1)
        from using                     35,980  (_merge==2)

    Matched                            14,020  (_merge==3)
    -----------------------------------------

.         keep if _merge==2
(14,020 observations deleted)

.         safecount
  35,980

.         save output/covid_unmatched_2017.dta, replace
file output/covid_unmatched_2017.dta saved

.         di "Unmatched COVID-19 cases:"
Unmatched COVID-19 cases:

.         safecount
  35,980

. restore

. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      1,927        5.00        5.00
 1 Most deprived |      7,370       19.13       24.13
               2 |      7,336       19.04       43.17
               3 |      7,215       18.73       61.90
               4 |      7,221       18.74       80.64
5 Least deprived |      7,459       19.36      100.00
-----------------+-----------------------------------
           Total |     38,528      100.00

. drop if imd==0
(1,927 observations deleted)

. safetab imd

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |      7,370       20.14       20.14
               2 |      7,336       20.04       40.18
               3 |      7,215       19.71       59.89
               4 |      7,221       19.73       79.62
5 Least deprived |      7,459       20.38      100.00
-----------------+-----------------------------------
           Total |     36,601      100.00

. 
. * STP missing
. drop stp

. tab stp_updated

stp_updated |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     36,601      100.00      100.00
------------+-----------------------------------
      Total |     36,601      100.00

. drop if stp_updated==""
(0 observations deleted)

. bysort stp_updated: gen stp = 1 if _n==1
(36,600 missing values generated)

. replace stp = sum(stp)
(36,600 real changes made)

. drop stp_updated

. label values stp stp

. label var stp "STP"

. safetab stp

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     36,601      100.00      100.00
------------+-----------------------------------
      Total |     36,601      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(32,913 missing values generated)

. replace region = 2 if region_string=="East"
(3,622 real changes made)

. replace region = 3 if region_string=="London"
(7,328 real changes made)

. replace region = 4 if region_string=="North East"
(3,586 real changes made)

. replace region = 5 if region_string=="North West"
(3,700 real changes made)

. replace region = 6 if region_string=="South East"
(3,654 real changes made)

. replace region = 7 if region_string=="South West"
(3,712 real changes made)

. replace region = 8 if region_string=="West Midlands"
(3,569 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(3,742 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,688       10.08       10.08
                    East |      3,622        9.90       19.97
                  London |      7,328       20.02       39.99
              North East |      3,586        9.80       49.79
              North West |      3,700       10.11       59.90
              South East |      3,654        9.98       69.88
              South West |      3,712       10.14       80.03
           West Midlands |      3,569        9.75       89.78
Yorkshire and The Humber |      3,742       10.22      100.00
-------------------------+-----------------------------------
                   Total |     36,601      100.00

. drop if region==10
(0 observations deleted)

. safetab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,688       10.08       10.08
                    East |      3,622        9.90       19.97
                  London |      7,328       20.02       39.99
              North East |      3,586        9.80       49.79
              North West |      3,700       10.11       59.90
              South East |      3,654        9.98       69.88
              South West |      3,712       10.14       80.03
           West Midlands |      3,569        9.75       89.78
Yorkshire and The Humber |      3,742       10.22      100.00
-------------------------+-----------------------------------
                   Total |     36,601      100.00

. 
. * Exclusions due to deregistration and kidney replacement therapy will be checked (should already have been applied from previous steps in workflow)
. gen index_date = date(case_index_date, "YMD")

. format index_date %td

. 
. * Deregistered before index_date
. gen deregistered_date = date(date_deregistered, "YMD")
(35,446 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date
(0 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(33,012 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(0 observations deleted)

. gen index_date_28 = index_date + 28

. format index_date_28 %td

. replace krt_date = index_date_28 if krt_date < index_date_28
(176 real changes made)

. 
. * Death before index_date + 28 days (i.e. only include people who survived 28 days after index_date)
. gen death_date1 = date(death_date, "YMD")
(34,388 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28
(98 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased within 28 days of index date"

. label values deceased deceased

. tab case deceased

           |       deceased
      case | Alive at   Deceased  |     Total
-----------+----------------------+----------
         0 |    23,180         83 |    23,263 
         1 |    13,323         15 |    13,338 
-----------+----------------------+----------
     Total |    36,503         98 |    36,601 

. drop if deceased==1
(98 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators only
. gen index_year = yofd(index_date)

. gen age = index_year - year_of_birth

. gen sex = 1 if male == "Male"
(18,598 missing values generated)

. replace sex = 0 if male == "Female"
(18,598 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 ///
>                                                                                                 baseline_creatinine_mar2017 ///
>                                                                                                 baseline_creatinine_apr2017 ///
>                                                                                                 baseline_creatinine_may2017 ///
>                                                                                                 baseline_creatinine_jun2017 ///
>                                                                                                 baseline_creatinine_jul2017 ///
>                                                                                                 baseline_creatinine_aug2017 ///
>                                                                                                 baseline_creatinine_sep2017 ///
>                                                                                                 baseline_creatinine_oct2017 ///
>                                                                                                 baseline_creatinine_nov2017 ///
>                                                                                                 baseline_creatinine_dec2017 ///
>                                                                                                 baseline_creatinine_jan2018 ///
>                                                                                                 baseline_creatinine_feb2018 ///
>                                                                                                 baseline_creatinine_mar2018 ///
>                                                                                                 baseline_creatinine_apr2018 ///
>                                                                                                 baseline_creatinine_may2018 ///
>                                                                                                 baseline_creatinine_jun2018 ///
>                                                                                                 baseline_creatinine_jul2018 ///
>                                                                                                 baseline_creatinine_aug2018 ///
>                                                                                                 baseline_creatinine_sep2018 ///
>                                                                                                 baseline_creatinine_oct2018 ///
>                                                                                                 baseline_creatinine_nov2018 ///
>                                                                                                 baseline_creatinine_dec2018 ///
>                                                                                                 baseline_creatinine_jan2019 ///
>                                                                                                 baseline_creatinine_feb2019 ///
>                                                                                                 baseline_creatinine_mar2019 ///
>                                                                                                 baseline_creatinine_apr2019 ///
>                                                                                                 baseline_creatinine_may2019 ///
>                                                                                                 baseline_creatinine_jun2019 ///
>                                                                                                 baseline_creatinine_jul2019 ///
>                                                                                                 baseline_creatinine_aug2019 ///
>                                                                                                 baseline_creatinine_sep2019 ///
>                                                                                                 baseline_creatinine_feb2020 ///
>                                                                                                 baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 ///
>                                                                                                 baseline_creatinine_feb2022 ///
>                                                                                                 baseline_creatinine_mar2022 ///
>                                                                                                 baseline_creatinine_apr2022 ///
>                                                                                                 baseline_creatinine_may2022 ///
>                                                                                                 baseline_creatinine_jun2022 ///
>                                                                                                 baseline_creatinine_jul2022 ///
>                                                                                                 baseline_creatinine_aug2022 ///
>                                                                                                 baseline_creatinine_sep2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(10,240 real changes made, 10,240 to missing)
(23,563 missing values generated)
(36,503 missing values generated)
(6,598 real changes made)
(6,342 real changes made)
(6,598 real changes made)
(6,342 real changes made)
(8,311 real changes made)
(36,503 missing values generated)
(6,598 real changes made)
(6,342 real changes made)
(12,940 real changes made)
(28,192 real changes made)
(23,563 missing values generated)
(12,940 real changes made)
(6,598 real changes made)
(10,246 real changes made, 10,246 to missing)
(23,569 missing values generated)
(36,503 missing values generated)
(6,554 real changes made)
(6,380 real changes made)
(6,554 real changes made)
(6,380 real changes made)
(8,156 real changes made)
(36,503 missing values generated)
(6,554 real changes made)
(6,380 real changes made)
(12,934 real changes made)
(28,347 real changes made)
(23,569 missing values generated)
(12,934 real changes made)
(6,554 real changes made)
(10,243 real changes made, 10,243 to missing)
(23,566 missing values generated)
(36,503 missing values generated)
(6,563 real changes made)
(6,374 real changes made)
(6,563 real changes made)
(6,374 real changes made)
(8,164 real changes made)
(36,503 missing values generated)
(6,563 real changes made)
(6,374 real changes made)
(12,937 real changes made)
(28,339 real changes made)
(23,566 missing values generated)
(12,937 real changes made)
(6,563 real changes made)
(10,147 real changes made, 10,147 to missing)
(23,470 missing values generated)
(36,503 missing values generated)
(6,657 real changes made)
(6,376 real changes made)
(6,657 real changes made)
(6,376 real changes made)
(8,283 real changes made)
(36,503 missing values generated)
(6,657 real changes made)
(6,376 real changes made)
(13,033 real changes made)
(28,220 real changes made)
(23,470 missing values generated)
(13,033 real changes made)
(6,657 real changes made)
(10,174 real changes made, 10,174 to missing)
(23,497 missing values generated)
(36,503 missing values generated)
(6,608 real changes made)
(6,398 real changes made)
(6,608 real changes made)
(6,398 real changes made)
(8,212 real changes made)
(36,503 missing values generated)
(6,608 real changes made)
(6,398 real changes made)
(13,006 real changes made)
(28,291 real changes made)
(23,497 missing values generated)
(13,006 real changes made)
(6,608 real changes made)
(10,231 real changes made, 10,231 to missing)
(23,554 missing values generated)
(36,503 missing values generated)
(6,581 real changes made)
(6,368 real changes made)
(6,581 real changes made)
(6,368 real changes made)
(8,206 real changes made)
(36,503 missing values generated)
(6,581 real changes made)
(6,368 real changes made)
(12,949 real changes made)
(28,297 real changes made)
(23,554 missing values generated)
(12,949 real changes made)
(6,581 real changes made)
(10,211 real changes made, 10,211 to missing)
(23,534 missing values generated)
(36,503 missing values generated)
(6,617 real changes made)
(6,352 real changes made)
(6,617 real changes made)
(6,352 real changes made)
(8,229 real changes made)
(36,503 missing values generated)
(6,617 real changes made)
(6,352 real changes made)
(12,969 real changes made)
(28,274 real changes made)
(23,534 missing values generated)
(12,969 real changes made)
(6,617 real changes made)
(10,213 real changes made, 10,213 to missing)
(23,536 missing values generated)
(36,503 missing values generated)
(6,657 real changes made)
(6,310 real changes made)
(6,657 real changes made)
(6,310 real changes made)
(8,097 real changes made)
(36,503 missing values generated)
(6,657 real changes made)
(6,310 real changes made)
(12,967 real changes made)
(28,406 real changes made)
(23,536 missing values generated)
(12,967 real changes made)
(6,657 real changes made)
(10,189 real changes made, 10,189 to missing)
(23,512 missing values generated)
(36,503 missing values generated)
(6,626 real changes made)
(6,365 real changes made)
(6,626 real changes made)
(6,365 real changes made)
(8,224 real changes made)
(36,503 missing values generated)
(6,626 real changes made)
(6,365 real changes made)
(12,991 real changes made)
(28,279 real changes made)
(23,512 missing values generated)
(12,991 real changes made)
(6,626 real changes made)
(10,202 real changes made, 10,202 to missing)
(23,525 missing values generated)
(36,503 missing values generated)
(6,617 real changes made)
(6,361 real changes made)
(6,617 real changes made)
(6,361 real changes made)
(8,210 real changes made)
(36,503 missing values generated)
(6,617 real changes made)
(6,361 real changes made)
(12,978 real changes made)
(28,293 real changes made)
(23,525 missing values generated)
(12,978 real changes made)
(6,617 real changes made)
(10,194 real changes made, 10,194 to missing)
(23,517 missing values generated)
(36,503 missing values generated)
(6,534 real changes made)
(6,452 real changes made)
(6,534 real changes made)
(6,452 real changes made)
(8,175 real changes made)
(36,503 missing values generated)
(6,534 real changes made)
(6,452 real changes made)
(12,986 real changes made)
(28,328 real changes made)
(23,517 missing values generated)
(12,986 real changes made)
(6,534 real changes made)
(10,204 real changes made, 10,204 to missing)
(23,527 missing values generated)
(36,503 missing values generated)
(6,648 real changes made)
(6,328 real changes made)
(6,648 real changes made)
(6,328 real changes made)
(8,183 real changes made)
(36,503 missing values generated)
(6,648 real changes made)
(6,328 real changes made)
(12,976 real changes made)
(28,320 real changes made)
(23,527 missing values generated)
(12,976 real changes made)
(6,648 real changes made)
(10,197 real changes made, 10,197 to missing)
(23,520 missing values generated)
(36,503 missing values generated)
(6,608 real changes made)
(6,375 real changes made)
(6,608 real changes made)
(6,375 real changes made)
(8,332 real changes made)
(36,503 missing values generated)
(6,608 real changes made)
(6,375 real changes made)
(12,983 real changes made)
(28,171 real changes made)
(23,520 missing values generated)
(12,983 real changes made)
(6,608 real changes made)
(10,226 real changes made, 10,226 to missing)
(23,549 missing values generated)
(36,503 missing values generated)
(6,565 real changes made)
(6,389 real changes made)
(6,565 real changes made)
(6,389 real changes made)
(8,214 real changes made)
(36,503 missing values generated)
(6,565 real changes made)
(6,389 real changes made)
(12,954 real changes made)
(28,289 real changes made)
(23,549 missing values generated)
(12,954 real changes made)
(6,565 real changes made)
(10,213 real changes made, 10,213 to missing)
(23,536 missing values generated)
(36,503 missing values generated)
(6,561 real changes made)
(6,406 real changes made)
(6,561 real changes made)
(6,406 real changes made)
(8,129 real changes made)
(36,503 missing values generated)
(6,561 real changes made)
(6,406 real changes made)
(12,967 real changes made)
(28,374 real changes made)
(23,536 missing values generated)
(12,967 real changes made)
(6,561 real changes made)
(10,216 real changes made, 10,216 to missing)
(23,539 missing values generated)
(36,503 missing values generated)
(6,609 real changes made)
(6,355 real changes made)
(6,609 real changes made)
(6,355 real changes made)
(8,142 real changes made)
(36,503 missing values generated)
(6,609 real changes made)
(6,355 real changes made)
(12,964 real changes made)
(28,361 real changes made)
(23,539 missing values generated)
(12,964 real changes made)
(6,609 real changes made)
(10,225 real changes made, 10,225 to missing)
(23,548 missing values generated)
(36,503 missing values generated)
(6,677 real changes made)
(6,278 real changes made)
(6,677 real changes made)
(6,278 real changes made)
(8,218 real changes made)
(36,503 missing values generated)
(6,677 real changes made)
(6,278 real changes made)
(12,955 real changes made)
(28,285 real changes made)
(23,548 missing values generated)
(12,955 real changes made)
(6,677 real changes made)
(10,208 real changes made, 10,208 to missing)
(23,531 missing values generated)
(36,503 missing values generated)
(6,646 real changes made)
(6,326 real changes made)
(6,646 real changes made)
(6,326 real changes made)
(8,194 real changes made)
(36,503 missing values generated)
(6,646 real changes made)
(6,326 real changes made)
(12,972 real changes made)
(28,309 real changes made)
(23,531 missing values generated)
(12,972 real changes made)
(6,646 real changes made)
(10,189 real changes made, 10,189 to missing)
(23,512 missing values generated)
(36,503 missing values generated)
(6,630 real changes made)
(6,361 real changes made)
(6,630 real changes made)
(6,361 real changes made)
(8,339 real changes made)
(36,503 missing values generated)
(6,630 real changes made)
(6,361 real changes made)
(12,991 real changes made)
(28,164 real changes made)
(23,512 missing values generated)
(12,991 real changes made)
(6,630 real changes made)
(10,182 real changes made, 10,182 to missing)
(23,505 missing values generated)
(36,503 missing values generated)
(6,648 real changes made)
(6,350 real changes made)
(6,648 real changes made)
(6,350 real changes made)
(8,218 real changes made)
(36,503 missing values generated)
(6,648 real changes made)
(6,350 real changes made)
(12,998 real changes made)
(28,285 real changes made)
(23,505 missing values generated)
(12,998 real changes made)
(6,648 real changes made)
(10,188 real changes made, 10,188 to missing)
(23,511 missing values generated)
(36,503 missing values generated)
(6,609 real changes made)
(6,383 real changes made)
(6,609 real changes made)
(6,383 real changes made)
(8,294 real changes made)
(36,503 missing values generated)
(6,609 real changes made)
(6,383 real changes made)
(12,992 real changes made)
(28,209 real changes made)
(23,511 missing values generated)
(12,992 real changes made)
(6,609 real changes made)
(10,152 real changes made, 10,152 to missing)
(23,475 missing values generated)
(36,503 missing values generated)
(6,706 real changes made)
(6,322 real changes made)
(6,706 real changes made)
(6,322 real changes made)
(8,280 real changes made)
(36,503 missing values generated)
(6,706 real changes made)
(6,322 real changes made)
(13,028 real changes made)
(28,223 real changes made)
(23,475 missing values generated)
(13,028 real changes made)
(6,706 real changes made)
(10,158 real changes made, 10,158 to missing)
(23,481 missing values generated)
(36,503 missing values generated)
(6,700 real changes made)
(6,322 real changes made)
(6,700 real changes made)
(6,322 real changes made)
(8,201 real changes made)
(36,503 missing values generated)
(6,700 real changes made)
(6,322 real changes made)
(13,022 real changes made)
(28,302 real changes made)
(23,481 missing values generated)
(13,022 real changes made)
(6,700 real changes made)
(10,190 real changes made, 10,190 to missing)
(23,513 missing values generated)
(36,503 missing values generated)
(6,618 real changes made)
(6,372 real changes made)
(6,618 real changes made)
(6,372 real changes made)
(8,301 real changes made)
(36,503 missing values generated)
(6,618 real changes made)
(6,372 real changes made)
(12,990 real changes made)
(28,202 real changes made)
(23,513 missing values generated)
(12,990 real changes made)
(6,618 real changes made)
(10,154 real changes made, 10,154 to missing)
(23,477 missing values generated)
(36,503 missing values generated)
(6,646 real changes made)
(6,380 real changes made)
(6,646 real changes made)
(6,380 real changes made)
(8,176 real changes made)
(36,503 missing values generated)
(6,646 real changes made)
(6,380 real changes made)
(13,026 real changes made)
(28,327 real changes made)
(23,477 missing values generated)
(13,026 real changes made)
(6,646 real changes made)
(10,213 real changes made, 10,213 to missing)
(23,536 missing values generated)
(36,503 missing values generated)
(6,624 real changes made)
(6,343 real changes made)
(6,624 real changes made)
(6,343 real changes made)
(8,121 real changes made)
(36,503 missing values generated)
(6,624 real changes made)
(6,343 real changes made)
(12,967 real changes made)
(28,382 real changes made)
(23,536 missing values generated)
(12,967 real changes made)
(6,624 real changes made)
(10,217 real changes made, 10,217 to missing)
(23,540 missing values generated)
(36,503 missing values generated)
(6,616 real changes made)
(6,347 real changes made)
(6,616 real changes made)
(6,347 real changes made)
(8,222 real changes made)
(36,503 missing values generated)
(6,616 real changes made)
(6,347 real changes made)
(12,963 real changes made)
(28,281 real changes made)
(23,540 missing values generated)
(12,963 real changes made)
(6,616 real changes made)
(10,189 real changes made, 10,189 to missing)
(23,512 missing values generated)
(36,503 missing values generated)
(6,619 real changes made)
(6,372 real changes made)
(6,619 real changes made)
(6,372 real changes made)
(8,204 real changes made)
(36,503 missing values generated)
(6,619 real changes made)
(6,372 real changes made)
(12,991 real changes made)
(28,299 real changes made)
(23,512 missing values generated)
(12,991 real changes made)
(6,619 real changes made)
(10,201 real changes made, 10,201 to missing)
(23,524 missing values generated)
(36,503 missing values generated)
(6,679 real changes made)
(6,300 real changes made)
(6,679 real changes made)
(6,300 real changes made)
(8,212 real changes made)
(36,503 missing values generated)
(6,679 real changes made)
(6,300 real changes made)
(12,979 real changes made)
(28,291 real changes made)
(23,524 missing values generated)
(12,979 real changes made)
(6,679 real changes made)
(10,198 real changes made, 10,198 to missing)
(23,521 missing values generated)
(36,503 missing values generated)
(6,625 real changes made)
(6,357 real changes made)
(6,625 real changes made)
(6,357 real changes made)
(8,203 real changes made)
(36,503 missing values generated)
(6,625 real changes made)
(6,357 real changes made)
(12,982 real changes made)
(28,300 real changes made)
(23,521 missing values generated)
(12,982 real changes made)
(6,625 real changes made)
(10,203 real changes made, 10,203 to missing)
(23,526 missing values generated)
(36,503 missing values generated)
(6,651 real changes made)
(6,326 real changes made)
(6,651 real changes made)
(6,326 real changes made)
(8,252 real changes made)
(36,503 missing values generated)
(6,651 real changes made)
(6,326 real changes made)
(12,977 real changes made)
(28,251 real changes made)
(23,526 missing values generated)
(12,977 real changes made)
(6,651 real changes made)
(10,176 real changes made, 10,176 to missing)
(23,499 missing values generated)
(36,503 missing values generated)
(6,608 real changes made)
(6,396 real changes made)
(6,608 real changes made)
(6,396 real changes made)
(8,201 real changes made)
(36,503 missing values generated)
(6,608 real changes made)
(6,396 real changes made)
(13,004 real changes made)
(28,302 real changes made)
(23,499 missing values generated)
(13,004 real changes made)
(6,608 real changes made)
(5,932 real changes made, 5,932 to missing)
(29,112 missing values generated)
(36,503 missing values generated)
(3,754 real changes made)
(3,637 real changes made)
(3,754 real changes made)
(3,637 real changes made)
(4,679 real changes made)
(36,503 missing values generated)
(3,754 real changes made)
(3,637 real changes made)
(7,391 real changes made)
(31,824 real changes made)
(29,112 missing values generated)
(7,391 real changes made)
(3,754 real changes made)
(5,870 real changes made, 5,870 to missing)
(29,050 missing values generated)
(36,503 missing values generated)
(3,802 real changes made)
(3,651 real changes made)
(3,802 real changes made)
(3,651 real changes made)
(4,736 real changes made)
(36,503 missing values generated)
(3,802 real changes made)
(3,651 real changes made)
(7,453 real changes made)
(31,767 real changes made)
(29,050 missing values generated)
(7,453 real changes made)
(3,802 real changes made)
(5,837 real changes made, 5,837 to missing)
(29,017 missing values generated)
(36,503 missing values generated)
(3,805 real changes made)
(3,681 real changes made)
(3,805 real changes made)
(3,681 real changes made)
(4,749 real changes made)
(36,503 missing values generated)
(3,805 real changes made)
(3,681 real changes made)
(7,486 real changes made)
(31,754 real changes made)
(29,017 missing values generated)
(7,486 real changes made)
(3,805 real changes made)
(5,872 real changes made, 5,872 to missing)
(29,052 missing values generated)
(36,503 missing values generated)
(3,823 real changes made)
(3,628 real changes made)
(3,823 real changes made)
(3,628 real changes made)
(4,745 real changes made)
(36,503 missing values generated)
(3,823 real changes made)
(3,628 real changes made)
(7,451 real changes made)
(31,758 real changes made)
(29,052 missing values generated)
(7,451 real changes made)
(3,823 real changes made)
(5,846 real changes made, 5,846 to missing)
(29,026 missing values generated)
(36,503 missing values generated)
(3,812 real changes made)
(3,665 real changes made)
(3,812 real changes made)
(3,665 real changes made)
(4,735 real changes made)
(36,503 missing values generated)
(3,812 real changes made)
(3,665 real changes made)
(7,477 real changes made)
(31,768 real changes made)
(29,026 missing values generated)
(7,477 real changes made)
(3,812 real changes made)
(5,820 real changes made, 5,820 to missing)
(29,000 missing values generated)
(36,503 missing values generated)
(3,827 real changes made)
(3,676 real changes made)
(3,827 real changes made)
(3,676 real changes made)
(4,731 real changes made)
(36,503 missing values generated)
(3,827 real changes made)
(3,676 real changes made)
(7,503 real changes made)
(31,772 real changes made)
(29,000 missing values generated)
(7,503 real changes made)
(3,827 real changes made)
(5,880 real changes made, 5,880 to missing)
(29,060 missing values generated)
(36,503 missing values generated)
(3,800 real changes made)
(3,643 real changes made)
(3,800 real changes made)
(3,643 real changes made)
(4,731 real changes made)
(36,503 missing values generated)
(3,800 real changes made)
(3,643 real changes made)
(7,443 real changes made)
(31,772 real changes made)
(29,060 missing values generated)
(7,443 real changes made)
(3,800 real changes made)
(5,857 real changes made, 5,857 to missing)
(29,037 missing values generated)
(36,503 missing values generated)
(3,770 real changes made)
(3,696 real changes made)
(3,770 real changes made)
(3,696 real changes made)
(4,686 real changes made)
(36,503 missing values generated)
(3,770 real changes made)
(3,696 real changes made)
(7,466 real changes made)
(31,817 real changes made)
(29,037 missing values generated)
(7,466 real changes made)
(3,770 real changes made)
(5,861 real changes made, 5,861 to missing)
(29,041 missing values generated)
(36,503 missing values generated)
(3,790 real changes made)
(3,672 real changes made)
(3,790 real changes made)
(3,672 real changes made)
(4,729 real changes made)
(36,503 missing values generated)
(3,790 real changes made)
(3,672 real changes made)
(7,462 real changes made)
(31,774 real changes made)
(29,041 missing values generated)
(7,462 real changes made)
(3,790 real changes made)
(5,884 real changes made, 5,884 to missing)
(29,064 missing values generated)
(36,503 missing values generated)
(3,777 real changes made)
(3,662 real changes made)
(3,777 real changes made)
(3,662 real changes made)
(4,698 real changes made)
(36,503 missing values generated)
(3,777 real changes made)
(3,662 real changes made)
(7,439 real changes made)
(31,805 real changes made)
(29,064 missing values generated)
(7,439 real changes made)
(3,777 real changes made)
(5,859 real changes made, 5,859 to missing)
(29,039 missing values generated)
(36,503 missing values generated)
(3,808 real changes made)
(3,656 real changes made)
(3,808 real changes made)
(3,656 real changes made)
(4,734 real changes made)
(36,503 missing values generated)
(3,808 real changes made)
(3,656 real changes made)
(7,464 real changes made)
(31,769 real changes made)
(29,039 missing values generated)
(7,464 real changes made)
(3,808 real changes made)
(5,851 real changes made, 5,851 to missing)
(29,031 missing values generated)
(36,503 missing values generated)
(3,799 real changes made)
(3,673 real changes made)
(3,799 real changes made)
(3,673 real changes made)
(4,734 real changes made)
(36,503 missing values generated)
(3,799 real changes made)
(3,673 real changes made)
(7,472 real changes made)
(31,769 real changes made)
(29,031 missing values generated)
(7,472 real changes made)
(3,799 real changes made)
(5,910 real changes made, 5,910 to missing)
(29,090 missing values generated)
(36,503 missing values generated)
(3,719 real changes made)
(3,694 real changes made)
(3,719 real changes made)
(3,694 real changes made)
(4,631 real changes made)
(36,503 missing values generated)
(3,719 real changes made)
(3,694 real changes made)
(7,413 real changes made)
(31,872 real changes made)
(29,090 missing values generated)
(7,413 real changes made)
(3,719 real changes made)
(5,879 real changes made, 5,879 to missing)
(29,059 missing values generated)
(36,503 missing values generated)
(3,781 real changes made)
(3,663 real changes made)
(3,781 real changes made)
(3,663 real changes made)
(4,804 real changes made)
(36,503 missing values generated)
(3,781 real changes made)
(3,663 real changes made)
(7,444 real changes made)
(31,699 real changes made)
(29,059 missing values generated)
(7,444 real changes made)
(3,781 real changes made)
(5,888 real changes made, 5,888 to missing)
(29,068 missing values generated)
(36,503 missing values generated)
(3,791 real changes made)
(3,644 real changes made)
(3,791 real changes made)
(3,644 real changes made)
(4,679 real changes made)
(36,503 missing values generated)
(3,791 real changes made)
(3,644 real changes made)
(7,435 real changes made)
(31,824 real changes made)
(29,068 missing values generated)
(7,435 real changes made)
(3,791 real changes made)
(5,850 real changes made, 5,850 to missing)
(29,030 missing values generated)
(36,503 missing values generated)
(3,811 real changes made)
(3,662 real changes made)
(3,811 real changes made)
(3,662 real changes made)
(4,777 real changes made)
(36,503 missing values generated)
(3,811 real changes made)
(3,662 real changes made)
(7,473 real changes made)
(31,726 real changes made)
(29,030 missing values generated)
(7,473 real changes made)
(3,811 real changes made)
(5,859 real changes made, 5,859 to missing)
(29,039 missing values generated)
(36,503 missing values generated)
(3,811 real changes made)
(3,653 real changes made)
(3,811 real changes made)
(3,653 real changes made)
(4,740 real changes made)
(36,503 missing values generated)
(3,811 real changes made)
(3,653 real changes made)
(7,464 real changes made)
(31,763 real changes made)
(29,039 missing values generated)
(7,464 real changes made)
(3,811 real changes made)
(5,842 real changes made, 5,842 to missing)
(29,022 missing values generated)
(36,503 missing values generated)
(3,834 real changes made)
(3,647 real changes made)
(3,834 real changes made)
(3,647 real changes made)
(4,707 real changes made)
(36,503 missing values generated)
(3,834 real changes made)
(3,647 real changes made)
(7,481 real changes made)
(31,796 real changes made)
(29,022 missing values generated)
(7,481 real changes made)
(3,834 real changes made)
(5,899 real changes made, 5,899 to missing)
(29,079 missing values generated)
(36,503 missing values generated)
(3,793 real changes made)
(3,631 real changes made)
(3,793 real changes made)
(3,631 real changes made)
(4,730 real changes made)
(36,503 missing values generated)
(3,793 real changes made)
(3,631 real changes made)
(7,424 real changes made)
(31,773 real changes made)
(29,079 missing values generated)
(7,424 real changes made)
(3,793 real changes made)
(5,838 real changes made, 5,838 to missing)
(29,018 missing values generated)
(36,503 missing values generated)
(3,809 real changes made)
(3,676 real changes made)
(3,809 real changes made)
(3,676 real changes made)
(4,693 real changes made)
(36,503 missing values generated)
(3,809 real changes made)
(3,676 real changes made)
(7,485 real changes made)
(31,810 real changes made)
(29,018 missing values generated)
(7,485 real changes made)
(3,809 real changes made)
(5,837 real changes made, 5,837 to missing)
(29,017 missing values generated)
(36,503 missing values generated)
(3,749 real changes made)
(3,737 real changes made)
(3,749 real changes made)
(3,737 real changes made)
(4,688 real changes made)
(36,503 missing values generated)
(3,749 real changes made)
(3,737 real changes made)
(7,486 real changes made)
(31,815 real changes made)
(29,017 missing values generated)
(7,486 real changes made)
(3,749 real changes made)
(5,877 real changes made, 5,877 to missing)
(29,057 missing values generated)
(36,503 missing values generated)
(3,804 real changes made)
(3,642 real changes made)
(3,804 real changes made)
(3,642 real changes made)
(4,702 real changes made)
(36,503 missing values generated)
(3,804 real changes made)
(3,642 real changes made)
(7,446 real changes made)
(31,801 real changes made)
(29,057 missing values generated)
(7,446 real changes made)
(3,804 real changes made)
(5,833 real changes made, 5,833 to missing)
(29,013 missing values generated)
(36,503 missing values generated)
(3,826 real changes made)
(3,664 real changes made)
(3,826 real changes made)
(3,664 real changes made)
(4,735 real changes made)
(36,503 missing values generated)
(3,826 real changes made)
(3,664 real changes made)
(7,490 real changes made)
(31,768 real changes made)
(29,013 missing values generated)
(7,490 real changes made)
(3,826 real changes made)
(5,807 real changes made, 5,807 to missing)
(28,987 missing values generated)
(36,503 missing values generated)
(3,865 real changes made)
(3,651 real changes made)
(3,865 real changes made)
(3,651 real changes made)
(4,760 real changes made)
(36,503 missing values generated)
(3,865 real changes made)
(3,651 real changes made)
(7,516 real changes made)
(31,743 real changes made)
(28,987 missing values generated)
(7,516 real changes made)
(3,865 real changes made)
(5,882 real changes made, 5,882 to missing)
(29,062 missing values generated)
(36,503 missing values generated)
(3,758 real changes made)
(3,683 real changes made)
(3,758 real changes made)
(3,683 real changes made)
(4,719 real changes made)
(36,503 missing values generated)
(3,758 real changes made)
(3,683 real changes made)
(7,441 real changes made)
(31,784 real changes made)
(29,062 missing values generated)
(7,441 real changes made)
(3,758 real changes made)
(5,898 real changes made, 5,898 to missing)
(29,078 missing values generated)
(36,503 missing values generated)
(3,768 real changes made)
(3,657 real changes made)
(3,768 real changes made)
(3,657 real changes made)
(4,708 real changes made)
(36,503 missing values generated)
(3,768 real changes made)
(3,657 real changes made)
(7,425 real changes made)
(31,795 real changes made)
(29,078 missing values generated)
(7,425 real changes made)
(3,768 real changes made)
(5,866 real changes made, 5,866 to missing)
(29,046 missing values generated)
(36,503 missing values generated)
(3,802 real changes made)
(3,655 real changes made)
(3,802 real changes made)
(3,655 real changes made)
(4,723 real changes made)
(36,503 missing values generated)
(3,802 real changes made)
(3,655 real changes made)
(7,457 real changes made)
(31,780 real changes made)
(29,046 missing values generated)
(7,457 real changes made)
(3,802 real changes made)
(5,854 real changes made, 5,854 to missing)
(29,034 missing values generated)
(36,503 missing values generated)
(3,848 real changes made)
(3,621 real changes made)
(3,848 real changes made)
(3,621 real changes made)
(4,727 real changes made)
(36,503 missing values generated)
(3,848 real changes made)
(3,621 real changes made)
(7,469 real changes made)
(31,776 real changes made)
(29,034 missing values generated)
(7,469 real changes made)
(3,848 real changes made)
(5,835 real changes made, 5,835 to missing)
(29,015 missing values generated)
(36,503 missing values generated)
(3,778 real changes made)
(3,710 real changes made)
(3,778 real changes made)
(3,710 real changes made)
(4,782 real changes made)
(36,503 missing values generated)
(3,778 real changes made)
(3,710 real changes made)
(7,488 real changes made)
(31,721 real changes made)
(29,015 missing values generated)
(7,488 real changes made)
(3,778 real changes made)
(5,856 real changes made, 5,856 to missing)
(29,036 missing values generated)
(36,503 missing values generated)
(3,811 real changes made)
(3,656 real changes made)
(3,811 real changes made)
(3,656 real changes made)
(4,707 real changes made)
(36,503 missing values generated)
(3,811 real changes made)
(3,656 real changes made)
(7,467 real changes made)
(31,796 real changes made)
(29,036 missing values generated)
(7,467 real changes made)
(3,811 real changes made)
(5,898 real changes made, 5,898 to missing)
(29,078 missing values generated)
(36,503 missing values generated)
(3,741 real changes made)
(3,684 real changes made)
(3,741 real changes made)
(3,684 real changes made)
(4,699 real changes made)
(36,503 missing values generated)
(3,741 real changes made)
(3,684 real changes made)
(7,425 real changes made)
(31,804 real changes made)
(29,078 missing values generated)
(7,425 real changes made)
(3,741 real changes made)
(5,861 real changes made, 5,861 to missing)
(29,041 missing values generated)
(36,503 missing values generated)
(3,770 real changes made)
(3,692 real changes made)
(3,770 real changes made)
(3,692 real changes made)
(4,646 real changes made)
(36,503 missing values generated)
(3,770 real changes made)
(3,692 real changes made)
(7,462 real changes made)
(31,857 real changes made)
(29,041 missing values generated)
(7,462 real changes made)
(3,770 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)

. gen baseline_egfr=.
(36,503 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(1,287 real changes made)
(1,206 real changes made)
(1,045 real changes made)
(1,029 real changes made)
(862 real changes made)
(831 real changes made)
(778 real changes made)
(682 real changes made)
(571 real changes made)
(508 real changes made)
(523 real changes made)
(436 real changes made)
(296 real changes made)
(340 real changes made)
(290 real changes made)
(255 real changes made)
(193 real changes made)
(209 real changes made)
(220 real changes made)
(194 real changes made)
(143 real changes made)
(143 real changes made)
(142 real changes made)
(119 real changes made)
(88 real changes made)
(120 real changes made)
(79 real changes made)
(62 real changes made)
(65 real changes made)
(72 real changes made)
(65 real changes made)
(40 real changes made)
(294 real changes made)
(291 real changes made)
(314 real changes made)
(309 real changes made)
(277 real changes made)
(279 real changes made)
(283 real changes made)
(286 real changes made)
(279 real changes made)
(258 real changes made)
(253 real changes made)
(258 real changes made)
(191 real changes made)
(244 real changes made)
(258 real changes made)
(236 real changes made)
(209 real changes made)
(222 real changes made)
(225 real changes made)
(209 real changes made)
(210 real changes made)
(187 real changes made)
(223 real changes made)
(207 real changes made)
(166 real changes made)
(212 real changes made)
(190 real changes made)
(180 real changes made)
(177 real changes made)
(157 real changes made)
(191 real changes made)
(151 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab case baseline_esrd

           | baseline_e
           |    srd
      case |   No ESRD |     Total
-----------+-----------+----------
         0 |    23,180 |    23,180 
         1 |    13,323 |    13,323 
-----------+-----------+----------
     Total |    36,503 |    36,503 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. * Drop COVID-19 cases without any matched historical comparators after further application of exclusion criteria
. generate match_counts1=.
(36,503 missing values generated)

. order patient_id set_id match_counts match_counts1

. bysort set_id: replace match_counts1=_N-1
(36,503 real changes made)

. replace match_counts1=. if case==0
(23,180 real changes made, 23,180 to missing)

. drop match_counts

. rename match_counts1 match_counts

. count if match_counts==0
  7,213

. drop if match_counts==0
(7,213 observations deleted)

. safetab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,180       79.14       79.14
          1 |      6,110       20.86      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. tab match_counts

match_count |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        780       12.77       12.77
          2 |        833       13.63       26.40
          3 |        815       13.34       39.74
          4 |      1,262       20.65       60.39
          5 |      2,420       39.61      100.00
------------+-----------------------------------
      Total |      6,110      100.00

. 
. ** Exposure
. label define case 0 "Comparator (historical)" ///
>                                   1 "COVID-19"

. label values case case

. safetab case 

                   case |      Freq.     Percent        Cum.
------------------------+-----------------------------------
Comparator (historical) |     23,180       79.14       79.14
               COVID-19 |      6,110       20.86      100.00
------------------------+-----------------------------------
                  Total |     29,290      100.00

. 
. * COVID-19 severity
. gen covid_severity = case

. replace covid_severity = 2 if covid_hospitalised==1
(592 real changes made)

. replace covid_severity = 3 if covid_critical_care==1
(296 real changes made)

. replace covid_severity = 3 if covid_critical_days==1
(315 real changes made)

. label define covid_severity_label       0 "Historical comparator"               ///
>                                                                         1 "Non-hospitalised SARS-CoV-2" ///
>                                                                         2 "Hospitalised COVID-19"               ///
>                                                                         3 "Critical care COVID-19"

. label values covid_severity covid_severity_label

. label var covid_severity "SARS-CoV-2 severity"

. drop covid_critical_care

. drop covid_critical_days

. safetab covid_severity, m

        SARS-CoV-2 severity |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
      Historical comparator |     23,180       79.14       79.14
Non-hospitalised SARS-CoV-2 |      4,986       17.02       96.16
      Hospitalised COVID-19 |        513        1.75       97.91
     Critical care COVID-19 |        611        2.09      100.00
----------------------------+-----------------------------------
                      Total |     29,290      100.00

. 
. * COVID-19 acute kidney injury
. gen covid_aki = case

. replace covid_aki = 2 if covid_hospitalised==1
(592 real changes made)

. replace covid_aki = 3 if covid_acute_kidney_injury==1
(305 real changes made)

. label define covid_aki  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised SARS-CoV-2"         ///
>                                                 2 "No AKI hospitalised COVID-19"        ///
>                                                 3 "AKI hospitalised COVID-19"

. label values covid_aki covid_aki

. label var covid_aki "COVID-19 acute kidney injury"

. drop covid_acute_kidney_injury

. safetab covid_aki, m

COVID-19 acute kidney injury |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
       Historical comparator |     23,180       79.14       79.14
 Non-hospitalised SARS-CoV-2 |      5,242       17.90       97.04
No AKI hospitalised COVID-19 |        563        1.92       98.96
   AKI hospitalised COVID-19 |        305        1.04      100.00
-----------------------------+-----------------------------------
                       Total |     29,290      100.00

. 
. * COVID-19 kidney replacement therapy
. gen covid_krt_combined = covid_krt_icd_10
(23,180 missing values generated)

. replace covid_krt_combined = covid_krt_opcs_4 if covid_krt_icd_10==0
(296 real changes made)

. gen covid_krt = case

. replace covid_krt = 2 if covid_hospitalised==1
(592 real changes made)

. replace covid_krt = 3 if covid_krt_combined==1
(593 real changes made)

. label define covid_krt  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised SARS-CoV-2"         ///
>                                                 2 "No KRT hospitalised COVID-19"        ///
>                                                 3 "KRT hospitalised COVID-19"

. label values covid_krt covid_krt

. label var covid_krt "COVID-19 kidney replacement therapy"

. drop covid_krt_icd_10

. drop covid_krt_opcs_4

. safetab covid_krt, m

 COVID-19 kidney replacement |
                     therapy |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
       Historical comparator |     23,180       79.14       79.14
 Non-hospitalised SARS-CoV-2 |      4,978       17.00       96.14
No KRT hospitalised COVID-19 |        539        1.84       97.98
   KRT hospitalised COVID-19 |        593        2.02      100.00
-----------------------------+-----------------------------------
                       Total |     29,290      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(28,047 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(28,067 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(28,094 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(28,117 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(1,173 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(987 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(790 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(658 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Historical comparator"       ///
>                                                 1 "Pre-vaccination"                     ///
>                                                 2 "1 vaccine dose"                      ///
>                                                 3 "2 vaccine doses"                     ///
>                                                 4 "3 vaccine doses"                     ///
>                                                 5 "4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "Vaccination status"

. safetab covid_vax, m

   Vaccination status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     23,180       79.14       79.14
      Pre-vaccination |      2,502        8.54       87.68
       1 vaccine dose |        658        2.25       89.93
      2 vaccine doses |        790        2.70       92.63
      3 vaccine doses |        987        3.37       96.00
      4 vaccine doses |      1,173        4.00      100.00
----------------------+-----------------------------------
                Total |     29,290      100.00

. 
. * Calendar period
. gen calendar_period = 1 if covid_month=="feb2020"
(28,775 missing values generated)

. replace calendar_period = 1 if covid_month=="mar2020"
(483 real changes made)

. replace calendar_period = 1 if covid_month=="apr2020"
(449 real changes made)

. replace calendar_period = 1 if covid_month=="may2020"
(442 real changes made)

. replace calendar_period = 1 if covid_month=="jun2020"
(386 real changes made)

. replace calendar_period = 2 if covid_month=="jul2020"
(372 real changes made)

. replace calendar_period = 2 if covid_month=="aug2020"
(368 real changes made)

. replace calendar_period = 3 if covid_month=="sep2020"
(324 real changes made)

. replace calendar_period = 3 if covid_month=="oct2020"
(279 real changes made)

. replace calendar_period = 3 if covid_month=="nov2020"
(241 real changes made)

. replace calendar_period = 4 if covid_month=="dec2020"
(252 real changes made)

. replace calendar_period = 4 if covid_month=="jan2021"
(239 real changes made)

. replace calendar_period = 4 if covid_month=="feb2021"
(148 real changes made)

. replace calendar_period = 5 if covid_month=="mar2021"
(181 real changes made)

. replace calendar_period = 5 if covid_month=="apr2021"
(174 real changes made)

. replace calendar_period = 5 if covid_month=="may2021"
(130 real changes made)

. replace calendar_period = 5 if covid_month=="jun2021"
(108 real changes made)

. replace calendar_period = 5 if covid_month=="jul2021"
(107 real changes made)

. replace calendar_period = 5 if covid_month=="aug2021"
(120 real changes made)

. replace calendar_period = 5 if covid_month=="sep2021"
(104 real changes made)

. replace calendar_period = 5 if covid_month=="oct2021"
(84 real changes made)

. replace calendar_period = 5 if covid_month=="nov2021"
(81 real changes made)

. replace calendar_period = 6 if covid_month=="dec2021"
(78 real changes made)

. replace calendar_period = 6 if covid_month=="jan2022"
(74 real changes made)

. replace calendar_period = 6 if covid_month=="feb2022"
(54 real changes made)

. replace calendar_period = 7 if covid_month=="mar2022"
(78 real changes made)

. replace calendar_period = 7 if covid_month=="apr2022"
(53 real changes made)

. replace calendar_period = 7 if covid_month=="may2022"
(36 real changes made)

. replace calendar_period = 7 if covid_month=="jun2022"
(46 real changes made)

. replace calendar_period = 7 if covid_month=="jul2022"
(44 real changes made)

. replace calendar_period = 7 if covid_month=="aug2022"
(37 real changes made)

. replace calendar_period = 7 if covid_month=="sep2022"
(23 real changes made)

. replace calendar_period = 0 if case==0
(23,180 real changes made)

. label define calendar_period    0 "Historical comparator"       ///
>                                                                 1 "Feb20-Jun20 SARS-CoV-2"      ///
>                                                                 2 "Jul20-Aug20 SARS-CoV-2"      ///
>                                                                 3 "Sep20-Nov20 SARS-CoV-2"      ///
>                                                                 4 "Dec20-Feb21 SARS-CoV-2"      ///
>                                                                 5 "Mar21-Nov21 SARS-CoV-2"      ///
>                                                                 6 "Dec21-Feb22 SARS-CoV-2"      ///
>                                                                 7 "Mar22-Sep22 SARS-CoV-2"

. label values calendar_period calendar_period

. label var calendar_period "Calendar period"

. safetab calendar_period, m

       Calendar period |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
 Historical comparator |     23,180       79.14       79.14
Feb20-Jun20 SARS-CoV-2 |      2,275        7.77       86.91
Jul20-Aug20 SARS-CoV-2 |        740        2.53       89.43
Sep20-Nov20 SARS-CoV-2 |        844        2.88       92.31
Dec20-Feb21 SARS-CoV-2 |        639        2.18       94.50
Mar21-Nov21 SARS-CoV-2 |      1,089        3.72       98.21
Dec21-Feb22 SARS-CoV-2 |        206        0.70       98.92
Mar22-Sep22 SARS-CoV-2 |        317        1.08      100.00
-----------------------+-----------------------------------
                 Total |     29,290      100.00

. 
. ** Covariates
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        354        1.21        1.21
         19 |        402        1.37        2.58
         20 |        469        1.60        4.18
         21 |        522        1.78        5.96
         22 |        554        1.89        7.86
         23 |        598        2.04        9.90
         24 |        563        1.92       11.82
         25 |        585        2.00       13.82
         26 |        590        2.01       15.83
         27 |        570        1.95       17.78
         28 |        614        2.10       19.87
         29 |        605        2.07       21.94
         30 |        566        1.93       23.87
         31 |        573        1.96       25.83
         32 |        600        2.05       27.88
         33 |        551        1.88       29.76
         34 |        605        2.07       31.82
         35 |        566        1.93       33.76
         36 |        579        1.98       35.73
         37 |        603        2.06       37.79
         38 |        601        2.05       39.84
         39 |        621        2.12       41.96
         40 |        527        1.80       43.76
         41 |        596        2.03       45.80
         42 |        521        1.78       47.58
         43 |        627        2.14       49.72
         44 |        589        2.01       51.73
         45 |        584        1.99       53.72
         46 |        581        1.98       55.71
         47 |        583        1.99       57.70
         48 |        599        2.05       59.74
         49 |        589        2.01       61.75
         50 |        591        2.02       63.77
         51 |        579        1.98       65.75
         52 |        584        1.99       67.74
         53 |        605        2.07       69.81
         54 |        576        1.97       71.77
         55 |        586        2.00       73.77
         56 |        606        2.07       75.84
         57 |        585        2.00       77.84
         58 |        582        1.99       79.83
         59 |        572        1.95       81.78
         60 |        622        2.12       83.90
         61 |        549        1.87       85.78
         62 |        611        2.09       87.86
         63 |        582        1.99       89.85
         64 |        642        2.19       92.04
         65 |        624        2.13       94.17
         66 |        574        1.96       96.13
         67 |        580        1.98       98.11
         68 |        251        0.86       98.97
         69 |        142        0.48       99.45
         70 |        117        0.40       99.85
         71 |         37        0.13       99.98
         72 |          6        0.02      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. safecount
  29,290

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///                                     
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(29290 differences between age and agegroup)

. 
. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label values agegroup agegroup

. label var agegroup "Age group"

. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,928       50.97       50.97
       Male |     14,362       49.03      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. safecount
  29,290

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(1,031 real changes made)

. replace ethnicity=2 if ethnicity==3
(1,061 real changes made)

. replace ethnicity=3 if ethnicity==4
(1,152 real changes made)

. replace ethnicity=4 if ethnicity==6
(1,031 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///                                             
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                                                               

. label values ethnicity ethnicity

. safetab ethnicity, m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     17,630       60.19       60.19
South Asian |      1,061        3.62       63.81
      Black |      1,152        3.93       67.75
      Mixed |      1,031        3.52       71.27
      Other |      1,112        3.80       75.06
          . |      7,304       24.94      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(7,304 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(7,304 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. safetab ethnicity1, m

 ethnicity1 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     17,630       60.19       60.19
South Asian |      1,061        3.62       63.81
      Black |      1,152        3.93       67.75
      Mixed |      1,031        3.52       71.27
      Other |      1,112        3.80       75.06
    Unknown |      7,304       24.94      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,799        9.56        9.56
                Urban minor conurbation |      2,906        9.92       19.48
                    Urban city and town |      2,953       10.08       29.56
Urban city and town in a sparse setting |      2,923        9.98       39.54
                  Rural town and fringe |      2,934       10.02       49.56
Rural town and fringe in a sparse setti |      2,972       10.15       59.70
            Rural village and dispersed |      5,861       20.01       79.71
Rural village and dispersed in a sparse |      5,942       20.29      100.00
----------------------------------------+-----------------------------------
                                  Total |     29,290      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(29,290 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(11,581 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(17,709 real changes made)

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

           |                                       rural_urban
     urban | Urban maj  Urban min  Urban cit  Urban cit  Rural tow  Rural tow  Rural vil  Rural vil |     Total
-----------+----------------------------------------------------------------------------------------+----------
     Rural |         0          0          0          0      2,934      2,972      5,861      5,942 |    17,709 
     Urban |     2,799      2,906      2,953      2,923          0          0          0          0 |    11,581 
-----------+----------------------------------------------------------------------------------------+----------
     Total |     2,799      2,906      2,953      2,923      2,934      2,972      5,861      5,942 |    29,290 

. tab case urban

                      |         urban
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Comparator (historica |    14,034      9,146 |    23,180 
             COVID-19 |     3,675      2,435 |     6,110 
----------------------+----------------------+----------
                Total |    17,709     11,581 |    29,290 

. label var urban "Urban/rural"

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,962 real changes made, 2,962 to missing)

. gen     bmi = .
(29,290 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(1868 changes made to bmi)

. recode  bmi . = 2 if body_mass_index<25
(6653 changes made to bmi)

. recode  bmi . = 3 if body_mass_index<30
(6778 changes made to bmi)

. recode  bmi . = 4 if body_mass_index<35
(5775 changes made to bmi)

. recode  bmi . = 5 if body_mass_index<40
(3486 changes made to bmi)

. recode  bmi . = 6 if body_mass_index<.
(1768 changes made to bmi)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                             

. label values bmi bmi

. safetab bmi, m

                 bmi |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,868        6.38        6.38
  Normal (18.5-24.9) |      6,653       22.71       29.09
Overweight (25-29.9) |      6,778       23.14       52.23
   Obese I (30-34.9) |      5,775       19.72       71.95
  Obese II (35-39.9) |      3,486       11.90       83.85
     Obese III (40+) |      1,768        6.04       89.89
                   . |      2,962       10.11      100.00
---------------------+-----------------------------------
               Total |     29,290      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(25,777 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(601 real changes made)

. replace smoking = 0 if smoking_status=="N"
(1,157 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |      1,157        3.95        3.95
Current/former smoker |      4,114       14.05       18.00
                    . |     24,019       82.00      100.00
----------------------+-----------------------------------
                Total |     29,290      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000)
(12,968 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(16322 changes made to egfr_group)

. label define egfr_group 1 "105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       105 |      5,191       17.72       17.72
     90-104 |      2,389        8.16       25.88
      75-89 |      2,106        7.19       33.07
      60-74 |      2,597        8.87       41.94
      45-59 |      2,573        8.78       50.72
      30-44 |      1,354        4.62       55.34
      15-29 |        112        0.38       55.73
          . |     12,968       44.27      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 15-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(12,968 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(24099 changes made to ckd_stage)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6 "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |     12,283       41.94       41.94
                      CKD 3A |      2,573        8.78       50.72
                      CKD 3B |      1,354        4.62       55.34
                       CKD 4 |        112        0.38       55.73
No baseline eGFR measurement |     12,968       44.27      100.00
-----------------------------+-----------------------------------
                       Total |     29,290      100.00

. 
. * Comorbidities
. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,831       95.02       95.02
          1 |      1,459        4.98      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     28,686       97.94       97.94
          1 |        604        2.06      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. safetab diabetes

   diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,389       79.85       79.85
          1 |      5,901       20.15      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     28,992       98.98       98.98
          1 |        298        1.02      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. safetab heart_failure

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     28,095       95.92       95.92
          1 |      1,195        4.08      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. safetab hiv

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     28,703       98.00       98.00
          1 |        587        2.00      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. safetab hypertension

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,438       80.02       80.02
          1 |      5,852       19.98      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. safetab non_haem_cancer

non_haem_ca |
       ncer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     28,719       98.05       98.05
          1 |        571        1.95      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. safetab myocardial_infarction

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,372       90.04       90.04
          1 |      2,918        9.96      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     28,698       97.98       97.98
          1 |        592        2.02      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     27,836       95.04       95.04
          1 |      1,454        4.96      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. safetab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     28,691       97.95       97.95
          1 |        599        2.05      100.00
------------+-----------------------------------
      Total |     29,290      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     28,716       98.04       98.04
          1 |        574        1.96      100.00
------------+-----------------------------------
      Total |     29,290      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                                 creatinine_mar2017 ///
>                                                                                 creatinine_apr2017 ///
>                                                                                 creatinine_may2017 ///
>                                                                                 creatinine_jun2017 ///
>                                                                                 creatinine_jul2017 ///
>                                                                                 creatinine_aug2017 ///
>                                                                                 creatinine_sep2017 ///
>                                                                                 creatinine_oct2017 ///
>                                                                                 creatinine_nov2017 ///
>                                                                                 creatinine_dec2017 ///
>                                                                                 creatinine_jan2018 ///
>                                                                                 creatinine_feb2018 ///
>                                                                                 creatinine_mar2018 ///
>                                                                                 creatinine_apr2018 ///
>                                                                                 creatinine_may2018 ///
>                                                                                 creatinine_jun2018 ///
>                                                                                 creatinine_jul2018 ///
>                                                                                 creatinine_aug2018 ///
>                                                                                 creatinine_sep2018 ///
>                                                                                 creatinine_oct2018 ///
>                                                                                 creatinine_nov2018 ///
>                                                                                 creatinine_dec2018 ///
>                                                                                 creatinine_jan2019 ///
>                                                                                 creatinine_feb2019 ///
>                                                                                 creatinine_mar2019 ///
>                                                                                 creatinine_apr2019 ///
>                                                                                 creatinine_may2019 ///
>                                                                                 creatinine_jun2019 ///
>                                                                                 creatinine_jul2019 ///
>                                                                                 creatinine_aug2019 ///
>                                                                                 creatinine_sep2019 ///
>                                                                                 creatinine_feb2020 ///
>                                                                                 creatinine_mar2020 ///
>                                                                                 creatinine_apr2020 ///
>                                                                                 creatinine_may2020 ///
>                                                                                 creatinine_jun2020 ///
>                                                                                 creatinine_jul2020 ///
>                                                                                 creatinine_aug2020 ///
>                                                                                 creatinine_sep2020 ///
>                                                                                 creatinine_oct2020 ///
>                                                                                 creatinine_nov2020 ///
>                                                                                 creatinine_dec2020 ///
>                                                                                 creatinine_jan2021 ///
>                                                                                 creatinine_feb2021 ///
>                                                                                 creatinine_mar2021 ///
>                                                                                 creatinine_apr2021 ///
>                                                                                 creatinine_may2021 ///
>                                                                                 creatinine_jun2021 ///
>                                                                                 creatinine_jul2021 ///
>                                                                                 creatinine_aug2021 ///
>                                                                                 creatinine_sep2021 ///
>                                                                                 creatinine_oct2021 ///
>                                                                                 creatinine_nov2021 ///
>                                                                                 creatinine_dec2021 ///
>                                                                                 creatinine_jan2022 ///
>                                                                                 creatinine_feb2022 ///
>                                                                                 creatinine_mar2022 ///
>                                                                                 creatinine_apr2022 ///
>                                                                                 creatinine_may2022 ///
>                                                                                 creatinine_jun2022 ///
>                                                                                 creatinine_jul2022 ///
>                                                                                 creatinine_aug2022 ///
>                                                                                 creatinine_sep2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 3000)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex==0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex==1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_monthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(10,258 real changes made, 10,258 to missing)
(16,368 missing values generated)
(29,290 missing values generated)
(6,620 real changes made)
(6,302 real changes made)
(6,620 real changes made)
(6,302 real changes made)
(8,219 real changes made)
(29,290 missing values generated)
(6,620 real changes made)
(6,302 real changes made)
(12,922 real changes made)
(21,071 real changes made)
(16,368 missing values generated)
(12,922 real changes made)
(6,620 real changes made)
(10,201 real changes made, 10,201 to missing)
(16,311 missing values generated)
(29,290 missing values generated)
(6,657 real changes made)
(6,322 real changes made)
(6,657 real changes made)
(6,322 real changes made)
(8,190 real changes made)
(29,290 missing values generated)
(6,657 real changes made)
(6,322 real changes made)
(12,979 real changes made)
(21,100 real changes made)
(16,311 missing values generated)
(12,979 real changes made)
(6,657 real changes made)
(10,190 real changes made, 10,190 to missing)
(16,300 missing values generated)
(29,290 missing values generated)
(6,672 real changes made)
(6,318 real changes made)
(6,672 real changes made)
(6,318 real changes made)
(8,305 real changes made)
(29,290 missing values generated)
(6,672 real changes made)
(6,318 real changes made)
(12,990 real changes made)
(20,985 real changes made)
(16,300 missing values generated)
(12,990 real changes made)
(6,672 real changes made)
(10,198 real changes made, 10,198 to missing)
(16,308 missing values generated)
(29,290 missing values generated)
(6,635 real changes made)
(6,347 real changes made)
(6,635 real changes made)
(6,347 real changes made)
(8,285 real changes made)
(29,290 missing values generated)
(6,635 real changes made)
(6,347 real changes made)
(12,982 real changes made)
(21,005 real changes made)
(16,308 missing values generated)
(12,982 real changes made)
(6,635 real changes made)
(10,226 real changes made, 10,226 to missing)
(16,336 missing values generated)
(29,290 missing values generated)
(6,596 real changes made)
(6,358 real changes made)
(6,596 real changes made)
(6,358 real changes made)
(8,234 real changes made)
(29,290 missing values generated)
(6,596 real changes made)
(6,358 real changes made)
(12,954 real changes made)
(21,056 real changes made)
(16,336 missing values generated)
(12,954 real changes made)
(6,596 real changes made)
(10,170 real changes made, 10,170 to missing)
(16,280 missing values generated)
(29,290 missing values generated)
(6,647 real changes made)
(6,363 real changes made)
(6,647 real changes made)
(6,363 real changes made)
(8,262 real changes made)
(29,290 missing values generated)
(6,647 real changes made)
(6,363 real changes made)
(13,010 real changes made)
(21,028 real changes made)
(16,280 missing values generated)
(13,010 real changes made)
(6,647 real changes made)
(10,188 real changes made, 10,188 to missing)
(16,298 missing values generated)
(29,290 missing values generated)
(6,657 real changes made)
(6,335 real changes made)
(6,657 real changes made)
(6,335 real changes made)
(8,269 real changes made)
(29,290 missing values generated)
(6,657 real changes made)
(6,335 real changes made)
(12,992 real changes made)
(21,021 real changes made)
(16,298 missing values generated)
(12,992 real changes made)
(6,657 real changes made)
(10,200 real changes made, 10,200 to missing)
(16,310 missing values generated)
(29,290 missing values generated)
(6,533 real changes made)
(6,447 real changes made)
(6,533 real changes made)
(6,447 real changes made)
(8,217 real changes made)
(29,290 missing values generated)
(6,533 real changes made)
(6,447 real changes made)
(12,980 real changes made)
(21,073 real changes made)
(16,310 missing values generated)
(12,980 real changes made)
(6,533 real changes made)
(10,253 real changes made, 10,253 to missing)
(16,363 missing values generated)
(29,290 missing values generated)
(6,568 real changes made)
(6,359 real changes made)
(6,568 real changes made)
(6,359 real changes made)
(8,201 real changes made)
(29,290 missing values generated)
(6,568 real changes made)
(6,359 real changes made)
(12,927 real changes made)
(21,089 real changes made)
(16,363 missing values generated)
(12,927 real changes made)
(6,568 real changes made)
(10,284 real changes made, 10,284 to missing)
(16,394 missing values generated)
(29,290 missing values generated)
(6,563 real changes made)
(6,333 real changes made)
(6,563 real changes made)
(6,333 real changes made)
(8,107 real changes made)
(29,290 missing values generated)
(6,563 real changes made)
(6,333 real changes made)
(12,896 real changes made)
(21,183 real changes made)
(16,394 missing values generated)
(12,896 real changes made)
(6,563 real changes made)
(10,249 real changes made, 10,249 to missing)
(16,359 missing values generated)
(29,290 missing values generated)
(6,603 real changes made)
(6,328 real changes made)
(6,603 real changes made)
(6,328 real changes made)
(8,156 real changes made)
(29,290 missing values generated)
(6,603 real changes made)
(6,328 real changes made)
(12,931 real changes made)
(21,134 real changes made)
(16,359 missing values generated)
(12,931 real changes made)
(6,603 real changes made)
(10,208 real changes made, 10,208 to missing)
(16,318 missing values generated)
(29,290 missing values generated)
(6,561 real changes made)
(6,411 real changes made)
(6,561 real changes made)
(6,411 real changes made)
(8,227 real changes made)
(29,290 missing values generated)
(6,561 real changes made)
(6,411 real changes made)
(12,972 real changes made)
(21,063 real changes made)
(16,318 missing values generated)
(12,972 real changes made)
(6,561 real changes made)
(10,168 real changes made, 10,168 to missing)
(16,278 missing values generated)
(29,290 missing values generated)
(6,629 real changes made)
(6,383 real changes made)
(6,629 real changes made)
(6,383 real changes made)
(8,344 real changes made)
(29,290 missing values generated)
(6,629 real changes made)
(6,383 real changes made)
(13,012 real changes made)
(20,946 real changes made)
(16,278 missing values generated)
(13,012 real changes made)
(6,629 real changes made)
(10,167 real changes made, 10,167 to missing)
(16,277 missing values generated)
(29,290 missing values generated)
(6,590 real changes made)
(6,423 real changes made)
(6,590 real changes made)
(6,423 real changes made)
(8,267 real changes made)
(29,290 missing values generated)
(6,590 real changes made)
(6,423 real changes made)
(13,013 real changes made)
(21,023 real changes made)
(16,277 missing values generated)
(13,013 real changes made)
(6,590 real changes made)
(10,200 real changes made, 10,200 to missing)
(16,310 missing values generated)
(29,290 missing values generated)
(6,605 real changes made)
(6,375 real changes made)
(6,605 real changes made)
(6,375 real changes made)
(8,181 real changes made)
(29,290 missing values generated)
(6,605 real changes made)
(6,375 real changes made)
(12,980 real changes made)
(21,109 real changes made)
(16,310 missing values generated)
(12,980 real changes made)
(6,605 real changes made)
(10,258 real changes made, 10,258 to missing)
(16,368 missing values generated)
(29,290 missing values generated)
(6,537 real changes made)
(6,385 real changes made)
(6,537 real changes made)
(6,385 real changes made)
(8,166 real changes made)
(29,290 missing values generated)
(6,537 real changes made)
(6,385 real changes made)
(12,922 real changes made)
(21,124 real changes made)
(16,368 missing values generated)
(12,922 real changes made)
(6,537 real changes made)
(10,198 real changes made, 10,198 to missing)
(16,308 missing values generated)
(29,290 missing values generated)
(6,664 real changes made)
(6,318 real changes made)
(6,664 real changes made)
(6,318 real changes made)
(8,296 real changes made)
(29,290 missing values generated)
(6,664 real changes made)
(6,318 real changes made)
(12,982 real changes made)
(20,994 real changes made)
(16,308 missing values generated)
(12,982 real changes made)
(6,664 real changes made)
(10,168 real changes made, 10,168 to missing)
(16,278 missing values generated)
(29,290 missing values generated)
(6,621 real changes made)
(6,391 real changes made)
(6,621 real changes made)
(6,391 real changes made)
(8,210 real changes made)
(29,290 missing values generated)
(6,621 real changes made)
(6,391 real changes made)
(13,012 real changes made)
(21,080 real changes made)
(16,278 missing values generated)
(13,012 real changes made)
(6,621 real changes made)
(10,233 real changes made, 10,233 to missing)
(16,343 missing values generated)
(29,290 missing values generated)
(6,644 real changes made)
(6,303 real changes made)
(6,644 real changes made)
(6,303 real changes made)
(8,167 real changes made)
(29,290 missing values generated)
(6,644 real changes made)
(6,303 real changes made)
(12,947 real changes made)
(21,123 real changes made)
(16,343 missing values generated)
(12,947 real changes made)
(6,644 real changes made)
(10,186 real changes made, 10,186 to missing)
(16,296 missing values generated)
(29,290 missing values generated)
(6,646 real changes made)
(6,348 real changes made)
(6,646 real changes made)
(6,348 real changes made)
(8,262 real changes made)
(29,290 missing values generated)
(6,646 real changes made)
(6,348 real changes made)
(12,994 real changes made)
(21,028 real changes made)
(16,296 missing values generated)
(12,994 real changes made)
(6,646 real changes made)
(10,203 real changes made, 10,203 to missing)
(16,313 missing values generated)
(29,290 missing values generated)
(6,638 real changes made)
(6,339 real changes made)
(6,638 real changes made)
(6,339 real changes made)
(8,198 real changes made)
(29,290 missing values generated)
(6,638 real changes made)
(6,339 real changes made)
(12,977 real changes made)
(21,092 real changes made)
(16,313 missing values generated)
(12,977 real changes made)
(6,638 real changes made)
(10,221 real changes made, 10,221 to missing)
(16,331 missing values generated)
(29,290 missing values generated)
(6,602 real changes made)
(6,357 real changes made)
(6,602 real changes made)
(6,357 real changes made)
(8,131 real changes made)
(29,290 missing values generated)
(6,602 real changes made)
(6,357 real changes made)
(12,959 real changes made)
(21,159 real changes made)
(16,331 missing values generated)
(12,959 real changes made)
(6,602 real changes made)
(10,204 real changes made, 10,204 to missing)
(16,314 missing values generated)
(29,290 missing values generated)
(6,627 real changes made)
(6,349 real changes made)
(6,627 real changes made)
(6,349 real changes made)
(8,160 real changes made)
(29,290 missing values generated)
(6,627 real changes made)
(6,349 real changes made)
(12,976 real changes made)
(21,130 real changes made)
(16,314 missing values generated)
(12,976 real changes made)
(6,627 real changes made)
(10,196 real changes made, 10,196 to missing)
(16,306 missing values generated)
(29,290 missing values generated)
(6,592 real changes made)
(6,392 real changes made)
(6,592 real changes made)
(6,392 real changes made)
(8,161 real changes made)
(29,290 missing values generated)
(6,592 real changes made)
(6,392 real changes made)
(12,984 real changes made)
(21,129 real changes made)
(16,306 missing values generated)
(12,984 real changes made)
(6,592 real changes made)
(10,211 real changes made, 10,211 to missing)
(16,321 missing values generated)
(29,290 missing values generated)
(6,574 real changes made)
(6,395 real changes made)
(6,574 real changes made)
(6,395 real changes made)
(8,166 real changes made)
(29,290 missing values generated)
(6,574 real changes made)
(6,395 real changes made)
(12,969 real changes made)
(21,124 real changes made)
(16,321 missing values generated)
(12,969 real changes made)
(6,574 real changes made)
(10,188 real changes made, 10,188 to missing)
(16,298 missing values generated)
(29,290 missing values generated)
(6,649 real changes made)
(6,343 real changes made)
(6,649 real changes made)
(6,343 real changes made)
(8,241 real changes made)
(29,290 missing values generated)
(6,649 real changes made)
(6,343 real changes made)
(12,992 real changes made)
(21,049 real changes made)
(16,298 missing values generated)
(12,992 real changes made)
(6,649 real changes made)
(10,191 real changes made, 10,191 to missing)
(16,301 missing values generated)
(29,290 missing values generated)
(6,566 real changes made)
(6,423 real changes made)
(6,566 real changes made)
(6,423 real changes made)
(8,220 real changes made)
(29,290 missing values generated)
(6,566 real changes made)
(6,423 real changes made)
(12,989 real changes made)
(21,070 real changes made)
(16,301 missing values generated)
(12,989 real changes made)
(6,566 real changes made)
(10,183 real changes made, 10,183 to missing)
(16,293 missing values generated)
(29,290 missing values generated)
(6,599 real changes made)
(6,398 real changes made)
(6,599 real changes made)
(6,398 real changes made)
(8,220 real changes made)
(29,290 missing values generated)
(6,599 real changes made)
(6,398 real changes made)
(12,997 real changes made)
(21,070 real changes made)
(16,293 missing values generated)
(12,997 real changes made)
(6,599 real changes made)
(10,234 real changes made, 10,234 to missing)
(16,344 missing values generated)
(29,290 missing values generated)
(6,556 real changes made)
(6,390 real changes made)
(6,556 real changes made)
(6,390 real changes made)
(8,222 real changes made)
(29,290 missing values generated)
(6,556 real changes made)
(6,390 real changes made)
(12,946 real changes made)
(21,068 real changes made)
(16,344 missing values generated)
(12,946 real changes made)
(6,556 real changes made)
(10,224 real changes made, 10,224 to missing)
(16,334 missing values generated)
(29,290 missing values generated)
(6,586 real changes made)
(6,370 real changes made)
(6,586 real changes made)
(6,370 real changes made)
(8,284 real changes made)
(29,290 missing values generated)
(6,586 real changes made)
(6,370 real changes made)
(12,956 real changes made)
(21,006 real changes made)
(16,334 missing values generated)
(12,956 real changes made)
(6,586 real changes made)
(10,245 real changes made, 10,245 to missing)
(16,355 missing values generated)
(29,290 missing values generated)
(6,593 real changes made)
(6,342 real changes made)
(6,593 real changes made)
(6,342 real changes made)
(8,227 real changes made)
(29,290 missing values generated)
(6,593 real changes made)
(6,342 real changes made)
(12,935 real changes made)
(21,063 real changes made)
(16,355 missing values generated)
(12,935 real changes made)
(6,593 real changes made)
(10,207 real changes made, 10,207 to missing)
(16,317 missing values generated)
(29,290 missing values generated)
(6,658 real changes made)
(6,315 real changes made)
(6,658 real changes made)
(6,315 real changes made)
(8,191 real changes made)
(29,290 missing values generated)
(6,658 real changes made)
(6,315 real changes made)
(12,973 real changes made)
(21,099 real changes made)
(16,317 missing values generated)
(12,973 real changes made)
(6,658 real changes made)
(2,727 real changes made, 2,727 to missing)
(25,907 missing values generated)
(29,290 missing values generated)
(1,724 real changes made)
(1,659 real changes made)
(1,724 real changes made)
(1,659 real changes made)
(2,108 real changes made)
(29,290 missing values generated)
(1,724 real changes made)
(1,659 real changes made)
(3,383 real changes made)
(27,182 real changes made)
(25,907 missing values generated)
(3,383 real changes made)
(1,724 real changes made)
(2,684 real changes made, 2,684 to missing)
(25,864 missing values generated)
(29,290 missing values generated)
(1,751 real changes made)
(1,675 real changes made)
(1,751 real changes made)
(1,675 real changes made)
(2,158 real changes made)
(29,290 missing values generated)
(1,751 real changes made)
(1,675 real changes made)
(3,426 real changes made)
(27,132 real changes made)
(25,864 missing values generated)
(3,426 real changes made)
(1,751 real changes made)
(2,692 real changes made, 2,692 to missing)
(25,872 missing values generated)
(29,290 missing values generated)
(1,756 real changes made)
(1,662 real changes made)
(1,756 real changes made)
(1,662 real changes made)
(2,099 real changes made)
(29,290 missing values generated)
(1,756 real changes made)
(1,662 real changes made)
(3,418 real changes made)
(27,191 real changes made)
(25,872 missing values generated)
(3,418 real changes made)
(1,756 real changes made)
(2,673 real changes made, 2,673 to missing)
(25,853 missing values generated)
(29,290 missing values generated)
(1,722 real changes made)
(1,715 real changes made)
(1,722 real changes made)
(1,715 real changes made)
(2,202 real changes made)
(29,290 missing values generated)
(1,722 real changes made)
(1,715 real changes made)
(3,437 real changes made)
(27,088 real changes made)
(25,853 missing values generated)
(3,437 real changes made)
(1,722 real changes made)
(2,664 real changes made, 2,664 to missing)
(25,844 missing values generated)
(29,290 missing values generated)
(1,756 real changes made)
(1,690 real changes made)
(1,756 real changes made)
(1,690 real changes made)
(2,211 real changes made)
(29,290 missing values generated)
(1,756 real changes made)
(1,690 real changes made)
(3,446 real changes made)
(27,079 real changes made)
(25,844 missing values generated)
(3,446 real changes made)
(1,756 real changes made)
(2,709 real changes made, 2,709 to missing)
(25,889 missing values generated)
(29,290 missing values generated)
(1,719 real changes made)
(1,682 real changes made)
(1,719 real changes made)
(1,682 real changes made)
(2,161 real changes made)
(29,290 missing values generated)
(1,719 real changes made)
(1,682 real changes made)
(3,401 real changes made)
(27,129 real changes made)
(25,889 missing values generated)
(3,401 real changes made)
(1,719 real changes made)
(2,638 real changes made, 2,638 to missing)
(25,818 missing values generated)
(29,290 missing values generated)
(1,741 real changes made)
(1,731 real changes made)
(1,741 real changes made)
(1,731 real changes made)
(2,160 real changes made)
(29,290 missing values generated)
(1,741 real changes made)
(1,731 real changes made)
(3,472 real changes made)
(27,130 real changes made)
(25,818 missing values generated)
(3,472 real changes made)
(1,741 real changes made)
(2,664 real changes made, 2,664 to missing)
(25,844 missing values generated)
(29,290 missing values generated)
(1,776 real changes made)
(1,670 real changes made)
(1,776 real changes made)
(1,670 real changes made)
(2,187 real changes made)
(29,290 missing values generated)
(1,776 real changes made)
(1,670 real changes made)
(3,446 real changes made)
(27,103 real changes made)
(25,844 missing values generated)
(3,446 real changes made)
(1,776 real changes made)
(2,703 real changes made, 2,703 to missing)
(25,883 missing values generated)
(29,290 missing values generated)
(1,704 real changes made)
(1,703 real changes made)
(1,704 real changes made)
(1,703 real changes made)
(2,197 real changes made)
(29,290 missing values generated)
(1,704 real changes made)
(1,703 real changes made)
(3,407 real changes made)
(27,093 real changes made)
(25,883 missing values generated)
(3,407 real changes made)
(1,704 real changes made)
(2,715 real changes made, 2,715 to missing)
(25,895 missing values generated)
(29,290 missing values generated)
(1,746 real changes made)
(1,649 real changes made)
(1,746 real changes made)
(1,649 real changes made)
(2,190 real changes made)
(29,290 missing values generated)
(1,746 real changes made)
(1,649 real changes made)
(3,395 real changes made)
(27,100 real changes made)
(25,895 missing values generated)
(3,395 real changes made)
(1,746 real changes made)
(2,721 real changes made, 2,721 to missing)
(25,901 missing values generated)
(29,290 missing values generated)
(1,741 real changes made)
(1,648 real changes made)
(1,741 real changes made)
(1,648 real changes made)
(2,192 real changes made)
(29,290 missing values generated)
(1,741 real changes made)
(1,648 real changes made)
(3,389 real changes made)
(27,098 real changes made)
(25,901 missing values generated)
(3,389 real changes made)
(1,741 real changes made)
(2,657 real changes made, 2,657 to missing)
(25,837 missing values generated)
(29,290 missing values generated)
(1,760 real changes made)
(1,693 real changes made)
(1,760 real changes made)
(1,693 real changes made)
(2,194 real changes made)
(29,290 missing values generated)
(1,760 real changes made)
(1,693 real changes made)
(3,453 real changes made)
(27,096 real changes made)
(25,837 missing values generated)
(3,453 real changes made)
(1,760 real changes made)
(2,696 real changes made, 2,696 to missing)
(25,876 missing values generated)
(29,290 missing values generated)
(1,748 real changes made)
(1,666 real changes made)
(1,748 real changes made)
(1,666 real changes made)
(2,180 real changes made)
(29,290 missing values generated)
(1,748 real changes made)
(1,666 real changes made)
(3,414 real changes made)
(27,110 real changes made)
(25,876 missing values generated)
(3,414 real changes made)
(1,748 real changes made)
(2,586 real changes made, 2,586 to missing)
(25,766 missing values generated)
(29,290 missing values generated)
(1,782 real changes made)
(1,742 real changes made)
(1,782 real changes made)
(1,742 real changes made)
(2,270 real changes made)
(29,290 missing values generated)
(1,782 real changes made)
(1,742 real changes made)
(3,524 real changes made)
(27,020 real changes made)
(25,766 missing values generated)
(3,524 real changes made)
(1,782 real changes made)
(2,628 real changes made, 2,628 to missing)
(25,808 missing values generated)
(29,290 missing values generated)
(1,768 real changes made)
(1,714 real changes made)
(1,768 real changes made)
(1,714 real changes made)
(2,263 real changes made)
(29,290 missing values generated)
(1,768 real changes made)
(1,714 real changes made)
(3,482 real changes made)
(27,027 real changes made)
(25,808 missing values generated)
(3,482 real changes made)
(1,768 real changes made)
(2,696 real changes made, 2,696 to missing)
(25,876 missing values generated)
(29,290 missing values generated)
(1,713 real changes made)
(1,701 real changes made)
(1,713 real changes made)
(1,701 real changes made)
(2,168 real changes made)
(29,290 missing values generated)
(1,713 real changes made)
(1,701 real changes made)
(3,414 real changes made)
(27,122 real changes made)
(25,876 missing values generated)
(3,414 real changes made)
(1,713 real changes made)
(2,670 real changes made, 2,670 to missing)
(25,850 missing values generated)
(29,290 missing values generated)
(1,733 real changes made)
(1,707 real changes made)
(1,733 real changes made)
(1,707 real changes made)
(2,180 real changes made)
(29,290 missing values generated)
(1,733 real changes made)
(1,707 real changes made)
(3,440 real changes made)
(27,110 real changes made)
(25,850 missing values generated)
(3,440 real changes made)
(1,733 real changes made)
(2,673 real changes made, 2,673 to missing)
(25,853 missing values generated)
(29,290 missing values generated)
(1,744 real changes made)
(1,693 real changes made)
(1,744 real changes made)
(1,693 real changes made)
(2,181 real changes made)
(29,290 missing values generated)
(1,744 real changes made)
(1,693 real changes made)
(3,437 real changes made)
(27,109 real changes made)
(25,853 missing values generated)
(3,437 real changes made)
(1,744 real changes made)
(2,619 real changes made, 2,619 to missing)
(25,799 missing values generated)
(29,290 missing values generated)
(1,791 real changes made)
(1,700 real changes made)
(1,791 real changes made)
(1,700 real changes made)
(2,222 real changes made)
(29,290 missing values generated)
(1,791 real changes made)
(1,700 real changes made)
(3,491 real changes made)
(27,068 real changes made)
(25,799 missing values generated)
(3,491 real changes made)
(1,791 real changes made)
(2,724 real changes made, 2,724 to missing)
(25,904 missing values generated)
(29,290 missing values generated)
(1,719 real changes made)
(1,667 real changes made)
(1,719 real changes made)
(1,667 real changes made)
(2,118 real changes made)
(29,290 missing values generated)
(1,719 real changes made)
(1,667 real changes made)
(3,386 real changes made)
(27,172 real changes made)
(25,904 missing values generated)
(3,386 real changes made)
(1,719 real changes made)
(2,687 real changes made, 2,687 to missing)
(25,867 missing values generated)
(29,290 missing values generated)
(1,807 real changes made)
(1,616 real changes made)
(1,807 real changes made)
(1,616 real changes made)
(2,210 real changes made)
(29,290 missing values generated)
(1,807 real changes made)
(1,616 real changes made)
(3,423 real changes made)
(27,080 real changes made)
(25,867 missing values generated)
(3,423 real changes made)
(1,807 real changes made)
(2,670 real changes made, 2,670 to missing)
(25,850 missing values generated)
(29,290 missing values generated)
(1,733 real changes made)
(1,707 real changes made)
(1,733 real changes made)
(1,707 real changes made)
(2,162 real changes made)
(29,290 missing values generated)
(1,733 real changes made)
(1,707 real changes made)
(3,440 real changes made)
(27,128 real changes made)
(25,850 missing values generated)
(3,440 real changes made)
(1,733 real changes made)
(2,670 real changes made, 2,670 to missing)
(25,850 missing values generated)
(29,290 missing values generated)
(1,785 real changes made)
(1,655 real changes made)
(1,785 real changes made)
(1,655 real changes made)
(2,200 real changes made)
(29,290 missing values generated)
(1,785 real changes made)
(1,655 real changes made)
(3,440 real changes made)
(27,090 real changes made)
(25,850 missing values generated)
(3,440 real changes made)
(1,785 real changes made)
(2,663 real changes made, 2,663 to missing)
(25,843 missing values generated)
(29,290 missing values generated)
(1,763 real changes made)
(1,684 real changes made)
(1,763 real changes made)
(1,684 real changes made)
(2,199 real changes made)
(29,290 missing values generated)
(1,763 real changes made)
(1,684 real changes made)
(3,447 real changes made)
(27,091 real changes made)
(25,843 missing values generated)
(3,447 real changes made)
(1,763 real changes made)
(2,752 real changes made, 2,752 to missing)
(25,932 missing values generated)
(29,290 missing values generated)
(1,715 real changes made)
(1,643 real changes made)
(1,715 real changes made)
(1,643 real changes made)
(2,118 real changes made)
(29,290 missing values generated)
(1,715 real changes made)
(1,643 real changes made)
(3,358 real changes made)
(27,172 real changes made)
(25,932 missing values generated)
(3,358 real changes made)
(1,715 real changes made)
(2,708 real changes made, 2,708 to missing)
(25,888 missing values generated)
(29,290 missing values generated)
(1,731 real changes made)
(1,671 real changes made)
(1,731 real changes made)
(1,671 real changes made)
(2,161 real changes made)
(29,290 missing values generated)
(1,731 real changes made)
(1,671 real changes made)
(3,402 real changes made)
(27,129 real changes made)
(25,888 missing values generated)
(3,402 real changes made)
(1,731 real changes made)
(2,685 real changes made, 2,685 to missing)
(25,865 missing values generated)
(29,290 missing values generated)
(1,738 real changes made)
(1,687 real changes made)
(1,738 real changes made)
(1,687 real changes made)
(2,197 real changes made)
(29,290 missing values generated)
(1,738 real changes made)
(1,687 real changes made)
(3,425 real changes made)
(27,093 real changes made)
(25,865 missing values generated)
(3,425 real changes made)
(1,738 real changes made)
(2,698 real changes made, 2,698 to missing)
(25,878 missing values generated)
(29,290 missing values generated)
(1,721 real changes made)
(1,691 real changes made)
(1,721 real changes made)
(1,691 real changes made)
(2,163 real changes made)
(29,290 missing values generated)
(1,721 real changes made)
(1,691 real changes made)
(3,412 real changes made)
(27,127 real changes made)
(25,878 missing values generated)
(3,412 real changes made)
(1,721 real changes made)
(2,679 real changes made, 2,679 to missing)
(25,859 missing values generated)
(29,290 missing values generated)
(1,749 real changes made)
(1,682 real changes made)
(1,749 real changes made)
(1,682 real changes made)
(2,161 real changes made)
(29,290 missing values generated)
(1,749 real changes made)
(1,682 real changes made)
(3,431 real changes made)
(27,129 real changes made)
(25,859 missing values generated)
(3,431 real changes made)
(1,749 real changes made)
(2,675 real changes made, 2,675 to missing)
(25,855 missing values generated)
(29,290 missing values generated)
(1,722 real changes made)
(1,713 real changes made)
(1,722 real changes made)
(1,713 real changes made)
(2,179 real changes made)
(29,290 missing values generated)
(1,722 real changes made)
(1,713 real changes made)
(3,435 real changes made)
(27,111 real changes made)
(25,855 missing values generated)
(3,435 real changes made)
(1,722 real changes made)
(2,752 real changes made, 2,752 to missing)
(25,932 missing values generated)
(29,290 missing values generated)
(1,719 real changes made)
(1,639 real changes made)
(1,719 real changes made)
(1,639 real changes made)
(2,164 real changes made)
(29,290 missing values generated)
(1,719 real changes made)
(1,639 real changes made)
(3,358 real changes made)
(27,126 real changes made)
(25,932 missing values generated)
(3,358 real changes made)
(1,719 real changes made)
(2,721 real changes made, 2,721 to missing)
(25,901 missing values generated)
(29,290 missing values generated)
(1,726 real changes made)
(1,663 real changes made)
(1,726 real changes made)
(1,663 real changes made)
(2,177 real changes made)
(29,290 missing values generated)
(1,726 real changes made)
(1,663 real changes made)
(3,389 real changes made)
(27,113 real changes made)
(25,901 missing values generated)
(3,389 real changes made)
(1,726 real changes made)

. 
. replace index_date = index_date_28
(29,290 real changes made)

. drop index_date_28

. gen egfr15_date=.
(29,290 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatinine_`x'<15 & date("01`x'", "DMY")>=index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen esrd_date = egfr15_date
(29,289 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if esrd_date==.
(3,160 real changes made)

. gen esrd_time = (esrd_date - index_date)
(26,129 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(26,129 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(3155 changes made to esrd_time_cat)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"                      ///
>                                                         3 "1 to 28 days"        ///
>                                                         4 "20 to 90 days"       ///
>                                                         5 "91 to 180 days"      ///
>                                                         6 "181 to 365 days"     ///
>                                                         7 "366 to 730 days"     ///
>                                                         8 "731 to 973 days"     ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach `exposure' of varlist   case                    ///
>                                                                 covid_severity  ///
>                                                                 covid_aki               {
  2.                                                                 by `exposure',sort: sum esrd_time, de
  3.                                                                 tab esrd_time_cat `exposure', m col chi
  4.                                                                 }
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\LSH170~1\AppData\Local\Temp\STDadc_000000.tmp"

. by case,sort: sum esrd_time, de

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Comparator (historical)

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            2              0
10%           37              0       Obs               2,515
25%          140              0       Sum of wgt.       2,515

50%          321                      Mean           348.1714
                        Largest       Std. dev.      244.4269
75%          544            919
90%          702            919       Variance       59744.49
95%          782            935       Skewness       .3617585
99%          877            940       Kurtosis        2.08713

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           12              0
10%           55              0       Obs                 646
25%          152              0       Sum of wgt.         646

50%        321.5                      Mean           353.3715
                        Largest       Std. dev.      239.8141
75%          532            908
90%          695            914       Variance       57510.79
95%          790            925       Skewness       .3838912
99%          873            926       Kurtosis       2.134809


. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STDadc_000000.tmp"

. tab esrd_time_cat case, m col chi

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Comparato   COVID-19 |     Total
----------------+----------------------+----------
         0 days |       123         21 |       144 
                |      0.53       0.34 |      0.49 
----------------+----------------------+----------
   1 to 28 days |       102         21 |       123 
                |      0.44       0.34 |      0.42 
----------------+----------------------+----------
  20 to 90 days |       236         57 |       293 
                |      1.02       0.93 |      1.00 
----------------+----------------------+----------
 91 to 180 days |       316         89 |       405 
                |      1.36       1.46 |      1.38 
----------------+----------------------+----------
181 to 365 days |       631        170 |       801 
                |      2.72       2.78 |      2.73 
----------------+----------------------+----------
366 to 730 days |       907        239 |     1,146 
                |      3.91       3.91 |      3.91 
----------------+----------------------+----------
731 to 973 days |       200         49 |       249 
                |      0.86       0.80 |      0.85 
----------------+----------------------+----------
              . |    20,665      5,464 |    26,129 
                |     89.15      89.43 |     89.21 
----------------+----------------------+----------
          Total |    23,180      6,110 |    29,290 
                |    100.00     100.00 |    100.00 

          Pearson chi2(7) =   5.4777   Pr = 0.602

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STDadc_000000.tmp"

. foreach `exposure' of varlist   case                    ///
>                                                                 covid_severity  ///
>                                                                 covid_aki               {
  2.                                                                 by `exposure',sort: sum esrd_time, de
  3.                                                                 }
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\LSH170~1\AppData\Local\Temp\STDadc_000000.tmp"

. foreach `exposure' of varlist   case                    ///
>                                                                 covid_severity  ///
>                                                                 covid_aki               {
  2.                                                                 tab esrd_time_cat `exposure', m col chi
  3.                                                                 }
invalid syntax
r(198);

end of do-file

r(198);

. do "C:\Users\LSH170~1\AppData\Local\Temp\STDadc_000000.tmp"

. foreach exposure of varlist     case                    ///
>                                                                 covid_severity  ///
>                                                                 covid_aki               {
  2.                                                                 by `exposure',sort: sum esrd_time, de
  3.                                                                 tab esrd_time_cat `exposure', m col chi
  4.                                                                 }

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Comparator (historical)

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            2              0
10%           37              0       Obs               2,515
25%          140              0       Sum of wgt.       2,515

50%          321                      Mean           348.1714
                        Largest       Std. dev.      244.4269
75%          544            919
90%          702            919       Variance       59744.49
95%          782            935       Skewness       .3617585
99%          877            940       Kurtosis        2.08713

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           12              0
10%           55              0       Obs                 646
25%          152              0       Sum of wgt.         646

50%        321.5                      Mean           353.3715
                        Largest       Std. dev.      239.8141
75%          532            908
90%          695            914       Variance       57510.79
95%          790            925       Skewness       .3838912
99%          873            926       Kurtosis       2.134809


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Comparato   COVID-19 |     Total
----------------+----------------------+----------
         0 days |       123         21 |       144 
                |      0.53       0.34 |      0.49 
----------------+----------------------+----------
   1 to 28 days |       102         21 |       123 
                |      0.44       0.34 |      0.42 
----------------+----------------------+----------
  20 to 90 days |       236         57 |       293 
                |      1.02       0.93 |      1.00 
----------------+----------------------+----------
 91 to 180 days |       316         89 |       405 
                |      1.36       1.46 |      1.38 
----------------+----------------------+----------
181 to 365 days |       631        170 |       801 
                |      2.72       2.78 |      2.73 
----------------+----------------------+----------
366 to 730 days |       907        239 |     1,146 
                |      3.91       3.91 |      3.91 
----------------+----------------------+----------
731 to 973 days |       200         49 |       249 
                |      0.86       0.80 |      0.85 
----------------+----------------------+----------
              . |    20,665      5,464 |    26,129 
                |     89.15      89.43 |     89.21 
----------------+----------------------+----------
          Total |    23,180      6,110 |    29,290 
                |    100.00     100.00 |    100.00 

          Pearson chi2(7) =   5.4777   Pr = 0.602

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            2              0
10%           37              0       Obs               2,515
25%          140              0       Sum of wgt.       2,515

50%          321                      Mean           348.1714
                        Largest       Std. dev.      244.4269
75%          544            919
90%          702            919       Variance       59744.49
95%          782            935       Skewness       .3617585
99%          877            940       Kurtosis        2.08713

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Non-hospitalised SARS-CoV-2

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           10              0
10%           59              0       Obs                 521
25%          152              0       Sum of wgt.         521

50%          339                      Mean           361.1785
                        Largest       Std. dev.      242.3377
75%          543            908
90%          700            914       Variance       58727.57
95%          795            925       Skewness        .334893
99%          876            926       Kurtosis       2.079453

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Hospitalised COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           12              0
10%           40             12       Obs                  55
25%          132             25       Sum of wgt.          55

50%          262                      Mean           296.7636
                        Largest       Std. dev.      217.6278
75%          450            707
90%          662            767       Variance       47361.85
95%          767            778       Skewness       .6926376
99%          833            833       Kurtosis       2.765559

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Critical care COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           29              0
10%           64             16       Obs                  70
25%          139             29       Sum of wgt.          70

50%        299.5                      Mean           339.7429
                        Largest       Std. dev.      233.9821
75%          524            813
90%        666.5            834       Variance       54747.61
95%          813            844       Skewness       .4988802
99%          873            873       Kurtosis        2.27611


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |             SARS-CoV-2 severity
  esrd_time_cat | Historica  Non-hospi  Hospitali  Critical  |     Total
----------------+--------------------------------------------+----------
         0 days |       123         17          2          2 |       144 
                |      0.53       0.34       0.39       0.33 |      0.49 
----------------+--------------------------------------------+----------
   1 to 28 days |       102         17          3          1 |       123 
                |      0.44       0.34       0.58       0.16 |      0.42 
----------------+--------------------------------------------+----------
  20 to 90 days |       236         45          6          6 |       293 
                |      1.02       0.90       1.17       0.98 |      1.00 
----------------+--------------------------------------------+----------
 91 to 180 days |       316         70          7         12 |       405 
                |      1.36       1.40       1.36       1.96 |      1.38 
----------------+--------------------------------------------+----------
181 to 365 days |       631        131         20         19 |       801 
                |      2.72       2.63       3.90       3.11 |      2.73 
----------------+--------------------------------------------+----------
366 to 730 days |       907        199         14         26 |     1,146 
                |      3.91       3.99       2.73       4.26 |      3.91 
----------------+--------------------------------------------+----------
731 to 973 days |       200         42          3          4 |       249 
                |      0.86       0.84       0.58       0.65 |      0.85 
----------------+--------------------------------------------+----------
              . |    20,665      4,465        458        541 |    26,129 
                |     89.15      89.55      89.28      88.54 |     89.21 
----------------+--------------------------------------------+----------
          Total |    23,180      4,986        513        611 |    29,290 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(21) =  14.0168   Pr = 0.869

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            2              0
10%           37              0       Obs               2,515
25%          140              0       Sum of wgt.       2,515

50%          321                      Mean           348.1714
                        Largest       Std. dev.      244.4269
75%          544            919
90%          702            919       Variance       59744.49
95%          782            935       Skewness       .3617585
99%          877            940       Kurtosis        2.08713

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Non-hospitalised SARS-CoV-2

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           16              0
10%           60              0       Obs                 550
25%          157              0       Sum of wgt.         550

50%        327.5                      Mean           361.1127
                        Largest       Std. dev.      243.5717
75%          544            908
90%        706.5            914       Variance       59327.17
95%          808            925       Skewness       .3638932
99%          876            926       Kurtosis        2.08222

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = No AKI hospitalised COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         18.5              0
10%           43             12       Obs                  60
25%        149.5             25       Sum of wgt.          60

50%        267.5                      Mean              306.6
                        Largest       Std. dev.      213.8733
75%          450            707
90%        604.5            767       Variance        45741.8
95%          737            778       Skewness       .5416818
99%          833            833       Kurtosis       2.572167

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = AKI hospitalised COVID-19

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%           29              3       Obs                  36
25%          112             29       Sum of wgt.          36

50%          323                      Mean           313.0556
                        Largest       Std. dev.      213.9658
75%          485            604
90%          604            662       Variance       45781.37
95%          684            684       Skewness       .1254109
99%          690            690       Kurtosis       1.838966


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |        COVID-19 acute kidney injury
  esrd_time_cat | Historica  Non-hospi  No AKI ho  AKI hospi |     Total
----------------+--------------------------------------------+----------
         0 days |       123         17          2          2 |       144 
                |      0.53       0.32       0.36       0.66 |      0.49 
----------------+--------------------------------------------+----------
   1 to 28 days |       102         17          3          1 |       123 
                |      0.44       0.32       0.53       0.33 |      0.42 
----------------+--------------------------------------------+----------
  20 to 90 days |       236         48          6          3 |       293 
                |      1.02       0.92       1.07       0.98 |      1.00 
----------------+--------------------------------------------+----------
 91 to 180 days |       316         75          8          6 |       405 
                |      1.36       1.43       1.42       1.97 |      1.38 
----------------+--------------------------------------------+----------
181 to 365 days |       631        142         19          9 |       801 
                |      2.72       2.71       3.37       2.95 |      2.73 
----------------+--------------------------------------------+----------
366 to 730 days |       907        205         19         15 |     1,146 
                |      3.91       3.91       3.37       4.92 |      3.91 
----------------+--------------------------------------------+----------
731 to 973 days |       200         46          3          0 |       249 
                |      0.86       0.88       0.53       0.00 |      0.85 
----------------+--------------------------------------------+----------
              . |    20,665      4,692        503        269 |    26,129 
                |     89.15      89.51      89.34      88.20 |     89.21 
----------------+--------------------------------------------+----------
          Total |    23,180      5,242        563        305 |    29,290 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(21) =  12.6372   Pr = 0.921

. 
end of do-file

