------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_2017.log
  log type:  text
 opened on:   1 Sep 2023, 17:30:08

. 
. ** Analysis cohort selection
. capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-9)
(55 vars, 50,000 obs)

. di "Potential COVID-19 cases extracted from OpenSAFELY:"
Potential COVID-19 cases extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/input_2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(16 vars, 50,000 obs)

. di "Potential historical comparators extracted from OpenSAFELY:"
Potential historical comparators extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/covid_matching_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 14,597 obs)

. di "Potential COVID-19 cases after application of exclusion criteria:"
Potential COVID-19 cases after application of exclusion criteria:

. safecount
  14,597

. capture noisily import delimited ./output/2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(7 vars, 28,792 obs)

. di "Potential historical comparators after application of exclusion criteria:"
Potential historical comparators after application of exclusion criteria:

. safecount
  28,792

. * Import COVID-19 dataset comprising individuals matched with historical comparators (limited matching variables only)  
. capture noisily import delimited ./output/input_combined_stps_covid_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(13 vars, 12,972 obs)

. * Drop age & covid_diagnosis_date
. keep patient_id death_date date_deregistered stp krt_outcome_date male covid_date covid_month set_id case match_counts

. tempfile covid_2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `covid_2017_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_b40_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_b40_000001.tmp saved as .dta format

. * Number of matched COVID-19 cases
. count
  12,972

. * Import matched historical comparators (limited matching variables only)
. capture noisily import delimited ./output/input_combined_stps_matches_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 21,534 obs)

. * Drop age
. keep patient_id death_date date_deregistered stp krt_outcome_date male set_id case covid_date

. tempfile 2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `2017_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_b40_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_b40_000002.tmp saved as .dta format

. * Number of matched historical comparators
. count
  21,534

. * Merge limited COVID-19 dataset with additional variables
. capture noisily import delimited ./output/input_covid_2017_additional.csv, clear
(encoding automatically selected: ISO-8859-9)
(113 vars, 12,972 obs)

. merge 1:1 patient_id using `covid_2017_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            12,972  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile covid_2017_complete

. save `covid_2017_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_b40_000003.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_b40_000003.tmp saved as .dta format

. di "Matched COVID-19 cases:"
Matched COVID-19 cases:

. safecount
  12,972

. * Merge limited historical comparator dataset with additional variables
. capture noisily import delimited ./output/input_2017_additional.csv, clear
(encoding automatically selected: ISO-8859-9)
(102 vars, 21,534 obs)

. merge 1:1 patient_id using `2017_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            21,534  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile 2017_complete

. save `2017_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_b40_000004.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_b40_000004.tmp saved as .dta format

. di "Matched historical comparators:"
Matched historical comparators:

. safecount
  21,534

. * Append matched COVID-19 cases and historical comparators
. append using `covid_2017_complete', force

. order patient_id set_id match_count case

. gsort set_id -case

. count if case==0
  21,534

. di "Matched COVID-19 cases and historical comparators:"
Matched COVID-19 cases and historical comparators:

. safecount
  34,506

. tab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,534       62.41       62.41
          1 |     12,972       37.59      100.00
------------+-----------------------------------
      Total |     34,506      100.00

. * Save list of matched COVID-19 cases
. preserve

.         keep if case==1
(21,534 observations deleted)

.         keep patient_id

.         tempfile covid_2017_matched_list

.         save `covid_2017_matched_list', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_b40_000006.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_b40_000006.tmp saved as .dta format

. restore

. * Generate list of unmatched COVID-19 cases
. preserve

.         capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-9)
(55 vars, 50,000 obs)

.         * For dummy data, should do nothing in the real data
.         duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

.         tempfile covid_prematching

.         save `covid_prematching', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_b40_000008.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_b40_000008.tmp saved as .dta format

.         use `covid_2017_matched_list', clear

.         merge 1:1 patient_id using `covid_prematching'

    Result                      Number of obs
    -----------------------------------------
    Not matched                        37,028
        from master                         0  (_merge==1)
        from using                     37,028  (_merge==2)

    Matched                            12,972  (_merge==3)
    -----------------------------------------

.         keep if _merge==2
(12,972 observations deleted)

.         safecount
  37,028

.         save output/covid_unmatched_2017.dta, replace
file output/covid_unmatched_2017.dta saved

.         di "Unmatched COVID-19 cases:"
Unmatched COVID-19 cases:

.         safecount
  37,028

. restore

. 
. **ID
. * Need to create unique identifiers as individuals may be in both covid_2017_matched and 2017_matched so will have the same patient_id
. gen unique = _n

. label var unique "Unique ID"

. 
. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label var imd "Index of multiple deprivation (IMD)"

. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      1,722        4.99        4.99
 1 Most deprived |      6,578       19.06       24.05
               2 |      6,600       19.13       43.18
               3 |      6,654       19.28       62.46
               4 |      6,600       19.13       81.59
5 Least deprived |      6,352       18.41      100.00
-----------------+-----------------------------------
           Total |     34,506      100.00

. drop if imd==0
(1,722 observations deleted)

. safetab imd

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |      6,578       20.06       20.06
               2 |      6,600       20.13       40.20
               3 |      6,654       20.30       60.49
               4 |      6,600       20.13       80.62
5 Least deprived |      6,352       19.38      100.00
-----------------+-----------------------------------
           Total |     32,784      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(32,753 missing values generated)

. replace stp1 = sum(stp1)
(32,783 real changes made)

. drop stp

. rename stp1 stp

. label define stp        1 "1"   ///
>                                         2 "2"   ///
>                                         3 "3"   ///
>                                         4 "4"   ///
>                                         5 "5"   ///
>                                         6 "6"   ///
>                                         7 "7"   ///
>                                         8 "8"   ///
>                                         9 "9"   ///
>                                         10 "10" ///
>                                         11 "11" ///                                     
>                                         12 "12" ///
>                                         13 "13" ///
>                                         14 "14" ///
>                                         15 "15" ///
>                                         16 "16" ///
>                                         17 "17" ///
>                                         18 "18" ///
>                                         19 "19" ///
>                                         20 "20" ///
>                                         21 "21" ///                                     
>                                         22 "22" ///
>                                         23 "23" ///
>                                         24 "24" ///
>                                         25 "25" ///
>                                         26 "26" ///
>                                         27 "27" ///
>                                         28 "28" ///
>                                         29 "29" ///
>                                         30 "30" ///
>                                         31 "31" 

. label values stp stp

. label var stp "STP"

. safetab stp

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,166        3.56        3.56
          2 |      1,059        3.23        6.79
          3 |      1,052        3.21       10.00
          4 |      1,061        3.24       13.23
          5 |      1,079        3.29       16.52
          6 |      1,051        3.21       19.73
          7 |      1,047        3.19       22.92
          8 |      1,035        3.16       26.08
          9 |      1,022        3.12       29.20
         10 |      1,035        3.16       32.35
         11 |      1,093        3.33       35.69
         12 |      1,032        3.15       38.84
         13 |      1,060        3.23       42.07
         14 |      1,047        3.19       45.26
         15 |      1,042        3.18       48.44
         16 |      1,040        3.17       51.61
         17 |      1,069        3.26       54.87
         18 |      1,071        3.27       58.14
         19 |      1,081        3.30       61.44
         20 |      1,098        3.35       64.79
         21 |      1,015        3.10       67.88
         22 |      1,028        3.14       71.02
         23 |      1,065        3.25       74.27
         24 |      1,100        3.36       77.62
         25 |      1,050        3.20       80.83
         26 |      1,029        3.14       83.96
         27 |      1,060        3.23       87.20
         28 |      1,042        3.18       90.38
         29 |      1,056        3.22       93.60
         30 |      1,057        3.22       96.82
         31 |      1,042        3.18      100.00
------------+-----------------------------------
      Total |     32,784      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(29,497 missing values generated)

. replace region = 2 if region_string=="East"
(3,308 real changes made)

. replace region = 3 if region_string=="London"
(6,520 real changes made)

. replace region = 4 if region_string=="North East"
(3,350 real changes made)

. replace region = 5 if region_string=="North West"
(3,251 real changes made)

. replace region = 6 if region_string=="South East"
(3,278 real changes made)

. replace region = 7 if region_string=="South West"
(3,286 real changes made)

. replace region = 8 if region_string=="West Midlands"
(3,361 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(3,143 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,287       10.03       10.03
                    East |      3,308       10.09       20.12
                  London |      6,520       19.89       40.00
              North East |      3,350       10.22       50.22
              North West |      3,251        9.92       60.14
              South East |      3,278       10.00       70.14
              South West |      3,286       10.02       80.16
           West Midlands |      3,361       10.25       90.41
Yorkshire and The Humber |      3,143        9.59      100.00
-------------------------+-----------------------------------
                   Total |     32,784      100.00

. drop if region==10
(0 observations deleted)

. safetab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      3,287       10.03       10.03
                    East |      3,308       10.09       20.12
                  London |      6,520       19.89       40.00
              North East |      3,350       10.22       50.22
              North West |      3,251        9.92       60.14
              South East |      3,278       10.00       70.14
              South West |      3,286       10.02       80.16
           West Midlands |      3,361       10.25       90.41
Yorkshire and The Humber |      3,143        9.59      100.00
-------------------------+-----------------------------------
                   Total |     32,784      100.00

. 
. * Create new index date variable 28 days after case_index_date (i.e. to exclude anyone who does not survive to start follow-up)
. gen index_date = date(case_index_date, "YMD")

. format index_date %td

. gen index_date_28 = index_date + 28

. format index_date_28 %td

. 
. * Deregistered before index_date + 29 days
. gen deregistered_date = date(date_deregistered, "YMD")
(31,808 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date_28 + 1
(47 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(29,760 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(0 observations deleted)

. replace krt_date = index_date_28 + 1 if krt_date < index_date_28 + 1
(137 real changes made)

. 
. * Death before index_date + 29 days (i.e. only include people who survived 29 days after index_date)
. gen death_date1 = date(death_date, "YMD")
(30,903 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28 + 1
(79 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased within 28 days of index date"

. label values deceased deceased

. tab case deceased

           |       deceased
      case | Alive at   Deceased  |     Total
-----------+----------------------+----------
         0 |    20,384         55 |    20,439 
         1 |    12,274         24 |    12,298 
-----------+----------------------+----------
     Total |    32,658         79 |    32,737 

. drop if deceased==1
(79 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched historical comparators only
. gen index_year = yofd(index_date)

. gen age = index_year - year_of_birth

. gen sex = 1 if male == "Male"
(16,815 missing values generated)

. label var sex "Sex"

. replace sex = 0 if male == "Female"
(16,815 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2017 ///
>                                                                                                 baseline_creatinine_mar2017 ///
>                                                                                                 baseline_creatinine_apr2017 ///
>                                                                                                 baseline_creatinine_may2017 ///
>                                                                                                 baseline_creatinine_jun2017 ///
>                                                                                                 baseline_creatinine_jul2017 ///
>                                                                                                 baseline_creatinine_aug2017 ///
>                                                                                                 baseline_creatinine_sep2017 ///
>                                                                                                 baseline_creatinine_oct2017 ///
>                                                                                                 baseline_creatinine_nov2017 ///
>                                                                                                 baseline_creatinine_dec2017 ///
>                                                                                                 baseline_creatinine_jan2018 ///
>                                                                                                 baseline_creatinine_feb2018 ///
>                                                                                                 baseline_creatinine_mar2018 ///
>                                                                                                 baseline_creatinine_apr2018 ///
>                                                                                                 baseline_creatinine_may2018 ///
>                                                                                                 baseline_creatinine_jun2018 ///
>                                                                                                 baseline_creatinine_jul2018 ///
>                                                                                                 baseline_creatinine_aug2018 ///
>                                                                                                 baseline_creatinine_sep2018 ///
>                                                                                                 baseline_creatinine_oct2018 ///
>                                                                                                 baseline_creatinine_nov2018 ///
>                                                                                                 baseline_creatinine_dec2018 ///
>                                                                                                 baseline_creatinine_jan2019 ///
>                                                                                                 baseline_creatinine_feb2019 ///
>                                                                                                 baseline_creatinine_mar2019 ///
>                                                                                                 baseline_creatinine_apr2019 ///
>                                                                                                 baseline_creatinine_may2019 ///
>                                                                                                 baseline_creatinine_jun2019 ///
>                                                                                                 baseline_creatinine_jul2019 ///
>                                                                                                 baseline_creatinine_aug2019 ///
>                                                                                                 baseline_creatinine_sep2019 ///
>                                                                                                 baseline_creatinine_feb2020 ///
>                                                                                                 baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 ///
>                                                                                                 baseline_creatinine_feb2022 ///
>                                                                                                 baseline_creatinine_mar2022 ///
>                                                                                                 baseline_creatinine_apr2022 ///
>                                                                                                 baseline_creatinine_may2022 ///
>                                                                                                 baseline_creatinine_jun2022 ///
>                                                                                                 baseline_creatinine_jul2022 ///
>                                                                                                 baseline_creatinine_aug2022 ///
>                                                                                                 baseline_creatinine_sep2022 ///
>                                                                                                 baseline_creatinine_oct2022 ///
>                                                                                                 baseline_creatinine_nov2022 ///
>                                                                                                 baseline_creatinine_dec2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(8,990 real changes made, 8,990 to missing)
(21,264 missing values generated)
(32,658 missing values generated)
(5,867 real changes made)
(5,527 real changes made)
(5,867 real changes made)
(5,527 real changes made)
(7,200 real changes made)
(32,658 missing values generated)
(5,867 real changes made)
(5,527 real changes made)
(11,394 real changes made)
(25,458 real changes made)
(21,264 missing values generated)
(11,394 real changes made)
(5,867 real changes made)
(8,937 real changes made, 8,937 to missing)
(21,211 missing values generated)
(32,658 missing values generated)
(5,894 real changes made)
(5,553 real changes made)
(5,894 real changes made)
(5,553 real changes made)
(7,302 real changes made)
(32,658 missing values generated)
(5,894 real changes made)
(5,553 real changes made)
(11,447 real changes made)
(25,356 real changes made)
(21,211 missing values generated)
(11,447 real changes made)
(5,894 real changes made)
(8,983 real changes made, 8,983 to missing)
(21,257 missing values generated)
(32,658 missing values generated)
(5,949 real changes made)
(5,452 real changes made)
(5,949 real changes made)
(5,452 real changes made)
(7,221 real changes made)
(32,658 missing values generated)
(5,949 real changes made)
(5,452 real changes made)
(11,401 real changes made)
(25,437 real changes made)
(21,257 missing values generated)
(11,401 real changes made)
(5,949 real changes made)
(8,953 real changes made, 8,953 to missing)
(21,227 missing values generated)
(32,658 missing values generated)
(5,963 real changes made)
(5,468 real changes made)
(5,963 real changes made)
(5,468 real changes made)
(7,224 real changes made)
(32,658 missing values generated)
(5,963 real changes made)
(5,468 real changes made)
(11,431 real changes made)
(25,434 real changes made)
(21,227 missing values generated)
(11,431 real changes made)
(5,963 real changes made)
(8,988 real changes made, 8,988 to missing)
(21,262 missing values generated)
(32,658 missing values generated)
(5,923 real changes made)
(5,473 real changes made)
(5,923 real changes made)
(5,473 real changes made)
(7,127 real changes made)
(32,658 missing values generated)
(5,923 real changes made)
(5,473 real changes made)
(11,396 real changes made)
(25,531 real changes made)
(21,262 missing values generated)
(11,396 real changes made)
(5,923 real changes made)
(9,023 real changes made, 9,023 to missing)
(21,297 missing values generated)
(32,658 missing values generated)
(5,837 real changes made)
(5,524 real changes made)
(5,837 real changes made)
(5,524 real changes made)
(7,177 real changes made)
(32,658 missing values generated)
(5,837 real changes made)
(5,524 real changes made)
(11,361 real changes made)
(25,481 real changes made)
(21,297 missing values generated)
(11,361 real changes made)
(5,837 real changes made)
(8,953 real changes made, 8,953 to missing)
(21,227 missing values generated)
(32,658 missing values generated)
(5,873 real changes made)
(5,558 real changes made)
(5,873 real changes made)
(5,558 real changes made)
(7,217 real changes made)
(32,658 missing values generated)
(5,873 real changes made)
(5,558 real changes made)
(11,431 real changes made)
(25,441 real changes made)
(21,227 missing values generated)
(11,431 real changes made)
(5,873 real changes made)
(8,970 real changes made, 8,970 to missing)
(21,244 missing values generated)
(32,658 missing values generated)
(5,843 real changes made)
(5,571 real changes made)
(5,843 real changes made)
(5,571 real changes made)
(7,354 real changes made)
(32,658 missing values generated)
(5,843 real changes made)
(5,571 real changes made)
(11,414 real changes made)
(25,304 real changes made)
(21,244 missing values generated)
(11,414 real changes made)
(5,843 real changes made)
(8,949 real changes made, 8,949 to missing)
(21,223 missing values generated)
(32,658 missing values generated)
(5,935 real changes made)
(5,500 real changes made)
(5,935 real changes made)
(5,500 real changes made)
(7,298 real changes made)
(32,658 missing values generated)
(5,935 real changes made)
(5,500 real changes made)
(11,435 real changes made)
(25,360 real changes made)
(21,223 missing values generated)
(11,435 real changes made)
(5,935 real changes made)
(8,950 real changes made, 8,950 to missing)
(21,224 missing values generated)
(32,658 missing values generated)
(5,920 real changes made)
(5,514 real changes made)
(5,920 real changes made)
(5,514 real changes made)
(7,243 real changes made)
(32,658 missing values generated)
(5,920 real changes made)
(5,514 real changes made)
(11,434 real changes made)
(25,415 real changes made)
(21,224 missing values generated)
(11,434 real changes made)
(5,920 real changes made)
(8,952 real changes made, 8,952 to missing)
(21,226 missing values generated)
(32,658 missing values generated)
(5,804 real changes made)
(5,628 real changes made)
(5,804 real changes made)
(5,628 real changes made)
(7,237 real changes made)
(32,658 missing values generated)
(5,804 real changes made)
(5,628 real changes made)
(11,432 real changes made)
(25,421 real changes made)
(21,226 missing values generated)
(11,432 real changes made)
(5,804 real changes made)
(8,961 real changes made, 8,961 to missing)
(21,235 missing values generated)
(32,658 missing values generated)
(5,923 real changes made)
(5,500 real changes made)
(5,923 real changes made)
(5,500 real changes made)
(7,303 real changes made)
(32,658 missing values generated)
(5,923 real changes made)
(5,500 real changes made)
(11,423 real changes made)
(25,355 real changes made)
(21,235 missing values generated)
(11,423 real changes made)
(5,923 real changes made)
(8,963 real changes made, 8,963 to missing)
(21,237 missing values generated)
(32,658 missing values generated)
(5,890 real changes made)
(5,531 real changes made)
(5,890 real changes made)
(5,531 real changes made)
(7,208 real changes made)
(32,658 missing values generated)
(5,890 real changes made)
(5,531 real changes made)
(11,421 real changes made)
(25,450 real changes made)
(21,237 missing values generated)
(11,421 real changes made)
(5,890 real changes made)
(9,004 real changes made, 9,004 to missing)
(21,278 missing values generated)
(32,658 missing values generated)
(5,856 real changes made)
(5,524 real changes made)
(5,856 real changes made)
(5,524 real changes made)
(7,246 real changes made)
(32,658 missing values generated)
(5,856 real changes made)
(5,524 real changes made)
(11,380 real changes made)
(25,412 real changes made)
(21,278 missing values generated)
(11,380 real changes made)
(5,856 real changes made)
(8,906 real changes made, 8,906 to missing)
(21,180 missing values generated)
(32,658 missing values generated)
(5,949 real changes made)
(5,529 real changes made)
(5,949 real changes made)
(5,529 real changes made)
(7,283 real changes made)
(32,658 missing values generated)
(5,949 real changes made)
(5,529 real changes made)
(11,478 real changes made)
(25,375 real changes made)
(21,180 missing values generated)
(11,478 real changes made)
(5,949 real changes made)
(8,974 real changes made, 8,974 to missing)
(21,248 missing values generated)
(32,658 missing values generated)
(5,918 real changes made)
(5,492 real changes made)
(5,918 real changes made)
(5,492 real changes made)
(7,239 real changes made)
(32,658 missing values generated)
(5,918 real changes made)
(5,492 real changes made)
(11,410 real changes made)
(25,419 real changes made)
(21,248 missing values generated)
(11,410 real changes made)
(5,918 real changes made)
(8,992 real changes made, 8,992 to missing)
(21,266 missing values generated)
(32,658 missing values generated)
(5,869 real changes made)
(5,523 real changes made)
(5,869 real changes made)
(5,523 real changes made)
(7,179 real changes made)
(32,658 missing values generated)
(5,869 real changes made)
(5,523 real changes made)
(11,392 real changes made)
(25,479 real changes made)
(21,266 missing values generated)
(11,392 real changes made)
(5,869 real changes made)
(8,994 real changes made, 8,994 to missing)
(21,268 missing values generated)
(32,658 missing values generated)
(5,892 real changes made)
(5,498 real changes made)
(5,892 real changes made)
(5,498 real changes made)
(7,292 real changes made)
(32,658 missing values generated)
(5,892 real changes made)
(5,498 real changes made)
(11,390 real changes made)
(25,366 real changes made)
(21,268 missing values generated)
(11,390 real changes made)
(5,892 real changes made)
(8,995 real changes made, 8,995 to missing)
(21,269 missing values generated)
(32,658 missing values generated)
(5,870 real changes made)
(5,519 real changes made)
(5,870 real changes made)
(5,519 real changes made)
(7,263 real changes made)
(32,658 missing values generated)
(5,870 real changes made)
(5,519 real changes made)
(11,389 real changes made)
(25,395 real changes made)
(21,269 missing values generated)
(11,389 real changes made)
(5,870 real changes made)
(8,942 real changes made, 8,942 to missing)
(21,216 missing values generated)
(32,658 missing values generated)
(5,877 real changes made)
(5,565 real changes made)
(5,877 real changes made)
(5,565 real changes made)
(7,211 real changes made)
(32,658 missing values generated)
(5,877 real changes made)
(5,565 real changes made)
(11,442 real changes made)
(25,447 real changes made)
(21,216 missing values generated)
(11,442 real changes made)
(5,877 real changes made)
(8,924 real changes made, 8,924 to missing)
(21,198 missing values generated)
(32,658 missing values generated)
(5,884 real changes made)
(5,576 real changes made)
(5,884 real changes made)
(5,576 real changes made)
(7,295 real changes made)
(32,658 missing values generated)
(5,884 real changes made)
(5,576 real changes made)
(11,460 real changes made)
(25,363 real changes made)
(21,198 missing values generated)
(11,460 real changes made)
(5,884 real changes made)
(8,934 real changes made, 8,934 to missing)
(21,208 missing values generated)
(32,658 missing values generated)
(5,968 real changes made)
(5,482 real changes made)
(5,968 real changes made)
(5,482 real changes made)
(7,247 real changes made)
(32,658 missing values generated)
(5,968 real changes made)
(5,482 real changes made)
(11,450 real changes made)
(25,411 real changes made)
(21,208 missing values generated)
(11,450 real changes made)
(5,968 real changes made)
(8,969 real changes made, 8,969 to missing)
(21,243 missing values generated)
(32,658 missing values generated)
(5,894 real changes made)
(5,521 real changes made)
(5,894 real changes made)
(5,521 real changes made)
(7,269 real changes made)
(32,658 missing values generated)
(5,894 real changes made)
(5,521 real changes made)
(11,415 real changes made)
(25,389 real changes made)
(21,243 missing values generated)
(11,415 real changes made)
(5,894 real changes made)
(8,956 real changes made, 8,956 to missing)
(21,230 missing values generated)
(32,658 missing values generated)
(5,872 real changes made)
(5,556 real changes made)
(5,872 real changes made)
(5,556 real changes made)
(7,184 real changes made)
(32,658 missing values generated)
(5,872 real changes made)
(5,556 real changes made)
(11,428 real changes made)
(25,474 real changes made)
(21,230 missing values generated)
(11,428 real changes made)
(5,872 real changes made)
(8,971 real changes made, 8,971 to missing)
(21,245 missing values generated)
(32,658 missing values generated)
(5,874 real changes made)
(5,539 real changes made)
(5,874 real changes made)
(5,539 real changes made)
(7,241 real changes made)
(32,658 missing values generated)
(5,874 real changes made)
(5,539 real changes made)
(11,413 real changes made)
(25,417 real changes made)
(21,245 missing values generated)
(11,413 real changes made)
(5,874 real changes made)
(8,897 real changes made, 8,897 to missing)
(21,171 missing values generated)
(32,658 missing values generated)
(5,963 real changes made)
(5,524 real changes made)
(5,963 real changes made)
(5,524 real changes made)
(7,322 real changes made)
(32,658 missing values generated)
(5,963 real changes made)
(5,524 real changes made)
(11,487 real changes made)
(25,336 real changes made)
(21,171 missing values generated)
(11,487 real changes made)
(5,963 real changes made)
(8,979 real changes made, 8,979 to missing)
(21,253 missing values generated)
(32,658 missing values generated)
(5,908 real changes made)
(5,497 real changes made)
(5,908 real changes made)
(5,497 real changes made)
(7,215 real changes made)
(32,658 missing values generated)
(5,908 real changes made)
(5,497 real changes made)
(11,405 real changes made)
(25,443 real changes made)
(21,253 missing values generated)
(11,405 real changes made)
(5,908 real changes made)
(8,962 real changes made, 8,962 to missing)
(21,236 missing values generated)
(32,658 missing values generated)
(5,815 real changes made)
(5,607 real changes made)
(5,815 real changes made)
(5,607 real changes made)
(7,283 real changes made)
(32,658 missing values generated)
(5,815 real changes made)
(5,607 real changes made)
(11,422 real changes made)
(25,375 real changes made)
(21,236 missing values generated)
(11,422 real changes made)
(5,815 real changes made)
(8,931 real changes made, 8,931 to missing)
(21,205 missing values generated)
(32,658 missing values generated)
(5,935 real changes made)
(5,518 real changes made)
(5,935 real changes made)
(5,518 real changes made)
(7,319 real changes made)
(32,658 missing values generated)
(5,935 real changes made)
(5,518 real changes made)
(11,453 real changes made)
(25,339 real changes made)
(21,205 missing values generated)
(11,453 real changes made)
(5,935 real changes made)
(9,018 real changes made, 9,018 to missing)
(21,292 missing values generated)
(32,658 missing values generated)
(5,900 real changes made)
(5,466 real changes made)
(5,900 real changes made)
(5,466 real changes made)
(7,246 real changes made)
(32,658 missing values generated)
(5,900 real changes made)
(5,466 real changes made)
(11,366 real changes made)
(25,412 real changes made)
(21,292 missing values generated)
(11,366 real changes made)
(5,900 real changes made)
(8,995 real changes made, 8,995 to missing)
(21,269 missing values generated)
(32,658 missing values generated)
(5,856 real changes made)
(5,533 real changes made)
(5,856 real changes made)
(5,533 real changes made)
(7,247 real changes made)
(32,658 missing values generated)
(5,856 real changes made)
(5,533 real changes made)
(11,389 real changes made)
(25,411 real changes made)
(21,269 missing values generated)
(11,389 real changes made)
(5,856 real changes made)
(8,968 real changes made, 8,968 to missing)
(21,242 missing values generated)
(32,658 missing values generated)
(5,910 real changes made)
(5,506 real changes made)
(5,910 real changes made)
(5,506 real changes made)
(7,344 real changes made)
(32,658 missing values generated)
(5,910 real changes made)
(5,506 real changes made)
(11,416 real changes made)
(25,314 real changes made)
(21,242 missing values generated)
(11,416 real changes made)
(5,910 real changes made)
(5,411 real changes made, 5,411 to missing)
(25,795 missing values generated)
(32,658 missing values generated)
(3,537 real changes made)
(3,326 real changes made)
(3,537 real changes made)
(3,326 real changes made)
(4,385 real changes made)
(32,658 missing values generated)
(3,537 real changes made)
(3,326 real changes made)
(6,863 real changes made)
(28,273 real changes made)
(25,795 missing values generated)
(6,863 real changes made)
(3,537 real changes made)
(5,389 real changes made, 5,389 to missing)
(25,773 missing values generated)
(32,658 missing values generated)
(3,509 real changes made)
(3,376 real changes made)
(3,509 real changes made)
(3,376 real changes made)
(4,349 real changes made)
(32,658 missing values generated)
(3,509 real changes made)
(3,376 real changes made)
(6,885 real changes made)
(28,309 real changes made)
(25,773 missing values generated)
(6,885 real changes made)
(3,509 real changes made)
(5,372 real changes made, 5,372 to missing)
(25,756 missing values generated)
(32,658 missing values generated)
(3,574 real changes made)
(3,328 real changes made)
(3,574 real changes made)
(3,328 real changes made)
(4,320 real changes made)
(32,658 missing values generated)
(3,574 real changes made)
(3,328 real changes made)
(6,902 real changes made)
(28,338 real changes made)
(25,756 missing values generated)
(6,902 real changes made)
(3,574 real changes made)
(5,411 real changes made, 5,411 to missing)
(25,795 missing values generated)
(32,658 missing values generated)
(3,525 real changes made)
(3,338 real changes made)
(3,525 real changes made)
(3,338 real changes made)
(4,325 real changes made)
(32,658 missing values generated)
(3,525 real changes made)
(3,338 real changes made)
(6,863 real changes made)
(28,333 real changes made)
(25,795 missing values generated)
(6,863 real changes made)
(3,525 real changes made)
(5,393 real changes made, 5,393 to missing)
(25,777 missing values generated)
(32,658 missing values generated)
(3,544 real changes made)
(3,337 real changes made)
(3,544 real changes made)
(3,337 real changes made)
(4,338 real changes made)
(32,658 missing values generated)
(3,544 real changes made)
(3,337 real changes made)
(6,881 real changes made)
(28,320 real changes made)
(25,777 missing values generated)
(6,881 real changes made)
(3,544 real changes made)
(5,406 real changes made, 5,406 to missing)
(25,790 missing values generated)
(32,658 missing values generated)
(3,535 real changes made)
(3,333 real changes made)
(3,535 real changes made)
(3,333 real changes made)
(4,304 real changes made)
(32,658 missing values generated)
(3,535 real changes made)
(3,333 real changes made)
(6,868 real changes made)
(28,354 real changes made)
(25,790 missing values generated)
(6,868 real changes made)
(3,535 real changes made)
(5,412 real changes made, 5,412 to missing)
(25,796 missing values generated)
(32,658 missing values generated)
(3,487 real changes made)
(3,375 real changes made)
(3,487 real changes made)
(3,375 real changes made)
(4,348 real changes made)
(32,658 missing values generated)
(3,487 real changes made)
(3,375 real changes made)
(6,862 real changes made)
(28,310 real changes made)
(25,796 missing values generated)
(6,862 real changes made)
(3,487 real changes made)
(5,368 real changes made, 5,368 to missing)
(25,752 missing values generated)
(32,658 missing values generated)
(3,563 real changes made)
(3,343 real changes made)
(3,563 real changes made)
(3,343 real changes made)
(4,379 real changes made)
(32,658 missing values generated)
(3,563 real changes made)
(3,343 real changes made)
(6,906 real changes made)
(28,279 real changes made)
(25,752 missing values generated)
(6,906 real changes made)
(3,563 real changes made)
(5,435 real changes made, 5,435 to missing)
(25,819 missing values generated)
(32,658 missing values generated)
(3,493 real changes made)
(3,346 real changes made)
(3,493 real changes made)
(3,346 real changes made)
(4,367 real changes made)
(32,658 missing values generated)
(3,493 real changes made)
(3,346 real changes made)
(6,839 real changes made)
(28,291 real changes made)
(25,819 missing values generated)
(6,839 real changes made)
(3,493 real changes made)
(5,414 real changes made, 5,414 to missing)
(25,798 missing values generated)
(32,658 missing values generated)
(3,539 real changes made)
(3,321 real changes made)
(3,539 real changes made)
(3,321 real changes made)
(4,345 real changes made)
(32,658 missing values generated)
(3,539 real changes made)
(3,321 real changes made)
(6,860 real changes made)
(28,313 real changes made)
(25,798 missing values generated)
(6,860 real changes made)
(3,539 real changes made)
(5,340 real changes made, 5,340 to missing)
(25,724 missing values generated)
(32,658 missing values generated)
(3,588 real changes made)
(3,346 real changes made)
(3,588 real changes made)
(3,346 real changes made)
(4,446 real changes made)
(32,658 missing values generated)
(3,588 real changes made)
(3,346 real changes made)
(6,934 real changes made)
(28,212 real changes made)
(25,724 missing values generated)
(6,934 real changes made)
(3,588 real changes made)
(5,440 real changes made, 5,440 to missing)
(25,824 missing values generated)
(32,658 missing values generated)
(3,486 real changes made)
(3,348 real changes made)
(3,486 real changes made)
(3,348 real changes made)
(4,405 real changes made)
(32,658 missing values generated)
(3,486 real changes made)
(3,348 real changes made)
(6,834 real changes made)
(28,253 real changes made)
(25,824 missing values generated)
(6,834 real changes made)
(3,486 real changes made)
(5,382 real changes made, 5,382 to missing)
(25,766 missing values generated)
(32,658 missing values generated)
(3,533 real changes made)
(3,359 real changes made)
(3,533 real changes made)
(3,359 real changes made)
(4,362 real changes made)
(32,658 missing values generated)
(3,533 real changes made)
(3,359 real changes made)
(6,892 real changes made)
(28,296 real changes made)
(25,766 missing values generated)
(6,892 real changes made)
(3,533 real changes made)
(5,442 real changes made, 5,442 to missing)
(25,826 missing values generated)
(32,658 missing values generated)
(3,466 real changes made)
(3,366 real changes made)
(3,466 real changes made)
(3,366 real changes made)
(4,334 real changes made)
(32,658 missing values generated)
(3,466 real changes made)
(3,366 real changes made)
(6,832 real changes made)
(28,324 real changes made)
(25,826 missing values generated)
(6,832 real changes made)
(3,466 real changes made)
(5,354 real changes made, 5,354 to missing)
(25,738 missing values generated)
(32,658 missing values generated)
(3,485 real changes made)
(3,435 real changes made)
(3,485 real changes made)
(3,435 real changes made)
(4,375 real changes made)
(32,658 missing values generated)
(3,485 real changes made)
(3,435 real changes made)
(6,920 real changes made)
(28,283 real changes made)
(25,738 missing values generated)
(6,920 real changes made)
(3,485 real changes made)
(5,391 real changes made, 5,391 to missing)
(25,775 missing values generated)
(32,658 missing values generated)
(3,565 real changes made)
(3,318 real changes made)
(3,565 real changes made)
(3,318 real changes made)
(4,342 real changes made)
(32,658 missing values generated)
(3,565 real changes made)
(3,318 real changes made)
(6,883 real changes made)
(28,316 real changes made)
(25,775 missing values generated)
(6,883 real changes made)
(3,565 real changes made)
(5,373 real changes made, 5,373 to missing)
(25,757 missing values generated)
(32,658 missing values generated)
(3,562 real changes made)
(3,339 real changes made)
(3,562 real changes made)
(3,339 real changes made)
(4,340 real changes made)
(32,658 missing values generated)
(3,562 real changes made)
(3,339 real changes made)
(6,901 real changes made)
(28,318 real changes made)
(25,757 missing values generated)
(6,901 real changes made)
(3,562 real changes made)
(5,365 real changes made, 5,365 to missing)
(25,749 missing values generated)
(32,658 missing values generated)
(3,568 real changes made)
(3,341 real changes made)
(3,568 real changes made)
(3,341 real changes made)
(4,420 real changes made)
(32,658 missing values generated)
(3,568 real changes made)
(3,341 real changes made)
(6,909 real changes made)
(28,238 real changes made)
(25,749 missing values generated)
(6,909 real changes made)
(3,568 real changes made)
(5,386 real changes made, 5,386 to missing)
(25,770 missing values generated)
(32,658 missing values generated)
(3,556 real changes made)
(3,332 real changes made)
(3,556 real changes made)
(3,332 real changes made)
(4,390 real changes made)
(32,658 missing values generated)
(3,556 real changes made)
(3,332 real changes made)
(6,888 real changes made)
(28,268 real changes made)
(25,770 missing values generated)
(6,888 real changes made)
(3,556 real changes made)
(5,392 real changes made, 5,392 to missing)
(25,776 missing values generated)
(32,658 missing values generated)
(3,534 real changes made)
(3,348 real changes made)
(3,534 real changes made)
(3,348 real changes made)
(4,405 real changes made)
(32,658 missing values generated)
(3,534 real changes made)
(3,348 real changes made)
(6,882 real changes made)
(28,253 real changes made)
(25,776 missing values generated)
(6,882 real changes made)
(3,534 real changes made)
(5,391 real changes made, 5,391 to missing)
(25,775 missing values generated)
(32,658 missing values generated)
(3,495 real changes made)
(3,388 real changes made)
(3,495 real changes made)
(3,388 real changes made)
(4,266 real changes made)
(32,658 missing values generated)
(3,495 real changes made)
(3,388 real changes made)
(6,883 real changes made)
(28,392 real changes made)
(25,775 missing values generated)
(6,883 real changes made)
(3,495 real changes made)
(5,396 real changes made, 5,396 to missing)
(25,780 missing values generated)
(32,658 missing values generated)
(3,514 real changes made)
(3,364 real changes made)
(3,514 real changes made)
(3,364 real changes made)
(4,346 real changes made)
(32,658 missing values generated)
(3,514 real changes made)
(3,364 real changes made)
(6,878 real changes made)
(28,312 real changes made)
(25,780 missing values generated)
(6,878 real changes made)
(3,514 real changes made)
(5,423 real changes made, 5,423 to missing)
(25,807 missing values generated)
(32,658 missing values generated)
(3,547 real changes made)
(3,304 real changes made)
(3,547 real changes made)
(3,304 real changes made)
(4,381 real changes made)
(32,658 missing values generated)
(3,547 real changes made)
(3,304 real changes made)
(6,851 real changes made)
(28,277 real changes made)
(25,807 missing values generated)
(6,851 real changes made)
(3,547 real changes made)
(5,389 real changes made, 5,389 to missing)
(25,773 missing values generated)
(32,658 missing values generated)
(3,511 real changes made)
(3,374 real changes made)
(3,511 real changes made)
(3,374 real changes made)
(4,386 real changes made)
(32,658 missing values generated)
(3,511 real changes made)
(3,374 real changes made)
(6,885 real changes made)
(28,272 real changes made)
(25,773 missing values generated)
(6,885 real changes made)
(3,511 real changes made)
(5,377 real changes made, 5,377 to missing)
(25,761 missing values generated)
(32,658 missing values generated)
(3,517 real changes made)
(3,380 real changes made)
(3,517 real changes made)
(3,380 real changes made)
(4,392 real changes made)
(32,658 missing values generated)
(3,517 real changes made)
(3,380 real changes made)
(6,897 real changes made)
(28,266 real changes made)
(25,761 missing values generated)
(6,897 real changes made)
(3,517 real changes made)
(5,389 real changes made, 5,389 to missing)
(25,773 missing values generated)
(32,658 missing values generated)
(3,541 real changes made)
(3,344 real changes made)
(3,541 real changes made)
(3,344 real changes made)
(4,346 real changes made)
(32,658 missing values generated)
(3,541 real changes made)
(3,344 real changes made)
(6,885 real changes made)
(28,312 real changes made)
(25,773 missing values generated)
(6,885 real changes made)
(3,541 real changes made)
(5,379 real changes made, 5,379 to missing)
(25,763 missing values generated)
(32,658 missing values generated)
(3,561 real changes made)
(3,334 real changes made)
(3,561 real changes made)
(3,334 real changes made)
(4,365 real changes made)
(32,658 missing values generated)
(3,561 real changes made)
(3,334 real changes made)
(6,895 real changes made)
(28,293 real changes made)
(25,763 missing values generated)
(6,895 real changes made)
(3,561 real changes made)
(5,409 real changes made, 5,409 to missing)
(25,793 missing values generated)
(32,658 missing values generated)
(3,524 real changes made)
(3,341 real changes made)
(3,524 real changes made)
(3,341 real changes made)
(4,347 real changes made)
(32,658 missing values generated)
(3,524 real changes made)
(3,341 real changes made)
(6,865 real changes made)
(28,311 real changes made)
(25,793 missing values generated)
(6,865 real changes made)
(3,524 real changes made)
(5,396 real changes made, 5,396 to missing)
(25,780 missing values generated)
(32,658 missing values generated)
(3,529 real changes made)
(3,349 real changes made)
(3,529 real changes made)
(3,349 real changes made)
(4,346 real changes made)
(32,658 missing values generated)
(3,529 real changes made)
(3,349 real changes made)
(6,878 real changes made)
(28,312 real changes made)
(25,780 missing values generated)
(6,878 real changes made)
(3,529 real changes made)
(5,402 real changes made, 5,402 to missing)
(25,786 missing values generated)
(32,658 missing values generated)
(3,548 real changes made)
(3,324 real changes made)
(3,548 real changes made)
(3,324 real changes made)
(4,371 real changes made)
(32,658 missing values generated)
(3,548 real changes made)
(3,324 real changes made)
(6,872 real changes made)
(28,287 real changes made)
(25,786 missing values generated)
(6,872 real changes made)
(3,548 real changes made)
(5,411 real changes made, 5,411 to missing)
(25,795 missing values generated)
(32,658 missing values generated)
(3,514 real changes made)
(3,349 real changes made)
(3,514 real changes made)
(3,349 real changes made)
(4,398 real changes made)
(32,658 missing values generated)
(3,514 real changes made)
(3,349 real changes made)
(6,863 real changes made)
(28,260 real changes made)
(25,795 missing values generated)
(6,863 real changes made)
(3,514 real changes made)
(5,362 real changes made, 5,362 to missing)
(25,746 missing values generated)
(32,658 missing values generated)
(3,557 real changes made)
(3,355 real changes made)
(3,557 real changes made)
(3,355 real changes made)
(4,437 real changes made)
(32,658 missing values generated)
(3,557 real changes made)
(3,355 real changes made)
(6,912 real changes made)
(28,221 real changes made)
(25,746 missing values generated)
(6,912 real changes made)
(3,557 real changes made)
(5,434 real changes made, 5,434 to missing)
(25,818 missing values generated)
(32,658 missing values generated)
(3,474 real changes made)
(3,366 real changes made)
(3,474 real changes made)
(3,366 real changes made)
(4,354 real changes made)
(32,658 missing values generated)
(3,474 real changes made)
(3,366 real changes made)
(6,840 real changes made)
(28,304 real changes made)
(25,818 missing values generated)
(6,840 real changes made)
(3,474 real changes made)
(5,358 real changes made, 5,358 to missing)
(25,742 missing values generated)
(32,658 missing values generated)
(3,559 real changes made)
(3,357 real changes made)
(3,559 real changes made)
(3,357 real changes made)
(4,422 real changes made)
(32,658 missing values generated)
(3,559 real changes made)
(3,357 real changes made)
(6,916 real changes made)
(28,236 real changes made)
(25,742 missing values generated)
(6,916 real changes made)
(3,559 real changes made)
(5,398 real changes made, 5,398 to missing)
(25,782 missing values generated)
(32,658 missing values generated)
(3,487 real changes made)
(3,389 real changes made)
(3,487 real changes made)
(3,389 real changes made)
(4,346 real changes made)
(32,658 missing values generated)
(3,487 real changes made)
(3,389 real changes made)
(6,876 real changes made)
(28,312 real changes made)
(25,782 missing values generated)
(6,876 real changes made)
(3,487 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)

. gen baseline_egfr=.
(32,658 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022 nov2022 dec2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(651 real changes made)
(691 real changes made)
(691 real changes made)
(646 real changes made)
(618 real changes made)
(529 real changes made)
(553 real changes made)
(566 real changes made)
(479 real changes made)
(439 real changes made)
(462 real changes made)
(398 real changes made)
(355 real changes made)
(386 real changes made)
(345 real changes made)
(325 real changes made)
(275 real changes made)
(281 real changes made)
(260 real changes made)
(247 real changes made)
(246 real changes made)
(212 real changes made)
(202 real changes made)
(175 real changes made)
(132 real changes made)
(136 real changes made)
(137 real changes made)
(143 real changes made)
(115 real changes made)
(120 real changes made)
(119 real changes made)
(109 real changes made)
(234 real changes made)
(253 real changes made)
(247 real changes made)
(246 real changes made)
(243 real changes made)
(221 real changes made)
(241 real changes made)
(230 real changes made)
(222 real changes made)
(223 real changes made)
(224 real changes made)
(216 real changes made)
(198 real changes made)
(237 real changes made)
(186 real changes made)
(179 real changes made)
(181 real changes made)
(199 real changes made)
(218 real changes made)
(205 real changes made)
(190 real changes made)
(161 real changes made)
(189 real changes made)
(190 real changes made)
(135 real changes made)
(174 real changes made)
(166 real changes made)
(159 real changes made)
(141 real changes made)
(148 real changes made)
(149 real changes made)
(151 real changes made)
(152 real changes made)
(138 real changes made)
(128 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab case baseline_esrd

           | baseline_e
           |    srd
      case |   No ESRD |     Total
-----------+-----------+----------
         0 |    20,384 |    20,384 
         1 |    12,274 |    12,274 
-----------+-----------+----------
     Total |    32,658 |    32,658 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. * Drop COVID-19 cases without any matched historical comparators after further application of exclusion criteria
. generate match_counts1=.
(32,658 missing values generated)

. order patient_id set_id match_counts match_counts1

. bysort set_id: replace match_counts1=_N-1
(32,658 real changes made)

. replace match_counts1=. if case==0
(20,384 real changes made, 20,384 to missing)

. drop match_counts

. rename match_counts1 match_counts

. count if match_counts==0
  4,601

. drop if match_counts==0
(4,601 observations deleted)

. safetab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,384       72.65       72.65
          1 |      7,673       27.35      100.00
------------+-----------------------------------
      Total |     28,057      100.00

. tab match_counts

match_count |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,036       13.50       13.50
          2 |      1,730       22.55       36.05
          3 |      4,907       63.95      100.00
------------+-----------------------------------
      Total |      7,673      100.00

. 
. bysort set_id: egen set_case_mean = mean(case) // if mean of exposure var is 0 then only uncase in set, if 1 then only case in set

. gen valid_set = (set_case_mean>0 & set_case_mean<1) // ==1 is valid set containing both case and uncase

. tab valid_set, miss

  valid_set |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,167        4.16        4.16
          1 |     26,890       95.84      100.00
------------+-----------------------------------
      Total |     28,057      100.00

. tab valid_set case, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |         case
 valid_set |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,167          0 |     1,167 
           |      5.73       0.00 |      4.16 
-----------+----------------------+----------
         1 |    19,217      7,673 |    26,890 
           |     94.27     100.00 |     95.84 
-----------+----------------------+----------
     Total |    20,384      7,673 |    28,057 
           |    100.00     100.00 |    100.00 

. keep if valid_set==1
(1,167 observations deleted)

. drop valid_set set_case_mean

. 
. ** Exposure
. label define case 0 "Historical comparator" ///
>                                   1 "SARS-CoV-2"

. label values case case

. safetab case 

                 case |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,217       71.47       71.47
           SARS-CoV-2 |      7,673       28.53      100.00
----------------------+-----------------------------------
                Total |     26,890      100.00

. 
. * COVID-19 severity
. gen covid_severity = case

. replace covid_severity = 2 if covid_hospitalised==1
(752 real changes made)

. replace covid_severity = 3 if covid_critical_care==1
(395 real changes made)

. replace covid_severity = 3 if covid_critical_days==1
(358 real changes made)

. label define covid_severity     0 "Historical comparator"               ///
>                                                         1 "Non-hospitalised COVID" ///
>                                                         2 "Hospitalised COVID"          ///
>                                                         3 "Critical care COVID"

. label values covid_severity covid_severity

. label var covid_severity "SARS-CoV-2 severity"

. drop covid_critical_care

. drop covid_critical_days

. safetab covid_severity, m

   SARS-CoV-2 severity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
 Historical comparator |     19,217       71.47       71.47
Non-hospitalised COVID |      6,239       23.20       94.67
    Hospitalised COVID |        681        2.53       97.20
   Critical care COVID |        753        2.80      100.00
-----------------------+-----------------------------------
                 Total |     26,890      100.00

. 
. * COVID-19 acute kidney injury
. gen covid_aki = case

. replace covid_aki = 2 if covid_hospitalised==1
(752 real changes made)

. replace covid_aki = 3 if covid_acute_kidney_injury==1
(382 real changes made)

. label define covid_aki  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised COVID"              ///
>                                                 2 "Hospitalised COVID"  ///
>                                                 3 "Hospitalised COVID-AKI"

. label values covid_aki covid_aki

. label var covid_aki "COVID-19 acute kidney injury"

. drop covid_acute_kidney_injury

. safetab covid_aki, m

 COVID-19 acute kidney |
                injury |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
 Historical comparator |     19,217       71.47       71.47
Non-hospitalised COVID |      6,570       24.43       95.90
    Hospitalised COVID |        721        2.68       98.58
Hospitalised COVID-AKI |        382        1.42      100.00
-----------------------+-----------------------------------
                 Total |     26,890      100.00

. 
. * COVID-19 kidney replacement therapy
. gen covid_krt_combined = covid_krt_icd_10
(19,217 missing values generated)

. replace covid_krt_combined = covid_krt_opcs_4 if covid_krt_icd_10==0
(353 real changes made)

. gen covid_krt = case

. replace covid_krt = 2 if covid_hospitalised==1
(752 real changes made)

. replace covid_krt = 3 if covid_krt_combined==1
(764 real changes made)

. label define covid_krt  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised SARS-CoV-2"         ///
>                                                 2 "No KRT hospitalised COVID-19"        ///
>                                                 3 "KRT hospitalised COVID-19"

. label values covid_krt covid_krt

. label var covid_krt "COVID-19 kidney replacement therapy"

. drop covid_krt_icd_10

. drop covid_krt_opcs_4

. safetab covid_krt, m

 COVID-19 kidney replacement |
                     therapy |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
       Historical comparator |     19,217       71.47       71.47
 Non-hospitalised SARS-CoV-2 |      6,235       23.19       94.65
No KRT hospitalised COVID-19 |        674        2.51       97.16
   KRT hospitalised COVID-19 |        764        2.84      100.00
-----------------------------+-----------------------------------
                       Total |     26,890      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(25,354 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(25,365 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(25,375 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(25,340 missing values generated)

. format covidvax4date %td

. *First vaccination in the UK was on 08/12/2020
. *di date("20201208", "YMD") -> 22257
. foreach var of varlist covidvax1date covidvax2date covidvax3date covidvax4date {
  2. replace `var' = . if `var'<22257
  3. replace `var' = . if `var' >= (index_date - 7)
  4. }
(0 real changes made)
(1,259 real changes made, 1,259 to missing)
(0 real changes made)
(1,255 real changes made, 1,255 to missing)
(0 real changes made)
(1,308 real changes made, 1,308 to missing)
(0 real changes made)
(1,319 real changes made, 1,319 to missing)

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(231 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(178 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(219 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(195 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Historical comparator"       ///
>                                                 1 "Pre-vaccination"                     ///
>                                                 2 "1 vaccine dose"                      ///
>                                                 3 "2 vaccine doses"                     ///
>                                                 4 "3 vaccine doses"                     ///
>                                                 5 "4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "Vaccination status"

. safetab covid_vax, m

   Vaccination status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,217       71.47       71.47
      Pre-vaccination |      6,850       25.47       96.94
       1 vaccine dose |        195        0.73       97.66
      2 vaccine doses |        219        0.81       98.48
      3 vaccine doses |        178        0.66       99.14
      4 vaccine doses |        231        0.86      100.00
----------------------+-----------------------------------
                Total |     26,890      100.00

. 
. * COVID-19 wave
. gen wave = case

. replace wave = 2 if index_month=="sep2020"
(359 real changes made)

. replace wave = 2 if index_month=="oct2020"
(306 real changes made)

. replace wave = 2 if index_month=="nov2020"
(285 real changes made)

. replace wave = 2 if index_month=="dec2020"
(304 real changes made)

. replace wave = 2 if index_month=="jan2021"
(280 real changes made)

. replace wave = 2 if index_month=="feb2021"
(230 real changes made)

. replace wave = 2 if index_month=="mar2021"
(269 real changes made)

. replace wave = 2 if index_month=="apr2021"
(227 real changes made)

. replace wave = 2 if index_month=="may2021"
(211 real changes made)

. replace wave = 2 if index_month=="jun2021"
(198 real changes made)

. replace wave = 3 if index_month=="jul2021"
(208 real changes made)

. replace wave = 3 if index_month=="aug2021"
(189 real changes made)

. replace wave = 3 if index_month=="sep2021"
(187 real changes made)

. replace wave = 3 if index_month=="oct2021"
(174 real changes made)

. replace wave = 3 if index_month=="nov2021"
(142 real changes made)

. replace wave = 4 if index_month=="dec2021"
(148 real changes made)

. replace wave = 4 if index_month=="jan2022"
(131 real changes made)

. replace wave = 4 if index_month=="feb2022"
(101 real changes made)

. replace wave = 4 if index_month=="mar2022"
(106 real changes made)

. replace wave = 4 if index_month=="apr2022"
(102 real changes made)

. replace wave = 4 if index_month=="may2022"
(106 real changes made)

. replace wave = 4 if index_month=="jun2022"
(91 real changes made)

. replace wave = 4 if index_month=="jul2022"
(90 real changes made)

. replace wave = 4 if index_month=="aug2022"
(89 real changes made)

. replace wave = 4 if index_month=="sep2022"
(83 real changes made)

. replace wave = 4 if index_month=="oct2022"
(78 real changes made)

. replace wave = 4 if index_month=="nov2022"
(74 real changes made)

. replace wave = 4 if index_month=="dec2022"
(73 real changes made)

. label define wave       0 "Historical comparator"       ///
>                                         1 "Febuary20-August20"  ///
>                                         2 "September20-June21"  ///
>                                         3 "July21-November21"   ///
>                                         4 "December21-December22"       

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m

        COVID-19 wave |      Freq.     Percent        Cum.
----------------------+-----------------------------------
Historical comparator |     19,217       71.47       71.47
   Febuary20-August20 |      2,832       10.53       82.00
   September20-June21 |      2,669        9.93       91.92
    July21-November21 |        900        3.35       95.27
December21-December22 |      1,272        4.73      100.00
----------------------+-----------------------------------
                Total |     26,890      100.00

. 
. ** Covariates
. * Check of GP consultations over past year by groups
. sum gp_count, detail

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -5
 5%            0             -5
10%            0             -4       Obs              26,890
25%            0             -4       Sum of wgt.      26,890

50%            3                      Mean           3.283191
                        Largest       Std. dev.      3.524345
75%            6             16
90%            8             16       Variance       12.42101
95%           10             16       Skewness       .6457965
99%           12             17       Kurtosis       2.290958

. bysort case: sum gp_count, detail

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Historical comparator

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -5
 5%            0             -4
10%            0             -4       Obs              19,217
25%            0             -3       Sum of wgt.      19,217

50%            3                      Mean           3.294947
                        Largest       Std. dev.      3.520845
75%            6             15
90%            8             15       Variance       12.39635
95%           10             16       Skewness       .6332512
99%           12             16       Kurtosis       2.263565

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = SARS-CoV-2

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -5
 5%            0             -4
10%            0             -4       Obs               7,673
25%            0             -3       Sum of wgt.       7,673

50%            2                      Mean           3.253747
                        Largest       Std. dev.      3.533154
75%            6             16
90%            8             16       Variance       12.48318
95%           10             16       Skewness       .6771505
99%           12             17       Kurtosis       2.360087


. egen gp_consults = cut(gp_count), at(0, 1, 3, 10, 1500)
(138 missing values generated)

. recode gp_consults 3=2 10=3
(13,496 changes made to gp_consults)

. label define gp_consults 0 "0" 1 "1-2" 2 "3-9" 3 ">9"

. label values gp_consults gp_consults

. label var gp_consults "GP interactions"

. tab case gp_consults

                      |               GP interactions
                 case |         0        1-2        3-9         >9 |     Total
----------------------+--------------------------------------------+----------
Historical comparator |     8,115      1,320      8,676      1,006 |    19,117 
           SARS-CoV-2 |     3,293        528      3,386        428 |     7,635 
----------------------+--------------------------------------------+----------
                Total |    11,408      1,848     12,062      1,434 |    26,752 

. 
. * Check of hospital admissions in preceding 5 years
. sum hosp_count, detail

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -3
 5%            0             -2
10%            0             -2       Obs              26,890
25%            0             -2       Sum of wgt.      26,890

50%            0                      Mean            .393492
                        Largest       Std. dev.      .7146653
75%            1              4
90%            1              4       Variance       .5107464
95%            2              5       Skewness       1.492531
99%            3              5       Kurtosis       5.197736

. bysort case: sum hosp_count, detail

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Historical comparator

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -3
 5%            0             -2
10%            0             -2       Obs              19,217
25%            0             -2       Sum of wgt.      19,217

50%            0                      Mean           .3936619
                        Largest       Std. dev.      .7176607
75%            1              4
90%            1              4       Variance       .5150368
95%            2              5       Skewness       1.502366
99%            3              5       Kurtosis       5.293449

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = SARS-CoV-2

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs               7,673
25%            0             -2       Sum of wgt.       7,673

50%            0                      Mean           .3930666
                        Largest       Std. dev.      .7071539
75%            1              4
90%            1              4       Variance       .5000666
95%            2              4       Skewness       1.466371
99%            3              4       Kurtosis       4.939823


. egen admissions = cut(hosp_count), at(0, 1, 2, 1000)
(363 missing values generated)

. label define admissions 0 "0" 1 "1" 2 ">1"

. label values admissions admissions

. label var admissions "Hospital admissions"

. tab case admissions

                      |       Hospital admissions
                 case |         0          1         >1 |     Total
----------------------+---------------------------------+----------
Historical comparator |    13,153      4,002      1,788 |    18,943 
           SARS-CoV-2 |     5,283      1,579        722 |     7,584 
----------------------+---------------------------------+----------
                Total |    18,436      5,581      2,510 |    26,527 

. 
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        202        0.75        0.75
         19 |        282        1.05        1.80
         20 |        399        1.48        3.28
         21 |        448        1.67        4.95
         22 |        528        1.96        6.91
         23 |        561        2.09        9.00
         24 |        510        1.90       10.90
         25 |        593        2.21       13.10
         26 |        535        1.99       15.09
         27 |        571        2.12       17.21
         28 |        508        1.89       19.10
         29 |        532        1.98       21.08
         30 |        516        1.92       23.00
         31 |        490        1.82       24.82
         32 |        541        2.01       26.84
         33 |        517        1.92       28.76
         34 |        542        2.02       30.77
         35 |        566        2.10       32.88
         36 |        529        1.97       34.85
         37 |        523        1.94       36.79
         38 |        500        1.86       38.65
         39 |        527        1.96       40.61
         40 |        514        1.91       42.52
         41 |        582        2.16       44.69
         42 |        545        2.03       46.71
         43 |        565        2.10       48.81
         44 |        592        2.20       51.02
         45 |        471        1.75       52.77
         46 |        554        2.06       54.83
         47 |        608        2.26       57.09
         48 |        538        2.00       59.09
         49 |        564        2.10       61.19
         50 |        560        2.08       63.27
         51 |        534        1.99       65.25
         52 |        489        1.82       67.07
         53 |        515        1.92       68.99
         54 |        562        2.09       71.08
         55 |        532        1.98       73.06
         56 |        545        2.03       75.08
         57 |        515        1.92       77.00
         58 |        553        2.06       79.06
         59 |        539        2.00       81.06
         60 |        529        1.97       83.03
         61 |        527        1.96       84.99
         62 |        518        1.93       86.91
         63 |        553        2.06       88.97
         64 |        545        2.03       91.00
         65 |        575        2.14       93.13
         66 |        541        2.01       95.15
         67 |        533        1.98       97.13
         68 |        342        1.27       98.40
         69 |        163        0.61       99.01
         70 |        159        0.59       99.60
         71 |         79        0.29       99.89
         72 |         28        0.10      100.00
         73 |          1        0.00      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. safecount
  26,890

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///                                     
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(26,890 differences between age and agegroup)

. 
. label var age "Age"

. label values age age

. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label var agegroup "Age group"

. label values agegroup agegroup

. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex

        Sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     13,839       51.47       51.47
       Male |     13,051       48.53      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. safecount
  26,890

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(1,036 real changes made)

. replace ethnicity=2 if ethnicity==3
(1,027 real changes made)

. replace ethnicity=3 if ethnicity==4
(971 real changes made)

. replace ethnicity=4 if ethnicity==6
(1,036 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///                                             
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                                                               

. label values ethnicity ethnicity

. safetab ethnicity, m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,132       59.99       59.99
South Asian |      1,027        3.82       63.81
      Black |        971        3.61       67.42
      Mixed |      1,036        3.85       71.28
      Other |      1,049        3.90       75.18
          . |      6,675       24.82      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(6,675 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(6,675 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. label var ethnicity1 "Ethnicity"

. safetab ethnicity1, m

  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     16,132       59.99       59.99
South Asian |      1,027        3.82       63.81
      Black |        971        3.61       67.42
      Mixed |      1,036        3.85       71.28
      Other |      1,049        3.90       75.18
    Unknown |      6,675       24.82      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,690       10.00       10.00
                Urban minor conurbation |      2,657        9.88       19.88
                    Urban city and town |      2,685        9.99       29.87
Urban city and town in a sparse setting |      2,726       10.14       40.01
                  Rural town and fringe |      2,648        9.85       49.85
Rural town and fringe in a sparse setti |      2,722       10.12       59.98
            Rural village and dispersed |      5,287       19.66       79.64
Rural village and dispersed in a sparse |      5,475       20.36      100.00
----------------------------------------+-----------------------------------
                                  Total |     26,890      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(26,890 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(10,758 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(16,132 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                                       rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow  Rural tow  Rural vil  Rural vil |     Total
-----------+----------------------------------------------------------------------------------------+----------
     Rural |         0          0          0          0      2,648      2,722      5,287      5,475 |    16,132 
     Urban |     2,690      2,657      2,685      2,726          0          0          0          0 |    10,758 
-----------+----------------------------------------------------------------------------------------+----------
     Total |     2,690      2,657      2,685      2,726      2,648      2,722      5,287      5,475 |    26,890 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Historical comparator |    11,472      7,745 |    19,217 
           SARS-CoV-2 |     4,660      3,013 |     7,673 
----------------------+----------------------+----------
                Total |    16,132     10,758 |    26,890 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,774 real changes made, 2,774 to missing)

. gen     bmi = .
(26,890 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(1,669 changes made to bmi)

. recode  bmi . = 2 if body_mass_index<25
(6,061 changes made to bmi)

. recode  bmi . = 3 if body_mass_index<30
(6,239 changes made to bmi)

. recode  bmi . = 4 if body_mass_index<35
(5,376 changes made to bmi)

. recode  bmi . = 5 if body_mass_index<40
(3,113 changes made to bmi)

. recode  bmi . = 6 if body_mass_index<.
(1,658 changes made to bmi)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                             

. label values bmi bmi

. label var bmi "Body mass index (BMI)"

. safetab bmi, m

     Body mass index |
               (BMI) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,669        6.21        6.21
  Normal (18.5-24.9) |      6,061       22.54       28.75
Overweight (25-29.9) |      6,239       23.20       51.95
   Obese I (30-34.9) |      5,376       19.99       71.94
  Obese II (35-39.9) |      3,113       11.58       83.52
     Obese III (40+) |      1,658        6.17       89.68
                   . |      2,774       10.32      100.00
---------------------+-----------------------------------
               Total |     26,890      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(23,653 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(525 real changes made)

. replace smoking = 0 if smoking_status=="N"
(1,070 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |      1,070        3.98        3.98
Current/former smoker |      3,762       13.99       17.97
                    . |     22,058       82.03      100.00
----------------------+-----------------------------------
                Total |     26,890      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000)
(12,181 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(14,709 changes made to egfr_group)

. label define egfr_group 1 "105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       105 |      4,790       17.81       17.81
     90-104 |      2,031        7.55       25.37
      75-89 |      1,855        6.90       32.26
      60-74 |      2,327        8.65       40.92
      45-59 |      2,325        8.65       49.56
      30-44 |      1,259        4.68       54.25
      15-29 |        122        0.45       54.70
          . |     12,181       45.30      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 15-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(12,181 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(22,100 changes made to ckd_stage)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6 "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |     11,003       40.92       40.92
                      CKD 3A |      2,325        8.65       49.56
                      CKD 3B |      1,259        4.68       54.25
                       CKD 4 |        122        0.45       54.70
No baseline eGFR measurement |     12,181       45.30      100.00
-----------------------------+-----------------------------------
                       Total |     26,890      100.00

. 
. * Comorbidities
. rename acute_kidney_injury_baseline aki_baseline

. safetab aki_baseline

aki_baselin |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,563       95.07       95.07
          1 |      1,327        4.93      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,555       95.04       95.04
          1 |      1,335        4.96      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,345       97.97       97.97
          1 |        545        2.03      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. label var diabetes "Diabetes"

. safetab diabetes

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,497       79.94       79.94
          1 |      5,393       20.06      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,616       98.98       98.98
          1 |        274        1.02      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. safetab heart_failure

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,803       95.96       95.96
          1 |      1,087        4.04      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. safetab hiv

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,320       97.88       97.88
          1 |        570        2.12      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. label var hypertension "Hypertension"

. safetab hypertension

Hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,537       80.09       80.09
          1 |      5,353       19.91      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. label var non_haem_cancer "Cancer (non-haematological)"

. safetab non_haem_cancer

     Cancer |
(non-haemat |
  ological) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,355       98.01       98.01
          1 |        535        1.99      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. safetab myocardial_infarction

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,177       89.91       89.91
          1 |      2,713       10.09      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,346       97.98       97.98
          1 |        544        2.02      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,544       94.99       94.99
          1 |      1,346        5.01      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. safetab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,368       98.06       98.06
          1 |        522        1.94      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,352       98.00       98.00
          1 |        538        2.00      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(1,034 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,477 real changes made)

. replace cardiovascular = 1 if pvd==1
(444 real changes made)

. replace cardiovascular = 1 if stroke==1
(417 real changes made)

. label var cardiovascular "Cardiovascular diseases"

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(563 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,301 real changes made)

. replace immunosuppressed = 1 if lupus==1
(497 real changes made)

. label var immunosuppressed "Immunosuppressive diseases"

. safetab cardiovascular

Cardiovascu |
        lar |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,183       78.78       78.78
          1 |      5,707       21.22      100.00
------------+-----------------------------------
      Total |     26,890      100.00

. safetab immunosuppressed

Immunosuppr |
     essive |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,255       90.20       90.20
          1 |      2,635        9.80      100.00
------------+-----------------------------------
      Total |     26,890      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                                 creatinine_mar2017 ///
>                                                                                 creatinine_apr2017 ///
>                                                                                 creatinine_may2017 ///
>                                                                                 creatinine_jun2017 ///
>                                                                                 creatinine_jul2017 ///
>                                                                                 creatinine_aug2017 ///
>                                                                                 creatinine_sep2017 ///
>                                                                                 creatinine_oct2017 ///
>                                                                                 creatinine_nov2017 ///
>                                                                                 creatinine_dec2017 ///
>                                                                                 creatinine_jan2018 ///
>                                                                                 creatinine_feb2018 ///
>                                                                                 creatinine_mar2018 ///
>                                                                                 creatinine_apr2018 ///
>                                                                                 creatinine_may2018 ///
>                                                                                 creatinine_jun2018 ///
>                                                                                 creatinine_jul2018 ///
>                                                                                 creatinine_aug2018 ///
>                                                                                 creatinine_sep2018 ///
>                                                                                 creatinine_oct2018 ///
>                                                                                 creatinine_nov2018 ///
>                                                                                 creatinine_dec2018 ///
>                                                                                 creatinine_jan2019 ///
>                                                                                 creatinine_feb2019 ///
>                                                                                 creatinine_mar2019 ///
>                                                                                 creatinine_apr2019 ///
>                                                                                 creatinine_may2019 ///
>                                                                                 creatinine_jun2019 ///
>                                                                                 creatinine_jul2019 ///
>                                                                                 creatinine_aug2019 ///
>                                                                                 creatinine_sep2019 ///
>                                                                                 creatinine_feb2020 ///
>                                                                                 creatinine_mar2020 ///
>                                                                                 creatinine_apr2020 ///
>                                                                                 creatinine_may2020 ///
>                                                                                 creatinine_jun2020 ///
>                                                                                 creatinine_jul2020 ///
>                                                                                 creatinine_aug2020 ///
>                                                                                 creatinine_sep2020 ///
>                                                                                 creatinine_oct2020 ///
>                                                                                 creatinine_nov2020 ///
>                                                                                 creatinine_dec2020 ///
>                                                                                 creatinine_jan2021 ///
>                                                                                 creatinine_feb2021 ///
>                                                                                 creatinine_mar2021 ///
>                                                                                 creatinine_apr2021 ///
>                                                                                 creatinine_may2021 ///
>                                                                                 creatinine_jun2021 ///
>                                                                                 creatinine_jul2021 ///
>                                                                                 creatinine_aug2021 ///
>                                                                                 creatinine_sep2021 ///
>                                                                                 creatinine_oct2021 ///
>                                                                                 creatinine_nov2021 ///
>                                                                                 creatinine_dec2021 ///
>                                                                                 creatinine_jan2022 ///
>                                                                                 creatinine_feb2022 ///
>                                                                                 creatinine_mar2022 ///
>                                                                                 creatinine_apr2022 ///
>                                                                                 creatinine_may2022 ///
>                                                                                 creatinine_jun2022 ///
>                                                                                 creatinine_jul2022 ///
>                                                                                 creatinine_aug2022 ///
>                                                                                 creatinine_sep2022 ///
>                                                                                 creatinine_oct2022 ///
>                                                                                 creatinine_nov2022 ///
>                                                                                 creatinine_dec2022 ///
>                                                                                 creatinine_jan2023 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 3000)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex==0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex==1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_monthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(8,455 real changes made, 8,455 to missing)
(16,128 missing values generated)
(26,890 missing values generated)
(5,523 real changes made)
(5,239 real changes made)
(5,523 real changes made)
(5,239 real changes made)
(6,880 real changes made)
(26,890 missing values generated)
(5,523 real changes made)
(5,239 real changes made)
(10,762 real changes made)
(20,010 real changes made)
(16,128 missing values generated)
(10,762 real changes made)
(5,523 real changes made)
(8,433 real changes made, 8,433 to missing)
(16,106 missing values generated)
(26,890 missing values generated)
(5,556 real changes made)
(5,228 real changes made)
(5,556 real changes made)
(5,228 real changes made)
(6,761 real changes made)
(26,890 missing values generated)
(5,556 real changes made)
(5,228 real changes made)
(10,784 real changes made)
(20,129 real changes made)
(16,106 missing values generated)
(10,784 real changes made)
(5,556 real changes made)
(8,470 real changes made, 8,470 to missing)
(16,143 missing values generated)
(26,890 missing values generated)
(5,551 real changes made)
(5,196 real changes made)
(5,551 real changes made)
(5,196 real changes made)
(6,782 real changes made)
(26,890 missing values generated)
(5,551 real changes made)
(5,196 real changes made)
(10,747 real changes made)
(20,108 real changes made)
(16,143 missing values generated)
(10,747 real changes made)
(5,551 real changes made)
(8,463 real changes made, 8,463 to missing)
(16,136 missing values generated)
(26,890 missing values generated)
(5,523 real changes made)
(5,231 real changes made)
(5,523 real changes made)
(5,231 real changes made)
(6,859 real changes made)
(26,890 missing values generated)
(5,523 real changes made)
(5,231 real changes made)
(10,754 real changes made)
(20,031 real changes made)
(16,136 missing values generated)
(10,754 real changes made)
(5,523 real changes made)
(8,502 real changes made, 8,502 to missing)
(16,175 missing values generated)
(26,890 missing values generated)
(5,537 real changes made)
(5,178 real changes made)
(5,537 real changes made)
(5,178 real changes made)
(6,711 real changes made)
(26,890 missing values generated)
(5,537 real changes made)
(5,178 real changes made)
(10,715 real changes made)
(20,179 real changes made)
(16,175 missing values generated)
(10,715 real changes made)
(5,537 real changes made)
(8,518 real changes made, 8,518 to missing)
(16,191 missing values generated)
(26,890 missing values generated)
(5,555 real changes made)
(5,144 real changes made)
(5,555 real changes made)
(5,144 real changes made)
(6,760 real changes made)
(26,890 missing values generated)
(5,555 real changes made)
(5,144 real changes made)
(10,699 real changes made)
(20,130 real changes made)
(16,191 missing values generated)
(10,699 real changes made)
(5,555 real changes made)
(8,430 real changes made, 8,430 to missing)
(16,103 missing values generated)
(26,890 missing values generated)
(5,538 real changes made)
(5,249 real changes made)
(5,538 real changes made)
(5,249 real changes made)
(6,842 real changes made)
(26,890 missing values generated)
(5,538 real changes made)
(5,249 real changes made)
(10,787 real changes made)
(20,048 real changes made)
(16,103 missing values generated)
(10,787 real changes made)
(5,538 real changes made)
(8,455 real changes made, 8,455 to missing)
(16,128 missing values generated)
(26,890 missing values generated)
(5,606 real changes made)
(5,156 real changes made)
(5,606 real changes made)
(5,156 real changes made)
(6,770 real changes made)
(26,890 missing values generated)
(5,606 real changes made)
(5,156 real changes made)
(10,762 real changes made)
(20,120 real changes made)
(16,128 missing values generated)
(10,762 real changes made)
(5,606 real changes made)
(8,466 real changes made, 8,466 to missing)
(16,139 missing values generated)
(26,890 missing values generated)
(5,573 real changes made)
(5,178 real changes made)
(5,573 real changes made)
(5,178 real changes made)
(6,941 real changes made)
(26,890 missing values generated)
(5,573 real changes made)
(5,178 real changes made)
(10,751 real changes made)
(19,949 real changes made)
(16,139 missing values generated)
(10,751 real changes made)
(5,573 real changes made)
(8,492 real changes made, 8,492 to missing)
(16,165 missing values generated)
(26,890 missing values generated)
(5,464 real changes made)
(5,261 real changes made)
(5,464 real changes made)
(5,261 real changes made)
(6,817 real changes made)
(26,890 missing values generated)
(5,464 real changes made)
(5,261 real changes made)
(10,725 real changes made)
(20,073 real changes made)
(16,165 missing values generated)
(10,725 real changes made)
(5,464 real changes made)
(8,459 real changes made, 8,459 to missing)
(16,132 missing values generated)
(26,890 missing values generated)
(5,561 real changes made)
(5,197 real changes made)
(5,561 real changes made)
(5,197 real changes made)
(6,879 real changes made)
(26,890 missing values generated)
(5,561 real changes made)
(5,197 real changes made)
(10,758 real changes made)
(20,011 real changes made)
(16,132 missing values generated)
(10,758 real changes made)
(5,561 real changes made)
(8,451 real changes made, 8,451 to missing)
(16,124 missing values generated)
(26,890 missing values generated)
(5,523 real changes made)
(5,243 real changes made)
(5,523 real changes made)
(5,243 real changes made)
(6,902 real changes made)
(26,890 missing values generated)
(5,523 real changes made)
(5,243 real changes made)
(10,766 real changes made)
(19,988 real changes made)
(16,124 missing values generated)
(10,766 real changes made)
(5,523 real changes made)
(8,411 real changes made, 8,411 to missing)
(16,084 missing values generated)
(26,890 missing values generated)
(5,554 real changes made)
(5,252 real changes made)
(5,554 real changes made)
(5,252 real changes made)
(6,874 real changes made)
(26,890 missing values generated)
(5,554 real changes made)
(5,252 real changes made)
(10,806 real changes made)
(20,016 real changes made)
(16,084 missing values generated)
(10,806 real changes made)
(5,554 real changes made)
(8,433 real changes made, 8,433 to missing)
(16,106 missing values generated)
(26,890 missing values generated)
(5,518 real changes made)
(5,266 real changes made)
(5,518 real changes made)
(5,266 real changes made)
(6,792 real changes made)
(26,890 missing values generated)
(5,518 real changes made)
(5,266 real changes made)
(10,784 real changes made)
(20,098 real changes made)
(16,106 missing values generated)
(10,784 real changes made)
(5,518 real changes made)
(8,441 real changes made, 8,441 to missing)
(16,114 missing values generated)
(26,890 missing values generated)
(5,555 real changes made)
(5,221 real changes made)
(5,555 real changes made)
(5,221 real changes made)
(6,804 real changes made)
(26,890 missing values generated)
(5,555 real changes made)
(5,221 real changes made)
(10,776 real changes made)
(20,086 real changes made)
(16,114 missing values generated)
(10,776 real changes made)
(5,555 real changes made)
(8,504 real changes made, 8,504 to missing)
(16,177 missing values generated)
(26,890 missing values generated)
(5,517 real changes made)
(5,196 real changes made)
(5,517 real changes made)
(5,196 real changes made)
(6,865 real changes made)
(26,890 missing values generated)
(5,517 real changes made)
(5,196 real changes made)
(10,713 real changes made)
(20,025 real changes made)
(16,177 missing values generated)
(10,713 real changes made)
(5,517 real changes made)
(8,516 real changes made, 8,516 to missing)
(16,189 missing values generated)
(26,890 missing values generated)
(5,555 real changes made)
(5,146 real changes made)
(5,555 real changes made)
(5,146 real changes made)
(6,814 real changes made)
(26,890 missing values generated)
(5,555 real changes made)
(5,146 real changes made)
(10,701 real changes made)
(20,076 real changes made)
(16,189 missing values generated)
(10,701 real changes made)
(5,555 real changes made)
(8,407 real changes made, 8,407 to missing)
(16,080 missing values generated)
(26,890 missing values generated)
(5,578 real changes made)
(5,232 real changes made)
(5,578 real changes made)
(5,232 real changes made)
(6,890 real changes made)
(26,890 missing values generated)
(5,578 real changes made)
(5,232 real changes made)
(10,810 real changes made)
(20,000 real changes made)
(16,080 missing values generated)
(10,810 real changes made)
(5,578 real changes made)
(8,499 real changes made, 8,499 to missing)
(16,172 missing values generated)
(26,890 missing values generated)
(5,539 real changes made)
(5,179 real changes made)
(5,539 real changes made)
(5,179 real changes made)
(6,801 real changes made)
(26,890 missing values generated)
(5,539 real changes made)
(5,179 real changes made)
(10,718 real changes made)
(20,089 real changes made)
(16,172 missing values generated)
(10,718 real changes made)
(5,539 real changes made)
(8,444 real changes made, 8,444 to missing)
(16,117 missing values generated)
(26,890 missing values generated)
(5,523 real changes made)
(5,250 real changes made)
(5,523 real changes made)
(5,250 real changes made)
(6,871 real changes made)
(26,890 missing values generated)
(5,523 real changes made)
(5,250 real changes made)
(10,773 real changes made)
(20,019 real changes made)
(16,117 missing values generated)
(10,773 real changes made)
(5,523 real changes made)
(8,463 real changes made, 8,463 to missing)
(16,136 missing values generated)
(26,890 missing values generated)
(5,473 real changes made)
(5,281 real changes made)
(5,473 real changes made)
(5,281 real changes made)
(6,836 real changes made)
(26,890 missing values generated)
(5,473 real changes made)
(5,281 real changes made)
(10,754 real changes made)
(20,054 real changes made)
(16,136 missing values generated)
(10,754 real changes made)
(5,473 real changes made)
(8,381 real changes made, 8,381 to missing)
(16,054 missing values generated)
(26,890 missing values generated)
(5,649 real changes made)
(5,187 real changes made)
(5,649 real changes made)
(5,187 real changes made)
(6,931 real changes made)
(26,890 missing values generated)
(5,649 real changes made)
(5,187 real changes made)
(10,836 real changes made)
(19,959 real changes made)
(16,054 missing values generated)
(10,836 real changes made)
(5,649 real changes made)
(8,426 real changes made, 8,426 to missing)
(16,099 missing values generated)
(26,890 missing values generated)
(5,523 real changes made)
(5,268 real changes made)
(5,523 real changes made)
(5,268 real changes made)
(6,791 real changes made)
(26,890 missing values generated)
(5,523 real changes made)
(5,268 real changes made)
(10,791 real changes made)
(20,099 real changes made)
(16,099 missing values generated)
(10,791 real changes made)
(5,523 real changes made)
(8,473 real changes made, 8,473 to missing)
(16,146 missing values generated)
(26,890 missing values generated)
(5,585 real changes made)
(5,159 real changes made)
(5,585 real changes made)
(5,159 real changes made)
(6,853 real changes made)
(26,890 missing values generated)
(5,585 real changes made)
(5,159 real changes made)
(10,744 real changes made)
(20,037 real changes made)
(16,146 missing values generated)
(10,744 real changes made)
(5,585 real changes made)
(8,443 real changes made, 8,443 to missing)
(16,116 missing values generated)
(26,890 missing values generated)
(5,531 real changes made)
(5,243 real changes made)
(5,531 real changes made)
(5,243 real changes made)
(6,810 real changes made)
(26,890 missing values generated)
(5,531 real changes made)
(5,243 real changes made)
(10,774 real changes made)
(20,080 real changes made)
(16,116 missing values generated)
(10,774 real changes made)
(5,531 real changes made)
(8,442 real changes made, 8,442 to missing)
(16,115 missing values generated)
(26,890 missing values generated)
(5,598 real changes made)
(5,177 real changes made)
(5,598 real changes made)
(5,177 real changes made)
(6,887 real changes made)
(26,890 missing values generated)
(5,598 real changes made)
(5,177 real changes made)
(10,775 real changes made)
(20,003 real changes made)
(16,115 missing values generated)
(10,775 real changes made)
(5,598 real changes made)
(8,438 real changes made, 8,438 to missing)
(16,111 missing values generated)
(26,890 missing values generated)
(5,545 real changes made)
(5,234 real changes made)
(5,545 real changes made)
(5,234 real changes made)
(6,936 real changes made)
(26,890 missing values generated)
(5,545 real changes made)
(5,234 real changes made)
(10,779 real changes made)
(19,954 real changes made)
(16,111 missing values generated)
(10,779 real changes made)
(5,545 real changes made)
(8,535 real changes made, 8,535 to missing)
(16,208 missing values generated)
(26,890 missing values generated)
(5,482 real changes made)
(5,200 real changes made)
(5,482 real changes made)
(5,200 real changes made)
(6,780 real changes made)
(26,890 missing values generated)
(5,482 real changes made)
(5,200 real changes made)
(10,682 real changes made)
(20,110 real changes made)
(16,208 missing values generated)
(10,682 real changes made)
(5,482 real changes made)
(8,447 real changes made, 8,447 to missing)
(16,120 missing values generated)
(26,890 missing values generated)
(5,542 real changes made)
(5,228 real changes made)
(5,542 real changes made)
(5,228 real changes made)
(6,825 real changes made)
(26,890 missing values generated)
(5,542 real changes made)
(5,228 real changes made)
(10,770 real changes made)
(20,065 real changes made)
(16,120 missing values generated)
(10,770 real changes made)
(5,542 real changes made)
(8,438 real changes made, 8,438 to missing)
(16,111 missing values generated)
(26,890 missing values generated)
(5,595 real changes made)
(5,184 real changes made)
(5,595 real changes made)
(5,184 real changes made)
(6,891 real changes made)
(26,890 missing values generated)
(5,595 real changes made)
(5,184 real changes made)
(10,779 real changes made)
(19,999 real changes made)
(16,111 missing values generated)
(10,779 real changes made)
(5,595 real changes made)
(8,449 real changes made, 8,449 to missing)
(16,122 missing values generated)
(26,890 missing values generated)
(5,540 real changes made)
(5,228 real changes made)
(5,540 real changes made)
(5,228 real changes made)
(6,880 real changes made)
(26,890 missing values generated)
(5,540 real changes made)
(5,228 real changes made)
(10,768 real changes made)
(20,010 real changes made)
(16,122 missing values generated)
(10,768 real changes made)
(5,540 real changes made)
(8,453 real changes made, 8,453 to missing)
(16,126 missing values generated)
(26,890 missing values generated)
(5,519 real changes made)
(5,245 real changes made)
(5,519 real changes made)
(5,245 real changes made)
(6,842 real changes made)
(26,890 missing values generated)
(5,519 real changes made)
(5,245 real changes made)
(10,764 real changes made)
(20,048 real changes made)
(16,126 missing values generated)
(10,764 real changes made)
(5,519 real changes made)
(3,331 real changes made, 3,331 to missing)
(22,548 missing values generated)
(26,890 missing values generated)
(2,218 real changes made)
(2,124 real changes made)
(2,218 real changes made)
(2,124 real changes made)
(2,747 real changes made)
(26,890 missing values generated)
(2,218 real changes made)
(2,124 real changes made)
(4,342 real changes made)
(24,143 real changes made)
(22,548 missing values generated)
(4,342 real changes made)
(2,218 real changes made)
(3,358 real changes made, 3,358 to missing)
(22,575 missing values generated)
(26,890 missing values generated)
(2,217 real changes made)
(2,098 real changes made)
(2,217 real changes made)
(2,098 real changes made)
(2,751 real changes made)
(26,890 missing values generated)
(2,217 real changes made)
(2,098 real changes made)
(4,315 real changes made)
(24,139 real changes made)
(22,575 missing values generated)
(4,315 real changes made)
(2,217 real changes made)
(3,422 real changes made, 3,422 to missing)
(22,639 missing values generated)
(26,890 missing values generated)
(2,143 real changes made)
(2,108 real changes made)
(2,143 real changes made)
(2,108 real changes made)
(2,695 real changes made)
(26,890 missing values generated)
(2,143 real changes made)
(2,108 real changes made)
(4,251 real changes made)
(24,195 real changes made)
(22,639 missing values generated)
(4,251 real changes made)
(2,143 real changes made)
(3,356 real changes made, 3,356 to missing)
(22,573 missing values generated)
(26,890 missing values generated)
(2,223 real changes made)
(2,094 real changes made)
(2,223 real changes made)
(2,094 real changes made)
(2,733 real changes made)
(26,890 missing values generated)
(2,223 real changes made)
(2,094 real changes made)
(4,317 real changes made)
(24,157 real changes made)
(22,573 missing values generated)
(4,317 real changes made)
(2,223 real changes made)
(3,389 real changes made, 3,389 to missing)
(22,606 missing values generated)
(26,890 missing values generated)
(2,228 real changes made)
(2,056 real changes made)
(2,228 real changes made)
(2,056 real changes made)
(2,723 real changes made)
(26,890 missing values generated)
(2,228 real changes made)
(2,056 real changes made)
(4,284 real changes made)
(24,167 real changes made)
(22,606 missing values generated)
(4,284 real changes made)
(2,228 real changes made)
(3,349 real changes made, 3,349 to missing)
(22,566 missing values generated)
(26,890 missing values generated)
(2,213 real changes made)
(2,111 real changes made)
(2,213 real changes made)
(2,111 real changes made)
(2,770 real changes made)
(26,890 missing values generated)
(2,213 real changes made)
(2,111 real changes made)
(4,324 real changes made)
(24,120 real changes made)
(22,566 missing values generated)
(4,324 real changes made)
(2,213 real changes made)
(3,381 real changes made, 3,381 to missing)
(22,598 missing values generated)
(26,890 missing values generated)
(2,247 real changes made)
(2,045 real changes made)
(2,247 real changes made)
(2,045 real changes made)
(2,778 real changes made)
(26,890 missing values generated)
(2,247 real changes made)
(2,045 real changes made)
(4,292 real changes made)
(24,112 real changes made)
(22,598 missing values generated)
(4,292 real changes made)
(2,247 real changes made)
(3,381 real changes made, 3,381 to missing)
(22,598 missing values generated)
(26,890 missing values generated)
(2,175 real changes made)
(2,117 real changes made)
(2,175 real changes made)
(2,117 real changes made)
(2,706 real changes made)
(26,890 missing values generated)
(2,175 real changes made)
(2,117 real changes made)
(4,292 real changes made)
(24,184 real changes made)
(22,598 missing values generated)
(4,292 real changes made)
(2,175 real changes made)
(3,406 real changes made, 3,406 to missing)
(22,623 missing values generated)
(26,890 missing values generated)
(2,176 real changes made)
(2,091 real changes made)
(2,176 real changes made)
(2,091 real changes made)
(2,784 real changes made)
(26,890 missing values generated)
(2,176 real changes made)
(2,091 real changes made)
(4,267 real changes made)
(24,106 real changes made)
(22,623 missing values generated)
(4,267 real changes made)
(2,176 real changes made)
(3,370 real changes made, 3,370 to missing)
(22,587 missing values generated)
(26,890 missing values generated)
(2,199 real changes made)
(2,104 real changes made)
(2,199 real changes made)
(2,104 real changes made)
(2,760 real changes made)
(26,890 missing values generated)
(2,199 real changes made)
(2,104 real changes made)
(4,303 real changes made)
(24,130 real changes made)
(22,587 missing values generated)
(4,303 real changes made)
(2,199 real changes made)
(3,365 real changes made, 3,365 to missing)
(22,582 missing values generated)
(26,890 missing values generated)
(2,203 real changes made)
(2,105 real changes made)
(2,203 real changes made)
(2,105 real changes made)
(2,699 real changes made)
(26,890 missing values generated)
(2,203 real changes made)
(2,105 real changes made)
(4,308 real changes made)
(24,191 real changes made)
(22,582 missing values generated)
(4,308 real changes made)
(2,203 real changes made)
(3,376 real changes made, 3,376 to missing)
(22,593 missing values generated)
(26,890 missing values generated)
(2,200 real changes made)
(2,097 real changes made)
(2,200 real changes made)
(2,097 real changes made)
(2,757 real changes made)
(26,890 missing values generated)
(2,200 real changes made)
(2,097 real changes made)
(4,297 real changes made)
(24,133 real changes made)
(22,593 missing values generated)
(4,297 real changes made)
(2,200 real changes made)
(3,385 real changes made, 3,385 to missing)
(22,602 missing values generated)
(26,890 missing values generated)
(2,235 real changes made)
(2,053 real changes made)
(2,235 real changes made)
(2,053 real changes made)
(2,711 real changes made)
(26,890 missing values generated)
(2,235 real changes made)
(2,053 real changes made)
(4,288 real changes made)
(24,179 real changes made)
(22,602 missing values generated)
(4,288 real changes made)
(2,235 real changes made)
(3,360 real changes made, 3,360 to missing)
(22,577 missing values generated)
(26,890 missing values generated)
(2,200 real changes made)
(2,113 real changes made)
(2,200 real changes made)
(2,113 real changes made)
(2,804 real changes made)
(26,890 missing values generated)
(2,200 real changes made)
(2,113 real changes made)
(4,313 real changes made)
(24,086 real changes made)
(22,577 missing values generated)
(4,313 real changes made)
(2,200 real changes made)
(3,382 real changes made, 3,382 to missing)
(22,599 missing values generated)
(26,890 missing values generated)
(2,208 real changes made)
(2,083 real changes made)
(2,208 real changes made)
(2,083 real changes made)
(2,758 real changes made)
(26,890 missing values generated)
(2,208 real changes made)
(2,083 real changes made)
(4,291 real changes made)
(24,132 real changes made)
(22,599 missing values generated)
(4,291 real changes made)
(2,208 real changes made)
(3,403 real changes made, 3,403 to missing)
(22,620 missing values generated)
(26,890 missing values generated)
(2,187 real changes made)
(2,083 real changes made)
(2,187 real changes made)
(2,083 real changes made)
(2,704 real changes made)
(26,890 missing values generated)
(2,187 real changes made)
(2,083 real changes made)
(4,270 real changes made)
(24,186 real changes made)
(22,620 missing values generated)
(4,270 real changes made)
(2,187 real changes made)
(3,431 real changes made, 3,431 to missing)
(22,648 missing values generated)
(26,890 missing values generated)
(2,190 real changes made)
(2,052 real changes made)
(2,190 real changes made)
(2,052 real changes made)
(2,725 real changes made)
(26,890 missing values generated)
(2,190 real changes made)
(2,052 real changes made)
(4,242 real changes made)
(24,165 real changes made)
(22,648 missing values generated)
(4,242 real changes made)
(2,190 real changes made)
(3,398 real changes made, 3,398 to missing)
(22,615 missing values generated)
(26,890 missing values generated)
(2,236 real changes made)
(2,039 real changes made)
(2,236 real changes made)
(2,039 real changes made)
(2,701 real changes made)
(26,890 missing values generated)
(2,236 real changes made)
(2,039 real changes made)
(4,275 real changes made)
(24,189 real changes made)
(22,615 missing values generated)
(4,275 real changes made)
(2,236 real changes made)
(3,387 real changes made, 3,387 to missing)
(22,604 missing values generated)
(26,890 missing values generated)
(2,221 real changes made)
(2,065 real changes made)
(2,221 real changes made)
(2,065 real changes made)
(2,724 real changes made)
(26,890 missing values generated)
(2,221 real changes made)
(2,065 real changes made)
(4,286 real changes made)
(24,166 real changes made)
(22,604 missing values generated)
(4,286 real changes made)
(2,221 real changes made)
(3,407 real changes made, 3,407 to missing)
(22,624 missing values generated)
(26,890 missing values generated)
(2,168 real changes made)
(2,098 real changes made)
(2,168 real changes made)
(2,098 real changes made)
(2,733 real changes made)
(26,890 missing values generated)
(2,168 real changes made)
(2,098 real changes made)
(4,266 real changes made)
(24,157 real changes made)
(22,624 missing values generated)
(4,266 real changes made)
(2,168 real changes made)
(3,386 real changes made, 3,386 to missing)
(22,603 missing values generated)
(26,890 missing values generated)
(2,181 real changes made)
(2,106 real changes made)
(2,181 real changes made)
(2,106 real changes made)
(2,741 real changes made)
(26,890 missing values generated)
(2,181 real changes made)
(2,106 real changes made)
(4,287 real changes made)
(24,149 real changes made)
(22,603 missing values generated)
(4,287 real changes made)
(2,181 real changes made)
(3,410 real changes made, 3,410 to missing)
(22,627 missing values generated)
(26,890 missing values generated)
(2,179 real changes made)
(2,084 real changes made)
(2,179 real changes made)
(2,084 real changes made)
(2,728 real changes made)
(26,890 missing values generated)
(2,179 real changes made)
(2,084 real changes made)
(4,263 real changes made)
(24,162 real changes made)
(22,627 missing values generated)
(4,263 real changes made)
(2,179 real changes made)
(3,376 real changes made, 3,376 to missing)
(22,593 missing values generated)
(26,890 missing values generated)
(2,226 real changes made)
(2,071 real changes made)
(2,226 real changes made)
(2,071 real changes made)
(2,751 real changes made)
(26,890 missing values generated)
(2,226 real changes made)
(2,071 real changes made)
(4,297 real changes made)
(24,139 real changes made)
(22,593 missing values generated)
(4,297 real changes made)
(2,226 real changes made)
(3,405 real changes made, 3,405 to missing)
(22,622 missing values generated)
(26,890 missing values generated)
(2,205 real changes made)
(2,063 real changes made)
(2,205 real changes made)
(2,063 real changes made)
(2,677 real changes made)
(26,890 missing values generated)
(2,205 real changes made)
(2,063 real changes made)
(4,268 real changes made)
(24,213 real changes made)
(22,622 missing values generated)
(4,268 real changes made)
(2,205 real changes made)
(3,352 real changes made, 3,352 to missing)
(22,569 missing values generated)
(26,890 missing values generated)
(2,245 real changes made)
(2,076 real changes made)
(2,245 real changes made)
(2,076 real changes made)
(2,798 real changes made)
(26,890 missing values generated)
(2,245 real changes made)
(2,076 real changes made)
(4,321 real changes made)
(24,092 real changes made)
(22,569 missing values generated)
(4,321 real changes made)
(2,245 real changes made)
(3,361 real changes made, 3,361 to missing)
(22,578 missing values generated)
(26,890 missing values generated)
(2,217 real changes made)
(2,095 real changes made)
(2,217 real changes made)
(2,095 real changes made)
(2,711 real changes made)
(26,890 missing values generated)
(2,217 real changes made)
(2,095 real changes made)
(4,312 real changes made)
(24,179 real changes made)
(22,578 missing values generated)
(4,312 real changes made)
(2,217 real changes made)
(3,347 real changes made, 3,347 to missing)
(22,564 missing values generated)
(26,890 missing values generated)
(2,231 real changes made)
(2,095 real changes made)
(2,231 real changes made)
(2,095 real changes made)
(2,703 real changes made)
(26,890 missing values generated)
(2,231 real changes made)
(2,095 real changes made)
(4,326 real changes made)
(24,187 real changes made)
(22,564 missing values generated)
(4,326 real changes made)
(2,231 real changes made)
(3,399 real changes made, 3,399 to missing)
(22,616 missing values generated)
(26,890 missing values generated)
(2,234 real changes made)
(2,040 real changes made)
(2,234 real changes made)
(2,040 real changes made)
(2,686 real changes made)
(26,890 missing values generated)
(2,234 real changes made)
(2,040 real changes made)
(4,274 real changes made)
(24,204 real changes made)
(22,616 missing values generated)
(4,274 real changes made)
(2,234 real changes made)
(3,399 real changes made, 3,399 to missing)
(22,616 missing values generated)
(26,890 missing values generated)
(2,200 real changes made)
(2,074 real changes made)
(2,200 real changes made)
(2,074 real changes made)
(2,736 real changes made)
(26,890 missing values generated)
(2,200 real changes made)
(2,074 real changes made)
(4,274 real changes made)
(24,154 real changes made)
(22,616 missing values generated)
(4,274 real changes made)
(2,200 real changes made)
(3,351 real changes made, 3,351 to missing)
(22,568 missing values generated)
(26,890 missing values generated)
(2,209 real changes made)
(2,113 real changes made)
(2,209 real changes made)
(2,113 real changes made)
(2,770 real changes made)
(26,890 missing values generated)
(2,209 real changes made)
(2,113 real changes made)
(4,322 real changes made)
(24,120 real changes made)
(22,568 missing values generated)
(4,322 real changes made)
(2,209 real changes made)
(3,464 real changes made, 3,464 to missing)
(22,681 missing values generated)
(26,890 missing values generated)
(2,149 real changes made)
(2,060 real changes made)
(2,149 real changes made)
(2,060 real changes made)
(2,680 real changes made)
(26,890 missing values generated)
(2,149 real changes made)
(2,060 real changes made)
(4,209 real changes made)
(24,210 real changes made)
(22,681 missing values generated)
(4,209 real changes made)
(2,149 real changes made)
(3,370 real changes made, 3,370 to missing)
(22,587 missing values generated)
(26,890 missing values generated)
(2,237 real changes made)
(2,066 real changes made)
(2,237 real changes made)
(2,066 real changes made)
(2,709 real changes made)
(26,890 missing values generated)
(2,237 real changes made)
(2,066 real changes made)
(4,303 real changes made)
(24,181 real changes made)
(22,587 missing values generated)
(4,303 real changes made)
(2,237 real changes made)
(3,350 real changes made, 3,350 to missing)
(22,567 missing values generated)
(26,890 missing values generated)
(2,230 real changes made)
(2,093 real changes made)
(2,230 real changes made)
(2,093 real changes made)
(2,804 real changes made)
(26,890 missing values generated)
(2,230 real changes made)
(2,093 real changes made)
(4,323 real changes made)
(24,086 real changes made)
(22,567 missing values generated)
(4,323 real changes made)
(2,230 real changes made)
(3,367 real changes made, 3,367 to missing)
(22,584 missing values generated)
(26,890 missing values generated)
(2,233 real changes made)
(2,073 real changes made)
(2,233 real changes made)
(2,073 real changes made)
(2,751 real changes made)
(26,890 missing values generated)
(2,233 real changes made)
(2,073 real changes made)
(4,306 real changes made)
(24,139 real changes made)
(22,584 missing values generated)
(4,306 real changes made)
(2,233 real changes made)
(3,362 real changes made, 3,362 to missing)
(22,579 missing values generated)
(26,890 missing values generated)
(2,175 real changes made)
(2,136 real changes made)
(2,175 real changes made)
(2,136 real changes made)
(2,716 real changes made)
(26,890 missing values generated)
(2,175 real changes made)
(2,136 real changes made)
(4,311 real changes made)
(24,174 real changes made)
(22,579 missing values generated)
(4,311 real changes made)
(2,175 real changes made)
(3,343 real changes made, 3,343 to missing)
(22,560 missing values generated)
(26,890 missing values generated)
(2,235 real changes made)
(2,095 real changes made)
(2,235 real changes made)
(2,095 real changes made)
(2,677 real changes made)
(26,890 missing values generated)
(2,235 real changes made)
(2,095 real changes made)
(4,330 real changes made)
(24,213 real changes made)
(22,560 missing values generated)
(4,330 real changes made)
(2,235 real changes made)

. 
. replace index_date = index_date_28
(26,890 real changes made)

. drop index_date_28

. gen egfr15_date=.
(26,890 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022 nov2022 dec2022 jan2023"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatinine_`x'<15 & date("01`x'", "DMY")>index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen index_date_esrd = index_date

. gen esrd_date = egfr15_date
(26,890 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if esrd_date==.
(2,599 real changes made)

. gen esrd = 0

. replace esrd = 1 if esrd_date!=.
(2,599 real changes made)

. label var esrd "Kidney failure"

. gen esrd_time = (esrd_date - index_date_esrd)
(24,291 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(24,291 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/973=8       ///
>                                                 974/max=9
(2,593 changes made to esrd_time_cat)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"                      ///
>                                                         3 "1 to 28 days"        ///
>                                                         4 "20 to 90 days"       ///
>                                                         5 "91 to 180 days"      ///
>                                                         6 "181 to 365 days"     ///
>                                                         7 "366 to 730 days"     ///
>                                                         8 "731 to 973 days"     ///
>                                                         9 ">973 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 covid_severity  ///
>                                                                 covid_aki               {
  2.                                                                 by `exposure',sort: sum esrd_time, de
  3.                                                                 tab esrd_time_cat `exposure', m col chi
  4.                                                                 }

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%           35              1       Obs               1,883
25%          137              1       Sum of wgt.       1,883

50%          337                      Mean            369.743
                        Largest       Std. dev.      268.9982
75%          568           1031
90%          765           1045       Variance       72360.04
95%          864           1045       Skewness       .4539072
99%          978           1049       Kurtosis       2.224587

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> case = SARS-CoV-2

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            5              1
10%           36              1       Obs                 716
25%        137.5              1       Sum of wgt.         716

50%        324.5                      Mean           361.7472
                        Largest       Std. dev.      260.1135
75%        559.5           1003
90%          732           1008       Variance       67659.04
95%          826           1011       Skewness       .4235894
99%          965           1020       Kurtosis       2.194771


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |         case
  esrd_time_cat | Historica  SARS-CoV- |     Total
----------------+----------------------+----------
   1 to 28 days |       169         58 |       227 
                |      0.88       0.76 |      0.84 
----------------+----------------------+----------
  20 to 90 days |       183         75 |       258 
                |      0.95       0.98 |      0.96 
----------------+----------------------+----------
 91 to 180 days |       218         88 |       306 
                |      1.13       1.15 |      1.14 
----------------+----------------------+----------
181 to 365 days |       439        169 |       608 
                |      2.28       2.20 |      2.26 
----------------+----------------------+----------
366 to 730 days |       648        254 |       902 
                |      3.37       3.31 |      3.35 
----------------+----------------------+----------
731 to 973 days |       203         66 |       269 
                |      1.06       0.86 |      1.00 
----------------+----------------------+----------
      >973 days |        23          6 |        29 
                |      0.12       0.08 |      0.11 
----------------+----------------------+----------
              . |    17,334      6,957 |    24,291 
                |     90.20      90.67 |     90.33 
----------------+----------------------+----------
          Total |    19,217      7,673 |    26,890 
                |    100.00     100.00 |    100.00 

          Pearson chi2(7) =   4.3777   Pr = 0.735

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%           35              1       Obs               1,883
25%          137              1       Sum of wgt.       1,883

50%          337                      Mean            369.743
                        Largest       Std. dev.      268.9982
75%          568           1031
90%          765           1045       Variance       72360.04
95%          864           1045       Skewness       .4539072
99%          978           1049       Kurtosis       2.224587

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%           31              1       Obs                 562
25%          135              1       Sum of wgt.         562

50%        308.5                      Mean           356.4591
                        Largest       Std. dev.      264.6773
75%          554            990
90%          747           1003       Variance       70054.05
95%          846           1008       Skewness       .4899068
99%          973           1011       Kurtosis       2.231234

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           50              1       Obs                  65
25%          144              1       Sum of wgt.          65

50%          349                      Mean           359.1231
                        Largest       Std. dev.      244.5112
75%          536            769
90%          703            799       Variance       59785.73
95%          769            805       Skewness       .3676812
99%         1020           1020       Kurtosis       2.338742

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_severity = Critical care COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           31              4
10%           57             19       Obs                  89
25%          201             29       Sum of wgt.          89

50%          418                      Mean           397.0562
                        Largest       Std. dev.      241.2676
75%          573            800
90%          733            825       Variance       58210.03
95%          763            831       Skewness        .000672
99%          903            903       Kurtosis       1.970096


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |             SARS-CoV-2 severity
  esrd_time_cat | Historica  Non-hospi  Hospitali  Critical  |     Total
----------------+--------------------------------------------+----------
   1 to 28 days |       169         51          4          3 |       227 
                |      0.88       0.82       0.59       0.40 |      0.84 
----------------+--------------------------------------------+----------
  20 to 90 days |       183         55          6         14 |       258 
                |      0.95       0.88       0.88       1.86 |      0.96 
----------------+--------------------------------------------+----------
 91 to 180 days |       218         74         10          4 |       306 
                |      1.13       1.19       1.47       0.53 |      1.14 
----------------+--------------------------------------------+----------
181 to 365 days |       439        136         14         19 |       608 
                |      2.28       2.18       2.06       2.52 |      2.26 
----------------+--------------------------------------------+----------
366 to 730 days |       648        188         26         40 |       902 
                |      3.37       3.01       3.82       5.31 |      3.35 
----------------+--------------------------------------------+----------
731 to 973 days |       203         53          4          9 |       269 
                |      1.06       0.85       0.59       1.20 |      1.00 
----------------+--------------------------------------------+----------
      >973 days |        23          5          1          0 |        29 
                |      0.12       0.08       0.15       0.00 |      0.11 
----------------+--------------------------------------------+----------
              . |    17,334      5,677        616        664 |    24,291 
                |     90.20      90.99      90.46      88.18 |     90.33 
----------------+--------------------------------------------+----------
          Total |    19,217      6,239        681        753 |    26,890 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(21) =  30.2617   Pr = 0.087

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Historical comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            3              1
10%           35              1       Obs               1,883
25%          137              1       Sum of wgt.       1,883

50%          337                      Mean            369.743
                        Largest       Std. dev.      268.9982
75%          568           1031
90%          765           1045       Variance       72360.04
95%          864           1045       Skewness       .4539072
99%          978           1049       Kurtosis       2.224587

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            6              1
10%           39              1       Obs                 597
25%          141              1       Sum of wgt.         597

50%          316                      Mean           362.4271
                        Largest       Std. dev.      261.5352
75%          558            990
90%          740           1003       Variance       68400.66
95%          845           1008       Skewness       .4557438
99%          973           1011       Kurtosis       2.215354

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           60              1       Obs                  70
25%          144              1       Sum of wgt.          70

50%          339                      Mean           358.1857
                        Largest       Std. dev.      243.8507
75%          557            769
90%          708            799       Variance       59463.17
95%          769            825       Skewness       .3965451
99%         1020           1020       Kurtosis       2.344285

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID-AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           18              1       Obs                  49
25%           61              1       Sum of wgt.          49

50%          398                      Mean            358.551
                        Largest       Std. dev.      270.2158
75%          570            771
90%          759            799       Variance       73016.59
95%          799            805       Skewness       .0765739
99%          893            893       Kurtosis       1.737001


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                |        COVID-19 acute kidney injury
  esrd_time_cat | Historica  Non-hospi  Hospitali  Hospitali |     Total
----------------+--------------------------------------------+----------
   1 to 28 days |       169         49          4          5 |       227 
                |      0.88       0.75       0.55       1.31 |      0.84 
----------------+--------------------------------------------+----------
  20 to 90 days |       183         58          7         10 |       258 
                |      0.95       0.88       0.97       2.62 |      0.96 
----------------+--------------------------------------------+----------
 91 to 180 days |       218         75         10          3 |       306 
                |      1.13       1.14       1.39       0.79 |      1.14 
----------------+--------------------------------------------+----------
181 to 365 days |       439        147         17          5 |       608 
                |      2.28       2.24       2.36       1.31 |      2.26 
----------------+--------------------------------------------+----------
366 to 730 days |       648        207         26         21 |       902 
                |      3.37       3.15       3.61       5.50 |      3.35 
----------------+--------------------------------------------+----------
731 to 973 days |       203         56          5          5 |       269 
                |      1.06       0.85       0.69       1.31 |      1.00 
----------------+--------------------------------------------+----------
      >973 days |        23          5          1          0 |        29 
                |      0.12       0.08       0.14       0.00 |      0.11 
----------------+--------------------------------------------+----------
              . |    17,334      5,973        651        333 |    24,291 
                |     90.20      90.91      90.29      87.17 |     90.33 
----------------+--------------------------------------------+----------
          Total |    19,217      6,570        721        382 |    26,890 
                |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(21) =  27.8518   Pr = 0.144

. gen exit_date_esrd = esrd_date
(24,291 missing values generated)

. format exit_date_esrd %td

. gen end_date = date("2023-01-31", "YMD") if case==1
(19,217 missing values generated)

. replace end_date = date("2020-01-31", "YMD") if case==0
(19,217 real changes made)

. format end_date %td

. replace exit_date_esrd = min(deregistered_date, death_date, end_date) if esrd_date==.
(24,291 real changes made)

. gen esrd_denominator = 1

. gen follow_up_time_esrd = (exit_date_esrd - index_date_esrd)

. label var follow_up_time_esrd "Follow-up time (Days)"

. gen follow_up_cat_esrd = follow_up_time_esrd

. recode follow_up_cat_esrd       min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0=3                     ///
>                                                 1/365=4         ///
>                                                 366/730=5       ///
>                                                 731/1040=6      ///                                     
>                                                 1041/max=7
(26,870 changes made to follow_up_cat_esrd)

. label define follow_up_cat_esrd         1 "<-29 days"   ///
>                                                         2 "-28 to -1 days"              ///
>                                                         3 "0 days"                              ///
>                                                         4 "1 to 365 days"               ///
>                                                         5 "366 to 730 days"     ///
>                                                         6 "731 to 1040 days"    ///
>                                                         7 ">1040 days"

. label values follow_up_cat_esrd follow_up_cat_esrd

. label var follow_up_cat_esrd "Follow_up time"

. tab case follow_up_cat_esrd

                      |                          Follow_up time
                 case | -28 to -1     0 days  1 to 365   366 to 73  731 to 10  >1040 day |     Total
----------------------+------------------------------------------------------------------+----------
Historical comparator |       115          3      4,195      6,202      7,968        734 |    19,217 
           SARS-CoV-2 |        56          2      1,703      2,565      3,070        277 |     7,673 
----------------------+------------------------------------------------------------------+----------
                Total |       171          5      5,898      8,767     11,038      1,011 |    26,890 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |                          Follow_up time
  replacement therapy | -28 to -1     0 days  1 to 365   366 to 73  731 to 10  >1040 day |     Total
----------------------+------------------------------------------------------------------+----------
Historical comparator |       115          3      4,195      6,202      7,968        734 |    19,217 
Non-hospitalised SARS |        47          1      1,408      2,050      2,508        221 |     6,235 
No KRT hospitalised C |         3          0        143        245        256         27 |       674 
KRT hospitalised COVI |         6          1        152        270        306         29 |       764 
----------------------+------------------------------------------------------------------+----------
                Total |       171          5      5,898      8,767     11,038      1,011 |    26,890 

. drop if follow_up_time_esrd<1
(176 observations deleted)

. drop if follow_up_time_esrd>1040
(1,011 observations deleted)

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,195      6,202      7,968 |    18,365 
           SARS-CoV-2 |     1,703      2,565      3,070 |     7,338 
----------------------+---------------------------------+----------
                Total |     5,898      8,767     11,038 |    25,703 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |          Follow_up time
  replacement therapy | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Historical comparator |     4,195      6,202      7,968 |    18,365 
Non-hospitalised SARS |     1,408      2,050      2,508 |     5,966 
No KRT hospitalised C |       143        245        256 |       644 
KRT hospitalised COVI |       152        270        306 |       728 
----------------------+---------------------------------+----------
                Total |     5,898      8,767     11,038 |    25,703 

. gen follow_up_years_esrd = follow_up_time_esrd/365.25

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(25,703 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 
> jul2019 aug2019 sep2019 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 ju
> n2022 jul2022 aug2022 sep2022 oct2022 nov2022 dec2022 jan2023"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_half_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>index_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(19 real changes made)
(41 real changes made)
(82 real changes made)
(102 real changes made)
(132 real changes made)
(157 real changes made)
(162 real changes made)
(167 real changes made)
(171 real changes made)
(168 real changes made)
(179 real changes made)
(174 real changes made)
(173 real changes made)
(182 real changes made)
(186 real changes made)
(171 real changes made)
(172 real changes made)
(161 real changes made)
(147 real changes made)
(171 real changes made)
(147 real changes made)
(145 real changes made)
(141 real changes made)
(124 real changes made)
(155 real changes made)
(147 real changes made)
(129 real changes made)
(101 real changes made)
(103 real changes made)
(99 real changes made)
(0 real changes made)
(0 real changes made)
(6 real changes made)
(21 real changes made)
(31 real changes made)
(35 real changes made)
(52 real changes made)
(55 real changes made)
(61 real changes made)
(62 real changes made)
(53 real changes made)
(71 real changes made)
(63 real changes made)
(63 real changes made)
(78 real changes made)
(60 real changes made)
(59 real changes made)
(51 real changes made)
(54 real changes made)
(72 real changes made)
(66 real changes made)
(63 real changes made)
(66 real changes made)
(82 real changes made)
(62 real changes made)
(53 real changes made)
(48 real changes made)
(51 real changes made)
(45 real changes made)
(59 real changes made)
(42 real changes made)
(33 real changes made)
(45 real changes made)
(46 real changes made)
(44 real changes made)
(43 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(1,881 real changes made)

. gen egfr_half = 0

. replace egfr_half = 1 if egfr_half_date!=.
(7,884 real changes made)

. label var egfr_half "50% reduction in eGFR"

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(11,544 real changes made, 11,544 to missing)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(17,819 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date) if egfr_half_date==. & index_date_egfr_half!=.
(7,347 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(11,544 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days)"

. gen egfr_half_denominator = 0

. replace egfr_half_denominator = 1 if index_date_egfr_half!=.
(14,159 real changes made)

. gen follow_up_years_egfr_half = follow_up_time_egfr_half/365.25
(11,544 missing values generated)

. 
. * AKI (or ESRD)
. gen index_date_aki = index_date

. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(23,194 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(2,328 real changes made)

. gen aki = 0

. replace aki = 1 if aki_date!=.
(4,837 real changes made)

. label var aki "Acute kidney injury"

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(20,866 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date)  if aki_date==.
(20,866 real changes made)

. gen aki_denominator = 1

. gen follow_up_time_aki = (exit_date_aki - index_date_aki)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. gen follow_up_years_aki = follow_up_time_aki/365.25

. 
. * Exit date (death)
. gen index_date_death = index_date

. gen exit_date_death = death_date
(24,126 missing values generated)

. gen death = 0

. replace death = 1 if death_date!=.
(1,577 real changes made)

. label var death "Death"

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(24,126 real changes made)

. gen death_denominator = 1

. gen follow_up_time_death = (exit_date_death - index_date_death)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. gen follow_up_years_death = follow_up_time_death/365.25

. 
. *ESRD by time period (i.e. including 0-1 days (because if ESRD before index date, this was set to index_date + 1))
. *0-1 days
. gen esrd_date1 = esrd_date if esrd_date < (index_date_esrd + 2)
(25,581 missing values generated)

. gen exit_date1_esrd = esrd_date1
(25,581 missing values generated)

. gen index_date1_esrd = index_date_esrd

. format exit_date1_esrd %td

. replace exit_date1_esrd = min(deregistered_date, death_date, end_date, index_date_esrd) if esrd_date1==.
(25,581 real changes made)

. *stset exit_date1_esrd, fail(esrd_date1) origin(index_date1_esrd) id(unique) scale(365.25)
. *2-29 days
. gen esrd_date29 = esrd_date if esrd_date < (index_date_esrd + 30) 
(25,471 missing values generated)

. gen exit_date29_esrd = esrd_date29
(25,471 missing values generated)

. gen index_date29_esrd = index_date_esrd + 2

. format exit_date29_esrd %td

. replace exit_date29_esrd = min(deregistered_date, death_date, end_date, (index_date_esrd + 29)) if esrd_date29==.
(25,471 real changes made)

. *stset exit_date29_esrd, fail(esrd_date29) origin(index_date29_esrd) id(unique) scale(365.25)
. *30-89 days
. gen esrd_date89 = esrd_date if esrd_date < (index_date_esrd + 90) 
(25,220 missing values generated)

. gen exit_date89_esrd = esrd_date89
(25,220 missing values generated)

. gen index_date89_esrd = index_date_esrd + 30

. format exit_date89_esrd %td

. replace exit_date89_esrd = min(deregistered_date, death_date, end_date, (index_date_esrd + 89)) if esrd_date89==.
(25,220 real changes made)

. *stset exit_date89_esrd, fail(esrd_date89) origin(index_date89_esrd) id(unique) scale(365.25)
. *90-179 days
. gen esrd_date179 = esrd_date if esrd_date < (index_date_esrd + 180) 
(24,915 missing values generated)

. gen exit_date179_esrd = esrd_date179
(24,915 missing values generated)

. gen index_date179_esrd = index_date_esrd + 90

. format exit_date179_esrd %td

. replace exit_date179_esrd = min(deregistered_date, death_date, end_date, (index_date_esrd + 179)) if esrd_date179==.
(24,915 real changes made)

. *stset exit_date179_esrd, fail(esrd_date179) origin(index_date179_esrd) id(unique) scale(365.25)
. *180+ days
. gen index_datemax_esrd = index_date_esrd + 180

. gen exit_datemax_esrd = exit_date_esrd

. gen esrd_datemax = esrd_date
(23,107 missing values generated)

. *stset exit_date_esrd, fail(esrd_date) origin(index_datemax_esrd) id(unique) scale(365.25)
. 
. *Secondary outcomes by time period
. local outcome "egfr_half aki death"

. foreach out of local outcome {
  2. *0-29 days
. gen `out'_date29 = `out'_date if `out'_date < (index_date_`out' + 30) 
  3. gen exit_date29_`out' = `out'_date29
  4. gen index_date29_`out' = index_date_`out'
  5. format exit_date29_`out' %td
  6. replace exit_date29_`out' = min(deregistered_date, death_date, end_date, (index_date_`out' + 29)) if `out'_date29==.
  7. *stset exit_date29_`out', fail(`out'_date29) origin(index_date29_`out') id(unique) scale(365.25)
. *30-89 days
. gen `out'_date89 = `out'_date if `out'_date < (index_date_`out' + 90) 
  8. gen exit_date89_`out' = `out'_date89
  9. gen index_date89_`out' = index_date_`out' + 30
 10. format exit_date89_`out' %td
 11. replace exit_date89_`out' = min(deregistered_date, death_date, end_date, (index_date_`out' + 89)) if `out'_date89==.
 12. *stset exit_date89_`out', fail(`out'_date89) origin(index_date89_`out') id(unique) scale(365.25)
. *90-179 days
. gen `out'_date179 = `out'_date if `out'_date < (index_date_`out' + 180) 
 13. gen exit_date179_`out' = `out'_date179
 14. gen index_date179_`out' = index_date_`out' + 90
 15. format exit_date179_`out' %td
 16. replace exit_date179_`out' = min(deregistered_date, death_date, end_date, (index_date_`out' + 179)) if `out'_date179==.
 17. *stset exit_date179_`out', fail(`out'_date179) origin(index_date179_`out') id(unique) scale(365.25)
. *180+ days
. gen index_datemax_`out' = index_date_`out' + 180
 18. gen exit_datemax_`out' = exit_date_`out'
 19. gen `out'_datemax = `out'_date
 20. *stset exit_date_`out', fail(`out'_date) origin(index_datemax_`out') id(unique) scale(365.25)
. }       
(24,108 missing values generated)
(24,108 missing values generated)
(11,544 missing values generated)
(24,108 real changes made)
(22,640 missing values generated)
(22,640 missing values generated)
(11,544 missing values generated)
(22,640 real changes made)
(21,191 missing values generated)
(21,191 missing values generated)
(11,544 missing values generated)
(21,191 real changes made)
(11,544 missing values generated)
(10,472 missing values generated)
(17,819 missing values generated)
(24,578 missing values generated)
(24,578 missing values generated)
(24,578 real changes made)
(24,201 missing values generated)
(24,201 missing values generated)
(24,201 real changes made)
(23,715 missing values generated)
(23,715 missing values generated)
(23,715 real changes made)
(20,866 missing values generated)
(25,643 missing values generated)
(25,643 missing values generated)
(25,643 real changes made)
(25,499 missing values generated)
(25,499 missing values generated)
(25,499 real changes made)
(25,305 missing values generated)
(25,305 missing values generated)
(25,305 real changes made)
(24,126 missing values generated)

.         
. /*stset exit_date_esrd, fail(esrd_date) origin(index_date_esrd) id(unique) scale(365.25)
> tab _st follow_up_cat_esrd
> 
> foreach outcome of varlist esrd egfr_half aki death {
>         stset exit_date_`outcome', fail(`outcome'_date) origin(index_date_`outcome') id(unique) scale(365.25)
>         bysort case: egen total_follow_up_`outcome' = total(_t)
>         forvalues i=0/1 {
>         di "Denominator case=`i' `outcome':"
>         count if case==`i' & `outcome'_denominator==1
>         local denominator = r(N)
>         di "Denominator(_st=1) case=`i' `outcome':"
>         count if case==`i' & `outcome'_denominator==1 & _st==1
>         local st_denominator = r(N)
>         di "Events case=`i' `outcome':"
>         count if case==`i' & `outcome'==1
>         local event = r(N)
>         di "Events (_st=1) case=`i' `outcome':"
>         count if case==`i' & `outcome'==1 & _st==1
>         local st_event = r(N)
>         di "Total follow_up case=`i' `outcome':"
>         su total_follow_up_`outcome' if case==`i'
>         local person_year = r(mean)
>         local rate = 100000*(`event'/`person_year')
>         di "Rate case=`i' `outcome':"
>         di `rate'
>         local st_rate = 100000*(`st_event'/`person_year')
>         di "Rate (_st=1) case=`i' `outcome':"
>         di `st_rate'
>         }
>         drop total_follow_up_`outcome'
> }*/
. 
. save ./output/analysis_2017.dta, replace
file ./output/analysis_2017.dta saved

. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/analysis_2017.log
  log type:  text
 closed on:   1 Sep 2023, 17:30:24
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
