-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/analysis_2020.log
  log type:  text
 opened on:  20 Apr 2024, 23:28:50

. 
. ** Analysis cohort selection
. capture noisily import delimited ./output/input_covid_matching.csv, clear
(55 vars, 50,000 obs)

. di "Potential COVID-19 cases extracted from OpenSAFELY:"
Potential COVID-19 cases extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/input_2020_matching.csv, clear
(20 vars, 50,000 obs)

. di "Potential contemporary comparators extracted from OpenSAFELY:"
Potential contemporary comparators extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/covid_matching_2020.csv, clear
(10 vars, 13,730 obs)

. di "Potential COVID-19 cases after application of exclusion criteria:"
Potential COVID-19 cases after application of exclusion criteria:

. safecount
  13,730

. capture noisily import delimited ./output/2020_matching.csv, clear
(8 vars, 28,833 obs)

. di "Potential contemporary comparators after application of exclusion criteri
> a:"
Potential contemporary comparators after application of exclusion criteria:

. safecount
  28,833

. * Import COVID-19 dataset comprising individuals matched with contemporary co
> mparators (limited matching variables only)        
. capture noisily import delimited ./output/input_combined_stps_covid_2020.csv,
>  clear
(13 vars, 12,972 obs)

. * Drop age & covid_diagnosis_date
. keep patient_id death_date date_deregistered stp krt_outcome_date male covid_
> date covid_month set_id case match_counts

. tempfile covid_2020_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `covid_2020_matched', replace
(note: file /tmp/St00016.000001 not found)
file /tmp/St00016.000001 saved

. * Number of matched COVID-19 cases
. count
  12,972

. * Import matched contemporary comparators (limited matching variables only)
. capture noisily import delimited ./output/input_combined_stps_matches_2020.cs
> v, clear
(11 vars, 18,081 obs)

. * Drop age
. * NB covid_date = date at which COVID case matched to a contemporary comparat
> or
. * covid_diagnosis_date = date at which contemporary comparator first diagnose
> d with COVID
. keep patient_id death_date date_deregistered stp krt_outcome_date male set_id
>  case covid_date covid_diagnosis_date

. tempfile 2020_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `2020_matched', replace
(note: file /tmp/St00016.000002 not found)
file /tmp/St00016.000002 saved

. * Number of matched contemporary comparators
. count
  18,081

. * Merge limited COVID-19 dataset with additional variables
. capture noisily import delimited ./output/input_covid_2020_additional.csv, cl
> ear
(117 vars, 12,972 obs)

. merge 1:1 patient_id using `covid_2020_matched'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            12,972  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile covid_2020_complete

. save `covid_2020_complete', replace
(note: file /tmp/St00016.000003 not found)
file /tmp/St00016.000003 saved

. di "Matched COVID-19 cases:"
Matched COVID-19 cases:

. safecount
  12,972

. * Merge limited contemporary comparator dataset with additional variables
. capture noisily import delimited ./output/input_2020_additional.csv, clear
(110 vars, 18,081 obs)

. merge 1:1 patient_id using `2020_matched'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            18,081  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile 2020_complete

. save `2020_complete', replace
(note: file /tmp/St00016.000004 not found)
file /tmp/St00016.000004 saved

. di "Matched contemporary comparators:"
Matched contemporary comparators:

. safecount
  18,081

. * Append matched COVID-19 cases and contemporary comparators
. append using `covid_2020_complete', force

. order patient_id set_id match_count case

. gsort set_id -case

. count if case==0
  18,081

. di "Matched COVID-19 cases and contemporary comparators:"
Matched COVID-19 cases and contemporary comparators:

. safecount
  31,053

. tab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,081       58.23       58.23
          1 |     12,972       41.77      100.00
------------+-----------------------------------
      Total |     31,053      100.00

. * Save list of matched COVID-19 cases
. preserve

.         keep if case==1
(18,081 observations deleted)

.         keep patient_id

.         tempfile covid_2020_matched_list

.         save `covid_2020_matched_list', replace
(note: file /tmp/St00016.000006 not found)
file /tmp/St00016.000006 saved

. restore

. * Generate list of unmatched COVID-19 cases
. preserve

.         capture noisily import delimited ./output/input_covid_matching.csv, c
> lear
(55 vars, 50,000 obs)

.         * For dummy data, should do nothing in the real data
.         duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

.         tempfile covid_prematching

.         save `covid_prematching', replace
(note: file /tmp/St00016.000008 not found)
file /tmp/St00016.000008 saved

.         use `covid_2020_matched_list', clear

.         merge 1:1 patient_id using `covid_prematching'

    Result                           # of obs.
    -----------------------------------------
    not matched                        60,220
        from master                    11,596  (_merge==1)
        from using                     48,624  (_merge==2)

    matched                             1,376  (_merge==3)
    -----------------------------------------

.         keep if _merge==2
(12,972 observations deleted)

.         safecount
  48,624

.         save output/covid_unmatched_2020.dta, replace
file output/covid_unmatched_2020.dta saved

.         di "Unmatched COVID-19 cases:"
Unmatched COVID-19 cases:

.         safecount
  48,624

. restore

. 
. **ID
. * Need to create unique identifiers as individuals may be in both covid_2020_
> matched and 2020_matched so will have the same patient_id
. gen unique = _n

. label var unique "Unique ID"

. 
. 
. ** Exclusions
. * Index of multiple deprivation missing
. * Ordered 1-5 from most deprived to least deprived
. label var imd "Index of multiple deprivation (IMD)"

. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. tab imd, m

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      1,554        5.00        5.00
 1 Most deprived |      5,810       18.71       23.71
               2 |      5,907       19.02       42.74
               3 |      5,899       19.00       61.73
               4 |      6,045       19.47       81.20
5 Least deprived |      5,838       18.80      100.00
-----------------+-----------------------------------
           Total |     31,053      100.00

. drop if imd==0
(1,554 observations deleted)

. safetab imd
0

        Index of |
        multiple |
     deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
 1 Most deprived |      5,810       19.70       19.70
               2 |      5,907       20.02       39.72
               3 |      5,899       20.00       59.72
               4 |      6,045       20.49       80.21
5 Least deprived |      5,838       19.79      100.00
-----------------+-----------------------------------
           Total |     29,499      100.00

. 
. * STP missing
. drop if stp==""
(0 observations deleted)

. bysort stp: gen stp1 = 1 if _n==1
(29,468 missing values generated)

. replace stp1 = sum(stp1)
(29,498 real changes made)

. drop stp

. rename stp1 stp

. label define stp        1 "1"   ///
>                                         2 "2"   ///
>                                         3 "3"   ///
>                                         4 "4"   ///
>                                         5 "5"   ///
>                                         6 "6"   ///
>                                         7 "7"   ///
>                                         8 "8"   ///
>                                         9 "9"   ///
>                                         10 "10" ///
>                                         11 "11" ///                          
>            
>                                         12 "12" ///
>                                         13 "13" ///
>                                         14 "14" ///
>                                         15 "15" ///
>                                         16 "16" ///
>                                         17 "17" ///
>                                         18 "18" ///
>                                         19 "19" ///
>                                         20 "20" ///
>                                         21 "21" ///                          
>            
>                                         22 "22" ///
>                                         23 "23" ///
>                                         24 "24" ///
>                                         25 "25" ///
>                                         26 "26" ///
>                                         27 "27" ///
>                                         28 "28" ///
>                                         29 "29" ///
>                                         30 "30" ///
>                                         31 "31" 

. label values stp stp

. label var stp "STP"

. safetab stp
0

        STP |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,020        3.46        3.46
          2 |        973        3.30        6.76
          3 |        933        3.16        9.92
          4 |        932        3.16       13.08
          5 |        981        3.33       16.40
          6 |        960        3.25       19.66
          7 |        934        3.17       22.82
          8 |        942        3.19       26.02
          9 |        938        3.18       29.20
         10 |        953        3.23       32.43
         11 |        954        3.23       35.66
         12 |        928        3.15       38.81
         13 |        946        3.21       42.01
         14 |        958        3.25       45.26
         15 |        951        3.22       48.49
         16 |        947        3.21       51.70
         17 |        944        3.20       54.90
         18 |        966        3.27       58.17
         19 |        970        3.29       61.46
         20 |        967        3.28       64.74
         21 |        909        3.08       67.82
         22 |        920        3.12       70.94
         23 |        939        3.18       74.12
         24 |        964        3.27       77.39
         25 |        964        3.27       80.66
         26 |        932        3.16       83.82
         27 |        957        3.24       87.06
         28 |        970        3.29       90.35
         29 |        948        3.21       93.56
         30 |        949        3.22       96.78
         31 |        950        3.22      100.00
------------+-----------------------------------
      Total |     29,499      100.00

. 
. * Region missing
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(26,628 missing values generated)

. replace region = 2 if region_string=="East"
(2,917 real changes made)

. replace region = 3 if region_string=="London"
(5,859 real changes made)

. replace region = 4 if region_string=="North East"
(2,983 real changes made)

. replace region = 5 if region_string=="North West"
(2,996 real changes made)

. replace region = 6 if region_string=="South East"
(2,920 real changes made)

. replace region = 7 if region_string=="South West"
(2,945 real changes made)

. replace region = 8 if region_string=="West Midlands"
(2,983 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(3,025 real changes made)

. replace region = 10 if region_string==""
(0 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            ///
>                                                 10 "Missing"

. label values region region

. label var region "Region"

. tab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      2,871        9.73        9.73
                    East |      2,917        9.89       19.62
                  London |      5,859       19.86       39.48
              North East |      2,983       10.11       49.59
              North West |      2,996       10.16       59.75
              South East |      2,920        9.90       69.65
              South West |      2,945        9.98       79.63
           West Midlands |      2,983       10.11       89.75
Yorkshire and The Humber |      3,025       10.25      100.00
-------------------------+-----------------------------------
                   Total |     29,499      100.00

. drop if region==10
(0 observations deleted)

. safetab region
0

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      2,871        9.73        9.73
                    East |      2,917        9.89       19.62
                  London |      5,859       19.86       39.48
              North East |      2,983       10.11       49.59
              North West |      2,996       10.16       59.75
              South East |      2,920        9.90       69.65
              South West |      2,945        9.98       79.63
           West Midlands |      2,983       10.11       89.75
Yorkshire and The Humber |      3,025       10.25      100.00
-------------------------+-----------------------------------
                   Total |     29,499      100.00

. 
. * Create new index date variable 28 days after case_index_date (i.e. to exclu
> de anyone who does not survive to start follow-up)
. gen index_date = date(case_index_date, "YMD")

. format index_date %td

. gen index_date_28 = index_date + 28

. format index_date_28 %td

. 
. * Create exit date for COVID amongst general population comparator
. gen covid_exit = date(covid_diagnosis_date, "YMD")
(21,977 missing values generated)

. format covid_exit %td

. replace covid_exit=. if case==1
(0 real changes made)

. drop if covid_exit < index_date_28 + 1
(347 observations deleted)

. gen comparator_covid = .
(29,152 missing values generated)

. replace comparator_covid = 0 if case==0
(16,805 real changes made)

. replace comparator_covid = 1 if covid_exit!=.
(7,175 real changes made)

. tab case comparator_covid, m

           |         comparator_covid
      case |         0          1          . |     Total
-----------+---------------------------------+----------
         0 |     9,630      7,175          0 |    16,805 
         1 |         0          0     12,347 |    12,347 
-----------+---------------------------------+----------
     Total |     9,630      7,175     12,347 |    29,152 

. 
. * Deregistered before index_date + 29 days
. gen deregistered_date = date(date_deregistered, "YMD")
(28,208 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date_28 + 1
(41 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_date = date(krt_outcome_date, "YMD")
(26,306 missing values generated)

. format krt_date %td

. drop krt_outcome_date

. drop if krt_date < index_date
(0 observations deleted)

. replace krt_date = index_date_28 + 1 if krt_date < index_date_28 + 1
(113 real changes made)

. 
. * Death before index_date + 29 days (i.e. only include people who survived 29
>  days after index_date)
. gen death_date1 = date(death_date, "YMD")
(27,456 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen deceased = 0

. replace deceased = 1 if death_date < index_date_28 + 1
(63 real changes made)

. label define deceased 0 "Alive at 28 days after index date" 1 "Deceased withi
> n 28 days of index date"

. label values deceased deceased

. tab case deceased

           |       deceased
      case | Alive at   Deceased  |     Total
-----------+----------------------+----------
         0 |    16,741         39 |    16,780 
         1 |    12,307         24 |    12,331 
-----------+----------------------+----------
     Total |    29,048         63 |    29,111 

. drop if deceased==1
(63 observations deleted)

. drop deceased

. 
. * eGFR <15 before index_date - should apply to matched contemporary comparato
> rs only
. gen index_year = yofd(index_date)

. gen age = index_year - year_of_birth

. *age>=18*
. drop if age<18|age==.
(0 observations deleted)

. gen sex = 1 if male == "Male"
(14,867 missing values generated)

. label var sex "Sex"

. replace sex = 0 if male == "Female"
(14,867 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_feb2020 /
> //
>                                                                              
>                    baseline_creatinine_mar2020 ///
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 ///
>                                                                              
>                    baseline_creatinine_oct2022 ///
>                                                                              
>                    baseline_creatinine_nov2022 ///
>                                                                              
>                    baseline_creatinine_dec2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if sex==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if sex==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if sex==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if sex==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if sex==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if sex==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if sex==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(12,769 real changes made, 12,769 to missing)
(12,769 missing values generated)
(29,048 missing values generated)
(8,351 real changes made)
(7,928 real changes made)
(8,351 real changes made)
(7,928 real changes made)
(10,327 real changes made)
(29,048 missing values generated)
(8,351 real changes made)
(7,928 real changes made)
(16,279 real changes made)
(18,721 real changes made)
(12,769 missing values generated)
(16,279 real changes made)
(8,351 real changes made)
(12,743 real changes made, 12,743 to missing)
(12,743 missing values generated)
(29,048 missing values generated)
(8,324 real changes made)
(7,981 real changes made)
(8,324 real changes made)
(7,981 real changes made)
(10,273 real changes made)
(29,048 missing values generated)
(8,324 real changes made)
(7,981 real changes made)
(16,305 real changes made)
(18,775 real changes made)
(12,743 missing values generated)
(16,305 real changes made)
(8,324 real changes made)
(12,879 real changes made, 12,879 to missing)
(12,879 missing values generated)
(29,048 missing values generated)
(8,255 real changes made)
(7,914 real changes made)
(8,255 real changes made)
(7,914 real changes made)
(10,219 real changes made)
(29,048 missing values generated)
(8,255 real changes made)
(7,914 real changes made)
(16,169 real changes made)
(18,829 real changes made)
(12,879 missing values generated)
(16,169 real changes made)
(8,255 real changes made)
(12,868 real changes made, 12,868 to missing)
(12,868 missing values generated)
(29,048 missing values generated)
(8,220 real changes made)
(7,960 real changes made)
(8,220 real changes made)
(7,960 real changes made)
(10,238 real changes made)
(29,048 missing values generated)
(8,220 real changes made)
(7,960 real changes made)
(16,180 real changes made)
(18,810 real changes made)
(12,868 missing values generated)
(16,180 real changes made)
(8,220 real changes made)
(12,823 real changes made, 12,823 to missing)
(12,823 missing values generated)
(29,048 missing values generated)
(8,305 real changes made)
(7,920 real changes made)
(8,305 real changes made)
(7,920 real changes made)
(10,266 real changes made)
(29,048 missing values generated)
(8,305 real changes made)
(7,920 real changes made)
(16,225 real changes made)
(18,782 real changes made)
(12,823 missing values generated)
(16,225 real changes made)
(8,305 real changes made)
(12,838 real changes made, 12,838 to missing)
(12,838 missing values generated)
(29,048 missing values generated)
(8,302 real changes made)
(7,908 real changes made)
(8,302 real changes made)
(7,908 real changes made)
(10,315 real changes made)
(29,048 missing values generated)
(8,302 real changes made)
(7,908 real changes made)
(16,210 real changes made)
(18,733 real changes made)
(12,838 missing values generated)
(16,210 real changes made)
(8,302 real changes made)
(12,864 real changes made, 12,864 to missing)
(12,864 missing values generated)
(29,048 missing values generated)
(8,366 real changes made)
(7,818 real changes made)
(8,366 real changes made)
(7,818 real changes made)
(10,195 real changes made)
(29,048 missing values generated)
(8,366 real changes made)
(7,818 real changes made)
(16,184 real changes made)
(18,853 real changes made)
(12,864 missing values generated)
(16,184 real changes made)
(8,366 real changes made)
(12,810 real changes made, 12,810 to missing)
(12,810 missing values generated)
(29,048 missing values generated)
(8,320 real changes made)
(7,918 real changes made)
(8,320 real changes made)
(7,918 real changes made)
(10,276 real changes made)
(29,048 missing values generated)
(8,320 real changes made)
(7,918 real changes made)
(16,238 real changes made)
(18,772 real changes made)
(12,810 missing values generated)
(16,238 real changes made)
(8,320 real changes made)
(12,806 real changes made, 12,806 to missing)
(12,806 missing values generated)
(29,048 missing values generated)
(8,294 real changes made)
(7,948 real changes made)
(8,294 real changes made)
(7,948 real changes made)
(10,279 real changes made)
(29,048 missing values generated)
(8,294 real changes made)
(7,948 real changes made)
(16,242 real changes made)
(18,769 real changes made)
(12,806 missing values generated)
(16,242 real changes made)
(8,294 real changes made)
(12,718 real changes made, 12,718 to missing)
(12,718 missing values generated)
(29,048 missing values generated)
(8,354 real changes made)
(7,976 real changes made)
(8,354 real changes made)
(7,976 real changes made)
(10,363 real changes made)
(29,048 missing values generated)
(8,354 real changes made)
(7,976 real changes made)
(16,330 real changes made)
(18,685 real changes made)
(12,718 missing values generated)
(16,330 real changes made)
(8,354 real changes made)
(12,825 real changes made, 12,825 to missing)
(12,825 missing values generated)
(29,048 missing values generated)
(8,363 real changes made)
(7,860 real changes made)
(8,363 real changes made)
(7,860 real changes made)
(10,421 real changes made)
(29,048 missing values generated)
(8,363 real changes made)
(7,860 real changes made)
(16,223 real changes made)
(18,627 real changes made)
(12,825 missing values generated)
(16,223 real changes made)
(8,363 real changes made)
(12,699 real changes made, 12,699 to missing)
(12,699 missing values generated)
(29,048 missing values generated)
(8,298 real changes made)
(8,051 real changes made)
(8,298 real changes made)
(8,051 real changes made)
(10,345 real changes made)
(29,048 missing values generated)
(8,298 real changes made)
(8,051 real changes made)
(16,349 real changes made)
(18,703 real changes made)
(12,699 missing values generated)
(16,349 real changes made)
(8,298 real changes made)
(12,776 real changes made, 12,776 to missing)
(12,776 missing values generated)
(29,048 missing values generated)
(8,342 real changes made)
(7,930 real changes made)
(8,342 real changes made)
(7,930 real changes made)
(10,403 real changes made)
(29,048 missing values generated)
(8,342 real changes made)
(7,930 real changes made)
(16,272 real changes made)
(18,645 real changes made)
(12,776 missing values generated)
(16,272 real changes made)
(8,342 real changes made)
(12,760 real changes made, 12,760 to missing)
(12,760 missing values generated)
(29,048 missing values generated)
(8,358 real changes made)
(7,930 real changes made)
(8,358 real changes made)
(7,930 real changes made)
(10,314 real changes made)
(29,048 missing values generated)
(8,358 real changes made)
(7,930 real changes made)
(16,288 real changes made)
(18,734 real changes made)
(12,760 missing values generated)
(16,288 real changes made)
(8,358 real changes made)
(12,795 real changes made, 12,795 to missing)
(12,795 missing values generated)
(29,048 missing values generated)
(8,263 real changes made)
(7,990 real changes made)
(8,263 real changes made)
(7,990 real changes made)
(10,332 real changes made)
(29,048 missing values generated)
(8,263 real changes made)
(7,990 real changes made)
(16,253 real changes made)
(18,716 real changes made)
(12,795 missing values generated)
(16,253 real changes made)
(8,263 real changes made)
(12,773 real changes made, 12,773 to missing)
(12,773 missing values generated)
(29,048 missing values generated)
(8,266 real changes made)
(8,009 real changes made)
(8,266 real changes made)
(8,009 real changes made)
(10,348 real changes made)
(29,048 missing values generated)
(8,266 real changes made)
(8,009 real changes made)
(16,275 real changes made)
(18,700 real changes made)
(12,773 missing values generated)
(16,275 real changes made)
(8,266 real changes made)
(12,768 real changes made, 12,768 to missing)
(12,768 missing values generated)
(29,048 missing values generated)
(8,260 real changes made)
(8,020 real changes made)
(8,260 real changes made)
(8,020 real changes made)
(10,196 real changes made)
(29,048 missing values generated)
(8,260 real changes made)
(8,020 real changes made)
(16,280 real changes made)
(18,852 real changes made)
(12,768 missing values generated)
(16,280 real changes made)
(8,260 real changes made)
(12,863 real changes made, 12,863 to missing)
(12,863 missing values generated)
(29,048 missing values generated)
(8,294 real changes made)
(7,891 real changes made)
(8,294 real changes made)
(7,891 real changes made)
(10,257 real changes made)
(29,048 missing values generated)
(8,294 real changes made)
(7,891 real changes made)
(16,185 real changes made)
(18,791 real changes made)
(12,863 missing values generated)
(16,185 real changes made)
(8,294 real changes made)
(12,859 real changes made, 12,859 to missing)
(12,859 missing values generated)
(29,048 missing values generated)
(8,251 real changes made)
(7,938 real changes made)
(8,251 real changes made)
(7,938 real changes made)
(10,211 real changes made)
(29,048 missing values generated)
(8,251 real changes made)
(7,938 real changes made)
(16,189 real changes made)
(18,837 real changes made)
(12,859 missing values generated)
(16,189 real changes made)
(8,251 real changes made)
(12,783 real changes made, 12,783 to missing)
(12,783 missing values generated)
(29,048 missing values generated)
(8,319 real changes made)
(7,946 real changes made)
(8,319 real changes made)
(7,946 real changes made)
(10,285 real changes made)
(29,048 missing values generated)
(8,319 real changes made)
(7,946 real changes made)
(16,265 real changes made)
(18,763 real changes made)
(12,783 missing values generated)
(16,265 real changes made)
(8,319 real changes made)
(12,774 real changes made, 12,774 to missing)
(12,774 missing values generated)
(29,048 missing values generated)
(8,372 real changes made)
(7,902 real changes made)
(8,372 real changes made)
(7,902 real changes made)
(10,309 real changes made)
(29,048 missing values generated)
(8,372 real changes made)
(7,902 real changes made)
(16,274 real changes made)
(18,739 real changes made)
(12,774 missing values generated)
(16,274 real changes made)
(8,372 real changes made)
(12,751 real changes made, 12,751 to missing)
(12,751 missing values generated)
(29,048 missing values generated)
(8,393 real changes made)
(7,904 real changes made)
(8,393 real changes made)
(7,904 real changes made)
(10,372 real changes made)
(29,048 missing values generated)
(8,393 real changes made)
(7,904 real changes made)
(16,297 real changes made)
(18,676 real changes made)
(12,751 missing values generated)
(16,297 real changes made)
(8,393 real changes made)
(12,838 real changes made, 12,838 to missing)
(12,838 missing values generated)
(29,048 missing values generated)
(8,288 real changes made)
(7,922 real changes made)
(8,288 real changes made)
(7,922 real changes made)
(10,243 real changes made)
(29,048 missing values generated)
(8,288 real changes made)
(7,922 real changes made)
(16,210 real changes made)
(18,805 real changes made)
(12,838 missing values generated)
(16,210 real changes made)
(8,288 real changes made)
(12,786 real changes made, 12,786 to missing)
(12,786 missing values generated)
(29,048 missing values generated)
(8,327 real changes made)
(7,935 real changes made)
(8,327 real changes made)
(7,935 real changes made)
(10,299 real changes made)
(29,048 missing values generated)
(8,327 real changes made)
(7,935 real changes made)
(16,262 real changes made)
(18,749 real changes made)
(12,786 missing values generated)
(16,262 real changes made)
(8,327 real changes made)
(12,708 real changes made, 12,708 to missing)
(12,708 missing values generated)
(29,048 missing values generated)
(8,337 real changes made)
(8,003 real changes made)
(8,337 real changes made)
(8,003 real changes made)
(10,367 real changes made)
(29,048 missing values generated)
(8,337 real changes made)
(8,003 real changes made)
(16,340 real changes made)
(18,681 real changes made)
(12,708 missing values generated)
(16,340 real changes made)
(8,337 real changes made)
(12,766 real changes made, 12,766 to missing)
(12,766 missing values generated)
(29,048 missing values generated)
(8,335 real changes made)
(7,947 real changes made)
(8,335 real changes made)
(7,947 real changes made)
(10,207 real changes made)
(29,048 missing values generated)
(8,335 real changes made)
(7,947 real changes made)
(16,282 real changes made)
(18,841 real changes made)
(12,766 missing values generated)
(16,282 real changes made)
(8,335 real changes made)
(12,793 real changes made, 12,793 to missing)
(12,793 missing values generated)
(29,048 missing values generated)
(8,315 real changes made)
(7,940 real changes made)
(8,315 real changes made)
(7,940 real changes made)
(10,212 real changes made)
(29,048 missing values generated)
(8,315 real changes made)
(7,940 real changes made)
(16,255 real changes made)
(18,836 real changes made)
(12,793 missing values generated)
(16,255 real changes made)
(8,315 real changes made)
(12,718 real changes made, 12,718 to missing)
(12,718 missing values generated)
(29,048 missing values generated)
(8,398 real changes made)
(7,932 real changes made)
(8,398 real changes made)
(7,932 real changes made)
(10,308 real changes made)
(29,048 missing values generated)
(8,398 real changes made)
(7,932 real changes made)
(16,330 real changes made)
(18,740 real changes made)
(12,718 missing values generated)
(16,330 real changes made)
(8,398 real changes made)
(12,757 real changes made, 12,757 to missing)
(12,757 missing values generated)
(29,048 missing values generated)
(8,258 real changes made)
(8,033 real changes made)
(8,258 real changes made)
(8,033 real changes made)
(10,360 real changes made)
(29,048 missing values generated)
(8,258 real changes made)
(8,033 real changes made)
(16,291 real changes made)
(18,688 real changes made)
(12,757 missing values generated)
(16,291 real changes made)
(8,258 real changes made)
(12,773 real changes made, 12,773 to missing)
(12,773 missing values generated)
(29,048 missing values generated)
(8,289 real changes made)
(7,986 real changes made)
(8,289 real changes made)
(7,986 real changes made)
(10,314 real changes made)
(29,048 missing values generated)
(8,289 real changes made)
(7,986 real changes made)
(16,275 real changes made)
(18,734 real changes made)
(12,773 missing values generated)
(16,275 real changes made)
(8,289 real changes made)
(12,721 real changes made, 12,721 to missing)
(12,721 missing values generated)
(29,048 missing values generated)
(8,311 real changes made)
(8,016 real changes made)
(8,311 real changes made)
(8,016 real changes made)
(10,260 real changes made)
(29,048 missing values generated)
(8,311 real changes made)
(8,016 real changes made)
(16,327 real changes made)
(18,788 real changes made)
(12,721 missing values generated)
(16,327 real changes made)
(8,311 real changes made)
(12,777 real changes made, 12,777 to missing)
(12,777 missing values generated)
(29,048 missing values generated)
(8,283 real changes made)
(7,988 real changes made)
(8,283 real changes made)
(7,988 real changes made)
(10,249 real changes made)
(29,048 missing values generated)
(8,283 real changes made)
(7,988 real changes made)
(16,271 real changes made)
(18,799 real changes made)
(12,777 missing values generated)
(16,271 real changes made)
(8,283 real changes made)
(12,817 real changes made, 12,817 to missing)
(12,817 missing values generated)
(29,048 missing values generated)
(8,348 real changes made)
(7,883 real changes made)
(8,348 real changes made)
(7,883 real changes made)
(10,306 real changes made)
(29,048 missing values generated)
(8,348 real changes made)
(7,883 real changes made)
(16,231 real changes made)
(18,742 real changes made)
(12,817 missing values generated)
(16,231 real changes made)
(8,348 real changes made)
(12,730 real changes made, 12,730 to missing)
(12,730 missing values generated)
(29,048 missing values generated)
(8,280 real changes made)
(8,038 real changes made)
(8,280 real changes made)
(8,038 real changes made)
(10,300 real changes made)
(29,048 missing values generated)
(8,280 real changes made)
(8,038 real changes made)
(16,318 real changes made)
(18,748 real changes made)
(12,730 missing values generated)
(16,318 real changes made)
(8,280 real changes made)
(12,846 real changes made, 12,846 to missing)
(12,846 missing values generated)
(29,048 missing values generated)
(8,346 real changes made)
(7,856 real changes made)
(8,346 real changes made)
(7,856 real changes made)
(10,422 real changes made)
(29,048 missing values generated)
(8,346 real changes made)
(7,856 real changes made)
(16,202 real changes made)
(18,626 real changes made)
(12,846 missing values generated)
(16,202 real changes made)
(8,346 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)

. gen baseline_egfr=.
(29,048 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr20
> 22 may2022 jun2022 jul2022 aug2022 sep2022 oct2022 nov2022 dec2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if index_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(859 real changes made)
(940 real changes made)
(911 real changes made)
(851 real changes made)
(837 real changes made)
(775 real changes made)
(737 real changes made)
(770 real changes made)
(627 real changes made)
(641 real changes made)
(641 real changes made)
(541 real changes made)
(468 real changes made)
(532 real changes made)
(421 real changes made)
(423 real changes made)
(394 real changes made)
(433 real changes made)
(373 real changes made)
(374 real changes made)
(353 real changes made)
(310 real changes made)
(329 real changes made)
(319 real changes made)
(249 real changes made)
(243 real changes made)
(257 real changes made)
(237 real changes made)
(208 real changes made)
(208 real changes made)
(227 real changes made)
(199 real changes made)
(185 real changes made)
(185 real changes made)
(161 real changes made)

. label var baseline_egfr "Baseline eGFR"

. gen baseline_esrd = 0

. replace baseline_esrd = 1 if baseline_egfr <15
(0 real changes made)

. label define baseline_esrd 0 "No ESRD" 1 "ESRD"

. label values baseline_esrd baseline_esrd

. tab case baseline_esrd

           | baseline_e
           |    srd
      case |   No ESRD |     Total
-----------+-----------+----------
         0 |    16,741 |    16,741 
         1 |    12,307 |    12,307 
-----------+-----------+----------
     Total |    29,048 |    29,048 

. drop if baseline_esrd==1
(0 observations deleted)

. drop baseline_esrd

. 
. * Drop COVID-19 cases without any matched contemporary comparators after furt
> her application of exclusion criteria
. generate match_counts1=.
(29,048 missing values generated)

. order patient_id set_id match_counts match_counts1

. bysort set_id: replace match_counts1=_N-1
(29048 real changes made)

. replace match_counts1=. if case==0
(16,741 real changes made, 16,741 to missing)

. drop match_counts

. rename match_counts1 match_counts

. count if match_counts==0
  5,553

. drop if match_counts==0
(5,553 observations deleted)

. safetab case
0

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,741       71.25       71.25
          1 |      6,754       28.75      100.00
------------+-----------------------------------
      Total |     23,495      100.00

. tab match_counts

match_count |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,259       18.64       18.64
          2 |      1,809       26.78       45.42
          3 |      3,686       54.58      100.00
------------+-----------------------------------
      Total |      6,754      100.00

. 
. bysort set_id: egen set_case_mean = mean(case) // if mean of exposure var is 
> 0 then only uncase in set, if 1 then only case in set

. gen valid_set = (set_case_mean>0 & set_case_mean<1) // ==1 is valid set conta
> ining both case and uncase

. tab valid_set, miss

  valid_set |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        806        3.43        3.43
          1 |     22,689       96.57      100.00
------------+-----------------------------------
      Total |     23,495      100.00

. tab valid_set case, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |         case
 valid_set |         0          1 |     Total
-----------+----------------------+----------
         0 |       806          0 |       806 
           |      4.81       0.00 |      3.43 
-----------+----------------------+----------
         1 |    15,935      6,754 |    22,689 
           |     95.19     100.00 |     96.57 
-----------+----------------------+----------
     Total |    16,741      6,754 |    23,495 
           |    100.00     100.00 |    100.00 

. keep if valid_set==1
(806 observations deleted)

. drop valid_set set_case_mean

. 
. ** Exposure
. label define case 0 "Contemporary comparator" ///
>                                   1 "SARS-CoV-2"

. label values case case

. safetab case 
0

                   case |      Freq.     Percent        Cum.
------------------------+-----------------------------------
Contemporary comparator |     15,935       70.23       70.23
             SARS-CoV-2 |      6,754       29.77      100.00
------------------------+-----------------------------------
                  Total |     22,689      100.00

. 
. * COVID-19 severity
. gen covid_severity = case

. replace covid_severity = 2 if covid_hospitalised==1
(695 real changes made)

. replace covid_severity = 3 if covid_critical_care==1
(337 real changes made)

. replace covid_severity = 3 if covid_critical_days==1
(338 real changes made)

. label define covid_severity     0 "Contemporary comparator"             ///
>                                                         1 "Non-hospitalised C
> OVID" ///
>                                                         2 "Hospitalised COVID
> "          ///
>                                                         3 "Critical care COVI
> D"

. label values covid_severity covid_severity

. label var covid_severity "SARS-CoV-2 severity"

. drop covid_critical_care

. drop covid_critical_days

. safetab covid_severity, m
15

    SARS-CoV-2 severity |      Freq.     Percent        Cum.
------------------------+-----------------------------------
Contemporary comparator |     15,935       70.23       70.23
 Non-hospitalised COVID |      5,455       24.04       94.27
     Hospitalised COVID |        624        2.75       97.02
    Critical care COVID |        675        2.98      100.00
------------------------+-----------------------------------
                  Total |     22,689      100.00

. 
. * COVID-19 acute kidney injury
. gen covid_aki = case

. replace covid_aki = 2 if covid_hospitalised==1
(695 real changes made)

. replace covid_aki = 3 if covid_acute_kidney_injury==1
(320 real changes made)

. label define covid_aki  0 "Contemporary comparator"                     ///
>                                                 1 "Non-hospitalised COVID"   
>            ///
>                                                 2 "Hospitalised COVID"  ///
>                                                 3 "Hospitalised COVID-AKI"

. label values covid_aki covid_aki

. label var covid_aki "COVID-19 acute kidney injury"

. drop covid_acute_kidney_injury

. safetab covid_aki, m
10

  COVID-19 acute kidney |
                 injury |      Freq.     Percent        Cum.
------------------------+-----------------------------------
Contemporary comparator |     15,935       70.23       70.23
 Non-hospitalised COVID |      5,783       25.49       95.72
     Hospitalised COVID |        651        2.87       98.59
 Hospitalised COVID-AKI |        320        1.41      100.00
------------------------+-----------------------------------
                  Total |     22,689      100.00

. 
. * COVID-19 kidney replacement therapy
. gen covid_krt_combined = covid_krt_icd_10
(15,935 missing values generated)

. replace covid_krt_combined = covid_krt_opcs_4 if covid_krt_icd_10==0
(347 real changes made)

. gen covid_krt = case

. replace covid_krt = 2 if covid_hospitalised==1
(695 real changes made)

. replace covid_krt = 3 if covid_krt_combined==1
(681 real changes made)

. label define covid_krt  0 "Contemporary comparator"                     ///
>                                                 1 "Non-hospitalised SARS-CoV-
> 2"         ///
>                                                 2 "No KRT hospitalised COVID-
> 19"        ///
>                                                 3 "KRT hospitalised COVID-19"

. label values covid_krt covid_krt

. label var covid_krt "COVID-19 kidney replacement therapy"

. drop covid_krt_icd_10

. drop covid_krt_opcs_4

. safetab covid_krt, m
10

 COVID-19 kidney replacement |
                     therapy |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
     Contemporary comparator |     15,935       70.23       70.23
 Non-hospitalised SARS-CoV-2 |      5,453       24.03       94.27
No KRT hospitalised COVID-19 |        620        2.73       97.00
   KRT hospitalised COVID-19 |        681        3.00      100.00
-----------------------------+-----------------------------------
                       Total |     22,689      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(18,149 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(18,193 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(18,120 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(18,112 missing values generated)

. format covidvax4date %td

. *First vaccination in the UK was on 08/12/2020
. *di date("20201208", "YMD") -> 22257
. foreach var of varlist covidvax1date covidvax2date covidvax3date covidvax4dat
> e {
  2. replace `var' = . if `var'<22257
  3. replace `var' = . if `var' >= (index_date - 7)
  4. }
(0 real changes made)
(3,931 real changes made, 3,931 to missing)
(0 real changes made)
(3,910 real changes made, 3,910 to missing)
(0 real changes made)
(4,116 real changes made, 4,116 to missing)
(0 real changes made)
(4,173 real changes made, 4,173 to missing)

. gen covid_vax = 1

. replace covid_vax = 2 if covidvax1date!=.
(609 real changes made)

. replace covid_vax = 3 if covidvax2date!=.
(586 real changes made)

. replace covid_vax = 4 if covidvax3date!=.
(453 real changes made)

. replace covid_vax = 5 if covidvax4date!=.
(404 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  1 "Pre-vaccination"                     ///
>                                                 2 "1 vaccine dose"           
>            ///
>                                                 3 "2 vaccine doses"          
>            ///
>                                                 4 "3 vaccine doses"          
>            ///
>                                                 5 "4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "Vaccination status"

. safetab covid_vax, m
10

    Vaccination |
         status |      Freq.     Percent        Cum.
----------------+-----------------------------------
Pre-vaccination |     20,951       92.34       92.34
 1 vaccine dose |        449        1.98       94.32
2 vaccine doses |        481        2.12       96.44
3 vaccine doses |        404        1.78       98.22
4 vaccine doses |        404        1.78      100.00
----------------+-----------------------------------
          Total |     22,689      100.00

. 
. * COVID-19 wave
. gen wave = 1

. replace wave = 2 if index_month=="sep2020"
(1,180 real changes made)

. replace wave = 2 if index_month=="oct2020"
(1,010 real changes made)

. replace wave = 2 if index_month=="nov2020"
(950 real changes made)

. replace wave = 2 if index_month=="dec2020"
(985 real changes made)

. replace wave = 2 if index_month=="jan2021"
(827 real changes made)

. replace wave = 2 if index_month=="feb2021"
(692 real changes made)

. replace wave = 2 if index_month=="mar2021"
(729 real changes made)

. replace wave = 2 if index_month=="apr2021"
(564 real changes made)

. replace wave = 2 if index_month=="may2021"
(578 real changes made)

. replace wave = 2 if index_month=="jun2021"
(527 real changes made)

. replace wave = 3 if index_month=="jul2021"
(575 real changes made)

. replace wave = 3 if index_month=="aug2021"
(446 real changes made)

. replace wave = 3 if index_month=="sep2021"
(417 real changes made)

. replace wave = 3 if index_month=="oct2021"
(386 real changes made)

. replace wave = 3 if index_month=="nov2021"
(316 real changes made)

. replace wave = 4 if index_month=="dec2021"
(330 real changes made)

. replace wave = 4 if index_month=="jan2022"
(268 real changes made)

. replace wave = 4 if index_month=="feb2022"
(233 real changes made)

. replace wave = 4 if index_month=="mar2022"
(238 real changes made)

. replace wave = 4 if index_month=="apr2022"
(230 real changes made)

. replace wave = 4 if index_month=="may2022"
(225 real changes made)

. replace wave = 4 if index_month=="jun2022"
(163 real changes made)

. replace wave = 4 if index_month=="jul2022"
(139 real changes made)

. replace wave = 4 if index_month=="aug2022"
(156 real changes made)

. replace wave = 4 if index_month=="sep2022"
(119 real changes made)

. replace wave = 4 if index_month=="oct2022"
(126 real changes made)

. replace wave = 4 if index_month=="nov2022"
(106 real changes made)

. replace wave = 4 if index_month=="dec2022"
(103 real changes made)

. label define wave       1 "Feb20-Aug20" ///
>                                         2 "Sep20-Jun21" ///
>                                         3 "Jul21-Nov21" ///
>                                         4 "Dec21-Dec22" 

. label values wave wave

. label var wave "COVID-19 wave"

. safetab wave, m
5

   COVID-19 |
       wave |      Freq.     Percent        Cum.
------------+-----------------------------------
Feb20-Aug20 |     10,071       44.39       44.39
Sep20-Jun21 |      8,042       35.44       79.83
Jul21-Nov21 |      2,140        9.43       89.26
Dec21-Dec22 |      2,436       10.74      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. 
. ** Covariates
. * Check of GP consultations over past year by groups
. sum gp_count, detail

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -5
 5%            0             -5
10%            0             -4       Obs              22,689
25%            0             -4       Sum of Wgt.      22,689

50%            3                      Mean           3.323505
                        Largest       Std. Dev.      3.562604
75%            6             16
90%            8             16       Variance       12.69215
95%           10             16       Skewness       .6291493
99%           12             16       Kurtosis       2.259713

. bysort case: sum gp_count, detail

-------------------------------------------------------------------------------
-> case = Contemporary comparator

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -5
 5%            0             -4
10%            0             -4       Obs              15,935
25%            0             -4       Sum of Wgt.      15,935

50%            3                      Mean           3.337935
                        Largest       Std. Dev.      3.568347
75%            6             16
90%            8             16       Variance        12.7331
95%           10             16       Skewness       .6222581
99%           12             16       Kurtosis       2.240276

-------------------------------------------------------------------------------
-> case = SARS-CoV-2

                          gp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0             -5
 5%            0             -4
10%            0             -4       Obs               6,754
25%            0             -3       Sum of Wgt.       6,754

50%            3                      Mean           3.289458
                        Largest       Std. Dev.      3.549049
75%            6             15
90%            8             15       Variance       12.59575
95%           10             15       Skewness       .6454655
99%           12             16       Kurtosis       2.306697


. egen gp_consults = cut(gp_count), at(0, 1, 3, 10, 1500)
(158 missing values generated)

. recode gp_consults 3=2 10=3
(gp_consults: 11435 changes made)

. label define gp_consults 0 "0" 1 "1-2" 2 "3-9" 3 ">9"

. label values gp_consults gp_consults

. label var gp_consults "GP interactions"

. tab case gp_consults

                      |               GP interactions
                 case |         0        1-2        3-9         >9 |     Total
----------------------+--------------------------------------------+----------
Contemporary comparat |     6,703      1,081      7,143        898 |    15,825 
           SARS-CoV-2 |     2,861        451      3,015        379 |     6,706 
----------------------+--------------------------------------------+----------
                Total |     9,564      1,532     10,158      1,277 |    22,531 

. 
. * Check of hospital admissions in preceding 5 years
. sum hosp_count, detail

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs              22,689
25%            0             -2       Sum of Wgt.      22,689

50%            0                      Mean           .3909383
                        Largest       Std. Dev.      .7138804
75%            1              4
90%            1              4       Variance       .5096252
95%            2              4       Skewness       1.504953
99%            3              4       Kurtosis       5.246355

. bysort case: sum hosp_count, detail

-------------------------------------------------------------------------------
-> case = Contemporary comparator

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs              15,935
25%            0             -2       Sum of Wgt.      15,935

50%            0                      Mean           .3875745
                        Largest       Std. Dev.      .7128234
75%            1              4
90%            1              4       Variance       .5081172
95%            2              4       Skewness       1.522847
99%            3              4       Kurtosis       5.320016

-------------------------------------------------------------------------------
-> case = SARS-CoV-2

                         hosp_count
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -1             -2
 5%            0             -2
10%            0             -2       Obs               6,754
25%            0             -2       Sum of Wgt.       6,754

50%            0                      Mean           .3988747
                        Largest       Std. Dev.      .7163583
75%            1              4
90%            1              4       Variance       .5131692
95%            2              4       Skewness       1.463382
99%            3              4       Kurtosis       5.078014


. egen admissions = cut(hosp_count), at(0, 1, 2, 1000)
(305 missing values generated)

. label define admissions 0 "0" 1 "1" 2 ">1"

. label values admissions admissions

. label var admissions "Hospital admissions"

. tab case admissions

                      |       Hospital admissions
                 case |         0          1         >1 |     Total
----------------------+---------------------------------+----------
Contemporary comparat |    10,999      3,248      1,471 |    15,718 
           SARS-CoV-2 |     4,605      1,424        637 |     6,666 
----------------------+---------------------------------+----------
                Total |    15,604      4,672      2,108 |    22,384 

. 
. * Age
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         20 |          1        0.00        0.00
         21 |        280        1.23        1.24
         22 |        419        1.85        3.09
         23 |        433        1.91        4.99
         24 |        477        2.10        7.10
         25 |        479        2.11        9.21
         26 |        461        2.03       11.24
         27 |        443        1.95       13.19
         28 |        477        2.10       15.29
         29 |        462        2.04       17.33
         30 |        501        2.21       19.54
         31 |        399        1.76       21.30
         32 |        484        2.13       23.43
         33 |        436        1.92       25.35
         34 |        465        2.05       27.40
         35 |        465        2.05       29.45
         36 |        434        1.91       31.36
         37 |        465        2.05       33.41
         38 |        425        1.87       35.29
         39 |        490        2.16       37.45
         40 |        446        1.97       39.41
         41 |        426        1.88       41.29
         42 |        470        2.07       43.36
         43 |        446        1.97       45.33
         44 |        489        2.16       47.48
         45 |        466        2.05       49.54
         46 |        433        1.91       51.44
         47 |        487        2.15       53.59
         48 |        454        2.00       55.59
         49 |        422        1.86       57.45
         50 |        398        1.75       59.20
         51 |        446        1.97       61.17
         52 |        409        1.80       62.97
         53 |        460        2.03       65.00
         54 |        472        2.08       67.08
         55 |        424        1.87       68.95
         56 |        472        2.08       71.03
         57 |        424        1.87       72.90
         58 |        456        2.01       74.91
         59 |        447        1.97       76.88
         60 |        471        2.08       78.95
         61 |        492        2.17       81.12
         62 |        459        2.02       83.15
         63 |        459        2.02       85.17
         64 |        452        1.99       87.16
         65 |        454        2.00       89.16
         66 |        457        2.01       91.18
         67 |        450        1.98       93.16
         68 |        434        1.91       95.07
         69 |        432        1.90       96.98
         70 |        482        2.12       99.10
         71 |        153        0.67       99.78
         72 |         49        0.22       99.99
         73 |          2        0.01      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. safecount
  22,689

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///          
>                            
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(22689 differences between age and agegroup)

. 
. label var age "Age"

. label values age age

. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label var agegroup "Age group"

. label values agegroup agegroup

. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex
0

        Sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     11,604       51.14       51.14
       Male |     11,085       48.86      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. safecount
  22,689

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(842 real changes made)

. replace ethnicity=2 if ethnicity==3
(854 real changes made)

. replace ethnicity=3 if ethnicity==4
(842 real changes made)

. replace ethnicity=4 if ethnicity==6
(842 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///          
>                                    
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                    
>                                            

. label values ethnicity ethnicity

. safetab ethnicity, m
10

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     13,623       60.04       60.04
South Asian |        854        3.76       63.81
      Black |        842        3.71       67.52
      Mixed |        842        3.71       71.23
      Other |        821        3.62       74.85
          . |      5,707       25.15      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(5,707 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(5,707 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. label var ethnicity1 "Ethnicity"

. safetab ethnicity1, m
11

  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     13,623       60.04       60.04
South Asian |        854        3.76       63.81
      Black |        842        3.71       67.52
      Mixed |        842        3.71       71.23
      Other |        821        3.62       74.85
    Unknown |      5,707       25.15      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. tab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      2,272       10.01       10.01
                Urban minor conurbation |      2,200        9.70       19.71
                    Urban city and town |      2,221        9.79       29.50
Urban city and town in a sparse setting |      2,271       10.01       39.51
                  Rural town and fringe |      2,227        9.82       49.32
Rural town and fringe in a sparse setti |      2,282       10.06       59.38
            Rural village and dispersed |      4,670       20.58       79.96
Rural village and dispersed in a sparse |      4,546       20.04      100.00
----------------------------------------+-----------------------------------
                                  Total |     22,689      100.00

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(22,689 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(8,964 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(13,725 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. tab urban rural_urban, m

Urban/rura |                      rural_urban
         l | Urban maj  Urban min  Urban cit  Urban cit  Rural tow |     Total
-----------+-------------------------------------------------------+----------
     Rural |         0          0          0          0      2,227 |    13,725 
     Urban |     2,272      2,200      2,221      2,271          0 |     8,964 
-----------+-------------------------------------------------------+----------
     Total |     2,272      2,200      2,221      2,271      2,227 |    22,689 


Urban/rura |           rural_urban
         l | Rural tow  Rural vil  Rural vil |     Total
-----------+---------------------------------+----------
     Rural |     2,282      4,670      4,546 |    13,725 
     Urban |         0          0          0 |     8,964 
-----------+---------------------------------+----------
     Total |     2,282      4,670      4,546 |    22,689 

. tab case urban

                      |      Urban/rural
                 case |     Rural      Urban |     Total
----------------------+----------------------+----------
Contemporary comparat |     9,597      6,338 |    15,935 
           SARS-CoV-2 |     4,128      2,626 |     6,754 
----------------------+----------------------+----------
                Total |    13,725      8,964 |    22,689 

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,279 real changes made, 2,279 to missing)

. gen     bmi = .
(22,689 missing values generated)

. recode  bmi . = 1 if body_mass_index<18.5
(bmi: 1423 changes made)

. recode  bmi . = 2 if body_mass_index<25
(bmi: 5210 changes made)

. recode  bmi . = 3 if body_mass_index<30
(bmi: 5231 changes made)

. recode  bmi . = 4 if body_mass_index<35
(bmi: 4502 changes made)

. recode  bmi . = 5 if body_mass_index<40
(bmi: 2678 changes made)

. recode  bmi . = 6 if body_mass_index<.
(bmi: 1366 changes made)

. replace bmi = . if body_mass_index>=.
(0 real changes made)

. label define bmi        1 "Underweight (<18.5)"         ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>            

. label values bmi bmi

. label var bmi "Body mass index (BMI)"

. safetab bmi, m
4

     Body mass index |
               (BMI) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      1,423        6.27        6.27
  Normal (18.5-24.9) |      5,210       22.96       29.23
Overweight (25-29.9) |      5,231       23.06       52.29
   Obese I (30-34.9) |      4,502       19.84       72.13
  Obese II (35-39.9) |      2,678       11.80       83.93
     Obese III (40+) |      1,366        6.02       89.96
                   . |      2,279       10.04      100.00
---------------------+-----------------------------------
               Total |     22,689      100.00

. 
. * Smoking
. gen smoking = 1 if smoking_status=="S"
(20,039 missing values generated)

. replace smoking = 1 if smoking_status=="E"
(435 real changes made)

. replace smoking = 0 if smoking_status=="N"
(958 real changes made)

. replace smoking = . if smoking_status=="M"
(0 real changes made)

. label define smoking 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking

. label var smoking "Smoking status"

. safetab smoking, m
8

       Smoking status |      Freq.     Percent        Cum.
----------------------+-----------------------------------
           Non-smoker |        958        4.22        4.22
Current/former smoker |      3,085       13.60       17.82
                    . |     18,646       82.18      100.00
----------------------+-----------------------------------
                Total |     22,689      100.00

. 
. * Baseline eGFR groups
. * All baseline eGFR <15 should already by excluded
. egen egfr_group = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000
> )
(9989 missing values generated)

. recode egfr_group 0=8 15=7 30=6 45=5 60=4 75=3 90=2 105=1
(egfr_group: 12700 changes made)

. label define egfr_group 1 "105" 2 "90-104" 3 "75-89" 4 "60-74" 5 "45-59" 6 "
> 30-44" 7 "15-29" 8 "<15"

. label values egfr_group egfr_group

. label var egfr_group "Baseline eGFR range"

. safetab egfr_group, m
11

   Baseline |
 eGFR range |      Freq.     Percent        Cum.
------------+-----------------------------------
       105 |      3,842       16.93       16.93
     90-104 |      1,854        8.17       25.10
      75-89 |      1,700        7.49       32.60
      60-74 |      2,036        8.97       41.57
      45-59 |      2,043        9.00       50.58
      30-44 |      1,111        4.90       55.47
      15-29 |        114        0.50       55.97
          . |      9,989       44.03      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. 
. * Baseline CKD stage
. * No CKD = eGFR >59, CKD 3A = eGFR 45-59, CKD 3B = eGFR 30-44, CKD 4 = eGFR 1
> 5-29, CKD 5 = eGFR <15
. * CKD 5 should already be excluded
. gen ckd_stage = egfr_group
(9,989 missing values generated)

. recode ckd_stage 2/4=1 5=2 6=3 7=4 8=5 .=6
(ckd_stage: 18847 changes made)

. label define ckd_stage 1 "No CKD" 2 "CKD 3A" 3 "CKD 3B" 4 "CKD 4" 5 "CKD 5" 6
>  "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. safetab ckd_stage, m
10

          Baseline CKD stage |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                      No CKD |      9,432       41.57       41.57
                      CKD 3A |      2,043        9.00       50.58
                      CKD 3B |      1,111        4.90       55.47
                       CKD 4 |        114        0.50       55.97
No baseline eGFR measurement |      9,989       44.03      100.00
-----------------------------+-----------------------------------
                       Total |     22,689      100.00

. 
. * Comorbidities
. rename acute_kidney_injury_baseline aki_baseline

. safetab aki_baseline
0

aki_baselin |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,552       94.99       94.99
          1 |      1,137        5.01      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. gen afib = atrial_fibrillation_or_flutter

. drop atrial_fibrillation_or_flutter

. safetab afib
0

       afib |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,539       94.93       94.93
          1 |      1,150        5.07      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. gen liver = chronic_liver_disease

. drop chronic_liver_disease

. safetab liver
0

      liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,230       97.98       97.98
          1 |        459        2.02      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. label var diabetes "Diabetes"

. safetab diabetes
0

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,172       80.09       80.09
          1 |      4,517       19.91      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. gen haem_cancer = haematological_cancer

. drop haematological_cancer

. safetab haem_cancer
0

haem_cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,466       99.02       99.02
          1 |        223        0.98      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. safetab heart_failure
0

heart_failu |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,815       96.15       96.15
          1 |        874        3.85      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. safetab hiv
0

        hiv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,239       98.02       98.02
          1 |        450        1.98      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. label var hypertension "Hypertension"

. safetab hypertension
0

Hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,097       79.76       79.76
          1 |      4,592       20.24      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. gen non_haem_cancer = non_haematological_cancer

. drop non_haematological_cancer

. label var non_haem_cancer "Cancer (non-haematological)"

. safetab non_haem_cancer
0

     Cancer |
(non-haemat |
  ological) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,226       97.96       97.96
          1 |        463        2.04      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. safetab myocardial_infarction
0

myocardial_ |
 infarction |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,429       90.04       90.04
          1 |      2,260        9.96      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. gen pvd = peripheral_vascular_disease

. drop peripheral_vascular_disease

. safetab pvd
0

        pvd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,234       97.99       97.99
          1 |        455        2.01      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. gen rheumatoid = rheumatoid_arthritis

. drop rheumatoid_arthritis

. safetab rheumatoid
0

 rheumatoid |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,528       94.88       94.88
          1 |      1,161        5.12      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. safetab stroke
0

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,246       98.05       98.05
          1 |        443        1.95      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. gen lupus = systemic_lupus_erythematosus

. drop systemic_lupus_erythematosus

. safetab lupus
0

      lupus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,239       98.02       98.02
          1 |        450        1.98      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. 
. *Group comorbidities
. gen cardiovascular = afib

. replace cardiovascular = 1 if heart_failure==1
(835 real changes made)

. replace cardiovascular = 1 if myocardial_infarction==1
(2,055 real changes made)

. replace cardiovascular = 1 if pvd==1
(365 real changes made)

. replace cardiovascular = 1 if stroke==1
(372 real changes made)

. label var cardiovascular "Cardiovascular diseases"

. gen immunosuppressed = haem_cancer

. replace immunosuppressed = 1 if hiv==1
(444 real changes made)

. replace immunosuppressed = 1 if rheumatoid==1
(1,118 real changes made)

. replace immunosuppressed = 1 if lupus==1
(411 real changes made)

. label var immunosuppressed "Immunosuppressive diseases"

. safetab cardiovascular
0

Cardiovascu |
        lar |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,912       78.95       78.95
          1 |      4,777       21.05      100.00
------------+-----------------------------------
      Total |     22,689      100.00

. safetab immunosuppressed
0

Immunosuppr |
     essive |
   diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,493       90.32       90.32
          1 |      2,196        9.68      100.00
------------+-----------------------------------
      Total |     22,689      100.00

.  
. **Outcomes
. * ESRD
. * eGFR <15 (earliest month)
. foreach creatinine_monthly of varlist   creatinine_feb2020 ///
>                                                                              
>    creatinine_mar2020 ///
>                                                                              
>    creatinine_apr2020 ///
>                                                                              
>    creatinine_may2020 ///
>                                                                              
>    creatinine_jun2020 ///
>                                                                              
>    creatinine_jul2020 ///
>                                                                              
>    creatinine_aug2020 ///
>                                                                              
>    creatinine_sep2020 ///
>                                                                              
>    creatinine_oct2020 ///
>                                                                              
>    creatinine_nov2020 ///
>                                                                              
>    creatinine_dec2020 ///
>                                                                              
>    creatinine_jan2021 ///
>                                                                              
>    creatinine_feb2021 ///
>                                                                              
>    creatinine_mar2021 ///
>                                                                              
>    creatinine_apr2021 ///
>                                                                              
>    creatinine_may2021 ///
>                                                                              
>    creatinine_jun2021 ///
>                                                                              
>    creatinine_jul2021 ///
>                                                                              
>    creatinine_aug2021 ///
>                                                                              
>    creatinine_sep2021 ///
>                                                                              
>    creatinine_oct2021 ///
>                                                                              
>    creatinine_nov2021 ///
>                                                                              
>    creatinine_dec2021 ///
>                                                                              
>    creatinine_jan2022 ///
>                                                                              
>    creatinine_feb2022 ///
>                                                                              
>    creatinine_mar2022 ///
>                                                                              
>    creatinine_apr2022 ///
>                                                                              
>    creatinine_may2022 ///
>                                                                              
>    creatinine_jun2022 ///
>                                                                              
>    creatinine_jul2022 ///
>                                                                              
>    creatinine_aug2022 ///
>                                                                              
>    creatinine_sep2022 ///
>                                                                              
>    creatinine_oct2022 ///
>                                                                              
>    creatinine_nov2022 ///
>                                                                              
>    creatinine_dec2022 ///
>                                                                              
>    creatinine_jan2023 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 300
> 0)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex=
> =0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex=
> =1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_m
> onthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex
> ==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(9,978 real changes made, 9,978 to missing)
(9,978 missing values generated)
(22,689 missing values generated)
(6,483 real changes made)
(6,228 real changes made)
(6,483 real changes made)
(6,228 real changes made)
(8,008 real changes made)
(22,689 missing values generated)
(6,483 real changes made)
(6,228 real changes made)
(12,711 real changes made)
(14,681 real changes made)
(9,978 missing values generated)
(12,711 real changes made)
(6,483 real changes made)
(10,019 real changes made, 10,019 to missing)
(10,019 missing values generated)
(22,689 missing values generated)
(6,485 real changes made)
(6,185 real changes made)
(6,485 real changes made)
(6,185 real changes made)
(7,980 real changes made)
(22,689 missing values generated)
(6,485 real changes made)
(6,185 real changes made)
(12,670 real changes made)
(14,709 real changes made)
(10,019 missing values generated)
(12,670 real changes made)
(6,485 real changes made)
(9,995 real changes made, 9,995 to missing)
(9,995 missing values generated)
(22,689 missing values generated)
(6,494 real changes made)
(6,200 real changes made)
(6,494 real changes made)
(6,200 real changes made)
(8,026 real changes made)
(22,689 missing values generated)
(6,494 real changes made)
(6,200 real changes made)
(12,694 real changes made)
(14,663 real changes made)
(9,995 missing values generated)
(12,694 real changes made)
(6,494 real changes made)
(10,032 real changes made, 10,032 to missing)
(10,032 missing values generated)
(22,689 missing values generated)
(6,467 real changes made)
(6,190 real changes made)
(6,467 real changes made)
(6,190 real changes made)
(8,057 real changes made)
(22,689 missing values generated)
(6,467 real changes made)
(6,190 real changes made)
(12,657 real changes made)
(14,632 real changes made)
(10,032 missing values generated)
(12,657 real changes made)
(6,467 real changes made)
(9,939 real changes made, 9,939 to missing)
(9,939 missing values generated)
(22,689 missing values generated)
(6,607 real changes made)
(6,143 real changes made)
(6,607 real changes made)
(6,143 real changes made)
(8,133 real changes made)
(22,689 missing values generated)
(6,607 real changes made)
(6,143 real changes made)
(12,750 real changes made)
(14,556 real changes made)
(9,939 missing values generated)
(12,750 real changes made)
(6,607 real changes made)
(9,937 real changes made, 9,937 to missing)
(9,937 missing values generated)
(22,689 missing values generated)
(6,582 real changes made)
(6,170 real changes made)
(6,582 real changes made)
(6,170 real changes made)
(8,131 real changes made)
(22,689 missing values generated)
(6,582 real changes made)
(6,170 real changes made)
(12,752 real changes made)
(14,558 real changes made)
(9,937 missing values generated)
(12,752 real changes made)
(6,582 real changes made)
(10,039 real changes made, 10,039 to missing)
(10,039 missing values generated)
(22,689 missing values generated)
(6,428 real changes made)
(6,222 real changes made)
(6,428 real changes made)
(6,222 real changes made)
(8,013 real changes made)
(22,689 missing values generated)
(6,428 real changes made)
(6,222 real changes made)
(12,650 real changes made)
(14,676 real changes made)
(10,039 missing values generated)
(12,650 real changes made)
(6,428 real changes made)
(9,913 real changes made, 9,913 to missing)
(9,913 missing values generated)
(22,689 missing values generated)
(6,499 real changes made)
(6,277 real changes made)
(6,499 real changes made)
(6,277 real changes made)
(8,104 real changes made)
(22,689 missing values generated)
(6,499 real changes made)
(6,277 real changes made)
(12,776 real changes made)
(14,585 real changes made)
(9,913 missing values generated)
(12,776 real changes made)
(6,499 real changes made)
(9,974 real changes made, 9,974 to missing)
(9,974 missing values generated)
(22,689 missing values generated)
(6,557 real changes made)
(6,158 real changes made)
(6,557 real changes made)
(6,158 real changes made)
(8,066 real changes made)
(22,689 missing values generated)
(6,557 real changes made)
(6,158 real changes made)
(12,715 real changes made)
(14,623 real changes made)
(9,974 missing values generated)
(12,715 real changes made)
(6,557 real changes made)
(9,930 real changes made, 9,930 to missing)
(9,930 missing values generated)
(22,689 missing values generated)
(6,596 real changes made)
(6,163 real changes made)
(6,596 real changes made)
(6,163 real changes made)
(8,090 real changes made)
(22,689 missing values generated)
(6,596 real changes made)
(6,163 real changes made)
(12,759 real changes made)
(14,599 real changes made)
(9,930 missing values generated)
(12,759 real changes made)
(6,596 real changes made)
(9,996 real changes made, 9,996 to missing)
(9,996 missing values generated)
(22,689 missing values generated)
(6,525 real changes made)
(6,168 real changes made)
(6,525 real changes made)
(6,168 real changes made)
(8,002 real changes made)
(22,689 missing values generated)
(6,525 real changes made)
(6,168 real changes made)
(12,693 real changes made)
(14,687 real changes made)
(9,996 missing values generated)
(12,693 real changes made)
(6,525 real changes made)
(9,908 real changes made, 9,908 to missing)
(9,908 missing values generated)
(22,689 missing values generated)
(6,529 real changes made)
(6,252 real changes made)
(6,529 real changes made)
(6,252 real changes made)
(8,139 real changes made)
(22,689 missing values generated)
(6,529 real changes made)
(6,252 real changes made)
(12,781 real changes made)
(14,550 real changes made)
(9,908 missing values generated)
(12,781 real changes made)
(6,529 real changes made)
(9,992 real changes made, 9,992 to missing)
(9,992 missing values generated)
(22,689 missing values generated)
(6,513 real changes made)
(6,184 real changes made)
(6,513 real changes made)
(6,184 real changes made)
(8,100 real changes made)
(22,689 missing values generated)
(6,513 real changes made)
(6,184 real changes made)
(12,697 real changes made)
(14,589 real changes made)
(9,992 missing values generated)
(12,697 real changes made)
(6,513 real changes made)
(9,999 real changes made, 9,999 to missing)
(9,999 missing values generated)
(22,689 missing values generated)
(6,465 real changes made)
(6,225 real changes made)
(6,465 real changes made)
(6,225 real changes made)
(8,087 real changes made)
(22,689 missing values generated)
(6,465 real changes made)
(6,225 real changes made)
(12,690 real changes made)
(14,602 real changes made)
(9,999 missing values generated)
(12,690 real changes made)
(6,465 real changes made)
(10,096 real changes made, 10,096 to missing)
(10,096 missing values generated)
(22,689 missing values generated)
(6,401 real changes made)
(6,192 real changes made)
(6,401 real changes made)
(6,192 real changes made)
(7,966 real changes made)
(22,689 missing values generated)
(6,401 real changes made)
(6,192 real changes made)
(12,593 real changes made)
(14,723 real changes made)
(10,096 missing values generated)
(12,593 real changes made)
(6,401 real changes made)
(9,991 real changes made, 9,991 to missing)
(9,991 missing values generated)
(22,689 missing values generated)
(6,554 real changes made)
(6,144 real changes made)
(6,554 real changes made)
(6,144 real changes made)
(8,100 real changes made)
(22,689 missing values generated)
(6,554 real changes made)
(6,144 real changes made)
(12,698 real changes made)
(14,589 real changes made)
(9,991 missing values generated)
(12,698 real changes made)
(6,554 real changes made)
(9,958 real changes made, 9,958 to missing)
(9,958 missing values generated)
(22,689 missing values generated)
(6,505 real changes made)
(6,226 real changes made)
(6,505 real changes made)
(6,226 real changes made)
(8,033 real changes made)
(22,689 missing values generated)
(6,505 real changes made)
(6,226 real changes made)
(12,731 real changes made)
(14,656 real changes made)
(9,958 missing values generated)
(12,731 real changes made)
(6,505 real changes made)
(9,912 real changes made, 9,912 to missing)
(9,912 missing values generated)
(22,689 missing values generated)
(6,543 real changes made)
(6,234 real changes made)
(6,543 real changes made)
(6,234 real changes made)
(8,148 real changes made)
(22,689 missing values generated)
(6,543 real changes made)
(6,234 real changes made)
(12,777 real changes made)
(14,541 real changes made)
(9,912 missing values generated)
(12,777 real changes made)
(6,543 real changes made)
(10,008 real changes made, 10,008 to missing)
(10,008 missing values generated)
(22,689 missing values generated)
(6,528 real changes made)
(6,153 real changes made)
(6,528 real changes made)
(6,153 real changes made)
(8,036 real changes made)
(22,689 missing values generated)
(6,528 real changes made)
(6,153 real changes made)
(12,681 real changes made)
(14,653 real changes made)
(10,008 missing values generated)
(12,681 real changes made)
(6,528 real changes made)
(9,957 real changes made, 9,957 to missing)
(9,957 missing values generated)
(22,689 missing values generated)
(6,506 real changes made)
(6,226 real changes made)
(6,506 real changes made)
(6,226 real changes made)
(8,021 real changes made)
(22,689 missing values generated)
(6,506 real changes made)
(6,226 real changes made)
(12,732 real changes made)
(14,668 real changes made)
(9,957 missing values generated)
(12,732 real changes made)
(6,506 real changes made)
(9,986 real changes made, 9,986 to missing)
(9,986 missing values generated)
(22,689 missing values generated)
(6,424 real changes made)
(6,279 real changes made)
(6,424 real changes made)
(6,279 real changes made)
(8,041 real changes made)
(22,689 missing values generated)
(6,424 real changes made)
(6,279 real changes made)
(12,703 real changes made)
(14,648 real changes made)
(9,986 missing values generated)
(12,703 real changes made)
(6,424 real changes made)
(9,999 real changes made, 9,999 to missing)
(9,999 missing values generated)
(22,689 missing values generated)
(6,513 real changes made)
(6,177 real changes made)
(6,513 real changes made)
(6,177 real changes made)
(7,984 real changes made)
(22,689 missing values generated)
(6,513 real changes made)
(6,177 real changes made)
(12,690 real changes made)
(14,705 real changes made)
(9,999 missing values generated)
(12,690 real changes made)
(6,513 real changes made)
(9,914 real changes made, 9,914 to missing)
(9,914 missing values generated)
(22,689 missing values generated)
(6,570 real changes made)
(6,205 real changes made)
(6,570 real changes made)
(6,205 real changes made)
(8,222 real changes made)
(22,689 missing values generated)
(6,570 real changes made)
(6,205 real changes made)
(12,775 real changes made)
(14,467 real changes made)
(9,914 missing values generated)
(12,775 real changes made)
(6,570 real changes made)
(9,967 real changes made, 9,967 to missing)
(9,967 missing values generated)
(22,689 missing values generated)
(6,473 real changes made)
(6,249 real changes made)
(6,473 real changes made)
(6,249 real changes made)
(8,002 real changes made)
(22,689 missing values generated)
(6,473 real changes made)
(6,249 real changes made)
(12,722 real changes made)
(14,687 real changes made)
(9,967 missing values generated)
(12,722 real changes made)
(6,473 real changes made)
(10,049 real changes made, 10,049 to missing)
(10,049 missing values generated)
(22,689 missing values generated)
(6,458 real changes made)
(6,182 real changes made)
(6,458 real changes made)
(6,182 real changes made)
(8,014 real changes made)
(22,689 missing values generated)
(6,458 real changes made)
(6,182 real changes made)
(12,640 real changes made)
(14,675 real changes made)
(10,049 missing values generated)
(12,640 real changes made)
(6,458 real changes made)
(10,009 real changes made, 10,009 to missing)
(10,009 missing values generated)
(22,689 missing values generated)
(6,523 real changes made)
(6,157 real changes made)
(6,523 real changes made)
(6,157 real changes made)
(8,058 real changes made)
(22,689 missing values generated)
(6,523 real changes made)
(6,157 real changes made)
(12,680 real changes made)
(14,631 real changes made)
(10,009 missing values generated)
(12,680 real changes made)
(6,523 real changes made)
(9,990 real changes made, 9,990 to missing)
(9,990 missing values generated)
(22,689 missing values generated)
(6,512 real changes made)
(6,187 real changes made)
(6,512 real changes made)
(6,187 real changes made)
(8,036 real changes made)
(22,689 missing values generated)
(6,512 real changes made)
(6,187 real changes made)
(12,699 real changes made)
(14,653 real changes made)
(9,990 missing values generated)
(12,699 real changes made)
(6,512 real changes made)
(10,049 real changes made, 10,049 to missing)
(10,049 missing values generated)
(22,689 missing values generated)
(6,455 real changes made)
(6,185 real changes made)
(6,455 real changes made)
(6,185 real changes made)
(8,074 real changes made)
(22,689 missing values generated)
(6,455 real changes made)
(6,185 real changes made)
(12,640 real changes made)
(14,615 real changes made)
(10,049 missing values generated)
(12,640 real changes made)
(6,455 real changes made)
(10,028 real changes made, 10,028 to missing)
(10,028 missing values generated)
(22,689 missing values generated)
(6,486 real changes made)
(6,175 real changes made)
(6,486 real changes made)
(6,175 real changes made)
(8,021 real changes made)
(22,689 missing values generated)
(6,486 real changes made)
(6,175 real changes made)
(12,661 real changes made)
(14,668 real changes made)
(10,028 missing values generated)
(12,661 real changes made)
(6,486 real changes made)
(10,012 real changes made, 10,012 to missing)
(10,012 missing values generated)
(22,689 missing values generated)
(6,397 real changes made)
(6,280 real changes made)
(6,397 real changes made)
(6,280 real changes made)
(8,122 real changes made)
(22,689 missing values generated)
(6,397 real changes made)
(6,280 real changes made)
(12,677 real changes made)
(14,567 real changes made)
(10,012 missing values generated)
(12,677 real changes made)
(6,397 real changes made)
(9,961 real changes made, 9,961 to missing)
(9,961 missing values generated)
(22,689 missing values generated)
(6,527 real changes made)
(6,201 real changes made)
(6,527 real changes made)
(6,201 real changes made)
(8,124 real changes made)
(22,689 missing values generated)
(6,527 real changes made)
(6,201 real changes made)
(12,728 real changes made)
(14,565 real changes made)
(9,961 missing values generated)
(12,728 real changes made)
(6,527 real changes made)
(9,989 real changes made, 9,989 to missing)
(9,989 missing values generated)
(22,689 missing values generated)
(6,417 real changes made)
(6,283 real changes made)
(6,417 real changes made)
(6,283 real changes made)
(8,103 real changes made)
(22,689 missing values generated)
(6,417 real changes made)
(6,283 real changes made)
(12,700 real changes made)
(14,586 real changes made)
(9,989 missing values generated)
(12,700 real changes made)
(6,417 real changes made)
(9,949 real changes made, 9,949 to missing)
(9,949 missing values generated)
(22,689 missing values generated)
(6,546 real changes made)
(6,194 real changes made)
(6,546 real changes made)
(6,194 real changes made)
(8,133 real changes made)
(22,689 missing values generated)
(6,546 real changes made)
(6,194 real changes made)
(12,740 real changes made)
(14,556 real changes made)
(9,949 missing values generated)
(12,740 real changes made)
(6,546 real changes made)
(9,959 real changes made, 9,959 to missing)
(9,959 missing values generated)
(22,689 missing values generated)
(6,449 real changes made)
(6,281 real changes made)
(6,449 real changes made)
(6,281 real changes made)
(8,034 real changes made)
(22,689 missing values generated)
(6,449 real changes made)
(6,281 real changes made)
(12,730 real changes made)
(14,655 real changes made)
(9,959 missing values generated)
(12,730 real changes made)
(6,449 real changes made)
(9,996 real changes made, 9,996 to missing)
(9,996 missing values generated)
(22,689 missing values generated)
(6,465 real changes made)
(6,228 real changes made)
(6,465 real changes made)
(6,228 real changes made)
(8,105 real changes made)
(22,689 missing values generated)
(6,465 real changes made)
(6,228 real changes made)
(12,693 real changes made)
(14,584 real changes made)
(9,996 missing values generated)
(12,693 real changes made)
(6,465 real changes made)
(10,056 real changes made, 10,056 to missing)
(10,056 missing values generated)
(22,689 missing values generated)
(6,458 real changes made)
(6,175 real changes made)
(6,458 real changes made)
(6,175 real changes made)
(8,019 real changes made)
(22,689 missing values generated)
(6,458 real changes made)
(6,175 real changes made)
(12,633 real changes made)
(14,670 real changes made)
(10,056 missing values generated)
(12,633 real changes made)
(6,458 real changes made)

. 
. replace index_date = index_date_28
(22,689 real changes made)

. drop index_date_28

. gen egfr15_date=.
(22,689 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr20
> 22 may2022 jun2022 jul2022 aug2022 sep2022 oct2022 nov2022 dec2022 jan2023"

. foreach x of local month_year  {
  2.   replace egfr15_date=date("15`x'", "DMY") if egfr15_date==.& egfr_creatin
> ine_`x'<15 & date("01`x'", "DMY")>index_date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr15_date %td

. 
. * ESRD date
. gen index_date_esrd = index_date

. gen esrd_date = egfr15_date
(22,689 missing values generated)

. format esrd_date %td

. replace esrd_date = krt_date if esrd_date==.
(2,387 real changes made)

. gen esrd = 0

. replace esrd = 1 if esrd_date!=.
(2,387 real changes made)

. label var esrd "Kidney failure"

. gen esrd_time = (esrd_date - index_date_esrd)
(20,302 missing values generated)

. label var esrd_time "Time to ESRD (Days)"

. gen esrd_time_cat = esrd_time
(20,302 missing values generated)

. recode esrd_time_cat    min/-1=1        ///
>                                                 0=2                     ///
>                                                 1/28=3          ///
>                                                 29/90=4         ///
>                                                 91/180=5        ///
>                                                 181/365=6       ///
>                                                 366/730=7       ///
>                                                 731/1096=8      ///
>                                                 1097/max=9
(esrd_time_cat: 2382 changes made)

. label define esrd_time_cat      1 "<0 days"                     ///
>                                                         2 "0 days"           
>            ///
>                                                         3 "1 to 28 days"     
>    ///
>                                                         4 "20 to 90 days"    
>    ///
>                                                         5 "91 to 180 days"   
>    ///
>                                                         6 "181 to 365 days"  
>    ///
>                                                         7 "366 to 730 days"  
>    ///
>                                                         8 "731 to 1096 days" 
>    ///
>                                                         9 ">1096 days"

. label values esrd_time_cat esrd_time_cat

. foreach exposure of varlist     case                    ///
>                                                                 covid_severit
> y  ///
>                                                                 covid_aki    
>            {
  2.                                                                 by `exposu
> re',sort: sum esrd_time, de
  3.                                                                 tab esrd_t
> ime_cat `exposure', m col chi
  4.                                                                 }

-------------------------------------------------------------------------------
-> case = Contemporary comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           13              1
10%           54              1       Obs               1,698
25%          164              1       Sum of Wgt.       1,698

50%          364                      Mean           395.6284
                        Largest       Std. Dev.      268.9024
75%          596           1039
90%          791           1039       Variance        72308.5
95%          870           1043       Skewness       .3607574
99%          989           1051       Kurtosis       2.136553

-------------------------------------------------------------------------------
-> case = SARS-CoV-2

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            7              1
10%           39              1       Obs                 689
25%          141              1       Sum of Wgt.         689

50%          334                      Mean           368.9274
                        Largest       Std. Dev.      264.4079
75%          572           1003
90%          757           1008       Variance       69911.52
95%          831           1011       Skewness        .383545
99%          973           1020       Kurtosis       2.098734


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |         case
   esrd_time_cat | Contempor  SARS-CoV- |     Total
-----------------+----------------------+----------
    1 to 28 days |       117         53 |       170 
                 |      0.73       0.78 |      0.75 
-----------------+----------------------+----------
   20 to 90 days |       131         76 |       207 
                 |      0.82       1.13 |      0.91 
-----------------+----------------------+----------
  91 to 180 days |       213         84 |       297 
                 |      1.34       1.24 |      1.31 
-----------------+----------------------+----------
 181 to 365 days |       391        155 |       546 
                 |      2.45       2.29 |      2.41 
-----------------+----------------------+----------
 366 to 730 days |       617        243 |       860 
                 |      3.87       3.60 |      3.79 
-----------------+----------------------+----------
731 to 1096 days |       229         78 |       307 
                 |      1.44       1.15 |      1.35 
-----------------+----------------------+----------
               . |    14,237      6,065 |    20,302 
                 |     89.34      89.80 |     89.48 
-----------------+----------------------+----------
           Total |    15,935      6,754 |    22,689 
                 |    100.00     100.00 |    100.00 

          Pearson chi2(6) =   9.5923   Pr = 0.143

-------------------------------------------------------------------------------
-> covid_severity = Contemporary comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           13              1
10%           54              1       Obs               1,698
25%          164              1       Sum of Wgt.       1,698

50%          364                      Mean           395.6284
                        Largest       Std. Dev.      268.9024
75%          596           1039
90%          791           1039       Variance        72308.5
95%          870           1043       Skewness       .3607574
99%          989           1051       Kurtosis       2.136553

-------------------------------------------------------------------------------
-> covid_severity = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            6              1
10%           38              1       Obs                 563
25%          140              1       Sum of Wgt.         563

50%          324                      Mean            364.556
                        Largest       Std. Dev.      265.5008
75%          574           1003
90%          758           1008       Variance       70490.67
95%          831           1011       Skewness       .4464272
99%          977           1020       Kurtosis       2.161095

-------------------------------------------------------------------------------
-> covid_severity = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            8              8
 5%           34             29
10%           46             31       Obs                  65
25%          185             34       Sum of Wgt.          65

50%          427                      Mean           379.7385
                        Largest       Std. Dev.       247.533
75%          561            793
90%          690            825       Variance        61272.6
95%          793            847       Skewness       .1498956
99%          907            907       Kurtosis       1.925147

-------------------------------------------------------------------------------
-> covid_severity = Critical care COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           17              1       Obs                  61
25%          117              1       Sum of Wgt.          61

50%          403                      Mean           397.7541
                        Largest       Std. Dev.      273.6444
75%          619            835
90%          757            864       Variance       74881.26
95%          835            893       Skewness       .0335276
99%          903            903       Kurtosis       1.839717


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |             SARS-CoV-2 severity
   esrd_time_cat | Contempor  Non-hospi  Hospitali  Critical  |     Total
-----------------+--------------------------------------------+----------
    1 to 28 days |       117         45          1          7 |       170 
                 |      0.73       0.82       0.16       1.04 |      0.75 
-----------------+--------------------------------------------+----------
   20 to 90 days |       131         58         12          6 |       207 
                 |      0.82       1.06       1.92       0.89 |      0.91 
-----------------+--------------------------------------------+----------
  91 to 180 days |       213         77          2          5 |       297 
                 |      1.34       1.41       0.32       0.74 |      1.31 
-----------------+--------------------------------------------+----------
 181 to 365 days |       391        129         17          9 |       546 
                 |      2.45       2.36       2.72       1.33 |      2.41 
-----------------+--------------------------------------------+----------
 366 to 730 days |       617        189         27         27 |       860 
                 |      3.87       3.46       4.33       4.00 |      3.79 
-----------------+--------------------------------------------+----------
731 to 1096 days |       229         65          6          7 |       307 
                 |      1.44       1.19       0.96       1.04 |      1.35 
-----------------+--------------------------------------------+----------
               . |    14,237      4,892        559        614 |    20,302 
                 |     89.34      89.68      89.58      90.96 |     89.48 
-----------------+--------------------------------------------+----------
           Total |    15,935      5,455        624        675 |    22,689 
                 |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(18) =  30.0800   Pr = 0.037

-------------------------------------------------------------------------------
-> covid_aki = Contemporary comparator

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           13              1
10%           54              1       Obs               1,698
25%          164              1       Sum of Wgt.       1,698

50%          364                      Mean           395.6284
                        Largest       Std. Dev.      268.9024
75%          596           1039
90%          791           1039       Variance        72308.5
95%          870           1043       Skewness       .3607574
99%          989           1051       Kurtosis       2.136553

-------------------------------------------------------------------------------
-> covid_aki = Non-hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            6              1
10%           36              1       Obs                 588
25%          141              1       Sum of Wgt.         588

50%        330.5                      Mean           368.3639
                        Largest       Std. Dev.      266.4388
75%          575           1003
90%          759           1008       Variance       70989.66
95%          839           1011       Skewness       .4136616
99%          977           1020       Kurtosis       2.124012

-------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%           31              8
10%           46             29       Obs                  74
25%          191             31       Sum of Wgt.          74

50%          452                      Mean           400.7568
                        Largest       Std. Dev.      257.7294
75%          573            825
90%          757            847       Variance       66424.43
95%          825            903       Skewness       .0621325
99%          907            907       Kurtosis       1.873498

-------------------------------------------------------------------------------
-> covid_aki = Hospitalised COVID-AKI

                     Time to ESRD (Days)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%           31             31       Obs                  27
25%           90             38       Sum of Wgt.          27

50%          241                      Mean            293.963
                        Largest       Std. Dev.      228.0627
75%          449            583
90%          600            600       Variance       52012.58
95%          656            656       Skewness       .4257233
99%          805            805       Kurtosis       2.101679


+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |        COVID-19 acute kidney injury
   esrd_time_cat | Contempor  Non-hospi  Hospitali  Hospitali |     Total
-----------------+--------------------------------------------+----------
    1 to 28 days |       117         49          2          2 |       170 
                 |      0.73       0.85       0.31       0.62 |      0.75 
-----------------+--------------------------------------------+----------
   20 to 90 days |       131         59         12          5 |       207 
                 |      0.82       1.02       1.84       1.56 |      0.91 
-----------------+--------------------------------------------+----------
  91 to 180 days |       213         77          3          4 |       297 
                 |      1.34       1.33       0.46       1.25 |      1.31 
-----------------+--------------------------------------------+----------
 181 to 365 days |       391        134         17          4 |       546 
                 |      2.45       2.32       2.61       1.25 |      2.41 
-----------------+--------------------------------------------+----------
 366 to 730 days |       617        201         31         11 |       860 
                 |      3.87       3.48       4.76       3.44 |      3.79 
-----------------+--------------------------------------------+----------
731 to 1096 days |       229         68          9          1 |       307 
                 |      1.44       1.18       1.38       0.31 |      1.35 
-----------------+--------------------------------------------+----------
               . |    14,237      5,195        577        293 |    20,302 
                 |     89.34      89.83      88.63      91.56 |     89.48 
-----------------+--------------------------------------------+----------
           Total |    15,935      5,783        651        320 |    22,689 
                 |    100.00     100.00     100.00     100.00 |    100.00 

         Pearson chi2(18) =  26.8905   Pr = 0.081

. gen exit_date_esrd = esrd_date
(20,302 missing values generated)

. format exit_date_esrd %td

. gen end_date = date("2023-01-31", "YMD")

. format end_date %td

. replace exit_date_esrd = min(deregistered_date, death_date, end_date, covid_e
> xit) if esrd_date==.
(20,302 real changes made)

. replace exit_date_esrd = covid_exit if covid_exit < esrd_date
(673 real changes made)

. replace esrd_date=. if covid_exit<esrd_date&case==0
(387 real changes made, 387 to missing)

. gen esrd_denominator = 1

. gen follow_up_time_esrd = (exit_date_esrd - index_date_esrd)

. label var follow_up_time_esrd "Follow-up time (Days)"

. gen follow_up_cat_esrd = follow_up_time_esrd

. recode follow_up_cat_esrd       min/-29=1       ///
>                                                 -28/-1=2        ///
>                                                 0=3                     ///
>                                                 1/365=4         ///
>                                                 366/730=5       ///
>                                                 731/1096=6      ///          
>                            
>                                                 1097/max=7
(follow_up_cat_esrd: 22672 changes made)

. label define follow_up_cat_esrd         1 "<-29 days"   ///
>                                                         2 "-28 to -1 days"   
>            ///
>                                                         3 "0 days"           
>                    ///
>                                                         4 "1 to 365 days"    
>            ///
>                                                         5 "366 to 730 days"  
>    ///
>                                                         6 "731 to 1096 days" 
>    ///
>                                                         7 ">1096 days"

. label values follow_up_cat_esrd follow_up_cat_esrd

. label var follow_up_cat_esrd "Follow_up time"

. tab case follow_up_cat_esrd

                      |               Follow_up time
                 case | -28 to -1     0 days  1 to 365   366 to 73 |     Total
----------------------+--------------------------------------------+----------
Contemporary comparat |        60          3      5,794      5,321 |    15,935 
           SARS-CoV-2 |        35          2      1,280      2,131 |     6,754 
----------------------+--------------------------------------------+----------
                Total |        95          5      7,074      7,452 |    22,689 


                      | Follow_up
                      |    time
                 case | 731 to 10 |     Total
----------------------+-----------+----------
Contemporary comparat |     4,757 |    15,935 
           SARS-CoV-2 |     3,306 |     6,754 
----------------------+-----------+----------
                Total |     8,063 |    22,689 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |               Follow_up time
  replacement therapy | -28 to -1     0 days  1 to 365   366 to 73 |     Total
----------------------+--------------------------------------------+----------
Contemporary comparat |        60          3      5,794      5,321 |    15,935 
Non-hospitalised SARS |        28          2      1,022      1,720 |     5,453 
No KRT hospitalised C |         5          0        120        218 |       620 
KRT hospitalised COVI |         2          0        138        193 |       681 
----------------------+--------------------------------------------+----------
                Total |        95          5      7,074      7,452 |    22,689 


                      | Follow_up
      COVID-19 kidney |    time
  replacement therapy | 731 to 10 |     Total
----------------------+-----------+----------
Contemporary comparat |     4,757 |    15,935 
Non-hospitalised SARS |     2,681 |     5,453 
No KRT hospitalised C |       277 |       620 
KRT hospitalised COVI |       348 |       681 
----------------------+-----------+----------
                Total |     8,063 |    22,689 

. drop if follow_up_time_esrd<1
(100 observations deleted)

. drop if follow_up_time_esrd>1096
(0 observations deleted)

. tab case follow_up_cat_esrd

                      |          Follow_up time
                 case | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Contemporary comparat |     5,794      5,321      4,757 |    15,872 
           SARS-CoV-2 |     1,280      2,131      3,306 |     6,717 
----------------------+---------------------------------+----------
                Total |     7,074      7,452      8,063 |    22,589 

. tab covid_krt follow_up_cat_esrd

      COVID-19 kidney |          Follow_up time
  replacement therapy | 1 to 365   366 to 73  731 to 10 |     Total
----------------------+---------------------------------+----------
Contemporary comparat |     5,794      5,321      4,757 |    15,872 
Non-hospitalised SARS |     1,022      1,720      2,681 |     5,423 
No KRT hospitalised C |       120        218        277 |       615 
KRT hospitalised COVI |       138        193        348 |       679 
----------------------+---------------------------------+----------
                Total |     7,074      7,452      8,063 |    22,589 

. gen follow_up_years_esrd = follow_up_time_esrd/365.25

. 
. * 50% eGFR reduction (earliest month) (or ESRD)
. gen egfr_half_date=.
(22,589 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr20
> 22 may2022 jun2022 jul2022 aug2022 sep2022 oct2022 nov2022 dec2022 jan2023"

. foreach x of local month_year {
  2.   replace egfr_half_date=date("15`x'", "DMY") if baseline_egfr!=. & egfr_h
> alf_date==.& egfr_creatinine_`x'<0.5*baseline_egfr & date("01`x'", "DMY")>ind
> ex_date
  3.   format egfr_half_date %td
  4. }
(0 real changes made)
(0 real changes made)
(52 real changes made)
(99 real changes made)
(146 real changes made)
(171 real changes made)
(196 real changes made)
(179 real changes made)
(214 real changes made)
(216 real changes made)
(212 real changes made)
(235 real changes made)
(238 real changes made)
(250 real changes made)
(237 real changes made)
(242 real changes made)
(193 real changes made)
(203 real changes made)
(219 real changes made)
(204 real changes made)
(183 real changes made)
(205 real changes made)
(198 real changes made)
(158 real changes made)
(173 real changes made)
(170 real changes made)
(150 real changes made)
(130 real changes made)
(131 real changes made)
(115 real changes made)
(142 real changes made)
(134 real changes made)
(118 real changes made)
(105 real changes made)
(108 real changes made)
(107 real changes made)

. replace egfr_half_date=esrd_date if egfr_half_date==.
(1,485 real changes made)

. gen egfr_half = 0

. replace egfr_half = 1 if egfr_half_date!=.
(7,318 real changes made)

. label var egfr_half "50% reduction in eGFR"

. * Index date (50% eGFR reduction)
. gen index_date_egfr_half = index_date

. replace index_date_egfr_half =. if baseline_egfr==.
(9,889 real changes made, 9,889 to missing)

. * Exit date (50% eGFR reduction)
. gen exit_date_egfr_half = egfr_half_date
(15,271 missing values generated)

. format exit_date_egfr_half %td

. replace exit_date_egfr_half = min(deregistered_date,death_date,end_date,covid
> _exit) if egfr_half_date==. & index_date_egfr_half!=.
(6,247 real changes made)

. replace exit_date_egfr_half = covid_exit if covid_exit < egfr_half_date
(3,611 real changes made)

. gen follow_up_time_egfr_half = (exit_date_egfr_half - index_date_egfr_half)
(9,889 missing values generated)

. label var follow_up_time_egfr_half "Follow-up time (50% eGFR reduction) (Days
> )"

. replace egfr_half_date=. if covid_exit<egfr_half_date&case==0
(632 real changes made, 632 to missing)

. gen egfr_half_denominator = 0

. replace egfr_half_denominator = 1 if index_date_egfr_half!=.
(12,700 real changes made)

. gen follow_up_years_egfr_half = follow_up_time_egfr_half/365.25
(9,889 missing values generated)

. 
. * AKI (or ESRD)
. gen index_date_aki = index_date

. gen aki_date = date(acute_kidney_injury_outcome, "YMD")
(20,315 missing values generated)

. format aki_date %td

. drop acute_kidney_injury_outcome

. replace aki_date = esrd_date if aki_date==.
(1,785 real changes made)

. gen aki = 0

. replace aki = 1 if aki_date!=.
(4,059 real changes made)

. label var aki "Acute kidney injury"

. * Exit date (AKI)
. gen exit_date_aki = aki_date
(18,530 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,death_date,end_date,covid_exit)
>   if aki_date==.
(18,530 real changes made)

. replace exit_date_aki = covid_exit if covid_exit < aki_date
(577 real changes made)

. replace aki_date=. if covid_exit<aki_date&case==0
(308 real changes made, 308 to missing)

. gen aki_denominator = 1

. gen follow_up_time_aki = (exit_date_aki - index_date_aki)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. gen follow_up_years_aki = follow_up_time_aki/365.25

. 
. * Exit date (death)
. gen index_date_death = index_date

. gen exit_date_death = death_date
(21,179 missing values generated)

. gen death = 0

. replace death = 1 if death_date!=.
(1,410 real changes made)

. label var death "Death"

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date,covid_exit)  if deat
> h_date==.
(21,179 real changes made)

. replace exit_date_death = covid_exit if covid_exit < death_date
(369 real changes made)

. replace death_date=. if covid_exit<death_date&case==0
(268 real changes made, 268 to missing)

. gen death_denominator = 1

. gen follow_up_time_death = (exit_date_death - index_date_death)

. label var follow_up_time_death "Follow-up time (death) (Days)"

. gen follow_up_years_death = follow_up_time_death/365.25

. 
. *Outcomes stratified by time period
. 
. local outcome "esrd egfr_half aki death"

. foreach out of local outcome {
  2. *0-29 days
. gen `out'_date29 = `out'_date if `out'_date < (index_date_`out' + 30) 
  3. gen exit_date29_`out' = `out'_date29
  4. gen index_date29_`out' = index_date_`out'
  5. format exit_date29_`out' %td
  6. replace exit_date29_`out' = min(deregistered_date, death_date, end_date, (
> index_date_`out' + 29)) if `out'_date29==.
  7. *stset exit_date29_`out', fail(`out'_date29) origin(index_date29_`out') id
> (unique) scale(365.25)
. *30-89 days
. gen `out'_date89 = `out'_date if `out'_date < (index_date_`out' + 90) 
  8. gen exit_date89_`out' = `out'_date89
  9. gen index_date89_`out' = index_date_`out' + 30
 10. format exit_date89_`out' %td
 11. replace exit_date89_`out' = min(deregistered_date, death_date, end_date, (
> index_date_`out' + 89)) if `out'_date89==.
 12. *stset exit_date89_`out', fail(`out'_date89) origin(index_date89_`out') id
> (unique) scale(365.25)
. *90-179 days
. gen `out'_date179 = `out'_date if `out'_date < (index_date_`out' + 180) 
 13. gen exit_date179_`out' = `out'_date179
 14. gen index_date179_`out' = index_date_`out' + 90
 15. format exit_date179_`out' %td
 16. replace exit_date179_`out' = min(deregistered_date, death_date, end_date, 
> (index_date_`out' + 179)) if `out'_date179==.
 17. *stset exit_date179_`out', fail(`out'_date179) origin(index_date179_`out')
>  id(unique) scale(365.25)
. *180+ days
. gen index_datemax_`out' = index_date_`out' + 180
 18. gen exit_datemax_`out' = exit_date_`out'
 19. gen `out'_datemax = `out'_date
 20. *stset exit_date_`out', fail(`out'_date) origin(index_datemax_`out') id(un
> ique) scale(365.25)
. }       
(22,411 missing values generated)
(22,411 missing values generated)
(22,411 real changes made)
(22,219 missing values generated)
(22,219 missing values generated)
(22,219 real changes made)
(21,944 missing values generated)
(21,944 missing values generated)
(21,944 real changes made)
(20,589 missing values generated)
(21,278 missing values generated)
(21,278 missing values generated)
(9,889 missing values generated)
(21,278 real changes made)
(19,954 missing values generated)
(19,954 missing values generated)
(9,889 missing values generated)
(19,954 real changes made)
(18,667 missing values generated)
(18,667 missing values generated)
(9,889 missing values generated)
(18,667 real changes made)
(9,889 missing values generated)
(6,120 missing values generated)
(15,903 missing values generated)
(21,715 missing values generated)
(21,715 missing values generated)
(21,715 real changes made)
(21,425 missing values generated)
(21,425 missing values generated)
(21,425 real changes made)
(21,006 missing values generated)
(21,006 missing values generated)
(21,006 real changes made)
(18,838 missing values generated)
(22,533 missing values generated)
(22,533 missing values generated)
(22,533 real changes made)
(22,437 missing values generated)
(22,437 missing values generated)
(22,437 real changes made)
(22,282 missing values generated)
(22,282 missing values generated)
(22,282 real changes made)
(21,447 missing values generated)

. 
. save ./output/analysis_2020.dta, replace
(note: file ./output/analysis_2020.dta not found)
file ./output/analysis_2020.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/analysis_2020.log
  log type:  text
 closed on:  20 Apr 2024, 23:29:13
-------------------------------------------------------------------------------
