------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/ckd_progression.log
  log type:  text
 opened on:   1 Feb 2023, 12:08:54

. 
. cap file close tablecontent

. file open tablecontent using ./output/ckd_progression.csv, write text replace
(file ./output/ckd_progression.csv not found)

. 
. **Column headings
. *There are three column headings for each year 2017-2022:
. *Column 1 = the number of people in each CKD group as of the beginning of each year (i.e. in April)
. *Column 2 = the number of people who remain within the same CKD group, progress to a more advanced CKD group, or die by the end of the year (i.e. by the subsequent April)
. *Column 3 = Column 2 as a percentage of Column 1
. file write tablecontent _tab _tab ("April_2017_N") _tab ("End_2017-2018_N") _tab ("End_2017-2018_pc") _tab ("April_2018_N") _tab ("End_2018-2019_N") _tab ("End_2018-2019_pc") _tab ("April_2019_N") _tab ("End_2019-2020_N") _tab ("End_2019-2020_pc") _t
> ab ("April_2020_N") _tab ("End_2020-2021_N") _tab ("End_2020-2021_pc") _tab ("April_2021_N") _tab ("End_2021-2022_N") _tab ("End_2021-2022_pc") _tab ("April_2022_N") _tab ("End_2022-2023_N") _tab ("End_2022-2023_pc") _n(2)

. 
. **Loops through datasets for each year `x' 2017-2022
. local year "2017 2018 2019 2020 2021 2022"

. foreach x of local year {
  2. use ./output/`x'_ckd_complete.dta, clear
  3. 
. **Disclosure minimisation
. *count provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year `x'
. qui count if ckd_group==1
  4. local baseline_ckd2_`x' = round(r(N),5)
  5. *Number/percentage of people in group who do not progress by the end of the year
. qui count if ckd_group==1 & ckd_progression==0
  6. local none_`x' = round(r(N),5)
  7. local percent_none_`x' = (`none_`x''/`baseline_ckd2_`x'')*100
  8. *Number/percentage of people in group who progress to CKD stage 3 by the end of the year
. qui count if ckd_group==1 & ckd_progression==1
  9. local ckd3_`x' = round(r(N),5)
 10. local percent_ckd3_`x' = (`ckd3_`x''/`baseline_ckd2_`x'')*100
 11. *Number/percentage of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui count if ckd_group==1 & ckd_progression==2
 12. local ckd4_`x' = round(r(N),5)
 13. local percent_ckd4_`x' = (`ckd4_`x''/`baseline_ckd2_`x'')*100
 14. *Number/percentage of people in group who progress to dialysis by the end of the year
. qui count if ckd_group==1 & ckd_progression==3
 15. local dialysis_`x' = round(r(N),5)
 16. local percent_dialysis_`x' = (`dialysis_`x''/`baseline_ckd2_`x'')*100
 17. *Number/percentage of people in group who progress to kidney transplant by the end of the year
. qui count if ckd_group==1 & ckd_progression==4
 18. local transplant_`x' = round(r(N),5)
 19. local percent_transplant_`x' = (`transplant_`x''/`baseline_ckd2_`x'')*100
 20. *Number/percentage of people in group who progress to KRT (unclear modality) by the end of the year
. qui count if ckd_group==1 & ckd_progression==5
 21. local unclear_`x' = round(r(N),5)
 22. local percent_unclear_`x' = (`unclear_`x''/`baseline_ckd2_`x'')*100
 23. *Number/percentage of people in group who die by the end of the year
. qui count if ckd_group==1 & ckd_progression==6
 24. local deceased_`x' = round(r(N),5)
 25. local percent_deceased_`x' = (`deceased_`x''/`baseline_ckd2_`x'')*100
 26. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year `x'
. qui count if ckd_group==2
 27. local baseline_ckd3_`x' = round(r(N),5)
 28. *Number/percentage of people in group who do not progress by the end of the year
. qui count if ckd_group==2 & ckd_progression==0
 29. local none_`x' = round(r(N),5)
 30. local percent_none_`x' = (`none_`x''/`baseline_ckd3_`x'')*100
 31. *Number/percentage of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui count if ckd_group==2 & ckd_progression==2
 32. local ckd4_`x' = round(r(N),5)
 33. local percent_ckd4_`x' = (`ckd4_`x''/`baseline_ckd3_`x'')*100
 34. *Number/percentage of people in group who progress to dialysis by the end of the year
. qui count if ckd_group==2 & ckd_progression==3
 35. local dialysis_`x' = round(r(N),5)
 36. local percent_dialysis_`x' = (`dialysis_`x''/`baseline_ckd3_`x'')*100
 37. *Number/percentage of people in group who progress to kidney transplant by the end of the year
. qui count if ckd_group==2 & ckd_progression==4
 38. local transplant_`x' = round(r(N),5)
 39. local percent_transplant_`x' = (`transplant_`x''/`baseline_ckd3_`x'')*100
 40. *Number/percentage of people in group who progress to KRT (unclear modality) by the end of the year
. qui count if ckd_group==2 & ckd_progression==5
 41. local unclear_`x' = round(r(N),5)
 42. local percent_unclear_`x' = (`unclear_`x''/`baseline_ckd3_`x'')*100
 43. *Number/percentage of people in group who die by the end of the year
. qui count if ckd_group==2 & ckd_progression==6
 44. local deceased_`x' = round(r(N),5)
 45. local percent_deceased_`x' = (`deceased_`x''/`baseline_ckd3_`x'')*100
 46. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year `x'
. qui count if ckd_group==3
 47. local baseline_ckd4_`x' = round(r(N),5)
 48. *Number/percentage of people in group who do not progress by the end of the year
. qui count if ckd_group==3 & ckd_progression==0
 49. local none_`x' = round(r(N),5)
 50. local percent_none_`x' = (`none_`x''/`baseline_ckd4_`x'')*100
 51. *Number/percentage of people in group who progress to dialysis by the end of the year
. qui count if ckd_group==3 & ckd_progression==3
 52. local dialysis_`x' = round(r(N),5)
 53. local percent_dialysis_`x' = (`dialysis_`x''/`baseline_ckd4_`x'')*100
 54. *Number/percentage of people in group who progress to kidney transplant by the end of the year
. qui count if ckd_group==3 & ckd_progression==4
 55. local transplant_`x' = round(r(N),5)
 56. local percent_transplant_`x' = (`transplant_`x''/`baseline_ckd4_`x'')*100
 57. *Number/percentage of people in group who progress to KRT (unclear modality) by the end of the year
. qui count if ckd_group==3 & ckd_progression==5
 58. local unclear_`x' = round(r(N),5)
 59. local percent_unclear_`x' = (`unclear_`x''/`baseline_ckd4_`x'')*100
 60. *Number/percentage of people in group who die by the end of the year
. qui count if ckd_group==3 & ckd_progression==6
 61. local deceased_`x' = round(r(N),5)
 62. local percent_deceased_`x' = (`deceased_`x''/`baseline_ckd4_`x'')*100
 63. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year `x'
. qui count if ckd_group==4
 64. local baseline_dialysis_`x' = round(r(N),5)
 65. *Number/percentage of people in group remaining on dialysis by the end of the year
. qui count if ckd_group==4 & ckd_progression==0
 66. local none_`x' = round(r(N),5)
 67. local percent_none_`x' = (`none_`x''/`baseline_dialysis_`x'')*100
 68. *Number/percentage of people in group with kidney transplant by the end of the year
. qui count if ckd_group==4 & ckd_progression==4
 69. local transplant_`x' = round(r(N),5)
 70. local percent_transplant_`x' = (`transplant_`x''/`baseline_dialysis_`x'')*100
 71. *Number/percentage of people in group who die by the end of the year
. qui count if ckd_group==4 & ckd_progression==6
 72. local deceased_`x' = round(r(N),5)
 73. local percent_deceased_`x' = (`deceased_`x''/`baseline_dialysis_`x'')*100
 74. 
. **Kidney transplant
. *Number of people in group (baseline_transplant_`x') at the beginning of each year `x'
. qui count if ckd_group==5
 75. local baseline_transplant_`x' = round(r(N),5)
 76. *Number/percentage of people in group remaining with kidney transplant by the end of the year
. qui count if ckd_group==5 & ckd_progression==0
 77. local none_`x' = round(r(N),5)
 78. local percent_none_`x' = (`none_`x''/`baseline_transplant_`x'')*100
 79. *Number/percentage of people in group on dialysis by the end of the year
. qui count if ckd_group==5 & ckd_progression==3
 80. local dialysis_`x' = round(r(N),5)
 81. local percent_dialysis_`x' = (`dialysis_`x''/`baseline_transplant_`x'')*100
 82. *Number/percentage of people in group who die by the end of the year
. qui count if ckd_group==5 & ckd_progression==6
 83. local deceased_`x' = round(r(N),5)
 84. local percent_deceased_`x' = (`deceased_`x''/`baseline_transplant_`x'')*100
 85. 
. **KRT unclear modality
. *Number of people in group (baseline_unclear_`x') at the beginning of each year `x'
. qui count if ckd_group==6
 86. local baseline_unclear_`x' = round(r(N),5)
 87. *Number/percentage of people in group remaining in group by the end of the year
. qui count if ckd_group==6 & ckd_progression==0
 88. local none_`x' = round(r(N),5)
 89. local percent_none_`x' = (`none_`x''/`baseline_unclear_`x'')*100
 90. *Number/percentage of people in group on dialysis by the end of the year
. qui count if ckd_group==6 & ckd_progression==3
 91. local dialysis_`x' = round(r(N),5)
 92. local percent_dialysis_`x' = (`dialysis_`x''/`baseline_unclear_`x'')*100
 93. *Number/percentage of people in group with kidney transplant by the end of the year
. qui count if ckd_group==6 & ckd_progression==4
 94. local transplant_`x' = round(r(N),5)
 95. local percent_transplant_`x' = (`transplant_`x''/`baseline_unclear_`x'')*100
 96. *Number/percentage of people in group who die by the end of the year
. qui count if ckd_group==6 & ckd_progression==6
 97. local deceased_`x' = round(r(N),5)
 98. local percent_deceased_`x' = (`deceased_`x''/`baseline_unclear_`x'')*100
 99. }
file ./output/2017_ckd_complete.dta not found
r(601);

end of do-file

r(601);

. cd ..
C:\Users\lsh1703468\Documents

. cd repo
C:\Users\lsh1703468\Documents\repo

. cd ckd-healthcare-use
C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD5158_000000.tmp"

. sysdir set PLUS ./analysis/adofiles

. sysdir set PERSONAL ./analysis/adofiles

. pwd
C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use

. cap log close
