-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_matches_2017.log
  log type:  text
 opened on:  26 Oct 2022, 22:33:06

. 
. *(1)=========Change source files to stata format============
. foreach i of numlist 5/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily import delimited ./output/matched_matches_2017_stp
> `i'.csv, clear
  3.         capture noisily tempfile matched_matches_2017_stp`i'
  4.         capture noisily save `matched_matches_2017_stp`i'', replace
  5. }
(11 vars, 384 obs)
(note: file /tmp/St00012.000001 not found)
file /tmp/St00012.000001 saved
(11 vars, 378 obs)
(note: file /tmp/St00012.000002 not found)
file /tmp/St00012.000002 saved
(11 vars, 386 obs)
(note: file /tmp/St00012.000003 not found)
file /tmp/St00012.000003 saved
(11 vars, 352 obs)
(note: file /tmp/St00012.000004 not found)
file /tmp/St00012.000004 saved
(11 vars, 375 obs)
(note: file /tmp/St00012.000005 not found)
file /tmp/St00012.000005 saved
(11 vars, 382 obs)
(note: file /tmp/St00012.000006 not found)
file /tmp/St00012.000006 saved
(11 vars, 364 obs)
(note: file /tmp/St00012.000007 not found)
file /tmp/St00012.000007 saved
(11 vars, 367 obs)
(note: file /tmp/St00012.000008 not found)
file /tmp/St00012.000008 saved
(11 vars, 403 obs)
(note: file /tmp/St00012.000009 not found)
file /tmp/St00012.000009 saved
(11 vars, 379 obs)
(note: file /tmp/St00012.00000a not found)
file /tmp/St00012.00000a saved
(11 vars, 396 obs)
(note: file /tmp/St00012.00000b not found)
file /tmp/St00012.00000b saved
(11 vars, 400 obs)
(note: file /tmp/St00012.00000c not found)
file /tmp/St00012.00000c saved
(11 vars, 392 obs)
(note: file /tmp/St00012.00000d not found)
file /tmp/St00012.00000d saved
(11 vars, 361 obs)
(note: file /tmp/St00012.00000e not found)
file /tmp/St00012.00000e saved
(11 vars, 402 obs)
(note: file /tmp/St00012.00000f not found)
file /tmp/St00012.00000f saved
(11 vars, 368 obs)
(note: file /tmp/St00012.00000g not found)
file /tmp/St00012.00000g saved
(11 vars, 385 obs)
(note: file /tmp/St00012.00000h not found)
file /tmp/St00012.00000h saved
(11 vars, 379 obs)
(note: file /tmp/St00012.00000i not found)
file /tmp/St00012.00000i saved
(11 vars, 385 obs)
(note: file /tmp/St00012.00000j not found)
file /tmp/St00012.00000j saved
(11 vars, 360 obs)
(note: file /tmp/St00012.00000k not found)
file /tmp/St00012.00000k saved
(11 vars, 363 obs)
(note: file /tmp/St00012.00000l not found)
file /tmp/St00012.00000l saved
(11 vars, 339 obs)
(note: file /tmp/St00012.00000m not found)
file /tmp/St00012.00000m saved
(11 vars, 383 obs)
(note: file /tmp/St00012.00000n not found)
file /tmp/St00012.00000n saved
(11 vars, 415 obs)
(note: file /tmp/St00012.00000o not found)
file /tmp/St00012.00000o saved
(11 vars, 366 obs)
(note: file /tmp/St00012.00000p not found)
file /tmp/St00012.00000p saved
(11 vars, 408 obs)
(note: file /tmp/St00012.00000q not found)
file /tmp/St00012.00000q saved
(11 vars, 375 obs)
(note: file /tmp/St00012.00000r not found)
file /tmp/St00012.00000r saved
(11 vars, 333 obs)
(note: file /tmp/St00012.00000s not found)
file /tmp/St00012.00000s saved
(11 vars, 364 obs)
(note: file /tmp/St00012.00000t not found)
file /tmp/St00012.00000t saved
(11 vars, 377 obs)
(note: file /tmp/St00012.00000u not found)
file /tmp/St00012.00000u saved
(11 vars, 393 obs)
(note: file /tmp/St00012.00000v not found)
file /tmp/St00012.00000v saved

. 
. *(2)=========Append separate cases files==========
. use `matched_matches_2017_stp5', clear

. foreach i of numlist 6/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily append using `matched_matches_2017_stp`i'', force
  3. }

. 
. *save as .csv file for input into study definitions that add further variable
> s, erase dta version
. capture noisily export delimited using "./output/input_combined_stps_matches_
> 2017.csv", replace
(note: file ./output/input_combined_stps_matches_2017.csv not found)
file ./output/input_combined_stps_matches_2017.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_matches_2017.log
  log type:  text
 closed on:  26 Oct 2022, 22:33:08
-------------------------------------------------------------------------------
