-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_matches4_2017.log
  log type:  text
 opened on:  30 Nov 2022, 16:02:41

. 
. *(1)=========Change source files to stata format============
. foreach i of numlist 5/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily import delimited ./output/matched_matches_2017_4st
> p`i'.csv, clear
  3.         capture noisily tempfile matched_matches_2017_4stp`i'
  4.         capture noisily save `matched_matches_2017_4stp`i'', replace
  5. }
(10 vars, 393 obs)
(note: file /tmp/St00012.000001 not found)
file /tmp/St00012.000001 saved
(10 vars, 359 obs)
(note: file /tmp/St00012.000002 not found)
file /tmp/St00012.000002 saved
(10 vars, 411 obs)
(note: file /tmp/St00012.000003 not found)
file /tmp/St00012.000003 saved
(10 vars, 331 obs)
(note: file /tmp/St00012.000004 not found)
file /tmp/St00012.000004 saved
(10 vars, 353 obs)
(note: file /tmp/St00012.000005 not found)
file /tmp/St00012.000005 saved
(10 vars, 368 obs)
(note: file /tmp/St00012.000006 not found)
file /tmp/St00012.000006 saved
(10 vars, 307 obs)
(note: file /tmp/St00012.000007 not found)
file /tmp/St00012.000007 saved
(10 vars, 386 obs)
(note: file /tmp/St00012.000008 not found)
file /tmp/St00012.000008 saved
(10 vars, 325 obs)
(note: file /tmp/St00012.000009 not found)
file /tmp/St00012.000009 saved
(10 vars, 365 obs)
(note: file /tmp/St00012.00000a not found)
file /tmp/St00012.00000a saved
(10 vars, 338 obs)
(note: file /tmp/St00012.00000b not found)
file /tmp/St00012.00000b saved
(10 vars, 368 obs)
(note: file /tmp/St00012.00000c not found)
file /tmp/St00012.00000c saved
(10 vars, 378 obs)
(note: file /tmp/St00012.00000d not found)
file /tmp/St00012.00000d saved
(10 vars, 369 obs)
(note: file /tmp/St00012.00000e not found)
file /tmp/St00012.00000e saved
(10 vars, 392 obs)
(note: file /tmp/St00012.00000f not found)
file /tmp/St00012.00000f saved
(10 vars, 339 obs)
(note: file /tmp/St00012.00000g not found)
file /tmp/St00012.00000g saved
(10 vars, 353 obs)
(note: file /tmp/St00012.00000h not found)
file /tmp/St00012.00000h saved
(10 vars, 374 obs)
(note: file /tmp/St00012.00000i not found)
file /tmp/St00012.00000i saved
(10 vars, 390 obs)
(note: file /tmp/St00012.00000j not found)
file /tmp/St00012.00000j saved
(10 vars, 341 obs)
(note: file /tmp/St00012.00000k not found)
file /tmp/St00012.00000k saved
(10 vars, 401 obs)
(note: file /tmp/St00012.00000l not found)
file /tmp/St00012.00000l saved
(10 vars, 350 obs)
(note: file /tmp/St00012.00000m not found)
file /tmp/St00012.00000m saved
(10 vars, 377 obs)
(note: file /tmp/St00012.00000n not found)
file /tmp/St00012.00000n saved
(10 vars, 312 obs)
(note: file /tmp/St00012.00000o not found)
file /tmp/St00012.00000o saved
(10 vars, 350 obs)
(note: file /tmp/St00012.00000p not found)
file /tmp/St00012.00000p saved
(10 vars, 342 obs)
(note: file /tmp/St00012.00000q not found)
file /tmp/St00012.00000q saved
(10 vars, 404 obs)
(note: file /tmp/St00012.00000r not found)
file /tmp/St00012.00000r saved
(10 vars, 387 obs)
(note: file /tmp/St00012.00000s not found)
file /tmp/St00012.00000s saved
(10 vars, 397 obs)
(note: file /tmp/St00012.00000t not found)
file /tmp/St00012.00000t saved
(10 vars, 358 obs)
(note: file /tmp/St00012.00000u not found)
file /tmp/St00012.00000u saved
(10 vars, 376 obs)
(note: file /tmp/St00012.00000v not found)
file /tmp/St00012.00000v saved

. 
. *(2)=========Append separate cases files==========
. use `matched_matches_2017_4stp5', clear

. foreach i of numlist 6/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily append using `matched_matches_2017_4stp`i'', force
  3. }
(note: variable date_deregistered was byte in the using data, but will be
       str10 now)
(note: variable date_deregistered was byte in the using data, but will be
       str10 now)
(note: variable date_deregistered was byte in the using data, but will be
       str10 now)

. 
. *save as .csv file for input into study definitions that add further variable
> s, erase dta version
. capture noisily export delimited using "./output/input_combined_stps_matches4
> _2017.csv", replace
(note: file ./output/input_combined_stps_matches4_2017.csv not found)
file ./output/input_combined_stps_matches4_2017.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_matches4_2017.log
  log type:  text
 closed on:  30 Nov 2022, 16:02:44
-------------------------------------------------------------------------------
