------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/combine_historical_stps_after_matching.log
  log type:  text
 opened on:  21 Oct 2022, 17:20:34

. 
. *(1)=========Change source files to stata format============
. foreach i of numlist 5/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily import delimited ./output/matched_matches_historical_stp`i'.csv, clear
  3.         *FOR TESTING ON DUMMY DATA
.         *import delimited ./output/input_historical_matching_stp`i'.csv, clear
.         capture noisily tempfile matched_matches_historical_stp`i'
  4.         capture noisily save `matched_matches_historical_stp`i'', replace
  5. }
(encoding automatically selected: ISO-8859-1)
(11 vars, 100 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000001.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(11 vars, 58 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000002.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(11 vars, 38 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000003.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000003.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(11 vars, 53 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000004.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000004.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(11 vars, 54 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000005.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000005.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(11 vars, 26 obs)
_matched_matches_historical_stp10 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 56 obs)
_matched_matches_historical_stp12 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 54 obs)
_matched_matches_historical_stp13 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 27 obs)
_matched_matches_historical_stp14 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 50 obs)
_matched_matches_historical_stp15 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 40 obs)
_matched_matches_historical_stp16 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 58 obs)
_matched_matches_historical_stp17 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 44 obs)
_matched_matches_historical_stp20 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 53 obs)
_matched_matches_historical_stp21 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 40 obs)
_matched_matches_historical_stp22 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 52 obs)
_matched_matches_historical_stp23 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 47 obs)
_matched_matches_historical_stp24 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 30 obs)
_matched_matches_historical_stp25 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 55 obs)
_matched_matches_historical_stp26 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 46 obs)
_matched_matches_historical_stp27 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 38 obs)
_matched_matches_historical_stp29 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 57 obs)
_matched_matches_historical_stp33 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 42 obs)
_matched_matches_historical_stp35 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 35 obs)
_matched_matches_historical_stp36 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 63 obs)
_matched_matches_historical_stp37 invalid name
invalid file specification
file ./output/matched_matches_historical_stp40.csv not found
_matched_matches_historical_stp40 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 35 obs)
_matched_matches_historical_stp41 invalid name
invalid file specification
(encoding automatically selected: ISO-8859-1)
(11 vars, 48 obs)
_matched_matches_historical_stp42 invalid name
invalid file specification
file ./output/matched_matches_historical_stp43.csv not found
_matched_matches_historical_stp43 invalid name
invalid file specification
file ./output/matched_matches_historical_stp44.csv not found
_matched_matches_historical_stp44 invalid name
invalid file specification
file ./output/matched_matches_historical_stp49.csv not found
_matched_matches_historical_stp49 invalid name
invalid file specification

. 
. *(2)=========Append separate cases files==========
. use `matched_matches_historical_stp5', clear

. foreach i of numlist 6/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily append using `matched_matches_historical_stp`i'', force
  3. }
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification

. 
. *save as .csv file for input into study definitions that add further variables, erase dta version
. capture noisily export delimited using "./output/input_matched_matches_historical_allSTPs.csv", replace
(file ./output/input_matched_matches_historical_allSTPs.csv not found)
file ./output/input_matched_matches_historical_allSTPs.csv saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/combine_historical_stps_after_matching.log
  log type:  text
 closed on:  21 Oct 2022, 17:20:36
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
