-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_matches_2020.log
  log type:  text
 opened on:  26 Oct 2022, 22:42:20

. 
. *(1)=========Change source files to stata format============
. foreach i of numlist 5/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily import delimited ./output/matched_matches_2020_stp
> `i'.csv, clear
  3.         capture noisily tempfile matched_matches_2020_stp`i'
  4.         capture noisily save `matched_matches_2020_stp`i'', replace
  5. }
(18 vars, 323 obs)
(note: file /tmp/St00012.000001 not found)
file /tmp/St00012.000001 saved
(18 vars, 289 obs)
(note: file /tmp/St00012.000002 not found)
file /tmp/St00012.000002 saved
(18 vars, 285 obs)
(note: file /tmp/St00012.000003 not found)
file /tmp/St00012.000003 saved
(18 vars, 304 obs)
(note: file /tmp/St00012.000004 not found)
file /tmp/St00012.000004 saved
(18 vars, 266 obs)
(note: file /tmp/St00012.000005 not found)
file /tmp/St00012.000005 saved
(18 vars, 289 obs)
(note: file /tmp/St00012.000006 not found)
file /tmp/St00012.000006 saved
(18 vars, 290 obs)
(note: file /tmp/St00012.000007 not found)
file /tmp/St00012.000007 saved
(18 vars, 276 obs)
(note: file /tmp/St00012.000008 not found)
file /tmp/St00012.000008 saved
(18 vars, 292 obs)
(note: file /tmp/St00012.000009 not found)
file /tmp/St00012.000009 saved
(18 vars, 277 obs)
(note: file /tmp/St00012.00000a not found)
file /tmp/St00012.00000a saved
(18 vars, 284 obs)
(note: file /tmp/St00012.00000b not found)
file /tmp/St00012.00000b saved
(18 vars, 297 obs)
(note: file /tmp/St00012.00000c not found)
file /tmp/St00012.00000c saved
(18 vars, 314 obs)
(note: file /tmp/St00012.00000d not found)
file /tmp/St00012.00000d saved
(18 vars, 275 obs)
(note: file /tmp/St00012.00000e not found)
file /tmp/St00012.00000e saved
(18 vars, 300 obs)
(note: file /tmp/St00012.00000f not found)
file /tmp/St00012.00000f saved
(18 vars, 282 obs)
(note: file /tmp/St00012.00000g not found)
file /tmp/St00012.00000g saved
(18 vars, 302 obs)
(note: file /tmp/St00012.00000h not found)
file /tmp/St00012.00000h saved
(18 vars, 277 obs)
(note: file /tmp/St00012.00000i not found)
file /tmp/St00012.00000i saved
(18 vars, 304 obs)
(note: file /tmp/St00012.00000j not found)
file /tmp/St00012.00000j saved
(18 vars, 311 obs)
(note: file /tmp/St00012.00000k not found)
file /tmp/St00012.00000k saved
(18 vars, 272 obs)
(note: file /tmp/St00012.00000l not found)
file /tmp/St00012.00000l saved
(18 vars, 266 obs)
(note: file /tmp/St00012.00000m not found)
file /tmp/St00012.00000m saved
(18 vars, 292 obs)
(note: file /tmp/St00012.00000n not found)
file /tmp/St00012.00000n saved
(18 vars, 272 obs)
(note: file /tmp/St00012.00000o not found)
file /tmp/St00012.00000o saved
(18 vars, 285 obs)
(note: file /tmp/St00012.00000p not found)
file /tmp/St00012.00000p saved
(18 vars, 298 obs)
(note: file /tmp/St00012.00000q not found)
file /tmp/St00012.00000q saved
(18 vars, 303 obs)
(note: file /tmp/St00012.00000r not found)
file /tmp/St00012.00000r saved
(18 vars, 277 obs)
(note: file /tmp/St00012.00000s not found)
file /tmp/St00012.00000s saved
(18 vars, 304 obs)
(note: file /tmp/St00012.00000t not found)
file /tmp/St00012.00000t saved
(18 vars, 315 obs)
(note: file /tmp/St00012.00000u not found)
file /tmp/St00012.00000u saved
(18 vars, 317 obs)
(note: file /tmp/St00012.00000v not found)
file /tmp/St00012.00000v saved

. 
. *(2)=========Append separate cases files==========
. use `matched_matches_2020_stp5', clear

. foreach i of numlist 6/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily append using `matched_matches_2020_stp`i'', force
  3. }

. 
. *save as .csv file for input into study definitions that add further variable
> s, erase dta version
. capture noisily export delimited using "./output/input_combined_stps_matches_
> 2020.csv", replace
(note: file ./output/input_combined_stps_matches_2020.csv not found)
file ./output/input_combined_stps_matches_2020.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_matches_2020.log
  log type:  text
 closed on:  26 Oct 2022, 22:42:21
-------------------------------------------------------------------------------
