-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_matches3_2017.log
  log type:  text
 opened on:  30 Nov 2022, 15:37:51

. 
. *(1)=========Change source files to stata format============
. foreach i of numlist 5/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily import delimited ./output/matched_matches_2017_3st
> p`i'.csv, clear
  3.         capture noisily tempfile matched_matches_2017_3stp`i'
  4.         capture noisily save `matched_matches_2017_3stp`i'', replace
  5. }
(10 vars, 260 obs)
(note: file /tmp/St00011.000001 not found)
file /tmp/St00011.000001 saved
(10 vars, 202 obs)
(note: file /tmp/St00011.000002 not found)
file /tmp/St00011.000002 saved
(10 vars, 267 obs)
(note: file /tmp/St00011.000003 not found)
file /tmp/St00011.000003 saved
(10 vars, 252 obs)
(note: file /tmp/St00011.000004 not found)
file /tmp/St00011.000004 saved
(10 vars, 294 obs)
(note: file /tmp/St00011.000005 not found)
file /tmp/St00011.000005 saved
(10 vars, 204 obs)
(note: file /tmp/St00011.000006 not found)
file /tmp/St00011.000006 saved
(10 vars, 231 obs)
(note: file /tmp/St00011.000007 not found)
file /tmp/St00011.000007 saved
(10 vars, 240 obs)
(note: file /tmp/St00011.000008 not found)
file /tmp/St00011.000008 saved
(10 vars, 247 obs)
(note: file /tmp/St00011.000009 not found)
file /tmp/St00011.000009 saved
(10 vars, 273 obs)
(note: file /tmp/St00011.00000a not found)
file /tmp/St00011.00000a saved
(10 vars, 218 obs)
(note: file /tmp/St00011.00000b not found)
file /tmp/St00011.00000b saved
(10 vars, 227 obs)
(note: file /tmp/St00011.00000c not found)
file /tmp/St00011.00000c saved
(10 vars, 272 obs)
(note: file /tmp/St00011.00000d not found)
file /tmp/St00011.00000d saved
(10 vars, 217 obs)
(note: file /tmp/St00011.00000e not found)
file /tmp/St00011.00000e saved
(10 vars, 241 obs)
(note: file /tmp/St00011.00000f not found)
file /tmp/St00011.00000f saved
(10 vars, 192 obs)
(note: file /tmp/St00011.00000g not found)
file /tmp/St00011.00000g saved
(10 vars, 181 obs)
(note: file /tmp/St00011.00000h not found)
file /tmp/St00011.00000h saved
(10 vars, 230 obs)
(note: file /tmp/St00011.00000i not found)
file /tmp/St00011.00000i saved
(10 vars, 228 obs)
(note: file /tmp/St00011.00000j not found)
file /tmp/St00011.00000j saved
(10 vars, 234 obs)
(note: file /tmp/St00011.00000k not found)
file /tmp/St00011.00000k saved
(10 vars, 218 obs)
(note: file /tmp/St00011.00000l not found)
file /tmp/St00011.00000l saved
(10 vars, 299 obs)
(note: file /tmp/St00011.00000m not found)
file /tmp/St00011.00000m saved
(10 vars, 220 obs)
(note: file /tmp/St00011.00000n not found)
file /tmp/St00011.00000n saved
(10 vars, 204 obs)
(note: file /tmp/St00011.00000o not found)
file /tmp/St00011.00000o saved
(10 vars, 213 obs)
(note: file /tmp/St00011.00000p not found)
file /tmp/St00011.00000p saved
(10 vars, 265 obs)
(note: file /tmp/St00011.00000q not found)
file /tmp/St00011.00000q saved
(10 vars, 252 obs)
(note: file /tmp/St00011.00000r not found)
file /tmp/St00011.00000r saved
(10 vars, 225 obs)
(note: file /tmp/St00011.00000s not found)
file /tmp/St00011.00000s saved
(10 vars, 191 obs)
(note: file /tmp/St00011.00000t not found)
file /tmp/St00011.00000t saved
(10 vars, 247 obs)
(note: file /tmp/St00011.00000u not found)
file /tmp/St00011.00000u saved
(10 vars, 288 obs)
(note: file /tmp/St00011.00000v not found)
file /tmp/St00011.00000v saved

. 
. *(2)=========Append separate cases files==========
. use `matched_matches_2017_3stp5', clear

. foreach i of numlist 6/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily append using `matched_matches_2017_3stp`i'', force
  3. }
(note: variable date_deregistered was byte in the using data, but will be
       str10 now)

. 
. *save as .csv file for input into study definitions that add further variable
> s, erase dta version
. capture noisily export delimited using "./output/input_combined_stps_matches3
> _2017.csv", replace
(note: file ./output/input_combined_stps_matches3_2017.csv not found)
file ./output/input_combined_stps_matches3_2017.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_matches3_2017.log
  log type:  text
 closed on:  30 Nov 2022, 15:37:52
-------------------------------------------------------------------------------
