------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/combine_covid_stps_after_matching.log
  log type:  text
 opened on:  11 Oct 2022, 23:18:26

. 
. *(1)=========Change source files to stata format============
. foreach i of numlist 5/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily import delimited ./output/matched_cases_contemporary_stp`i'.csv, clear
  3.         *FOR TESTING ON DUMMY DATA
.         *import delimited ./output/input_covid_matching_stp`i'.csv, clear
.         capture noisily tempfile matched_cases_contemporary_stp`i'
  4.         capture noisily save `matched_cases_contemporary_stp`i'', replace
  5. }
file ./output/matched_cases_contemporary_stp5.csv not found
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000001.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp6.csv not found
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000002.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp7.csv not found
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000003.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000003.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp8.csv not found
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000004.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000004.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp9.csv not found
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp10.csv not found
_matched_cases_contemporary_stp10 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp12.csv not found
_matched_cases_contemporary_stp12 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp13.csv not found
_matched_cases_contemporary_stp13 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp14.csv not found
_matched_cases_contemporary_stp14 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp15.csv not found
_matched_cases_contemporary_stp15 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp16.csv not found
_matched_cases_contemporary_stp16 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp17.csv not found
_matched_cases_contemporary_stp17 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp20.csv not found
_matched_cases_contemporary_stp20 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp21.csv not found
_matched_cases_contemporary_stp21 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp22.csv not found
_matched_cases_contemporary_stp22 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp23.csv not found
_matched_cases_contemporary_stp23 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp24.csv not found
_matched_cases_contemporary_stp24 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp25.csv not found
_matched_cases_contemporary_stp25 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp26.csv not found
_matched_cases_contemporary_stp26 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp27.csv not found
_matched_cases_contemporary_stp27 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp29.csv not found
_matched_cases_contemporary_stp29 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
file ./output/matched_cases_contemporary_stp33.csv not found
_matched_cases_contemporary_stp33 invalid name
file C:\Users\LSH170~1\AppData\Local\Temp\ST_72b4_000005.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(13 vars, 372 obs)
_matched_cases_contemporary_stp35 invalid name
invalid file specification
file ./output/matched_cases_contemporary_stp36.csv not found
_matched_cases_contemporary_stp36 invalid name
invalid file specification
file ./output/matched_cases_contemporary_stp37.csv not found
_matched_cases_contemporary_stp37 invalid name
invalid file specification
file ./output/matched_cases_contemporary_stp40.csv not found
_matched_cases_contemporary_stp40 invalid name
invalid file specification
file ./output/matched_cases_contemporary_stp41.csv not found
_matched_cases_contemporary_stp41 invalid name
invalid file specification
file ./output/matched_cases_contemporary_stp42.csv not found
_matched_cases_contemporary_stp42 invalid name
invalid file specification
file ./output/matched_cases_contemporary_stp43.csv not found
_matched_cases_contemporary_stp43 invalid name
invalid file specification
file ./output/matched_cases_contemporary_stp44.csv not found
_matched_cases_contemporary_stp44 invalid name
invalid file specification
file ./output/matched_cases_contemporary_stp49.csv not found
_matched_cases_contemporary_stp49 invalid name
invalid file specification

. 
. *(2)=========Append separate cases files==========
. use `matched_cases_contemporary_stp5', clear

. foreach i of numlist 6/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily append using `matched_cases_contemporary_stp`i'', force
  3. }
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification
invalid file specification

. 
. *save as .csv file for input into study definitions that add further variables, erase dta version
. capture noisily export delimited using "./output/input_matched_cases_contemporary_allSTPs.csv", replace
(file ./output/input_matched_cases_contemporary_allSTPs.csv not found)
file ./output/input_matched_cases_contemporary_allSTPs.csv saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/combine_covid_stps_after_matching.log
  log type:  text
 closed on:  11 Oct 2022, 23:18:27
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
