-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_matches_2020.log
  log type:  text
 opened on:  27 Oct 2022, 23:46:15

. 
. *(1)=========Change source files to stata format============
. foreach i of numlist 5/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily import delimited ./output/matched_matches_2020_stp
> `i'.csv, clear
  3.         capture noisily tempfile matched_matches_2020_stp`i'
  4.         capture noisily save `matched_matches_2020_stp`i'', replace
  5. }
(17 vars, 711 obs)
(note: file /tmp/St00011.000001 not found)
file /tmp/St00011.000001 saved
(17 vars, 672 obs)
(note: file /tmp/St00011.000002 not found)
file /tmp/St00011.000002 saved
(17 vars, 681 obs)
(note: file /tmp/St00011.000003 not found)
file /tmp/St00011.000003 saved
(17 vars, 673 obs)
(note: file /tmp/St00011.000004 not found)
file /tmp/St00011.000004 saved
(17 vars, 675 obs)
(note: file /tmp/St00011.000005 not found)
file /tmp/St00011.000005 saved
(17 vars, 670 obs)
(note: file /tmp/St00011.000006 not found)
file /tmp/St00011.000006 saved
(17 vars, 689 obs)
(note: file /tmp/St00011.000007 not found)
file /tmp/St00011.000007 saved
(17 vars, 654 obs)
(note: file /tmp/St00011.000008 not found)
file /tmp/St00011.000008 saved
(17 vars, 684 obs)
(note: file /tmp/St00011.000009 not found)
file /tmp/St00011.000009 saved
(17 vars, 669 obs)
(note: file /tmp/St00011.00000a not found)
file /tmp/St00011.00000a saved
(17 vars, 717 obs)
(note: file /tmp/St00011.00000b not found)
file /tmp/St00011.00000b saved
(17 vars, 662 obs)
(note: file /tmp/St00011.00000c not found)
file /tmp/St00011.00000c saved
(17 vars, 680 obs)
(note: file /tmp/St00011.00000d not found)
file /tmp/St00011.00000d saved
(17 vars, 692 obs)
(note: file /tmp/St00011.00000e not found)
file /tmp/St00011.00000e saved
(17 vars, 656 obs)
(note: file /tmp/St00011.00000f not found)
file /tmp/St00011.00000f saved
(17 vars, 698 obs)
(note: file /tmp/St00011.00000g not found)
file /tmp/St00011.00000g saved
(17 vars, 687 obs)
(note: file /tmp/St00011.00000h not found)
file /tmp/St00011.00000h saved
(17 vars, 686 obs)
(note: file /tmp/St00011.00000i not found)
file /tmp/St00011.00000i saved
(17 vars, 663 obs)
(note: file /tmp/St00011.00000j not found)
file /tmp/St00011.00000j saved
(17 vars, 710 obs)
(note: file /tmp/St00011.00000k not found)
file /tmp/St00011.00000k saved
(17 vars, 695 obs)
(note: file /tmp/St00011.00000l not found)
file /tmp/St00011.00000l saved
(17 vars, 691 obs)
(note: file /tmp/St00011.00000m not found)
file /tmp/St00011.00000m saved
(17 vars, 667 obs)
(note: file /tmp/St00011.00000n not found)
file /tmp/St00011.00000n saved
(17 vars, 673 obs)
(note: file /tmp/St00011.00000o not found)
file /tmp/St00011.00000o saved
(17 vars, 681 obs)
(note: file /tmp/St00011.00000p not found)
file /tmp/St00011.00000p saved
(17 vars, 696 obs)
(note: file /tmp/St00011.00000q not found)
file /tmp/St00011.00000q saved
(17 vars, 647 obs)
(note: file /tmp/St00011.00000r not found)
file /tmp/St00011.00000r saved
(17 vars, 700 obs)
(note: file /tmp/St00011.00000s not found)
file /tmp/St00011.00000s saved
(17 vars, 706 obs)
(note: file /tmp/St00011.00000t not found)
file /tmp/St00011.00000t saved
(17 vars, 662 obs)
(note: file /tmp/St00011.00000u not found)
file /tmp/St00011.00000u saved
(17 vars, 680 obs)
(note: file /tmp/St00011.00000v not found)
file /tmp/St00011.00000v saved

. 
. *(2)=========Append separate cases files==========
. use `matched_matches_2020_stp5', clear

. foreach i of numlist 6/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily append using `matched_matches_2020_stp`i'', force
  3. }

. 
. *save as .csv file for input into study definitions that add further variable
> s, erase dta version
. capture noisily export delimited using "./output/input_combined_stps_matches_
> 2020.csv", replace
(note: file ./output/input_combined_stps_matches_2020.csv not found)
file ./output/input_combined_stps_matches_2020.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_matches_2020.log
  log type:  text
 closed on:  27 Oct 2022, 23:46:17
-------------------------------------------------------------------------------
