-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_matches_2017.log
  log type:  text
 opened on:  19 Jul 2023, 22:54:00

. 
. *(1)=========Change source files to stata format============
. foreach i of numlist 5/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily import delimited ./output/matched_matches_2017_stp
> `i'.csv, clear
  3.         capture noisily tempfile matched_matches_2017_stp`i'
  4.         capture noisily save `matched_matches_2017_stp`i'', replace
  5. }
(10 vars, 771 obs)
(note: file /tmp/St00016.000001 not found)
file /tmp/St00016.000001 saved
(10 vars, 702 obs)
(note: file /tmp/St00016.000002 not found)
file /tmp/St00016.000002 saved
(10 vars, 711 obs)
(note: file /tmp/St00016.000003 not found)
file /tmp/St00016.000003 saved
(10 vars, 695 obs)
(note: file /tmp/St00016.000004 not found)
file /tmp/St00016.000004 saved
(10 vars, 713 obs)
(note: file /tmp/St00016.000005 not found)
file /tmp/St00016.000005 saved
(10 vars, 690 obs)
(note: file /tmp/St00016.000006 not found)
file /tmp/St00016.000006 saved
(10 vars, 691 obs)
(note: file /tmp/St00016.000007 not found)
file /tmp/St00016.000007 saved
(10 vars, 679 obs)
(note: file /tmp/St00016.000008 not found)
file /tmp/St00016.000008 saved
(10 vars, 660 obs)
(note: file /tmp/St00016.000009 not found)
file /tmp/St00016.000009 saved
(10 vars, 673 obs)
(note: file /tmp/St00016.00000a not found)
file /tmp/St00016.00000a saved
(10 vars, 719 obs)
(note: file /tmp/St00016.00000b not found)
file /tmp/St00016.00000b saved
(10 vars, 684 obs)
(note: file /tmp/St00016.00000c not found)
file /tmp/St00016.00000c saved
(10 vars, 696 obs)
(note: file /tmp/St00016.00000d not found)
file /tmp/St00016.00000d saved
(10 vars, 675 obs)
(note: file /tmp/St00016.00000e not found)
file /tmp/St00016.00000e saved
(10 vars, 678 obs)
(note: file /tmp/St00016.00000f not found)
file /tmp/St00016.00000f saved
(10 vars, 679 obs)
(note: file /tmp/St00016.00000g not found)
file /tmp/St00016.00000g saved
(10 vars, 701 obs)
(note: file /tmp/St00016.00000h not found)
file /tmp/St00016.00000h saved
(10 vars, 711 obs)
(note: file /tmp/St00016.00000i not found)
file /tmp/St00016.00000i saved
(10 vars, 718 obs)
(note: file /tmp/St00016.00000j not found)
file /tmp/St00016.00000j saved
(10 vars, 720 obs)
(note: file /tmp/St00016.00000k not found)
file /tmp/St00016.00000k saved
(10 vars, 663 obs)
(note: file /tmp/St00016.00000l not found)
file /tmp/St00016.00000l saved
(10 vars, 682 obs)
(note: file /tmp/St00016.00000m not found)
file /tmp/St00016.00000m saved
(10 vars, 711 obs)
(note: file /tmp/St00016.00000n not found)
file /tmp/St00016.00000n saved
(10 vars, 721 obs)
(note: file /tmp/St00016.00000o not found)
file /tmp/St00016.00000o saved
(10 vars, 690 obs)
(note: file /tmp/St00016.00000p not found)
file /tmp/St00016.00000p saved
(10 vars, 666 obs)
(note: file /tmp/St00016.00000q not found)
file /tmp/St00016.00000q saved
(10 vars, 695 obs)
(note: file /tmp/St00016.00000r not found)
file /tmp/St00016.00000r saved
(10 vars, 667 obs)
(note: file /tmp/St00016.00000s not found)
file /tmp/St00016.00000s saved
(10 vars, 693 obs)
(note: file /tmp/St00016.00000t not found)
file /tmp/St00016.00000t saved
(10 vars, 700 obs)
(note: file /tmp/St00016.00000u not found)
file /tmp/St00016.00000u saved
(10 vars, 680 obs)
(note: file /tmp/St00016.00000v not found)
file /tmp/St00016.00000v saved

. 
. *(2)=========Append separate cases files==========
. use `matched_matches_2017_stp5', clear

. foreach i of numlist 6/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily append using `matched_matches_2017_stp`i'', force
  3. }

. 
. *save as .csv file for input into study definitions that add further variable
> s, erase dta version
. capture noisily export delimited using "./output/input_combined_stps_matches_
> 2017.csv", replace
(note: file ./output/input_combined_stps_matches_2017.csv not found)
file ./output/input_combined_stps_matches_2017.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_matches_2017.log
  log type:  text
 closed on:  19 Jul 2023, 22:54:04
-------------------------------------------------------------------------------
