------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/combine_stps_matches_2020.log
  log type:  text
 opened on:  24 Apr 2024, 15:58:04

. 
. *(1)=========Change source files to stata format============
. foreach i of numlist 5/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily import delimited ./output/matched_matches_2020_stp`i'.csv, clear
  3.         capture noisily tempfile matched_matches_2020_stp`i'
  4.         capture noisily save `matched_matches_2020_stp`i'', replace
  5. }
(encoding automatically selected: ISO-8859-1)
(12 vars, 225 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000001.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 162 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000002.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 156 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000003.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000003.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 145 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000004.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000004.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 150 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000005.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000005.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 150 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000006.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000006.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 151 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000007.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000007.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 157 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000008.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000008.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 155 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000009.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_000009.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 149 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000a.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000a.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 153 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000b.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000b.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 152 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000c.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000c.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 146 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000d.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000d.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 160 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000e.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000e.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 140 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000f.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000f.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 143 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000g.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000g.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 148 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000h.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000h.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 142 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000i.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000i.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 152 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000j.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000j.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 162 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000k.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000k.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 146 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000l.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000l.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 153 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000m.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000m.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 142 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000n.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000n.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 150 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000o.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000o.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 149 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000p.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000p.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 145 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000q.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000q.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 135 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000r.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000r.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 158 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000s.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000s.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 146 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000t.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000t.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 163 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000u.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000u.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(12 vars, 155 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000v.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_4594_00000v.tmp saved as .dta format

. 
. *(2)=========Append separate cases files==========
. use `matched_matches_2020_stp5', clear

. foreach i of numlist 6/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily append using `matched_matches_2020_stp`i'', force
  3. }
(note: variable date_deregistered was byte in the using data, but will be str10 now)

. 
. *save as .csv file for input into study definitions that add further variables, erase dta version
. capture noisily export delimited using "./output/input_combined_stps_matches_2020.csv", replace
file ./output/input_combined_stps_matches_2020.csv saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/combine_stps_matches_2020.log
  log type:  text
 closed on:  24 Apr 2024, 15:58:06
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
