-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_covid_2020.log
  log type:  text
 opened on:  27 Oct 2022, 23:41:44

. 
. *(1)=========Change source files to stata format============
. foreach i of numlist 5/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily import delimited ./output/matched_cases_2020_stp`i
> '.csv, clear
  3.         capture noisily tempfile matched_cases_2020_stp`i'
  4.         capture noisily save `matched_cases_2020_stp`i'', replace
  5. }
(14 vars, 500 obs)
(note: file /tmp/St00011.000001 not found)
file /tmp/St00011.000001 saved
(14 vars, 458 obs)
(note: file /tmp/St00011.000002 not found)
file /tmp/St00011.000002 saved
(14 vars, 459 obs)
(note: file /tmp/St00011.000003 not found)
file /tmp/St00011.000003 saved
(14 vars, 457 obs)
(note: file /tmp/St00011.000004 not found)
file /tmp/St00011.000004 saved
(14 vars, 455 obs)
(note: file /tmp/St00011.000005 not found)
file /tmp/St00011.000005 saved
(14 vars, 463 obs)
(note: file /tmp/St00011.000006 not found)
file /tmp/St00011.000006 saved
(14 vars, 454 obs)
(note: file /tmp/St00011.000007 not found)
file /tmp/St00011.000007 saved
(14 vars, 469 obs)
(note: file /tmp/St00011.000008 not found)
file /tmp/St00011.000008 saved
(14 vars, 459 obs)
(note: file /tmp/St00011.000009 not found)
file /tmp/St00011.000009 saved
(14 vars, 453 obs)
(note: file /tmp/St00011.00000a not found)
file /tmp/St00011.00000a saved
(14 vars, 474 obs)
(note: file /tmp/St00011.00000b not found)
file /tmp/St00011.00000b saved
(14 vars, 456 obs)
(note: file /tmp/St00011.00000c not found)
file /tmp/St00011.00000c saved
(14 vars, 462 obs)
(note: file /tmp/St00011.00000d not found)
file /tmp/St00011.00000d saved
(14 vars, 454 obs)
(note: file /tmp/St00011.00000e not found)
file /tmp/St00011.00000e saved
(14 vars, 456 obs)
(note: file /tmp/St00011.00000f not found)
file /tmp/St00011.00000f saved
(14 vars, 462 obs)
(note: file /tmp/St00011.00000g not found)
file /tmp/St00011.00000g saved
(14 vars, 450 obs)
(note: file /tmp/St00011.00000h not found)
file /tmp/St00011.00000h saved
(14 vars, 465 obs)
(note: file /tmp/St00011.00000i not found)
file /tmp/St00011.00000i saved
(14 vars, 454 obs)
(note: file /tmp/St00011.00000j not found)
file /tmp/St00011.00000j saved
(14 vars, 463 obs)
(note: file /tmp/St00011.00000k not found)
file /tmp/St00011.00000k saved
(14 vars, 469 obs)
(note: file /tmp/St00011.00000l not found)
file /tmp/St00011.00000l saved
(14 vars, 462 obs)
(note: file /tmp/St00011.00000m not found)
file /tmp/St00011.00000m saved
(14 vars, 467 obs)
(note: file /tmp/St00011.00000n not found)
file /tmp/St00011.00000n saved
(14 vars, 473 obs)
(note: file /tmp/St00011.00000o not found)
file /tmp/St00011.00000o saved
(14 vars, 472 obs)
(note: file /tmp/St00011.00000p not found)
file /tmp/St00011.00000p saved
(14 vars, 456 obs)
(note: file /tmp/St00011.00000q not found)
file /tmp/St00011.00000q saved
(14 vars, 463 obs)
(note: file /tmp/St00011.00000r not found)
file /tmp/St00011.00000r saved
(14 vars, 458 obs)
(note: file /tmp/St00011.00000s not found)
file /tmp/St00011.00000s saved
(14 vars, 469 obs)
(note: file /tmp/St00011.00000t not found)
file /tmp/St00011.00000t saved
(14 vars, 454 obs)
(note: file /tmp/St00011.00000u not found)
file /tmp/St00011.00000u saved
(14 vars, 464 obs)
(note: file /tmp/St00011.00000v not found)
file /tmp/St00011.00000v saved

. 
. *(2)=========Append separate cases files==========
. use `matched_cases_2020_stp5', clear

. foreach i of numlist 6/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily append using `matched_cases_2020_stp`i'', force
  3. }
(note: variable age was byte, now int to accommodate using data's values)

. 
. *save as .csv file for input into study definitions that add further variable
> s, erase dta version
. capture noisily export delimited using "./output/input_combined_stps_covid_20
> 20.csv", replace
(note: file ./output/input_combined_stps_covid_2020.csv not found)
file ./output/input_combined_stps_covid_2020.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_covid_2020.log
  log type:  text
 closed on:  27 Oct 2022, 23:41:46
-------------------------------------------------------------------------------
