-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/combine_stps_covid_2017.log
  log type:  text
 opened on:  23 Oct 2022, 17:38:50

. 
. *(1)=========Change source files to stata format============
. foreach i of numlist 5/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily import delimited ./output/matched_cases_2017_stp`i'.csv, clear
  3.         capture noisily tempfile matched_cases_2017_stp`i'
  4.         capture noisily save `matched_cases_2017_stp`i'', replace
  5. }
(encoding automatically selected: ISO-8859-1)
(14 vars, 414 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000001.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 375 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000002.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 372 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000003.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000003.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 383 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000004.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000004.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 386 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000005.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000005.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 374 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000006.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000006.tmp saved as .dta format
(encoding automatically selected: ISO-8859-2)
(14 vars, 375 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000007.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000007.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 374 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000008.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000008.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 371 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000009.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_000009.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 376 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000a.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000a.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 384 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000b.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000b.tmp saved as .dta format
(encoding automatically selected: ISO-8859-2)
(14 vars, 371 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000c.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000c.tmp saved as .dta format
(encoding automatically selected: ISO-8859-2)
(14 vars, 374 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000d.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000d.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 380 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000e.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000e.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 379 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000f.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000f.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 373 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000g.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000g.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 383 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000h.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000h.tmp saved as .dta format
(encoding automatically selected: ISO-8859-2)
(14 vars, 371 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000i.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000i.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 367 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000j.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000j.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 369 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000k.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000k.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 367 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000l.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000l.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 373 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000m.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000m.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 373 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000n.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000n.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 366 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000o.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000o.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 364 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000p.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000p.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 375 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000q.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000q.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 369 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000r.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000r.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 378 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000s.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000s.tmp saved as .dta format
(encoding automatically selected: ISO-8859-2)
(14 vars, 380 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000t.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000t.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 380 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000u.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000u.tmp saved as .dta format
(encoding automatically selected: ISO-8859-1)
(14 vars, 374 obs)
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000v.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_2c6c_00000v.tmp saved as .dta format

. 
. *(2)=========Append separate cases files==========
. use `matched_cases_2017_stp5', clear

. foreach i of numlist 6/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily append using `matched_cases_2017_stp`i'', force
  3. }

. 
. *save as .csv file for input into study definitions that add further variables, erase dta version
. capture noisily export delimited using "./output/input_combined_stps_covid_2017.csv", replace
file ./output/input_combined_stps_covid_2017.csv saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/combine_stps_covid_2017.log
  log type:  text
 closed on:  23 Oct 2022, 17:38:52
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
