-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_covid4_2017.log
  log type:  text
 opened on:  30 Nov 2022, 15:54:28

. 
. *(1)=========Change source files to stata format============
. foreach i of numlist 5/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily import delimited ./output/matched_cases_2017_4stp`
> i'.csv, clear
  3.         capture noisily tempfile matched_cases_2017_4stp`i'
  4.         capture noisily save `matched_cases_2017_4stp`i'', replace
  5. }
(14 vars, 131 obs)
(note: file /tmp/St00012.000001 not found)
file /tmp/St00012.000001 saved
(14 vars, 120 obs)
(note: file /tmp/St00012.000002 not found)
file /tmp/St00012.000002 saved
(14 vars, 135 obs)
(note: file /tmp/St00012.000003 not found)
file /tmp/St00012.000003 saved
(14 vars, 112 obs)
(note: file /tmp/St00012.000004 not found)
file /tmp/St00012.000004 saved
(14 vars, 123 obs)
(note: file /tmp/St00012.000005 not found)
file /tmp/St00012.000005 saved
(14 vars, 111 obs)
(note: file /tmp/St00012.000006 not found)
file /tmp/St00012.000006 saved
(14 vars, 102 obs)
(note: file /tmp/St00012.000007 not found)
file /tmp/St00012.000007 saved
(14 vars, 133 obs)
(note: file /tmp/St00012.000008 not found)
file /tmp/St00012.000008 saved
(14 vars, 102 obs)
(note: file /tmp/St00012.000009 not found)
file /tmp/St00012.000009 saved
(14 vars, 119 obs)
(note: file /tmp/St00012.00000a not found)
file /tmp/St00012.00000a saved
(14 vars, 112 obs)
(note: file /tmp/St00012.00000b not found)
file /tmp/St00012.00000b saved
(14 vars, 118 obs)
(note: file /tmp/St00012.00000c not found)
file /tmp/St00012.00000c saved
(14 vars, 114 obs)
(note: file /tmp/St00012.00000d not found)
file /tmp/St00012.00000d saved
(14 vars, 110 obs)
(note: file /tmp/St00012.00000e not found)
file /tmp/St00012.00000e saved
(14 vars, 121 obs)
(note: file /tmp/St00012.00000f not found)
file /tmp/St00012.00000f saved
(14 vars, 107 obs)
(note: file /tmp/St00012.00000g not found)
file /tmp/St00012.00000g saved
(14 vars, 111 obs)
(note: file /tmp/St00012.00000h not found)
file /tmp/St00012.00000h saved
(14 vars, 123 obs)
(note: file /tmp/St00012.00000i not found)
file /tmp/St00012.00000i saved
(14 vars, 117 obs)
(note: file /tmp/St00012.00000j not found)
file /tmp/St00012.00000j saved
(14 vars, 108 obs)
(note: file /tmp/St00012.00000k not found)
file /tmp/St00012.00000k saved
(14 vars, 134 obs)
(note: file /tmp/St00012.00000l not found)
file /tmp/St00012.00000l saved
(14 vars, 117 obs)
(note: file /tmp/St00012.00000m not found)
file /tmp/St00012.00000m saved
(14 vars, 117 obs)
(note: file /tmp/St00012.00000n not found)
file /tmp/St00012.00000n saved
(14 vars, 108 obs)
(note: file /tmp/St00012.00000o not found)
file /tmp/St00012.00000o saved
(14 vars, 120 obs)
(note: file /tmp/St00012.00000p not found)
file /tmp/St00012.00000p saved
(14 vars, 109 obs)
(note: file /tmp/St00012.00000q not found)
file /tmp/St00012.00000q saved
(14 vars, 119 obs)
(note: file /tmp/St00012.00000r not found)
file /tmp/St00012.00000r saved
(14 vars, 128 obs)
(note: file /tmp/St00012.00000s not found)
file /tmp/St00012.00000s saved
(14 vars, 130 obs)
(note: file /tmp/St00012.00000t not found)
file /tmp/St00012.00000t saved
(14 vars, 123 obs)
(note: file /tmp/St00012.00000u not found)
file /tmp/St00012.00000u saved
(14 vars, 121 obs)
(note: file /tmp/St00012.00000v not found)
file /tmp/St00012.00000v saved

. 
. *(2)=========Append separate cases files==========
. use `matched_cases_2017_4stp5', clear

. foreach i of numlist 6/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily append using `matched_cases_2017_4stp`i'', force
  3. }
(note: variable krt_outcome_date was byte in the using data, but will be
       str10 now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable death_date was byte in the using data, but will be str10 now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable death_date was byte in the using data, but will be str10 now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable death_date was byte in the using data, but will be str10 now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable death_date was byte in the using data, but will be str10 now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable death_date was byte in the using data, but will be str10 now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable death_date was byte in the using data, but will be str10 now)
(note: variable krt_outcome_date was byte in the using data, but will be
       str10 now)
(note: variable krt_outcome_date was byte in the using data, but will be
       str10 now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)
(note: variable date_deregistered was str10 in the using data, but will be
       byte now)

. 
. *save as .csv file for input into study definitions that add further variable
> s, erase dta version
. capture noisily export delimited using "./output/input_combined_stps_covid4_2
> 017.csv", replace
(note: file ./output/input_combined_stps_covid4_2017.csv not found)
file ./output/input_combined_stps_covid4_2017.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_covid4_2017.log
  log type:  text
 closed on:  30 Nov 2022, 15:54:28
-------------------------------------------------------------------------------
