-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_matches2_2017.log
  log type:  text
 opened on:  29 Nov 2022, 16:47:02

. 
. *(1)=========Change source files to stata format============
. foreach i of numlist 5/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily import delimited ./output/matched_matches_2017_2st
> p`i'.csv, clear
  3.         capture noisily tempfile matched_matches_2017_2stp`i'
  4.         capture noisily save `matched_matches_2017_2stp`i'', replace
  5. }
(10 vars, 576 obs)
(note: file /tmp/St00012.000001 not found)
file /tmp/St00012.000001 saved
(10 vars, 448 obs)
(note: file /tmp/St00012.000002 not found)
file /tmp/St00012.000002 saved
(10 vars, 456 obs)
(note: file /tmp/St00012.000003 not found)
file /tmp/St00012.000003 saved
(10 vars, 434 obs)
(note: file /tmp/St00012.000004 not found)
file /tmp/St00012.000004 saved
(10 vars, 412 obs)
(note: file /tmp/St00012.000005 not found)
file /tmp/St00012.000005 saved
(10 vars, 525 obs)
(note: file /tmp/St00012.000006 not found)
file /tmp/St00012.000006 saved
(10 vars, 511 obs)
(note: file /tmp/St00012.000007 not found)
file /tmp/St00012.000007 saved
(10 vars, 483 obs)
(note: file /tmp/St00012.000008 not found)
file /tmp/St00012.000008 saved
(10 vars, 476 obs)
(note: file /tmp/St00012.000009 not found)
file /tmp/St00012.000009 saved
(10 vars, 444 obs)
(note: file /tmp/St00012.00000a not found)
file /tmp/St00012.00000a saved
(10 vars, 409 obs)
(note: file /tmp/St00012.00000b not found)
file /tmp/St00012.00000b saved
(10 vars, 483 obs)
(note: file /tmp/St00012.00000c not found)
file /tmp/St00012.00000c saved
(10 vars, 470 obs)
(note: file /tmp/St00012.00000d not found)
file /tmp/St00012.00000d saved
(10 vars, 434 obs)
(note: file /tmp/St00012.00000e not found)
file /tmp/St00012.00000e saved
(10 vars, 458 obs)
(note: file /tmp/St00012.00000f not found)
file /tmp/St00012.00000f saved
(10 vars, 498 obs)
(note: file /tmp/St00012.00000g not found)
file /tmp/St00012.00000g saved
(10 vars, 467 obs)
(note: file /tmp/St00012.00000h not found)
file /tmp/St00012.00000h saved
(10 vars, 461 obs)
(note: file /tmp/St00012.00000i not found)
file /tmp/St00012.00000i saved
(10 vars, 458 obs)
(note: file /tmp/St00012.00000j not found)
file /tmp/St00012.00000j saved
(10 vars, 425 obs)
(note: file /tmp/St00012.00000k not found)
file /tmp/St00012.00000k saved
(10 vars, 414 obs)
(note: file /tmp/St00012.00000l not found)
file /tmp/St00012.00000l saved
(10 vars, 483 obs)
(note: file /tmp/St00012.00000m not found)
file /tmp/St00012.00000m saved
(10 vars, 429 obs)
(note: file /tmp/St00012.00000n not found)
file /tmp/St00012.00000n saved
(10 vars, 509 obs)
(note: file /tmp/St00012.00000o not found)
file /tmp/St00012.00000o saved
(10 vars, 486 obs)
(note: file /tmp/St00012.00000p not found)
file /tmp/St00012.00000p saved
(10 vars, 447 obs)
(note: file /tmp/St00012.00000q not found)
file /tmp/St00012.00000q saved
(10 vars, 422 obs)
(note: file /tmp/St00012.00000r not found)
file /tmp/St00012.00000r saved
(10 vars, 465 obs)
(note: file /tmp/St00012.00000s not found)
file /tmp/St00012.00000s saved
(10 vars, 488 obs)
(note: file /tmp/St00012.00000t not found)
file /tmp/St00012.00000t saved
(10 vars, 480 obs)
(note: file /tmp/St00012.00000u not found)
file /tmp/St00012.00000u saved
(10 vars, 439 obs)
(note: file /tmp/St00012.00000v not found)
file /tmp/St00012.00000v saved

. 
. *(2)=========Append separate cases files==========
. use `matched_matches_2017_2stp5', clear

. foreach i of numlist 6/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily append using `matched_matches_2017_2stp`i'', force
  3. }

. 
. *save as .csv file for input into study definitions that add further variable
> s, erase dta version
. capture noisily export delimited using "./output/input_combined_stps_matches2
> _2017.csv", replace
(note: file ./output/input_combined_stps_matches2_2017.csv not found)
file ./output/input_combined_stps_matches2_2017.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_matches2_2017.log
  log type:  text
 closed on:  29 Nov 2022, 16:47:06
-------------------------------------------------------------------------------
