-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_matches_2020.log
  log type:  text
 opened on:   5 Apr 2023, 12:18:59

. 
. *(1)=========Change source files to stata format============
. foreach i of numlist 5/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily import delimited ./output/matched_matches_2020_stp
> `i'.csv, clear
  3.         capture noisily tempfile matched_matches_2020_stp`i'
  4.         capture noisily save `matched_matches_2020_stp`i'', replace
  5. }
(11 vars, 651 obs)
(note: file /tmp/St00016.000001 not found)
file /tmp/St00016.000001 saved
(11 vars, 583 obs)
(note: file /tmp/St00016.000002 not found)
file /tmp/St00016.000002 saved
(11 vars, 585 obs)
(note: file /tmp/St00016.000003 not found)
file /tmp/St00016.000003 saved
(11 vars, 595 obs)
(note: file /tmp/St00016.000004 not found)
file /tmp/St00016.000004 saved
(11 vars, 572 obs)
(note: file /tmp/St00016.000005 not found)
file /tmp/St00016.000005 saved
(11 vars, 593 obs)
(note: file /tmp/St00016.000006 not found)
file /tmp/St00016.000006 saved
(11 vars, 614 obs)
(note: file /tmp/St00016.000007 not found)
file /tmp/St00016.000007 saved
(11 vars, 602 obs)
(note: file /tmp/St00016.000008 not found)
file /tmp/St00016.000008 saved
(11 vars, 605 obs)
(note: file /tmp/St00016.000009 not found)
file /tmp/St00016.000009 saved
(11 vars, 568 obs)
(note: file /tmp/St00016.00000a not found)
file /tmp/St00016.00000a saved
(11 vars, 594 obs)
(note: file /tmp/St00016.00000b not found)
file /tmp/St00016.00000b saved
(11 vars, 580 obs)
(note: file /tmp/St00016.00000c not found)
file /tmp/St00016.00000c saved
(11 vars, 570 obs)
(note: file /tmp/St00016.00000d not found)
file /tmp/St00016.00000d saved
(11 vars, 582 obs)
(note: file /tmp/St00016.00000e not found)
file /tmp/St00016.00000e saved
(11 vars, 546 obs)
(note: file /tmp/St00016.00000f not found)
file /tmp/St00016.00000f saved
(11 vars, 571 obs)
(note: file /tmp/St00016.00000g not found)
file /tmp/St00016.00000g saved
(11 vars, 577 obs)
(note: file /tmp/St00016.00000h not found)
file /tmp/St00016.00000h saved
(11 vars, 561 obs)
(note: file /tmp/St00016.00000i not found)
file /tmp/St00016.00000i saved
(11 vars, 586 obs)
(note: file /tmp/St00016.00000j not found)
file /tmp/St00016.00000j saved
(11 vars, 597 obs)
(note: file /tmp/St00016.00000k not found)
file /tmp/St00016.00000k saved
(11 vars, 566 obs)
(note: file /tmp/St00016.00000l not found)
file /tmp/St00016.00000l saved
(11 vars, 573 obs)
(note: file /tmp/St00016.00000m not found)
file /tmp/St00016.00000m saved
(11 vars, 547 obs)
(note: file /tmp/St00016.00000n not found)
file /tmp/St00016.00000n saved
(11 vars, 578 obs)
(note: file /tmp/St00016.00000o not found)
file /tmp/St00016.00000o saved
(11 vars, 583 obs)
(note: file /tmp/St00016.00000p not found)
file /tmp/St00016.00000p saved
(11 vars, 571 obs)
(note: file /tmp/St00016.00000q not found)
file /tmp/St00016.00000q saved
(11 vars, 589 obs)
(note: file /tmp/St00016.00000r not found)
file /tmp/St00016.00000r saved
(11 vars, 608 obs)
(note: file /tmp/St00016.00000s not found)
file /tmp/St00016.00000s saved
(11 vars, 600 obs)
(note: file /tmp/St00016.00000t not found)
file /tmp/St00016.00000t saved
(11 vars, 527 obs)
(note: file /tmp/St00016.00000u not found)
file /tmp/St00016.00000u saved
(11 vars, 576 obs)
(note: file /tmp/St00016.00000v not found)
file /tmp/St00016.00000v saved

. 
. *(2)=========Append separate cases files==========
. use `matched_matches_2020_stp5', clear

. foreach i of numlist 6/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily append using `matched_matches_2020_stp`i'', force
  3. }

. 
. *save as .csv file for input into study definitions that add further variable
> s, erase dta version
. capture noisily export delimited using "./output/input_combined_stps_matches_
> 2020.csv", replace
(note: file ./output/input_combined_stps_matches_2020.csv not found)
file ./output/input_combined_stps_matches_2020.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_matches_2020.log
  log type:  text
 closed on:   5 Apr 2023, 12:19:00
-------------------------------------------------------------------------------
