-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_covid3_2017.log
  log type:  text
 opened on:  30 Nov 2022, 15:13:02

. 
. *(1)=========Change source files to stata format============
. foreach i of numlist 5/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily import delimited ./output/matched_cases_2017_3stp`
> i'.csv, clear
  3.         capture noisily tempfile matched_cases_2017_3stp`i'
  4.         capture noisily save `matched_cases_2017_3stp`i'', replace
  5. }
(14 vars, 68 obs)
(note: file /tmp/St00011.000001 not found)
file /tmp/St00011.000001 saved
(14 vars, 56 obs)
(note: file /tmp/St00011.000002 not found)
file /tmp/St00011.000002 saved
(14 vars, 71 obs)
(note: file /tmp/St00011.000003 not found)
file /tmp/St00011.000003 saved
(14 vars, 75 obs)
(note: file /tmp/St00011.000004 not found)
file /tmp/St00011.000004 saved
(14 vars, 77 obs)
(note: file /tmp/St00011.000005 not found)
file /tmp/St00011.000005 saved
(14 vars, 55 obs)
(note: file /tmp/St00011.000006 not found)
file /tmp/St00011.000006 saved
(14 vars, 63 obs)
(note: file /tmp/St00011.000007 not found)
file /tmp/St00011.000007 saved
(14 vars, 61 obs)
(note: file /tmp/St00011.000008 not found)
file /tmp/St00011.000008 saved
(14 vars, 70 obs)
(note: file /tmp/St00011.000009 not found)
file /tmp/St00011.000009 saved
(14 vars, 76 obs)
(note: file /tmp/St00011.00000a not found)
file /tmp/St00011.00000a saved
(14 vars, 60 obs)
(note: file /tmp/St00011.00000b not found)
file /tmp/St00011.00000b saved
(14 vars, 60 obs)
(note: file /tmp/St00011.00000c not found)
file /tmp/St00011.00000c saved
(14 vars, 72 obs)
(note: file /tmp/St00011.00000d not found)
file /tmp/St00011.00000d saved
(14 vars, 57 obs)
(note: file /tmp/St00011.00000e not found)
file /tmp/St00011.00000e saved
(14 vars, 69 obs)
(note: file /tmp/St00011.00000f not found)
file /tmp/St00011.00000f saved
(14 vars, 53 obs)
(note: file /tmp/St00011.00000g not found)
file /tmp/St00011.00000g saved
(14 vars, 50 obs)
(note: file /tmp/St00011.00000h not found)
file /tmp/St00011.00000h saved
(14 vars, 65 obs)
(note: file /tmp/St00011.00000i not found)
file /tmp/St00011.00000i saved
(14 vars, 61 obs)
(note: file /tmp/St00011.00000j not found)
file /tmp/St00011.00000j saved
(14 vars, 66 obs)
(note: file /tmp/St00011.00000k not found)
file /tmp/St00011.00000k saved
(14 vars, 65 obs)
(note: file /tmp/St00011.00000l not found)
file /tmp/St00011.00000l saved
(14 vars, 82 obs)
(note: file /tmp/St00011.00000m not found)
file /tmp/St00011.00000m saved
(14 vars, 60 obs)
(note: file /tmp/St00011.00000n not found)
file /tmp/St00011.00000n saved
(14 vars, 54 obs)
(note: file /tmp/St00011.00000o not found)
file /tmp/St00011.00000o saved
(14 vars, 56 obs)
(note: file /tmp/St00011.00000p not found)
file /tmp/St00011.00000p saved
(14 vars, 73 obs)
(note: file /tmp/St00011.00000q not found)
file /tmp/St00011.00000q saved
(14 vars, 68 obs)
(note: file /tmp/St00011.00000r not found)
file /tmp/St00011.00000r saved
(14 vars, 58 obs)
(note: file /tmp/St00011.00000s not found)
file /tmp/St00011.00000s saved
(14 vars, 56 obs)
(note: file /tmp/St00011.00000t not found)
file /tmp/St00011.00000t saved
(14 vars, 70 obs)
(note: file /tmp/St00011.00000u not found)
file /tmp/St00011.00000u saved
(14 vars, 72 obs)
(note: file /tmp/St00011.00000v not found)
file /tmp/St00011.00000v saved

. 
. *(2)=========Append separate cases files==========
. use `matched_cases_2017_3stp5', clear

. foreach i of numlist 6/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily append using `matched_cases_2017_3stp`i'', force
  3. }
(note: variable date_deregistered was byte in the using data, but will be
       str10 now)
(note: variable date_deregistered was byte in the using data, but will be
       str10 now)
(note: variable death_date was byte in the using data, but will be str10 now)
(note: variable date_deregistered was byte in the using data, but will be
       str10 now)
(note: variable date_deregistered was byte in the using data, but will be
       str10 now)
(note: variable date_deregistered was byte in the using data, but will be
       str10 now)
(note: variable death_date was byte in the using data, but will be str10 now)
(note: variable date_deregistered was byte in the using data, but will be
       str10 now)
(note: variable death_date was byte in the using data, but will be str10 now)
(note: variable date_deregistered was byte in the using data, but will be
       str10 now)
(note: variable date_deregistered was byte in the using data, but will be
       str10 now)
(note: variable age was byte, now int to accommodate using data's values)
(note: variable death_date was byte in the using data, but will be str10 now)
(note: variable date_deregistered was byte in the using data, but will be
       str10 now)

. 
. *save as .csv file for input into study definitions that add further variable
> s, erase dta version
. capture noisily export delimited using "./output/input_combined_stps_covid3_2
> 017.csv", replace
(note: file ./output/input_combined_stps_covid3_2017.csv not found)
file ./output/input_combined_stps_covid3_2017.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_covid3_2017.log
  log type:  text
 closed on:  30 Nov 2022, 15:13:02
-------------------------------------------------------------------------------
