-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_covid_2020.log
  log type:  text
 opened on:   5 Apr 2023, 12:17:36

. 
. *(1)=========Change source files to stata format============
. foreach i of numlist 5/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily import delimited ./output/matched_cases_2020_stp`i
> '.csv, clear
  3.         capture noisily tempfile matched_cases_2020_stp`i'
  4.         capture noisily save `matched_cases_2020_stp`i'', replace
  5. }
(13 vars, 450 obs)
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved
(13 vars, 429 obs)
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved
(13 vars, 412 obs)
(note: file /tmp/St00015.000003 not found)
file /tmp/St00015.000003 saved
(13 vars, 411 obs)
(note: file /tmp/St00015.000004 not found)
file /tmp/St00015.000004 saved
(13 vars, 421 obs)
(note: file /tmp/St00015.000005 not found)
file /tmp/St00015.000005 saved
(13 vars, 426 obs)
(note: file /tmp/St00015.000006 not found)
file /tmp/St00015.000006 saved
(13 vars, 428 obs)
(note: file /tmp/St00015.000007 not found)
file /tmp/St00015.000007 saved
(13 vars, 415 obs)
(note: file /tmp/St00015.000008 not found)
file /tmp/St00015.000008 saved
(13 vars, 424 obs)
(note: file /tmp/St00015.000009 not found)
file /tmp/St00015.000009 saved
(13 vars, 427 obs)
(note: file /tmp/St00015.00000a not found)
file /tmp/St00015.00000a saved
(13 vars, 420 obs)
(note: file /tmp/St00015.00000b not found)
file /tmp/St00015.00000b saved
(13 vars, 424 obs)
(note: file /tmp/St00015.00000c not found)
file /tmp/St00015.00000c saved
(13 vars, 410 obs)
(note: file /tmp/St00015.00000d not found)
file /tmp/St00015.00000d saved
(13 vars, 407 obs)
(note: file /tmp/St00015.00000e not found)
file /tmp/St00015.00000e saved
(13 vars, 423 obs)
(note: file /tmp/St00015.00000f not found)
file /tmp/St00015.00000f saved
(13 vars, 411 obs)
(note: file /tmp/St00015.00000g not found)
file /tmp/St00015.00000g saved
(13 vars, 424 obs)
(note: file /tmp/St00015.00000h not found)
file /tmp/St00015.00000h saved
(13 vars, 419 obs)
(note: file /tmp/St00015.00000i not found)
file /tmp/St00015.00000i saved
(13 vars, 419 obs)
(note: file /tmp/St00015.00000j not found)
file /tmp/St00015.00000j saved
(13 vars, 431 obs)
(note: file /tmp/St00015.00000k not found)
file /tmp/St00015.00000k saved
(13 vars, 419 obs)
(note: file /tmp/St00015.00000l not found)
file /tmp/St00015.00000l saved
(13 vars, 412 obs)
(note: file /tmp/St00015.00000m not found)
file /tmp/St00015.00000m saved
(13 vars, 409 obs)
(note: file /tmp/St00015.00000n not found)
file /tmp/St00015.00000n saved
(13 vars, 426 obs)
(note: file /tmp/St00015.00000o not found)
file /tmp/St00015.00000o saved
(13 vars, 423 obs)
(note: file /tmp/St00015.00000p not found)
file /tmp/St00015.00000p saved
(13 vars, 419 obs)
(note: file /tmp/St00015.00000q not found)
file /tmp/St00015.00000q saved
(13 vars, 428 obs)
(note: file /tmp/St00015.00000r not found)
file /tmp/St00015.00000r saved
(13 vars, 413 obs)
(note: file /tmp/St00015.00000s not found)
file /tmp/St00015.00000s saved
(13 vars, 427 obs)
(note: file /tmp/St00015.00000t not found)
file /tmp/St00015.00000t saved
(13 vars, 417 obs)
(note: file /tmp/St00015.00000u not found)
file /tmp/St00015.00000u saved
(13 vars, 418 obs)
(note: file /tmp/St00015.00000v not found)
file /tmp/St00015.00000v saved

. 
. *(2)=========Append separate cases files==========
. use `matched_cases_2020_stp5', clear

. foreach i of numlist 6/10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         capture noisily append using `matched_cases_2020_stp`i'', force
  3. }
(note: variable age was byte, now int to accommodate using data's values)

. 
. *save as .csv file for input into study definitions that add further variable
> s, erase dta version
. capture noisily export delimited using "./output/input_combined_stps_covid_20
> 20.csv", replace
(note: file ./output/input_combined_stps_covid_2020.csv not found)
file ./output/input_combined_stps_covid_2020.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/combine_stps_covid_2020.log
  log type:  text
 closed on:   5 Apr 2023, 12:17:37
-------------------------------------------------------------------------------
