------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/contemporary_matching.log
  log type:  text
 opened on:  19 Oct 2022, 10:25:24

. clear

. 
. import delimited ./output/input_contemporary_matching.csv, delimiter(comma) varnames(1) case(preserve) 
(encoding automatically selected: ISO-8859-1)
(22 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,632 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosis
. drop if has_follow_up==0
(1,986 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,845 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,760 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,713 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb2020, 20, 3000)
(14,092 real changes made, 14,092 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,092 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,064 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.7 if male==0
(9,288 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.9 if male==1
(8,684 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.329  if male==0
(9,288 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.411  if male==1
(8,684 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb2020<1
(11,427 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,064 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.7 if male==0
(9,288 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.9 if male==1
(8,684 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.209
(17,972 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb2020>1
(20,637 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_baseline_creatinine_feb2020*141
(14,092 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(0.993^age)
(17,972 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1.018 if male==0
(9,288 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. drop egfr_baseline_creatinine_feb2020

. drop age

. 
. * Deceased
. drop if deceased==1
(3,182 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. 
. *Tabulate variables
. tab year_of_birth

year_of_bir |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
       1950 |        621        2.15        2.15
       1951 |        576        1.99        4.14
       1952 |        558        1.93        6.08
       1953 |        618        2.14        8.22
       1954 |        588        2.04       10.25
       1955 |        592        2.05       12.30
       1956 |        548        1.90       14.20
       1957 |        610        2.11       16.31
       1958 |        578        2.00       18.31
       1959 |        603        2.09       20.40
       1960 |        606        2.10       22.50
       1961 |        596        2.06       24.56
       1962 |        582        2.02       26.58
       1963 |        607        2.10       28.68
       1964 |        563        1.95       30.63
       1965 |        554        1.92       32.55
       1966 |        525        1.82       34.36
       1967 |        601        2.08       36.44
       1968 |        528        1.83       38.27
       1969 |        577        2.00       40.27
       1970 |        592        2.05       42.32
       1971 |        566        1.96       44.28
       1972 |        542        1.88       46.16
       1973 |        562        1.95       48.10
       1974 |        577        2.00       50.10
       1975 |        594        2.06       52.16
       1976 |        584        2.02       54.18
       1977 |        562        1.95       56.12
       1978 |        603        2.09       58.21
       1979 |        595        2.06       60.27
       1980 |        574        1.99       62.26
       1981 |        566        1.96       64.22
       1982 |        557        1.93       66.15
       1983 |        575        1.99       68.14
       1984 |        580        2.01       70.15
       1985 |        546        1.89       72.04
       1986 |        558        1.93       73.97
       1987 |        567        1.96       75.93
       1988 |        539        1.87       77.80
       1989 |        598        2.07       79.87
       1990 |        556        1.93       81.79
       1991 |        608        2.11       83.90
       1992 |        572        1.98       85.88
       1993 |        566        1.96       87.84
       1994 |        598        2.07       89.91
       1995 |        559        1.94       91.85
       1996 |        600        2.08       93.92
       1997 |        555        1.92       95.85
       1998 |        609        2.11       97.95
       1999 |        590        2.04      100.00
       2000 |          1        0.00      100.00
------------+-----------------------------------
      Total |     28,882      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,455        5.04        5.04
          1 |      5,369       18.59       23.63
          2 |      5,514       19.09       42.72
          3 |      5,454       18.88       61.60
          4 |      5,606       19.41       81.01
          5 |      5,484       18.99      100.00
------------+-----------------------------------
      Total |     28,882      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,815       51.29       51.29
       Male |     14,067       48.71      100.00
------------+-----------------------------------
      Total |     28,882      100.00

. 
. gen covid_date = date(covid_diagnosis_date, "YMD")
(15,979 missing values generated)

. format covid_date %td

. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)
(15,979 missing values generated)

. bysort year_of_birth: tab covid_month

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1950

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        4.78        4.78
    apr2021 |         12        4.10        8.87
    aug2020 |         14        4.78       13.65
    aug2021 |         10        3.41       17.06
    dec2020 |         12        4.10       21.16
    dec2021 |         10        3.41       24.57
    feb2020 |          8        2.73       27.30
    feb2021 |         12        4.10       31.40
    jan2021 |          9        3.07       34.47
    jan2022 |         17        5.80       40.27
    jul2020 |         15        5.12       45.39
    jul2021 |         18        6.14       51.54
    jun2020 |         13        4.44       55.97
    jun2021 |          7        2.39       58.36
    mar2020 |         24        8.19       66.55
    mar2021 |          7        2.39       68.94
    may2020 |         12        4.10       73.04
    may2021 |         16        5.46       78.50
    nov2020 |         12        4.10       82.59
    nov2021 |          6        2.05       84.64
    oct2020 |         11        3.75       88.40
    oct2021 |         11        3.75       92.15
    sep2020 |         12        4.10       96.25
    sep2021 |         11        3.75      100.00
------------+-----------------------------------
      Total |        293      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1951

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         17        6.97        6.97
    apr2021 |         17        6.97       13.93
    aug2020 |          7        2.87       16.80
    aug2021 |          8        3.28       20.08
    dec2020 |          8        3.28       23.36
    dec2021 |          6        2.46       25.82
    feb2020 |         14        5.74       31.56
    feb2021 |          8        3.28       34.84
    jan2021 |         12        4.92       39.75
    jan2022 |          7        2.87       42.62
    jul2020 |         13        5.33       47.95
    jul2021 |          6        2.46       50.41
    jun2020 |         15        6.15       56.56
    jun2021 |          9        3.69       60.25
    mar2020 |         10        4.10       64.34
    mar2021 |         14        5.74       70.08
    may2020 |          9        3.69       73.77
    may2021 |          2        0.82       74.59
    nov2020 |         12        4.92       79.51
    nov2021 |          7        2.87       82.38
    oct2020 |         12        4.92       87.30
    oct2021 |         14        5.74       93.03
    sep2020 |          5        2.05       95.08
    sep2021 |         12        4.92      100.00
------------+-----------------------------------
      Total |        244      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1952

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        5.43        5.43
    apr2021 |          8        3.10        8.53
    aug2020 |         16        6.20       14.73
    aug2021 |          8        3.10       17.83
    dec2020 |          6        2.33       20.16
    dec2021 |          8        3.10       23.26
    feb2020 |         13        5.04       28.29
    feb2021 |          7        2.71       31.01
    jan2021 |         16        6.20       37.21
    jan2022 |          5        1.94       39.15
    jul2020 |          9        3.49       42.64
    jul2021 |         13        5.04       47.67
    jun2020 |         15        5.81       53.49
    jun2021 |         10        3.88       57.36
    mar2020 |         13        5.04       62.40
    mar2021 |         13        5.04       67.44
    may2020 |         13        5.04       72.48
    may2021 |         10        3.88       76.36
    nov2020 |         13        5.04       81.40
    nov2021 |          9        3.49       84.88
    oct2020 |          4        1.55       86.43
    oct2021 |         10        3.88       90.31
    sep2020 |         17        6.59       96.90
    sep2021 |          8        3.10      100.00
------------+-----------------------------------
      Total |        258      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1953

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         17        5.88        5.88
    apr2021 |         10        3.46        9.34
    aug2020 |          9        3.11       12.46
    aug2021 |          9        3.11       15.57
    dec2020 |         16        5.54       21.11
    dec2021 |         14        4.84       25.95
    feb2020 |         11        3.81       29.76
    feb2021 |          7        2.42       32.18
    jan2021 |         16        5.54       37.72
    jan2022 |         11        3.81       41.52
    jul2020 |         14        4.84       46.37
    jul2021 |         17        5.88       52.25
    jun2020 |         12        4.15       56.40
    jun2021 |         11        3.81       60.21
    mar2020 |         13        4.50       64.71
    mar2021 |         16        5.54       70.24
    may2020 |         19        6.57       76.82
    may2021 |          8        2.77       79.58
    nov2020 |         11        3.81       83.39
    nov2021 |          9        3.11       86.51
    oct2020 |         15        5.19       91.70
    oct2021 |          4        1.38       93.08
    sep2020 |         14        4.84       97.92
    sep2021 |          6        2.08      100.00
------------+-----------------------------------
      Total |        289      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1954

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        4.49        4.49
    apr2021 |          6        2.25        6.74
    aug2020 |         15        5.62       12.36
    aug2021 |         13        4.87       17.23
    dec2020 |         13        4.87       22.10
    dec2021 |          7        2.62       24.72
    feb2020 |         14        5.24       29.96
    feb2021 |          5        1.87       31.84
    jan2021 |         12        4.49       36.33
    jan2022 |          9        3.37       39.70
    jul2020 |         16        5.99       45.69
    jul2021 |          7        2.62       48.31
    jun2020 |         14        5.24       53.56
    jun2021 |          7        2.62       56.18
    mar2020 |         16        5.99       62.17
    mar2021 |          9        3.37       65.54
    may2020 |          7        2.62       68.16
    may2021 |         11        4.12       72.28
    nov2020 |         16        5.99       78.28
    nov2021 |         15        5.62       83.90
    oct2020 |         15        5.62       89.51
    oct2021 |         12        4.49       94.01
    sep2020 |          8        3.00       97.00
    sep2021 |          8        3.00      100.00
------------+-----------------------------------
      Total |        267      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1955

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        5.07        5.07
    apr2021 |         13        4.71        9.78
    aug2020 |         10        3.62       13.41
    aug2021 |          9        3.26       16.67
    dec2020 |         11        3.99       20.65
    dec2021 |          6        2.17       22.83
    feb2020 |         14        5.07       27.90
    feb2021 |         11        3.99       31.88
    jan2021 |         14        5.07       36.96
    jan2022 |          8        2.90       39.86
    jul2020 |         12        4.35       44.20
    jul2021 |         12        4.35       48.55
    jun2020 |         12        4.35       52.90
    jun2021 |         14        5.07       57.97
    mar2020 |         18        6.52       64.49
    mar2021 |         10        3.62       68.12
    may2020 |         11        3.99       72.10
    may2021 |         12        4.35       76.45
    nov2020 |         10        3.62       80.07
    nov2021 |         10        3.62       83.70
    oct2020 |         14        5.07       88.77
    oct2021 |         11        3.99       92.75
    sep2020 |         11        3.99       96.74
    sep2021 |          9        3.26      100.00
------------+-----------------------------------
      Total |        276      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1956

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          9        3.85        3.85
    apr2021 |         10        4.27        8.12
    aug2020 |          8        3.42       11.54
    aug2021 |          7        2.99       14.53
    dec2020 |          6        2.56       17.09
    dec2021 |          4        1.71       18.80
    feb2020 |          8        3.42       22.22
    feb2021 |          6        2.56       24.79
    jan2021 |         15        6.41       31.20
    jan2022 |         10        4.27       35.47
    jul2020 |         17        7.26       42.74
    jul2021 |          8        3.42       46.15
    jun2020 |          7        2.99       49.15
    jun2021 |         10        4.27       53.42
    mar2020 |         18        7.69       61.11
    mar2021 |         13        5.56       66.67
    may2020 |         16        6.84       73.50
    may2021 |          4        1.71       75.21
    nov2020 |          7        2.99       78.21
    nov2021 |          9        3.85       82.05
    oct2020 |         11        4.70       86.75
    oct2021 |          8        3.42       90.17
    sep2020 |         11        4.70       94.87
    sep2021 |         12        5.13      100.00
------------+-----------------------------------
      Total |        234      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1957

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         17        6.42        6.42
    apr2021 |          7        2.64        9.06
    aug2020 |         15        5.66       14.72
    aug2021 |         10        3.77       18.49
    dec2020 |          9        3.40       21.89
    dec2021 |         12        4.53       26.42
    feb2020 |         10        3.77       30.19
    feb2021 |          8        3.02       33.21
    jan2021 |         16        6.04       39.25
    jan2022 |          9        3.40       42.64
    jul2020 |         11        4.15       46.79
    jul2021 |          8        3.02       49.81
    jun2020 |         14        5.28       55.09
    jun2021 |          6        2.26       57.36
    mar2020 |         10        3.77       61.13
    mar2021 |         13        4.91       66.04
    may2020 |         14        5.28       71.32
    may2021 |          8        3.02       74.34
    nov2020 |          8        3.02       77.36
    nov2021 |         12        4.53       81.89
    oct2020 |         14        5.28       87.17
    oct2021 |          9        3.40       90.57
    sep2020 |         13        4.91       95.47
    sep2021 |         12        4.53      100.00
------------+-----------------------------------
      Total |        265      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1958

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        4.06        4.06
    apr2021 |          4        1.48        5.54
    aug2020 |         14        5.17       10.70
    aug2021 |         11        4.06       14.76
    dec2020 |         10        3.69       18.45
    dec2021 |          8        2.95       21.40
    feb2020 |         13        4.80       26.20
    feb2021 |          5        1.85       28.04
    jan2021 |         10        3.69       31.73
    jan2022 |          8        2.95       34.69
    jul2020 |         11        4.06       38.75
    jul2021 |          8        2.95       41.70
    jun2020 |         14        5.17       46.86
    jun2021 |         10        3.69       50.55
    mar2020 |         17        6.27       56.83
    mar2021 |         11        4.06       60.89
    may2020 |         15        5.54       66.42
    may2021 |          7        2.58       69.00
    nov2020 |         14        5.17       74.17
    nov2021 |          9        3.32       77.49
    oct2020 |         17        6.27       83.76
    oct2021 |         10        3.69       87.45
    sep2020 |         20        7.38       94.83
    sep2021 |         14        5.17      100.00
------------+-----------------------------------
      Total |        271      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1959

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        5.19        5.19
    apr2021 |         14        5.19       10.37
    aug2020 |          9        3.33       13.70
    aug2021 |         11        4.07       17.78
    dec2020 |         15        5.56       23.33
    dec2021 |         10        3.70       27.04
    feb2020 |         13        4.81       31.85
    feb2021 |          6        2.22       34.07
    jan2021 |         12        4.44       38.52
    jan2022 |         14        5.19       43.70
    jul2020 |         15        5.56       49.26
    jul2021 |          6        2.22       51.48
    jun2020 |          9        3.33       54.81
    jun2021 |         11        4.07       58.89
    mar2020 |         12        4.44       63.33
    mar2021 |         11        4.07       67.41
    may2020 |         14        5.19       72.59
    may2021 |          8        2.96       75.56
    nov2020 |          9        3.33       78.89
    nov2021 |         13        4.81       83.70
    oct2020 |          9        3.33       87.04
    oct2021 |          6        2.22       89.26
    sep2020 |         16        5.93       95.19
    sep2021 |         13        4.81      100.00
------------+-----------------------------------
      Total |        270      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1960

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         10        3.46        3.46
    apr2021 |          8        2.77        6.23
    aug2020 |         14        4.84       11.07
    aug2021 |         13        4.50       15.57
    dec2020 |         12        4.15       19.72
    dec2021 |         14        4.84       24.57
    feb2020 |         15        5.19       29.76
    feb2021 |          9        3.11       32.87
    jan2021 |         19        6.57       39.45
    jan2022 |          8        2.77       42.21
    jul2020 |         10        3.46       45.67
    jul2021 |          9        3.11       48.79
    jun2020 |         19        6.57       55.36
    jun2021 |         12        4.15       59.52
    mar2020 |         11        3.81       63.32
    mar2021 |         10        3.46       66.78
    may2020 |         13        4.50       71.28
    may2021 |         14        4.84       76.12
    nov2020 |         14        4.84       80.97
    nov2021 |          6        2.08       83.04
    oct2020 |         16        5.54       88.58
    oct2021 |          7        2.42       91.00
    sep2020 |         17        5.88       96.89
    sep2021 |          9        3.11      100.00
------------+-----------------------------------
      Total |        289      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1961

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          7        2.83        2.83
    apr2021 |         12        4.86        7.69
    aug2020 |         14        5.67       13.36
    aug2021 |          7        2.83       16.19
    dec2020 |          9        3.64       19.84
    dec2021 |          7        2.83       22.67
    feb2020 |         10        4.05       26.72
    feb2021 |          8        3.24       29.96
    jan2021 |         15        6.07       36.03
    jan2022 |          8        3.24       39.27
    jul2020 |          8        3.24       42.51
    jul2021 |          6        2.43       44.94
    jun2020 |         11        4.45       49.39
    jun2021 |          7        2.83       52.23
    mar2020 |         11        4.45       56.68
    mar2021 |         17        6.88       63.56
    may2020 |         16        6.48       70.04
    may2021 |          8        3.24       73.28
    nov2020 |         14        5.67       78.95
    nov2021 |         15        6.07       85.02
    oct2020 |         10        4.05       89.07
    oct2021 |         14        5.67       94.74
    sep2020 |          9        3.64       98.38
    sep2021 |          4        1.62      100.00
------------+-----------------------------------
      Total |        247      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1962

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        5.56        5.56
    apr2021 |          9        3.57        9.13
    aug2020 |          8        3.17       12.30
    aug2021 |          7        2.78       15.08
    dec2020 |         11        4.37       19.44
    dec2021 |         14        5.56       25.00
    feb2020 |         11        4.37       29.37
    feb2021 |         18        7.14       36.51
    jan2021 |         12        4.76       41.27
    jan2022 |         11        4.37       45.63
    jul2020 |          6        2.38       48.02
    jul2021 |          7        2.78       50.79
    jun2020 |         14        5.56       56.35
    jun2021 |          8        3.17       59.52
    mar2020 |         14        5.56       65.08
    mar2021 |          9        3.57       68.65
    may2020 |          9        3.57       72.22
    may2021 |         12        4.76       76.98
    nov2020 |          7        2.78       79.76
    nov2021 |          7        2.78       82.54
    oct2020 |         14        5.56       88.10
    oct2021 |         11        4.37       92.46
    sep2020 |          8        3.17       95.63
    sep2021 |         11        4.37      100.00
------------+-----------------------------------
      Total |        252      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1963

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          8        2.99        2.99
    apr2021 |         11        4.10        7.09
    aug2020 |         11        4.10       11.19
    aug2021 |          8        2.99       14.18
    dec2020 |         18        6.72       20.90
    dec2021 |          9        3.36       24.25
    feb2020 |         15        5.60       29.85
    feb2021 |         14        5.22       35.07
    jan2021 |         11        4.10       39.18
    jan2022 |         11        4.10       43.28
    jul2020 |         16        5.97       49.25
    jul2021 |         10        3.73       52.99
    jun2020 |         17        6.34       59.33
    jun2021 |          9        3.36       62.69
    mar2020 |         13        4.85       67.54
    mar2021 |         12        4.48       72.01
    may2020 |          6        2.24       74.25
    may2021 |         15        5.60       79.85
    nov2020 |          8        2.99       82.84
    nov2021 |         11        4.10       86.94
    oct2020 |          6        2.24       89.18
    oct2021 |          4        1.49       90.67
    sep2020 |         13        4.85       95.52
    sep2021 |         12        4.48      100.00
------------+-----------------------------------
      Total |        268      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1964

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        4.71        4.71
    apr2021 |         13        5.10        9.80
    aug2020 |         11        4.31       14.12
    aug2021 |         15        5.88       20.00
    dec2020 |          8        3.14       23.14
    dec2021 |          7        2.75       25.88
    feb2020 |          9        3.53       29.41
    feb2021 |          5        1.96       31.37
    jan2021 |         13        5.10       36.47
    jan2022 |          4        1.57       38.04
    jul2020 |         12        4.71       42.75
    jul2021 |         10        3.92       46.67
    jun2020 |          6        2.35       49.02
    jun2021 |         11        4.31       53.33
    mar2020 |         13        5.10       58.43
    mar2021 |         15        5.88       64.31
    may2020 |         13        5.10       69.41
    may2021 |         14        5.49       74.90
    nov2020 |         13        5.10       80.00
    nov2021 |          7        2.75       82.75
    oct2020 |         12        4.71       87.45
    oct2021 |         10        3.92       91.37
    sep2020 |         12        4.71       96.08
    sep2021 |         10        3.92      100.00
------------+-----------------------------------
      Total |        255      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1965

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        5.69        5.69
    apr2021 |          6        2.44        8.13
    aug2020 |         15        6.10       14.23
    aug2021 |          6        2.44       16.67
    dec2020 |          7        2.85       19.51
    dec2021 |         13        5.28       24.80
    feb2020 |         10        4.07       28.86
    feb2021 |         13        5.28       34.15
    jan2021 |         11        4.47       38.62
    jan2022 |         10        4.07       42.68
    jul2020 |         17        6.91       49.59
    jul2021 |          6        2.44       52.03
    jun2020 |         12        4.88       56.91
    jun2021 |         10        4.07       60.98
    mar2020 |         12        4.88       65.85
    mar2021 |          9        3.66       69.51
    may2020 |         12        4.88       74.39
    may2021 |         10        4.07       78.46
    nov2020 |         10        4.07       82.52
    nov2021 |          4        1.63       84.15
    oct2020 |         12        4.88       89.02
    oct2021 |          8        3.25       92.28
    sep2020 |          9        3.66       95.93
    sep2021 |         10        4.07      100.00
------------+-----------------------------------
      Total |        246      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1966

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        5.19        5.19
    apr2021 |          4        1.73        6.93
    aug2020 |          9        3.90       10.82
    aug2021 |         13        5.63       16.45
    dec2020 |          7        3.03       19.48
    dec2021 |         11        4.76       24.24
    feb2020 |         12        5.19       29.44
    feb2021 |         11        4.76       34.20
    jan2021 |          9        3.90       38.10
    jan2022 |          6        2.60       40.69
    jul2020 |          8        3.46       44.16
    jul2021 |         16        6.93       51.08
    jun2020 |          8        3.46       54.55
    jun2021 |          8        3.46       58.01
    mar2020 |         12        5.19       63.20
    mar2021 |         10        4.33       67.53
    may2020 |         11        4.76       72.29
    may2021 |          9        3.90       76.19
    nov2020 |         11        4.76       80.95
    nov2021 |         11        4.76       85.71
    oct2020 |          7        3.03       88.74
    oct2021 |          8        3.46       92.21
    sep2020 |         12        5.19       97.40
    sep2021 |          6        2.60      100.00
------------+-----------------------------------
      Total |        231      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1967

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         13        5.02        5.02
    apr2021 |         13        5.02       10.04
    aug2020 |         12        4.63       14.67
    aug2021 |         10        3.86       18.53
    dec2020 |         14        5.41       23.94
    dec2021 |         10        3.86       27.80
    feb2020 |         12        4.63       32.43
    feb2021 |         11        4.25       36.68
    jan2021 |         13        5.02       41.70
    jan2022 |          5        1.93       43.63
    jul2020 |          8        3.09       46.72
    jul2021 |         15        5.79       52.51
    jun2020 |         12        4.63       57.14
    jun2021 |         12        4.63       61.78
    mar2020 |          7        2.70       64.48
    mar2021 |          8        3.09       67.57
    may2020 |          9        3.47       71.04
    may2021 |         11        4.25       75.29
    nov2020 |         12        4.63       79.92
    nov2021 |          9        3.47       83.40
    oct2020 |         10        3.86       87.26
    oct2021 |          7        2.70       89.96
    sep2020 |          9        3.47       93.44
    sep2021 |         17        6.56      100.00
------------+-----------------------------------
      Total |        259      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1968

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         13        5.68        5.68
    apr2021 |          8        3.49        9.17
    aug2020 |          8        3.49       12.66
    aug2021 |          8        3.49       16.16
    dec2020 |          8        3.49       19.65
    dec2021 |         12        5.24       24.89
    feb2020 |          5        2.18       27.07
    feb2021 |         11        4.80       31.88
    jan2021 |          6        2.62       34.50
    jan2022 |         14        6.11       40.61
    jul2020 |         12        5.24       45.85
    jul2021 |          8        3.49       49.34
    jun2020 |         11        4.80       54.15
    jun2021 |         11        4.80       58.95
    mar2020 |         17        7.42       66.38
    mar2021 |          9        3.93       70.31
    may2020 |          9        3.93       74.24
    may2021 |          9        3.93       78.17
    nov2020 |          6        2.62       80.79
    nov2021 |          9        3.93       84.72
    oct2020 |          8        3.49       88.21
    oct2021 |         11        4.80       93.01
    sep2020 |          7        3.06       96.07
    sep2021 |          9        3.93      100.00
------------+-----------------------------------
      Total |        229      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1969

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        4.20        4.20
    apr2021 |         11        4.20        8.40
    aug2020 |          9        3.44       11.83
    aug2021 |          9        3.44       15.27
    dec2020 |         20        7.63       22.90
    dec2021 |          4        1.53       24.43
    feb2020 |         22        8.40       32.82
    feb2021 |          8        3.05       35.88
    jan2021 |          5        1.91       37.79
    jan2022 |         11        4.20       41.98
    jul2020 |          9        3.44       45.42
    jul2021 |         14        5.34       50.76
    jun2020 |         11        4.20       54.96
    jun2021 |         13        4.96       59.92
    mar2020 |          7        2.67       62.60
    mar2021 |         12        4.58       67.18
    may2020 |         12        4.58       71.76
    may2021 |         11        4.20       75.95
    nov2020 |         19        7.25       83.21
    nov2021 |          6        2.29       85.50
    oct2020 |         10        3.82       89.31
    oct2021 |         10        3.82       93.13
    sep2020 |          7        2.67       95.80
    sep2021 |         11        4.20      100.00
------------+-----------------------------------
      Total |        262      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1970

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        5.58        5.58
    apr2021 |         10        3.98        9.56
    aug2020 |         10        3.98       13.55
    aug2021 |         12        4.78       18.33
    dec2020 |         10        3.98       22.31
    dec2021 |         11        4.38       26.69
    feb2020 |          6        2.39       29.08
    feb2021 |          9        3.59       32.67
    jan2021 |         10        3.98       36.65
    jan2022 |         10        3.98       40.64
    jul2020 |         11        4.38       45.02
    jul2021 |         13        5.18       50.20
    jun2020 |         13        5.18       55.38
    jun2021 |          6        2.39       57.77
    mar2020 |         14        5.58       63.35
    mar2021 |          8        3.19       66.53
    may2020 |         12        4.78       71.31
    may2021 |         11        4.38       75.70
    nov2020 |          7        2.79       78.49
    nov2021 |         13        5.18       83.67
    oct2020 |         10        3.98       87.65
    oct2021 |          7        2.79       90.44
    sep2020 |         14        5.58       96.02
    sep2021 |         10        3.98      100.00
------------+-----------------------------------
      Total |        251      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1971

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        5.79        5.79
    apr2021 |          6        2.48        8.26
    aug2020 |         12        4.96       13.22
    aug2021 |          4        1.65       14.88
    dec2020 |         11        4.55       19.42
    dec2021 |         11        4.55       23.97
    feb2020 |         12        4.96       28.93
    feb2021 |         13        5.37       34.30
    jan2021 |          8        3.31       37.60
    jan2022 |         11        4.55       42.15
    jul2020 |          7        2.89       45.04
    jul2021 |          8        3.31       48.35
    jun2020 |         13        5.37       53.72
    jun2021 |         13        5.37       59.09
    mar2020 |         11        4.55       63.64
    mar2021 |         11        4.55       68.18
    may2020 |          8        3.31       71.49
    may2021 |         10        4.13       75.62
    nov2020 |          9        3.72       79.34
    nov2021 |         14        5.79       85.12
    oct2020 |          8        3.31       88.43
    oct2021 |          8        3.31       91.74
    sep2020 |          8        3.31       95.04
    sep2021 |         12        4.96      100.00
------------+-----------------------------------
      Total |        242      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1972

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          5        2.07        2.07
    apr2021 |          7        2.89        4.96
    aug2020 |          9        3.72        8.68
    aug2021 |         15        6.20       14.88
    dec2020 |         11        4.55       19.42
    dec2021 |         10        4.13       23.55
    feb2020 |         11        4.55       28.10
    feb2021 |          7        2.89       30.99
    jan2021 |          8        3.31       34.30
    jan2022 |         10        4.13       38.43
    jul2020 |         12        4.96       43.39
    jul2021 |         12        4.96       48.35
    jun2020 |         14        5.79       54.13
    jun2021 |          2        0.83       54.96
    mar2020 |         15        6.20       61.16
    mar2021 |         14        5.79       66.94
    may2020 |         19        7.85       74.79
    may2021 |         10        4.13       78.93
    nov2020 |         11        4.55       83.47
    nov2021 |          5        2.07       85.54
    oct2020 |          6        2.48       88.02
    oct2021 |         10        4.13       92.15
    sep2020 |         10        4.13       96.28
    sep2021 |          9        3.72      100.00
------------+-----------------------------------
      Total |        242      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1973

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          7        2.73        2.73
    apr2021 |          8        3.13        5.86
    aug2020 |          7        2.73        8.59
    aug2021 |          7        2.73       11.33
    dec2020 |         18        7.03       18.36
    dec2021 |          9        3.52       21.88
    feb2020 |         14        5.47       27.34
    feb2021 |          9        3.52       30.86
    jan2021 |          9        3.52       34.38
    jan2022 |         11        4.30       38.67
    jul2020 |         12        4.69       43.36
    jul2021 |         10        3.91       47.27
    jun2020 |         16        6.25       53.52
    jun2021 |          6        2.34       55.86
    mar2020 |         14        5.47       61.33
    mar2021 |          7        2.73       64.06
    may2020 |         11        4.30       68.36
    may2021 |         12        4.69       73.05
    nov2020 |         14        5.47       78.52
    nov2021 |         11        4.30       82.81
    oct2020 |         11        4.30       87.11
    oct2021 |          6        2.34       89.45
    sep2020 |         13        5.08       94.53
    sep2021 |         14        5.47      100.00
------------+-----------------------------------
      Total |        256      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1974

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         19        6.76        6.76
    apr2021 |          8        2.85        9.61
    aug2020 |         10        3.56       13.17
    aug2021 |          7        2.49       15.66
    dec2020 |          5        1.78       17.44
    dec2021 |          7        2.49       19.93
    feb2020 |         12        4.27       24.20
    feb2021 |          5        1.78       25.98
    jan2021 |          6        2.14       28.11
    jan2022 |         19        6.76       34.88
    jul2020 |         14        4.98       39.86
    jul2021 |         15        5.34       45.20
    jun2020 |         18        6.41       51.60
    jun2021 |         13        4.63       56.23
    mar2020 |         12        4.27       60.50
    mar2021 |         13        4.63       65.12
    may2020 |         11        3.91       69.04
    may2021 |          9        3.20       72.24
    nov2020 |         13        4.63       76.87
    nov2021 |          9        3.20       80.07
    oct2020 |         19        6.76       86.83
    oct2021 |         16        5.69       92.53
    sep2020 |         11        3.91       96.44
    sep2021 |         10        3.56      100.00
------------+-----------------------------------
      Total |        281      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1975

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         13        4.81        4.81
    apr2021 |         14        5.19       10.00
    aug2020 |         10        3.70       13.70
    aug2021 |         10        3.70       17.41
    dec2020 |         15        5.56       22.96
    dec2021 |         12        4.44       27.41
    feb2020 |         16        5.93       33.33
    feb2021 |         12        4.44       37.78
    jan2021 |          6        2.22       40.00
    jan2022 |         13        4.81       44.81
    jul2020 |         13        4.81       49.63
    jul2021 |          7        2.59       52.22
    jun2020 |         10        3.70       55.93
    jun2021 |         12        4.44       60.37
    mar2020 |         19        7.04       67.41
    mar2021 |          8        2.96       70.37
    may2020 |          9        3.33       73.70
    may2021 |          8        2.96       76.67
    nov2020 |         12        4.44       81.11
    nov2021 |         10        3.70       84.81
    oct2020 |         14        5.19       90.00
    oct2021 |          5        1.85       91.85
    sep2020 |         14        5.19       97.04
    sep2021 |          8        2.96      100.00
------------+-----------------------------------
      Total |        270      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1976

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          9        3.47        3.47
    apr2021 |          8        3.09        6.56
    aug2020 |         13        5.02       11.58
    aug2021 |          8        3.09       14.67
    dec2020 |         14        5.41       20.08
    dec2021 |         10        3.86       23.94
    feb2020 |         11        4.25       28.19
    feb2021 |          8        3.09       31.27
    jan2021 |          6        2.32       33.59
    jan2022 |         10        3.86       37.45
    jul2020 |         16        6.18       43.63
    jul2021 |          7        2.70       46.33
    jun2020 |          8        3.09       49.42
    jun2021 |         13        5.02       54.44
    mar2020 |          8        3.09       57.53
    mar2021 |         11        4.25       61.78
    may2020 |         12        4.63       66.41
    may2021 |         12        4.63       71.04
    nov2020 |         11        4.25       75.29
    nov2021 |         14        5.41       80.69
    oct2020 |         16        6.18       86.87
    oct2021 |          9        3.47       90.35
    sep2020 |         15        5.79       96.14
    sep2021 |         10        3.86      100.00
------------+-----------------------------------
      Total |        259      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1977

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        5.36        5.36
    apr2021 |          9        3.45        8.81
    aug2020 |         13        4.98       13.79
    aug2021 |         11        4.21       18.01
    dec2020 |         14        5.36       23.37
    dec2021 |          9        3.45       26.82
    feb2020 |         12        4.60       31.42
    feb2021 |         14        5.36       36.78
    jan2021 |          8        3.07       39.85
    jan2022 |          7        2.68       42.53
    jul2020 |         15        5.75       48.28
    jul2021 |         14        5.36       53.64
    jun2020 |         13        4.98       58.62
    jun2021 |          9        3.45       62.07
    mar2020 |         12        4.60       66.67
    mar2021 |          5        1.92       68.58
    may2020 |         10        3.83       72.41
    may2021 |          7        2.68       75.10
    nov2020 |         13        4.98       80.08
    nov2021 |         11        4.21       84.29
    oct2020 |         12        4.60       88.89
    oct2021 |         10        3.83       92.72
    sep2020 |         11        4.21       96.93
    sep2021 |          8        3.07      100.00
------------+-----------------------------------
      Total |        261      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1978

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         13        5.02        5.02
    apr2021 |          9        3.47        8.49
    aug2020 |          8        3.09       11.58
    aug2021 |          8        3.09       14.67
    dec2020 |          7        2.70       17.37
    dec2021 |         10        3.86       21.24
    feb2020 |         17        6.56       27.80
    feb2021 |          7        2.70       30.50
    jan2021 |         12        4.63       35.14
    jan2022 |         11        4.25       39.38
    jul2020 |          9        3.47       42.86
    jul2021 |          6        2.32       45.17
    jun2020 |          8        3.09       48.26
    jun2021 |         13        5.02       53.28
    mar2020 |         14        5.41       58.69
    mar2021 |         10        3.86       62.55
    may2020 |          4        1.54       64.09
    may2021 |         14        5.41       69.50
    nov2020 |         17        6.56       76.06
    nov2021 |         11        4.25       80.31
    oct2020 |         16        6.18       86.49
    oct2021 |         12        4.63       91.12
    sep2020 |         11        4.25       95.37
    sep2021 |         12        4.63      100.00
------------+-----------------------------------
      Total |        259      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1979

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        4.53        4.53
    apr2021 |          6        2.26        6.79
    aug2020 |          7        2.64        9.43
    aug2021 |         18        6.79       16.23
    dec2020 |         16        6.04       22.26
    dec2021 |         14        5.28       27.55
    feb2020 |         12        4.53       32.08
    feb2021 |          8        3.02       35.09
    jan2021 |         13        4.91       40.00
    jan2022 |         10        3.77       43.77
    jul2020 |         13        4.91       48.68
    jul2021 |         12        4.53       53.21
    jun2020 |         15        5.66       58.87
    jun2021 |         12        4.53       63.40
    mar2020 |         12        4.53       67.92
    mar2021 |         13        4.91       72.83
    may2020 |          5        1.89       74.72
    may2021 |          9        3.40       78.11
    nov2020 |         15        5.66       83.77
    nov2021 |          7        2.64       86.42
    oct2020 |          6        2.26       88.68
    oct2021 |          9        3.40       92.08
    sep2020 |         13        4.91       96.98
    sep2021 |          8        3.02      100.00
------------+-----------------------------------
      Total |        265      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1980

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         10        3.64        3.64
    apr2021 |         10        3.64        7.27
    aug2020 |         15        5.45       12.73
    aug2021 |         13        4.73       17.45
    dec2020 |         13        4.73       22.18
    dec2021 |         15        5.45       27.64
    feb2020 |         13        4.73       32.36
    feb2021 |         15        5.45       37.82
    jan2021 |          8        2.91       40.73
    jan2022 |          6        2.18       42.91
    jul2020 |         11        4.00       46.91
    jul2021 |         10        3.64       50.55
    jun2020 |         11        4.00       54.55
    jun2021 |          7        2.55       57.09
    mar2020 |         11        4.00       61.09
    mar2021 |          9        3.27       64.36
    may2020 |         17        6.18       70.55
    may2021 |         13        4.73       75.27
    nov2020 |         13        4.73       80.00
    nov2021 |         13        4.73       84.73
    oct2020 |          8        2.91       87.64
    oct2021 |          9        3.27       90.91
    sep2020 |         12        4.36       95.27
    sep2021 |         13        4.73      100.00
------------+-----------------------------------
      Total |        275      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1981

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        4.44        4.44
    apr2021 |          9        3.63        8.06
    aug2020 |         11        4.44       12.50
    aug2021 |          8        3.23       15.73
    dec2020 |          9        3.63       19.35
    dec2021 |          8        3.23       22.58
    feb2020 |         13        5.24       27.82
    feb2021 |          8        3.23       31.05
    jan2021 |         11        4.44       35.48
    jan2022 |         10        4.03       39.52
    jul2020 |         14        5.65       45.16
    jul2021 |         12        4.84       50.00
    jun2020 |         10        4.03       54.03
    jun2021 |         17        6.85       60.89
    mar2020 |         17        6.85       67.74
    mar2021 |         14        5.65       73.39
    may2020 |         10        4.03       77.42
    may2021 |          7        2.82       80.24
    nov2020 |         10        4.03       84.27
    nov2021 |          8        3.23       87.50
    oct2020 |         11        4.44       91.94
    oct2021 |          3        1.21       93.15
    sep2020 |          9        3.63       96.77
    sep2021 |          8        3.23      100.00
------------+-----------------------------------
      Total |        248      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1982

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         10        4.46        4.46
    apr2021 |          4        1.79        6.25
    aug2020 |         13        5.80       12.05
    aug2021 |         10        4.46       16.52
    dec2020 |         10        4.46       20.98
    dec2021 |          9        4.02       25.00
    feb2020 |          9        4.02       29.02
    feb2021 |          5        2.23       31.25
    jan2021 |         12        5.36       36.61
    jan2022 |          6        2.68       39.29
    jul2020 |          9        4.02       43.30
    jul2021 |         10        4.46       47.77
    jun2020 |         13        5.80       53.57
    jun2021 |          9        4.02       57.59
    mar2020 |         10        4.46       62.05
    mar2021 |          4        1.79       63.84
    may2020 |          8        3.57       67.41
    may2021 |          6        2.68       70.09
    nov2020 |         15        6.70       76.79
    nov2021 |         10        4.46       81.25
    oct2020 |         13        5.80       87.05
    oct2021 |          9        4.02       91.07
    sep2020 |         11        4.91       95.98
    sep2021 |          9        4.02      100.00
------------+-----------------------------------
      Total |        224      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1983

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        4.09        4.09
    apr2021 |         12        4.46        8.55
    aug2020 |          9        3.35       11.90
    aug2021 |         10        3.72       15.61
    dec2020 |         13        4.83       20.45
    dec2021 |          6        2.23       22.68
    feb2020 |         11        4.09       26.77
    feb2021 |          6        2.23       29.00
    jan2021 |          9        3.35       32.34
    jan2022 |          9        3.35       35.69
    jul2020 |         12        4.46       40.15
    jul2021 |         14        5.20       45.35
    jun2020 |          9        3.35       48.70
    jun2021 |          8        2.97       51.67
    mar2020 |         15        5.58       57.25
    mar2021 |         12        4.46       61.71
    may2020 |         16        5.95       67.66
    may2021 |         10        3.72       71.38
    nov2020 |         18        6.69       78.07
    nov2021 |          7        2.60       80.67
    oct2020 |         16        5.95       86.62
    oct2021 |         10        3.72       90.33
    sep2020 |         12        4.46       94.80
    sep2021 |         14        5.20      100.00
------------+-----------------------------------
      Total |        269      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1984

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        4.26        4.26
    apr2021 |         10        3.88        8.14
    aug2020 |         15        5.81       13.95
    aug2021 |         10        3.88       17.83
    dec2020 |          9        3.49       21.32
    dec2021 |          7        2.71       24.03
    feb2020 |         14        5.43       29.46
    feb2021 |         13        5.04       34.50
    jan2021 |         12        4.65       39.15
    jan2022 |         10        3.88       43.02
    jul2020 |         15        5.81       48.84
    jul2021 |         11        4.26       53.10
    jun2020 |         13        5.04       58.14
    jun2021 |          8        3.10       61.24
    mar2020 |         13        5.04       66.28
    mar2021 |          6        2.33       68.60
    may2020 |         14        5.43       74.03
    may2021 |         14        5.43       79.46
    nov2020 |          8        3.10       82.56
    nov2021 |          9        3.49       86.05
    oct2020 |         12        4.65       90.70
    oct2021 |          7        2.71       93.41
    sep2020 |         12        4.65       98.06
    sep2021 |          5        1.94      100.00
------------+-----------------------------------
      Total |        258      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1985

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         13        5.33        5.33
    apr2021 |         10        4.10        9.43
    aug2020 |          9        3.69       13.11
    aug2021 |          8        3.28       16.39
    dec2020 |          8        3.28       19.67
    dec2021 |          8        3.28       22.95
    feb2020 |         13        5.33       28.28
    feb2021 |          5        2.05       30.33
    jan2021 |         14        5.74       36.07
    jan2022 |         10        4.10       40.16
    jul2020 |          9        3.69       43.85
    jul2021 |          9        3.69       47.54
    jun2020 |          8        3.28       50.82
    jun2021 |          8        3.28       54.10
    mar2020 |         11        4.51       58.61
    mar2021 |          7        2.87       61.48
    may2020 |         18        7.38       68.85
    may2021 |         15        6.15       75.00
    nov2020 |         12        4.92       79.92
    nov2021 |         13        5.33       85.25
    oct2020 |         11        4.51       89.75
    oct2021 |         10        4.10       93.85
    sep2020 |          7        2.87       96.72
    sep2021 |          8        3.28      100.00
------------+-----------------------------------
      Total |        244      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1986

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          9        3.77        3.77
    apr2021 |          9        3.77        7.53
    aug2020 |          4        1.67        9.21
    aug2021 |          9        3.77       12.97
    dec2020 |         10        4.18       17.15
    dec2021 |         10        4.18       21.34
    feb2020 |          6        2.51       23.85
    feb2021 |         10        4.18       28.03
    jan2021 |         11        4.60       32.64
    jan2022 |          8        3.35       35.98
    jul2020 |         13        5.44       41.42
    jul2021 |         10        4.18       45.61
    jun2020 |         14        5.86       51.46
    jun2021 |          9        3.77       55.23
    mar2020 |         17        7.11       62.34
    mar2021 |         11        4.60       66.95
    may2020 |          8        3.35       70.29
    may2021 |         14        5.86       76.15
    nov2020 |         13        5.44       81.59
    nov2021 |          4        1.67       83.26
    oct2020 |         10        4.18       87.45
    oct2021 |         10        4.18       91.63
    sep2020 |         14        5.86       97.49
    sep2021 |          6        2.51      100.00
------------+-----------------------------------
      Total |        239      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1987

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         15        5.54        5.54
    apr2021 |         10        3.69        9.23
    aug2020 |          7        2.58       11.81
    aug2021 |         10        3.69       15.50
    dec2020 |         10        3.69       19.19
    dec2021 |          8        2.95       22.14
    feb2020 |         13        4.80       26.94
    feb2021 |         16        5.90       32.84
    jan2021 |         14        5.17       38.01
    jan2022 |          8        2.95       40.96
    jul2020 |         13        4.80       45.76
    jul2021 |          9        3.32       49.08
    jun2020 |          9        3.32       52.40
    jun2021 |         16        5.90       58.30
    mar2020 |         15        5.54       63.84
    mar2021 |          8        2.95       66.79
    may2020 |         10        3.69       70.48
    may2021 |         17        6.27       76.75
    nov2020 |         17        6.27       83.03
    nov2021 |         13        4.80       87.82
    oct2020 |          6        2.21       90.04
    oct2021 |          6        2.21       92.25
    sep2020 |         10        3.69       95.94
    sep2021 |         11        4.06      100.00
------------+-----------------------------------
      Total |        271      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1988

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        4.44        4.44
    apr2021 |         10        4.03        8.47
    aug2020 |         12        4.84       13.31
    aug2021 |          5        2.02       15.32
    dec2020 |          7        2.82       18.15
    dec2021 |         13        5.24       23.39
    feb2020 |         13        5.24       28.63
    feb2021 |         11        4.44       33.06
    jan2021 |          3        1.21       34.27
    jan2022 |          8        3.23       37.50
    jul2020 |         14        5.65       43.15
    jul2021 |         15        6.05       49.19
    jun2020 |          8        3.23       52.42
    jun2021 |         12        4.84       57.26
    mar2020 |         16        6.45       63.71
    mar2021 |          9        3.63       67.34
    may2020 |         14        5.65       72.98
    may2021 |          9        3.63       76.61
    nov2020 |         14        5.65       82.26
    nov2021 |          8        3.23       85.48
    oct2020 |          8        3.23       88.71
    oct2021 |         10        4.03       92.74
    sep2020 |         10        4.03       96.77
    sep2021 |          8        3.23      100.00
------------+-----------------------------------
      Total |        248      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1989

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         15        5.79        5.79
    apr2021 |         12        4.63       10.42
    aug2020 |         16        6.18       16.60
    aug2021 |         12        4.63       21.24
    dec2020 |         10        3.86       25.10
    dec2021 |          9        3.47       28.57
    feb2020 |          7        2.70       31.27
    feb2021 |          6        2.32       33.59
    jan2021 |         12        4.63       38.22
    jan2022 |         13        5.02       43.24
    jul2020 |          7        2.70       45.95
    jul2021 |          8        3.09       49.03
    jun2020 |          9        3.47       52.51
    jun2021 |          7        2.70       55.21
    mar2020 |         17        6.56       61.78
    mar2021 |         12        4.63       66.41
    may2020 |          7        2.70       69.11
    may2021 |          7        2.70       71.81
    nov2020 |         12        4.63       76.45
    nov2021 |          3        1.16       77.61
    oct2020 |         20        7.72       85.33
    oct2021 |         13        5.02       90.35
    sep2020 |         14        5.41       95.75
    sep2021 |         11        4.25      100.00
------------+-----------------------------------
      Total |        259      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1990

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        5.32        5.32
    apr2021 |          5        1.90        7.22
    aug2020 |          7        2.66        9.89
    aug2021 |         12        4.56       14.45
    dec2020 |         16        6.08       20.53
    dec2021 |         13        4.94       25.48
    feb2020 |          8        3.04       28.52
    feb2021 |          8        3.04       31.56
    jan2021 |          8        3.04       34.60
    jan2022 |          7        2.66       37.26
    jul2020 |         15        5.70       42.97
    jul2021 |         14        5.32       48.29
    jun2020 |         10        3.80       52.09
    jun2021 |         11        4.18       56.27
    mar2020 |         15        5.70       61.98
    mar2021 |         19        7.22       69.20
    may2020 |         14        5.32       74.52
    may2021 |         10        3.80       78.33
    nov2020 |         14        5.32       83.65
    nov2021 |          7        2.66       86.31
    oct2020 |         10        3.80       90.11
    oct2021 |          6        2.28       92.40
    sep2020 |         17        6.46       98.86
    sep2021 |          3        1.14      100.00
------------+-----------------------------------
      Total |        263      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1991

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        5.41        5.41
    apr2021 |         10        3.86        9.27
    aug2020 |          9        3.47       12.74
    aug2021 |          8        3.09       15.83
    dec2020 |         14        5.41       21.24
    dec2021 |          8        3.09       24.32
    feb2020 |         16        6.18       30.50
    feb2021 |         13        5.02       35.52
    jan2021 |          1        0.39       35.91
    jan2022 |         11        4.25       40.15
    jul2020 |         12        4.63       44.79
    jul2021 |          8        3.09       47.88
    jun2020 |         13        5.02       52.90
    jun2021 |          9        3.47       56.37
    mar2020 |         18        6.95       63.32
    mar2021 |          9        3.47       66.80
    may2020 |          7        2.70       69.50
    may2021 |         13        5.02       74.52
    nov2020 |          5        1.93       76.45
    nov2021 |         12        4.63       81.08
    oct2020 |         10        3.86       84.94
    oct2021 |         11        4.25       89.19
    sep2020 |         20        7.72       96.91
    sep2021 |          8        3.09      100.00
------------+-----------------------------------
      Total |        259      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1992

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         15        5.68        5.68
    apr2021 |          9        3.41        9.09
    aug2020 |         10        3.79       12.88
    aug2021 |          8        3.03       15.91
    dec2020 |         10        3.79       19.70
    dec2021 |         14        5.30       25.00
    feb2020 |         11        4.17       29.17
    feb2021 |         11        4.17       33.33
    jan2021 |         10        3.79       37.12
    jan2022 |         15        5.68       42.80
    jul2020 |         12        4.55       47.35
    jul2021 |         14        5.30       52.65
    jun2020 |         11        4.17       56.82
    jun2021 |          9        3.41       60.23
    mar2020 |         11        4.17       64.39
    mar2021 |         13        4.92       69.32
    may2020 |          9        3.41       72.73
    may2021 |         10        3.79       76.52
    nov2020 |          9        3.41       79.92
    nov2021 |         10        3.79       83.71
    oct2020 |         13        4.92       88.64
    oct2021 |         11        4.17       92.80
    sep2020 |          8        3.03       95.83
    sep2021 |         11        4.17      100.00
------------+-----------------------------------
      Total |        264      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1993

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        4.86        4.86
    apr2021 |          7        2.83        7.69
    aug2020 |         12        4.86       12.55
    aug2021 |         11        4.45       17.00
    dec2020 |          8        3.24       20.24
    dec2021 |          8        3.24       23.48
    feb2020 |         13        5.26       28.74
    feb2021 |         10        4.05       32.79
    jan2021 |         14        5.67       38.46
    jan2022 |          7        2.83       41.30
    jul2020 |         10        4.05       45.34
    jul2021 |          7        2.83       48.18
    jun2020 |         16        6.48       54.66
    jun2021 |          8        3.24       57.89
    mar2020 |         10        4.05       61.94
    mar2021 |         10        4.05       65.99
    may2020 |         16        6.48       72.47
    may2021 |         15        6.07       78.54
    nov2020 |          8        3.24       81.78
    nov2021 |          8        3.24       85.02
    oct2020 |          4        1.62       86.64
    oct2021 |         10        4.05       90.69
    sep2020 |         11        4.45       95.14
    sep2021 |         12        4.86      100.00
------------+-----------------------------------
      Total |        247      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1994

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         13        4.94        4.94
    apr2021 |         11        4.18        9.13
    aug2020 |         15        5.70       14.83
    aug2021 |         10        3.80       18.63
    dec2020 |         10        3.80       22.43
    dec2021 |          9        3.42       25.86
    feb2020 |         14        5.32       31.18
    feb2021 |         10        3.80       34.98
    jan2021 |         12        4.56       39.54
    jan2022 |         10        3.80       43.35
    jul2020 |         13        4.94       48.29
    jul2021 |          7        2.66       50.95
    jun2020 |          8        3.04       53.99
    jun2021 |         11        4.18       58.17
    mar2020 |         10        3.80       61.98
    mar2021 |         11        4.18       66.16
    may2020 |         16        6.08       72.24
    may2021 |         10        3.80       76.05
    nov2020 |         10        3.80       79.85
    nov2021 |          8        3.04       82.89
    oct2020 |         10        3.80       86.69
    oct2021 |         12        4.56       91.25
    sep2020 |         14        5.32       96.58
    sep2021 |          9        3.42      100.00
------------+-----------------------------------
      Total |        263      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1995

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          9        3.67        3.67
    apr2021 |         15        6.12        9.80
    aug2020 |         12        4.90       14.69
    aug2021 |          4        1.63       16.33
    dec2020 |          7        2.86       19.18
    dec2021 |          6        2.45       21.63
    feb2020 |         12        4.90       26.53
    feb2021 |          9        3.67       30.20
    jan2021 |         12        4.90       35.10
    jan2022 |          6        2.45       37.55
    jul2020 |         12        4.90       42.45
    jul2021 |         11        4.49       46.94
    jun2020 |         12        4.90       51.84
    jun2021 |          9        3.67       55.51
    mar2020 |         18        7.35       62.86
    mar2021 |          8        3.27       66.12
    may2020 |          9        3.67       69.80
    may2021 |         12        4.90       74.69
    nov2020 |          7        2.86       77.55
    nov2021 |          7        2.86       80.41
    oct2020 |         11        4.49       84.90
    oct2021 |         16        6.53       91.43
    sep2020 |         14        5.71       97.14
    sep2021 |          7        2.86      100.00
------------+-----------------------------------
      Total |        245      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1996

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         10        3.83        3.83
    apr2021 |         10        3.83        7.66
    aug2020 |         13        4.98       12.64
    aug2021 |         11        4.21       16.86
    dec2020 |          6        2.30       19.16
    dec2021 |          7        2.68       21.84
    feb2020 |         10        3.83       25.67
    feb2021 |         11        4.21       29.89
    jan2021 |          6        2.30       32.18
    jan2022 |          9        3.45       35.63
    jul2020 |         14        5.36       41.00
    jul2021 |          5        1.92       42.91
    jun2020 |         20        7.66       50.57
    jun2021 |         12        4.60       55.17
    mar2020 |         15        5.75       60.92
    mar2021 |         11        4.21       65.13
    may2020 |          8        3.07       68.20
    may2021 |         11        4.21       72.41
    nov2020 |         10        3.83       76.25
    nov2021 |         11        4.21       80.46
    oct2020 |         18        6.90       87.36
    oct2021 |          6        2.30       89.66
    sep2020 |         13        4.98       94.64
    sep2021 |         14        5.36      100.00
------------+-----------------------------------
      Total |        261      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1997

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        4.71        4.71
    apr2021 |         13        5.10        9.80
    aug2020 |         12        4.71       14.51
    aug2021 |          9        3.53       18.04
    dec2020 |         11        4.31       22.35
    dec2021 |         12        4.71       27.06
    feb2020 |         14        5.49       32.55
    feb2021 |          9        3.53       36.08
    jan2021 |         17        6.67       42.75
    jan2022 |          8        3.14       45.88
    jul2020 |         12        4.71       50.59
    jul2021 |          9        3.53       54.12
    jun2020 |          6        2.35       56.47
    jun2021 |         11        4.31       60.78
    mar2020 |         13        5.10       65.88
    mar2021 |          7        2.75       68.63
    may2020 |         14        5.49       74.12
    may2021 |         11        4.31       78.43
    nov2020 |         11        4.31       82.75
    nov2021 |         11        4.31       87.06
    oct2020 |         13        5.10       92.16
    oct2021 |          6        2.35       94.51
    sep2020 |          8        3.14       97.65
    sep2021 |          6        2.35      100.00
------------+-----------------------------------
      Total |        255      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1998

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        4.10        4.10
    apr2021 |         11        4.10        8.21
    aug2020 |          9        3.36       11.57
    aug2021 |         13        4.85       16.42
    dec2020 |         18        6.72       23.13
    dec2021 |         14        5.22       28.36
    feb2020 |         13        4.85       33.21
    feb2021 |          5        1.87       35.07
    jan2021 |         10        3.73       38.81
    jan2022 |         15        5.60       44.40
    jul2020 |          7        2.61       47.01
    jul2021 |          6        2.24       49.25
    jun2020 |          9        3.36       52.61
    jun2021 |         10        3.73       56.34
    mar2020 |         12        4.48       60.82
    mar2021 |         11        4.10       64.93
    may2020 |         16        5.97       70.90
    may2021 |         17        6.34       77.24
    nov2020 |          8        2.99       80.22
    nov2021 |         10        3.73       83.96
    oct2020 |         15        5.60       89.55
    oct2021 |          4        1.49       91.04
    sep2020 |         12        4.48       95.52
    sep2021 |         12        4.48      100.00
------------+-----------------------------------
      Total |        268      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1999

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          8        3.17        3.17
    apr2021 |         12        4.76        7.94
    aug2020 |         11        4.37       12.30
    aug2021 |         15        5.95       18.25
    dec2020 |          9        3.57       21.83
    dec2021 |          8        3.17       25.00
    feb2020 |         11        4.37       29.37
    feb2021 |          8        3.17       32.54
    jan2021 |         13        5.16       37.70
    jan2022 |          7        2.78       40.48
    jul2020 |         12        4.76       45.24
    jul2021 |         16        6.35       51.59
    jun2020 |         11        4.37       55.95
    jun2021 |          5        1.98       57.94
    mar2020 |         14        5.56       63.49
    mar2021 |          7        2.78       66.27
    may2020 |         21        8.33       74.60
    may2021 |          8        3.17       77.78
    nov2020 |          7        2.78       80.56
    nov2021 |          6        2.38       82.94
    oct2020 |         15        5.95       88.89
    oct2021 |          9        3.57       92.46
    sep2020 |         10        3.97       96.43
    sep2021 |          9        3.57      100.00
------------+-----------------------------------
      Total |        252      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 2000
no observations


. 
. gen death_date1 = date(death_date, "YMD")
(27,463 missing values generated)

. format death_date1 td%
variable td not found
r(111);

end of do-file

r(111);

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD2c6c_000000.tmp"

. format death_date1 %td

. gen death_date_string=string(death_date1, "%td")

. gen death_month=substr( death_date_string ,3,7)
(27,463 missing values generated)

. bysort year_of_birth: tab death_month

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1950

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          3       10.71       10.71
    dec2020 |          2        7.14       17.86
    feb2020 |          1        3.57       21.43
    feb2021 |          2        7.14       28.57
    jan2021 |          1        3.57       32.14
    jan2022 |          2        7.14       39.29
    jul2021 |          1        3.57       42.86
    jun2021 |          2        7.14       50.00
    mar2020 |          3       10.71       60.71
    mar2021 |          1        3.57       64.29
    may2021 |          1        3.57       67.86
    nov2020 |          1        3.57       71.43
    oct2020 |          1        3.57       75.00
    oct2021 |          1        3.57       78.57
    sep2020 |          3       10.71       89.29
    sep2021 |          3       10.71      100.00
------------+-----------------------------------
      Total |         28      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1951

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    aug2020 |          5       20.00       20.00
    aug2021 |          1        4.00       24.00
    dec2020 |          1        4.00       28.00
    feb2021 |          1        4.00       32.00
    jan2021 |          1        4.00       36.00
    jan2022 |          2        8.00       44.00
    jul2020 |          1        4.00       48.00
    jun2020 |          2        8.00       56.00
    jun2021 |          1        4.00       60.00
    mar2020 |          1        4.00       64.00
    may2021 |          1        4.00       68.00
    nov2021 |          4       16.00       84.00
    oct2020 |          2        8.00       92.00
    sep2020 |          1        4.00       96.00
    sep2021 |          1        4.00      100.00
------------+-----------------------------------
      Total |         25      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1952

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          3        9.38        9.38
    apr2021 |          2        6.25       15.63
    aug2020 |          2        6.25       21.88
    aug2021 |          1        3.13       25.00
    dec2020 |          1        3.13       28.13
    dec2021 |          1        3.13       31.25
    feb2021 |          1        3.13       34.38
    jan2022 |          1        3.13       37.50
    jul2020 |          3        9.38       46.88
    jun2020 |          5       15.63       62.50
    mar2020 |          1        3.13       65.63
    may2020 |          3        9.38       75.00
    may2021 |          2        6.25       81.25
    nov2020 |          1        3.13       84.38
    oct2020 |          1        3.13       87.50
    oct2021 |          1        3.13       90.63
    sep2020 |          1        3.13       93.75
    sep2021 |          2        6.25      100.00
------------+-----------------------------------
      Total |         32      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1953

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          2        8.70        8.70
    aug2021 |          2        8.70       17.39
    dec2020 |          1        4.35       21.74
    dec2021 |          1        4.35       26.09
    feb2020 |          2        8.70       34.78
    jan2021 |          1        4.35       39.13
    jan2022 |          1        4.35       43.48
    jul2020 |          2        8.70       52.17
    jun2020 |          1        4.35       56.52
    jun2021 |          1        4.35       60.87
    may2020 |          1        4.35       65.22
    may2021 |          1        4.35       69.57
    nov2020 |          2        8.70       78.26
    nov2021 |          2        8.70       86.96
    oct2021 |          1        4.35       91.30
    sep2020 |          1        4.35       95.65
    sep2021 |          1        4.35      100.00
------------+-----------------------------------
      Total |         23      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1954

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          1        4.17        4.17
    aug2020 |          1        4.17        8.33
    aug2021 |          3       12.50       20.83
    feb2020 |          2        8.33       29.17
    feb2021 |          1        4.17       33.33
    jan2022 |          1        4.17       37.50
    jul2020 |          1        4.17       41.67
    jun2021 |          2        8.33       50.00
    mar2020 |          2        8.33       58.33
    may2020 |          2        8.33       66.67
    nov2020 |          1        4.17       70.83
    nov2021 |          2        8.33       79.17
    oct2020 |          1        4.17       83.33
    oct2021 |          3       12.50       95.83
    sep2021 |          1        4.17      100.00
------------+-----------------------------------
      Total |         24      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1955

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          2        6.25        6.25
    aug2020 |          2        6.25       12.50
    aug2021 |          2        6.25       18.75
    dec2020 |          2        6.25       25.00
    dec2021 |          1        3.13       28.13
    feb2020 |          2        6.25       34.38
    feb2021 |          1        3.13       37.50
    jan2021 |          1        3.13       40.63
    jan2022 |          1        3.13       43.75
    jul2021 |          3        9.38       53.13
    jun2020 |          1        3.13       56.25
    mar2020 |          2        6.25       62.50
    mar2021 |          1        3.13       65.63
    may2020 |          1        3.13       68.75
    may2021 |          4       12.50       81.25
    nov2021 |          1        3.13       84.38
    oct2021 |          1        3.13       87.50
    sep2020 |          2        6.25       93.75
    sep2021 |          2        6.25      100.00
------------+-----------------------------------
      Total |         32      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1956

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          1        3.23        3.23
    aug2021 |          2        6.45        9.68
    dec2020 |          4       12.90       22.58
    dec2021 |          2        6.45       29.03
    feb2021 |          1        3.23       32.26
    jan2021 |          1        3.23       35.48
    jan2022 |          1        3.23       38.71
    jul2020 |          2        6.45       45.16
    jul2021 |          2        6.45       51.61
    jun2020 |          1        3.23       54.84
    mar2021 |          3        9.68       64.52
    may2020 |          3        9.68       74.19
    may2021 |          1        3.23       77.42
    nov2020 |          1        3.23       80.65
    nov2021 |          2        6.45       87.10
    oct2020 |          1        3.23       90.32
    oct2021 |          1        3.23       93.55
    sep2021 |          2        6.45      100.00
------------+-----------------------------------
      Total |         31      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1957

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          2        8.00        8.00
    apr2021 |          2        8.00       16.00
    aug2021 |          2        8.00       24.00
    dec2020 |          1        4.00       28.00
    feb2020 |          2        8.00       36.00
    feb2021 |          1        4.00       40.00
    jan2022 |          2        8.00       48.00
    jul2020 |          1        4.00       52.00
    jun2020 |          1        4.00       56.00
    jun2021 |          1        4.00       60.00
    mar2020 |          1        4.00       64.00
    mar2021 |          2        8.00       72.00
    may2020 |          1        4.00       76.00
    may2021 |          1        4.00       80.00
    nov2020 |          1        4.00       84.00
    nov2021 |          1        4.00       88.00
    oct2020 |          2        8.00       96.00
    sep2020 |          1        4.00      100.00
------------+-----------------------------------
      Total |         25      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1958

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          1        4.35        4.35
    aug2020 |          2        8.70       13.04
    aug2021 |          2        8.70       21.74
    feb2020 |          1        4.35       26.09
    feb2021 |          2        8.70       34.78
    jan2021 |          1        4.35       39.13
    jan2022 |          1        4.35       43.48
    jul2020 |          1        4.35       47.83
    jun2020 |          2        8.70       56.52
    jun2021 |          1        4.35       60.87
    mar2020 |          3       13.04       73.91
    mar2021 |          1        4.35       78.26
    may2020 |          1        4.35       82.61
    may2021 |          2        8.70       91.30
    oct2021 |          1        4.35       95.65
    sep2021 |          1        4.35      100.00
------------+-----------------------------------
      Total |         23      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1959

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        2.94        2.94
    aug2020 |          2        5.88        8.82
    aug2021 |          2        5.88       14.71
    dec2020 |          1        2.94       17.65
    dec2021 |          2        5.88       23.53
    feb2020 |          2        5.88       29.41
    jan2021 |          2        5.88       35.29
    jan2022 |          2        5.88       41.18
    jul2021 |          2        5.88       47.06
    jun2021 |          1        2.94       50.00
    mar2020 |          2        5.88       55.88
    mar2021 |          2        5.88       61.76
    may2020 |          2        5.88       67.65
    may2021 |          3        8.82       76.47
    nov2020 |          2        5.88       82.35
    oct2020 |          2        5.88       88.24
    oct2021 |          3        8.82       97.06
    sep2020 |          1        2.94      100.00
------------+-----------------------------------
      Total |         34      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1960

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          3        8.82        8.82
    aug2020 |          3        8.82       17.65
    aug2021 |          3        8.82       26.47
    dec2020 |          1        2.94       29.41
    dec2021 |          3        8.82       38.24
    feb2021 |          2        5.88       44.12
    jan2021 |          2        5.88       50.00
    jan2022 |          2        5.88       55.88
    jul2020 |          1        2.94       58.82
    jul2021 |          2        5.88       64.71
    jun2020 |          1        2.94       67.65
    jun2021 |          1        2.94       70.59
    mar2020 |          1        2.94       73.53
    may2020 |          2        5.88       79.41
    may2021 |          2        5.88       85.29
    nov2020 |          2        5.88       91.18
    nov2021 |          1        2.94       94.12
    oct2020 |          1        2.94       97.06
    sep2021 |          1        2.94      100.00
------------+-----------------------------------
      Total |         34      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1961

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        2.86        2.86
    apr2021 |          3        8.57       11.43
    aug2020 |          4       11.43       22.86
    dec2021 |          4       11.43       34.29
    feb2020 |          1        2.86       37.14
    feb2021 |          2        5.71       42.86
    jan2021 |          1        2.86       45.71
    jan2022 |          1        2.86       48.57
    jul2020 |          2        5.71       54.29
    jul2021 |          1        2.86       57.14
    jun2020 |          1        2.86       60.00
    jun2021 |          1        2.86       62.86
    mar2020 |          4       11.43       74.29
    mar2021 |          1        2.86       77.14
    may2020 |          3        8.57       85.71
    nov2021 |          1        2.86       88.57
    oct2020 |          1        2.86       91.43
    sep2020 |          1        2.86       94.29
    sep2021 |          2        5.71      100.00
------------+-----------------------------------
      Total |         35      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1962

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          2        7.69        7.69
    apr2021 |          1        3.85       11.54
    dec2020 |          4       15.38       26.92
    dec2021 |          1        3.85       30.77
    feb2020 |          2        7.69       38.46
    feb2021 |          1        3.85       42.31
    jan2021 |          2        7.69       50.00
    jan2022 |          1        3.85       53.85
    jun2020 |          1        3.85       57.69
    mar2021 |          2        7.69       65.38
    may2020 |          1        3.85       69.23
    nov2021 |          2        7.69       76.92
    oct2020 |          2        7.69       84.62
    oct2021 |          2        7.69       92.31
    sep2020 |          1        3.85       96.15
    sep2021 |          1        3.85      100.00
------------+-----------------------------------
      Total |         26      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1963

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        3.03        3.03
    aug2020 |          4       12.12       15.15
    aug2021 |          1        3.03       18.18
    dec2020 |          3        9.09       27.27
    feb2021 |          2        6.06       33.33
    jan2021 |          4       12.12       45.45
    jul2020 |          1        3.03       48.48
    jul2021 |          1        3.03       51.52
    jun2020 |          2        6.06       57.58
    mar2020 |          1        3.03       60.61
    mar2021 |          2        6.06       66.67
    may2020 |          2        6.06       72.73
    nov2020 |          1        3.03       75.76
    oct2020 |          6       18.18       93.94
    sep2020 |          1        3.03       96.97
    sep2021 |          1        3.03      100.00
------------+-----------------------------------
      Total |         33      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1964

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        2.50        2.50
    apr2021 |          1        2.50        5.00
    aug2020 |          3        7.50       12.50
    dec2020 |          1        2.50       15.00
    dec2021 |          1        2.50       17.50
    feb2020 |          2        5.00       22.50
    feb2021 |          1        2.50       25.00
    jan2021 |          3        7.50       32.50
    jan2022 |          1        2.50       35.00
    jul2020 |          2        5.00       40.00
    jul2021 |          3        7.50       47.50
    jun2020 |          3        7.50       55.00
    jun2021 |          4       10.00       65.00
    mar2020 |          1        2.50       67.50
    mar2021 |          1        2.50       70.00
    may2020 |          2        5.00       75.00
    may2021 |          1        2.50       77.50
    nov2020 |          1        2.50       80.00
    nov2021 |          3        7.50       87.50
    oct2020 |          1        2.50       90.00
    oct2021 |          2        5.00       95.00
    sep2021 |          2        5.00      100.00
------------+-----------------------------------
      Total |         40      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1965

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    dec2020 |          2       10.53       10.53
    dec2021 |          1        5.26       15.79
    feb2020 |          1        5.26       21.05
    feb2021 |          1        5.26       26.32
    jul2021 |          1        5.26       31.58
    jun2020 |          2       10.53       42.11
    jun2021 |          2       10.53       52.63
    mar2021 |          1        5.26       57.89
    nov2020 |          1        5.26       63.16
    nov2021 |          4       21.05       84.21
    oct2020 |          2       10.53       94.74
    sep2021 |          1        5.26      100.00
------------+-----------------------------------
      Total |         19      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1966

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    aug2020 |          2        9.52        9.52
    aug2021 |          1        4.76       14.29
    dec2021 |          1        4.76       19.05
    feb2020 |          1        4.76       23.81
    feb2021 |          2        9.52       33.33
    jul2020 |          1        4.76       38.10
    jul2021 |          1        4.76       42.86
    mar2020 |          1        4.76       47.62
    mar2021 |          1        4.76       52.38
    may2020 |          1        4.76       57.14
    may2021 |          1        4.76       61.90
    nov2021 |          2        9.52       71.43
    oct2020 |          2        9.52       80.95
    oct2021 |          1        4.76       85.71
    sep2020 |          1        4.76       90.48
    sep2021 |          2        9.52      100.00
------------+-----------------------------------
      Total |         21      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1967

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          2        8.33        8.33
    apr2021 |          3       12.50       20.83
    aug2020 |          1        4.17       25.00
    aug2021 |          1        4.17       29.17
    dec2021 |          2        8.33       37.50
    feb2020 |          1        4.17       41.67
    feb2021 |          2        8.33       50.00
    jan2021 |          1        4.17       54.17
    jan2022 |          2        8.33       62.50
    jul2020 |          1        4.17       66.67
    jun2020 |          1        4.17       70.83
    mar2020 |          1        4.17       75.00
    mar2021 |          1        4.17       79.17
    nov2020 |          2        8.33       87.50
    oct2020 |          1        4.17       91.67
    oct2021 |          1        4.17       95.83
    sep2020 |          1        4.17      100.00
------------+-----------------------------------
      Total |         24      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1968

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          1        5.88        5.88
    aug2021 |          1        5.88       11.76
    dec2020 |          2       11.76       23.53
    feb2020 |          2       11.76       35.29
    feb2021 |          1        5.88       41.18
    jan2021 |          1        5.88       47.06
    jan2022 |          1        5.88       52.94
    jul2020 |          1        5.88       58.82
    jun2021 |          1        5.88       64.71
    mar2020 |          1        5.88       70.59
    may2020 |          1        5.88       76.47
    nov2020 |          1        5.88       82.35
    nov2021 |          1        5.88       88.24
    oct2020 |          1        5.88       94.12
    sep2021 |          1        5.88      100.00
------------+-----------------------------------
      Total |         17      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1969

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          2        6.06        6.06
    aug2020 |          1        3.03        9.09
    aug2021 |          4       12.12       21.21
    dec2020 |          1        3.03       24.24
    dec2021 |          2        6.06       30.30
    feb2020 |          2        6.06       36.36
    feb2021 |          2        6.06       42.42
    jan2022 |          3        9.09       51.52
    jul2020 |          2        6.06       57.58
    jul2021 |          4       12.12       69.70
    jun2021 |          1        3.03       72.73
    mar2020 |          1        3.03       75.76
    mar2021 |          1        3.03       78.79
    may2021 |          2        6.06       84.85
    nov2021 |          1        3.03       87.88
    oct2020 |          2        6.06       93.94
    sep2020 |          1        3.03       96.97
    sep2021 |          1        3.03      100.00
------------+-----------------------------------
      Total |         33      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1970

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        4.00        4.00
    apr2021 |          1        4.00        8.00
    aug2021 |          1        4.00       12.00
    dec2020 |          2        8.00       20.00
    dec2021 |          2        8.00       28.00
    feb2020 |          1        4.00       32.00
    feb2021 |          1        4.00       36.00
    jan2021 |          3       12.00       48.00
    jan2022 |          1        4.00       52.00
    jul2020 |          2        8.00       60.00
    jun2021 |          1        4.00       64.00
    may2021 |          2        8.00       72.00
    nov2021 |          2        8.00       80.00
    oct2020 |          2        8.00       88.00
    oct2021 |          1        4.00       92.00
    sep2020 |          1        4.00       96.00
    sep2021 |          1        4.00      100.00
------------+-----------------------------------
      Total |         25      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1971

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          2        7.41        7.41
    aug2021 |          1        3.70       11.11
    dec2020 |          1        3.70       14.81
    dec2021 |          2        7.41       22.22
    feb2020 |          2        7.41       29.63
    feb2021 |          1        3.70       33.33
    jan2021 |          1        3.70       37.04
    jan2022 |          5       18.52       55.56
    jul2020 |          2        7.41       62.96
    jun2020 |          1        3.70       66.67
    jun2021 |          1        3.70       70.37
    may2020 |          3       11.11       81.48
    may2021 |          1        3.70       85.19
    nov2020 |          2        7.41       92.59
    oct2020 |          1        3.70       96.30
    oct2021 |          1        3.70      100.00
------------+-----------------------------------
      Total |         27      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1972

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          1        3.70        3.70
    aug2020 |          3       11.11       14.81
    aug2021 |          2        7.41       22.22
    dec2021 |          1        3.70       25.93
    feb2020 |          1        3.70       29.63
    jan2021 |          2        7.41       37.04
    jul2020 |          2        7.41       44.44
    jun2021 |          1        3.70       48.15
    mar2020 |          1        3.70       51.85
    mar2021 |          1        3.70       55.56
    may2020 |          3       11.11       66.67
    may2021 |          1        3.70       70.37
    nov2020 |          3       11.11       81.48
    nov2021 |          1        3.70       85.19
    oct2020 |          2        7.41       92.59
    oct2021 |          1        3.70       96.30
    sep2020 |          1        3.70      100.00
------------+-----------------------------------
      Total |         27      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1973

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        2.44        2.44
    apr2021 |          2        4.88        7.32
    aug2020 |          5       12.20       19.51
    aug2021 |          3        7.32       26.83
    dec2020 |          1        2.44       29.27
    dec2021 |          2        4.88       34.15
    jan2022 |          2        4.88       39.02
    jul2020 |          1        2.44       41.46
    jul2021 |          1        2.44       43.90
    jun2020 |          2        4.88       48.78
    jun2021 |          4        9.76       58.54
    mar2020 |          2        4.88       63.41
    mar2021 |          3        7.32       70.73
    may2020 |          2        4.88       75.61
    may2021 |          1        2.44       78.05
    nov2020 |          2        4.88       82.93
    nov2021 |          3        7.32       90.24
    oct2021 |          1        2.44       92.68
    sep2020 |          3        7.32      100.00
------------+-----------------------------------
      Total |         41      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1974

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        4.00        4.00
    apr2021 |          1        4.00        8.00
    aug2021 |          3       12.00       20.00
    dec2020 |          3       12.00       32.00
    dec2021 |          1        4.00       36.00
    jan2021 |          2        8.00       44.00
    jul2020 |          2        8.00       52.00
    jul2021 |          2        8.00       60.00
    jun2020 |          2        8.00       68.00
    jun2021 |          1        4.00       72.00
    may2020 |          1        4.00       76.00
    nov2020 |          1        4.00       80.00
    oct2020 |          2        8.00       88.00
    oct2021 |          2        8.00       96.00
    sep2021 |          1        4.00      100.00
------------+-----------------------------------
      Total |         25      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1975

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        3.85        3.85
    apr2021 |          1        3.85        7.69
    aug2020 |          1        3.85       11.54
    aug2021 |          2        7.69       19.23
    dec2020 |          1        3.85       23.08
    dec2021 |          3       11.54       34.62
    jan2021 |          1        3.85       38.46
    jul2020 |          2        7.69       46.15
    jul2021 |          2        7.69       53.85
    mar2021 |          2        7.69       61.54
    may2020 |          2        7.69       69.23
    may2021 |          2        7.69       76.92
    nov2020 |          1        3.85       80.77
    oct2020 |          3       11.54       92.31
    oct2021 |          1        3.85       96.15
    sep2020 |          1        3.85      100.00
------------+-----------------------------------
      Total |         26      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1976

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          2        6.45        6.45
    aug2020 |          2        6.45       12.90
    dec2020 |          3        9.68       22.58
    dec2021 |          3        9.68       32.26
    feb2020 |          1        3.23       35.48
    feb2021 |          2        6.45       41.94
    jul2020 |          2        6.45       48.39
    jul2021 |          2        6.45       54.84
    jun2020 |          2        6.45       61.29
    jun2021 |          1        3.23       64.52
    may2020 |          2        6.45       70.97
    may2021 |          1        3.23       74.19
    nov2021 |          1        3.23       77.42
    oct2020 |          2        6.45       83.87
    oct2021 |          2        6.45       90.32
    sep2021 |          3        9.68      100.00
------------+-----------------------------------
      Total |         31      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1977

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        4.00        4.00
    apr2021 |          3       12.00       16.00
    dec2020 |          1        4.00       20.00
    dec2021 |          1        4.00       24.00
    feb2021 |          1        4.00       28.00
    jan2022 |          3       12.00       40.00
    jul2020 |          1        4.00       44.00
    jul2021 |          2        8.00       52.00
    jun2021 |          3       12.00       64.00
    mar2021 |          2        8.00       72.00
    may2021 |          2        8.00       80.00
    nov2021 |          1        4.00       84.00
    oct2021 |          1        4.00       88.00
    sep2020 |          2        8.00       96.00
    sep2021 |          1        4.00      100.00
------------+-----------------------------------
      Total |         25      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1978

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          1        3.57        3.57
    aug2020 |          2        7.14       10.71
    aug2021 |          3       10.71       21.43
    dec2020 |          1        3.57       25.00
    feb2020 |          1        3.57       28.57
    feb2021 |          2        7.14       35.71
    jan2022 |          2        7.14       42.86
    jun2021 |          2        7.14       50.00
    mar2020 |          2        7.14       57.14
    mar2021 |          1        3.57       60.71
    may2020 |          1        3.57       64.29
    may2021 |          1        3.57       67.86
    nov2020 |          4       14.29       82.14
    oct2020 |          1        3.57       85.71
    oct2021 |          2        7.14       92.86
    sep2020 |          1        3.57       96.43
    sep2021 |          1        3.57      100.00
------------+-----------------------------------
      Total |         28      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1979

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        3.85        3.85
    aug2020 |          2        7.69       11.54
    dec2020 |          1        3.85       15.38
    dec2021 |          1        3.85       19.23
    feb2020 |          1        3.85       23.08
    feb2021 |          1        3.85       26.92
    jan2021 |          1        3.85       30.77
    jan2022 |          3       11.54       42.31
    jul2020 |          1        3.85       46.15
    jul2021 |          2        7.69       53.85
    jun2020 |          1        3.85       57.69
    mar2020 |          1        3.85       61.54
    mar2021 |          1        3.85       65.38
    may2021 |          3       11.54       76.92
    nov2021 |          1        3.85       80.77
    oct2020 |          3       11.54       92.31
    oct2021 |          1        3.85       96.15
    sep2020 |          1        3.85      100.00
------------+-----------------------------------
      Total |         26      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1980

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        4.17        4.17
    apr2021 |          1        4.17        8.33
    aug2020 |          1        4.17       12.50
    aug2021 |          1        4.17       16.67
    dec2021 |          1        4.17       20.83
    feb2020 |          1        4.17       25.00
    feb2021 |          1        4.17       29.17
    jan2021 |          1        4.17       33.33
    jul2020 |          2        8.33       41.67
    jun2021 |          3       12.50       54.17
    mar2021 |          1        4.17       58.33
    may2020 |          1        4.17       62.50
    may2021 |          1        4.17       66.67
    nov2021 |          3       12.50       79.17
    sep2020 |          3       12.50       91.67
    sep2021 |          2        8.33      100.00
------------+-----------------------------------
      Total |         24      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1981

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          2        7.41        7.41
    apr2021 |          1        3.70       11.11
    aug2020 |          1        3.70       14.81
    aug2021 |          1        3.70       18.52
    dec2020 |          1        3.70       22.22
    dec2021 |          3       11.11       33.33
    feb2021 |          2        7.41       40.74
    jan2022 |          1        3.70       44.44
    jul2020 |          1        3.70       48.15
    jul2021 |          2        7.41       55.56
    jun2020 |          2        7.41       62.96
    mar2020 |          1        3.70       66.67
    mar2021 |          1        3.70       70.37
    may2021 |          1        3.70       74.07
    nov2020 |          3       11.11       85.19
    nov2021 |          2        7.41       92.59
    oct2020 |          2        7.41      100.00
------------+-----------------------------------
      Total |         27      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1982

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    aug2021 |          1        4.17        4.17
    dec2020 |          1        4.17        8.33
    dec2021 |          1        4.17       12.50
    feb2020 |          1        4.17       16.67
    jan2021 |          2        8.33       25.00
    jul2020 |          2        8.33       33.33
    jul2021 |          2        8.33       41.67
    mar2020 |          2        8.33       50.00
    mar2021 |          1        4.17       54.17
    may2021 |          2        8.33       62.50
    nov2020 |          1        4.17       66.67
    nov2021 |          1        4.17       70.83
    oct2020 |          3       12.50       83.33
    oct2021 |          2        8.33       91.67
    sep2021 |          2        8.33      100.00
------------+-----------------------------------
      Total |         24      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1983

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          3       12.50       12.50
    apr2021 |          1        4.17       16.67
    aug2020 |          1        4.17       20.83
    dec2020 |          1        4.17       25.00
    dec2021 |          1        4.17       29.17
    feb2020 |          1        4.17       33.33
    feb2021 |          1        4.17       37.50
    jan2022 |          2        8.33       45.83
    jun2020 |          1        4.17       50.00
    jun2021 |          2        8.33       58.33
    mar2020 |          1        4.17       62.50
    mar2021 |          1        4.17       66.67
    may2020 |          1        4.17       70.83
    oct2020 |          1        4.17       75.00
    oct2021 |          3       12.50       87.50
    sep2020 |          3       12.50      100.00
------------+-----------------------------------
      Total |         24      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1984

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        4.17        4.17
    apr2021 |          2        8.33       12.50
    aug2020 |          1        4.17       16.67
    aug2021 |          1        4.17       20.83
    feb2020 |          2        8.33       29.17
    feb2021 |          1        4.17       33.33
    jan2021 |          4       16.67       50.00
    jan2022 |          1        4.17       54.17
    jul2020 |          1        4.17       58.33
    jul2021 |          2        8.33       66.67
    mar2021 |          1        4.17       70.83
    may2020 |          1        4.17       75.00
    may2021 |          1        4.17       79.17
    nov2020 |          1        4.17       83.33
    nov2021 |          1        4.17       87.50
    oct2020 |          2        8.33       95.83
    sep2020 |          1        4.17      100.00
------------+-----------------------------------
      Total |         24      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1985

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          3        9.38        9.38
    apr2021 |          2        6.25       15.63
    aug2021 |          1        3.13       18.75
    dec2020 |          1        3.13       21.88
    feb2021 |          3        9.38       31.25
    jan2021 |          3        9.38       40.63
    jan2022 |          1        3.13       43.75
    jul2021 |          1        3.13       46.88
    jun2020 |          2        6.25       53.13
    jun2021 |          1        3.13       56.25
    mar2020 |          2        6.25       62.50
    mar2021 |          1        3.13       65.63
    may2020 |          1        3.13       68.75
    may2021 |          2        6.25       75.00
    nov2020 |          1        3.13       78.13
    oct2020 |          3        9.38       87.50
    oct2021 |          2        6.25       93.75
    sep2020 |          1        3.13       96.88
    sep2021 |          1        3.13      100.00
------------+-----------------------------------
      Total |         32      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1986

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          3       11.54       11.54
    aug2020 |          3       11.54       23.08
    aug2021 |          1        3.85       26.92
    jan2021 |          2        7.69       34.62
    jul2020 |          2        7.69       42.31
    jul2021 |          1        3.85       46.15
    jun2020 |          1        3.85       50.00
    mar2021 |          2        7.69       57.69
    may2020 |          1        3.85       61.54
    may2021 |          4       15.38       76.92
    nov2020 |          1        3.85       80.77
    oct2020 |          2        7.69       88.46
    oct2021 |          1        3.85       92.31
    sep2020 |          1        3.85       96.15
    sep2021 |          1        3.85      100.00
------------+-----------------------------------
      Total |         26      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1987

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        3.33        3.33
    aug2020 |          5       16.67       20.00
    aug2021 |          3       10.00       30.00
    dec2020 |          1        3.33       33.33
    feb2020 |          1        3.33       36.67
    feb2021 |          1        3.33       40.00
    jan2021 |          1        3.33       43.33
    jan2022 |          1        3.33       46.67
    jul2020 |          1        3.33       50.00
    jul2021 |          3       10.00       60.00
    jun2020 |          1        3.33       63.33
    jun2021 |          1        3.33       66.67
    mar2020 |          4       13.33       80.00
    mar2021 |          2        6.67       86.67
    may2020 |          1        3.33       90.00
    nov2021 |          3       10.00      100.00
------------+-----------------------------------
      Total |         30      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1988

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        3.03        3.03
    apr2021 |          3        9.09       12.12
    aug2020 |          1        3.03       15.15
    aug2021 |          3        9.09       24.24
    dec2020 |          1        3.03       27.27
    feb2021 |          2        6.06       33.33
    jan2021 |          2        6.06       39.39
    jul2020 |          2        6.06       45.45
    jul2021 |          1        3.03       48.48
    jun2020 |          3        9.09       57.58
    mar2020 |          2        6.06       63.64
    mar2021 |          1        3.03       66.67
    may2020 |          1        3.03       69.70
    may2021 |          3        9.09       78.79
    nov2020 |          1        3.03       81.82
    nov2021 |          1        3.03       84.85
    oct2021 |          1        3.03       87.88
    sep2020 |          3        9.09       96.97
    sep2021 |          1        3.03      100.00
------------+-----------------------------------
      Total |         33      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1989

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        3.03        3.03
    apr2021 |          3        9.09       12.12
    aug2020 |          2        6.06       18.18
    aug2021 |          1        3.03       21.21
    dec2020 |          1        3.03       24.24
    feb2020 |          1        3.03       27.27
    feb2021 |          1        3.03       30.30
    jan2021 |          1        3.03       33.33
    jul2020 |          1        3.03       36.36
    jun2020 |          3        9.09       45.45
    jun2021 |          2        6.06       51.52
    mar2021 |          3        9.09       60.61
    may2020 |          1        3.03       63.64
    may2021 |          1        3.03       66.67
    nov2020 |          2        6.06       72.73
    nov2021 |          1        3.03       75.76
    oct2020 |          1        3.03       78.79
    oct2021 |          4       12.12       90.91
    sep2021 |          3        9.09      100.00
------------+-----------------------------------
      Total |         33      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1990

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          2        8.33        8.33
    aug2020 |          3       12.50       20.83
    aug2021 |          1        4.17       25.00
    dec2021 |          1        4.17       29.17
    feb2020 |          2        8.33       37.50
    jan2021 |          1        4.17       41.67
    jan2022 |          1        4.17       45.83
    jul2020 |          1        4.17       50.00
    jun2020 |          2        8.33       58.33
    mar2020 |          1        4.17       62.50
    mar2021 |          2        8.33       70.83
    may2020 |          1        4.17       75.00
    may2021 |          1        4.17       79.17
    nov2021 |          1        4.17       83.33
    oct2020 |          2        8.33       91.67
    sep2021 |          2        8.33      100.00
------------+-----------------------------------
      Total |         24      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1991

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          2        5.88        5.88
    aug2020 |          2        5.88       11.76
    aug2021 |          1        2.94       14.71
    dec2020 |          1        2.94       17.65
    dec2021 |          2        5.88       23.53
    feb2020 |          4       11.76       35.29
    jan2022 |          4       11.76       47.06
    jul2020 |          2        5.88       52.94
    jul2021 |          2        5.88       58.82
    jun2021 |          4       11.76       70.59
    mar2020 |          3        8.82       79.41
    mar2021 |          1        2.94       82.35
    nov2020 |          1        2.94       85.29
    nov2021 |          2        5.88       91.18
    oct2020 |          1        2.94       94.12
    sep2020 |          1        2.94       97.06
    sep2021 |          1        2.94      100.00
------------+-----------------------------------
      Total |         34      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1992

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        3.45        3.45
    aug2020 |          4       13.79       17.24
    dec2021 |          2        6.90       24.14
    feb2020 |          1        3.45       27.59
    feb2021 |          2        6.90       34.48
    jan2022 |          1        3.45       37.93
    jul2021 |          2        6.90       44.83
    jun2020 |          1        3.45       48.28
    jun2021 |          1        3.45       51.72
    mar2020 |          3       10.34       62.07
    mar2021 |          2        6.90       68.97
    nov2021 |          2        6.90       75.86
    oct2020 |          1        3.45       79.31
    oct2021 |          3       10.34       89.66
    sep2020 |          1        3.45       93.10
    sep2021 |          2        6.90      100.00
------------+-----------------------------------
      Total |         29      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1993

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          3       11.54       11.54
    apr2021 |          1        3.85       15.38
    aug2021 |          1        3.85       19.23
    dec2020 |          3       11.54       30.77
    feb2021 |          1        3.85       34.62
    jan2021 |          1        3.85       38.46
    jan2022 |          2        7.69       46.15
    jul2021 |          1        3.85       50.00
    jun2020 |          1        3.85       53.85
    jun2021 |          1        3.85       57.69
    mar2020 |          1        3.85       61.54
    may2020 |          2        7.69       69.23
    may2021 |          1        3.85       73.08
    nov2020 |          1        3.85       76.92
    nov2021 |          2        7.69       84.62
    oct2020 |          1        3.85       88.46
    oct2021 |          1        3.85       92.31
    sep2020 |          2        7.69      100.00
------------+-----------------------------------
      Total |         26      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1994

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          2        6.90        6.90
    apr2021 |          1        3.45       10.34
    dec2020 |          1        3.45       13.79
    feb2020 |          1        3.45       17.24
    feb2021 |          3       10.34       27.59
    jan2021 |          1        3.45       31.03
    jul2021 |          2        6.90       37.93
    jun2020 |          2        6.90       44.83
    jun2021 |          1        3.45       48.28
    mar2020 |          3       10.34       58.62
    mar2021 |          3       10.34       68.97
    may2020 |          2        6.90       75.86
    may2021 |          2        6.90       82.76
    oct2020 |          1        3.45       86.21
    oct2021 |          1        3.45       89.66
    sep2020 |          1        3.45       93.10
    sep2021 |          2        6.90      100.00
------------+-----------------------------------
      Total |         29      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1995

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          3       10.00       10.00
    apr2021 |          1        3.33       13.33
    aug2020 |          5       16.67       30.00
    aug2021 |          1        3.33       33.33
    dec2020 |          1        3.33       36.67
    dec2021 |          1        3.33       40.00
    feb2020 |          1        3.33       43.33
    feb2021 |          1        3.33       46.67
    jan2022 |          1        3.33       50.00
    jul2020 |          1        3.33       53.33
    jun2020 |          1        3.33       56.67
    may2020 |          2        6.67       63.33
    may2021 |          2        6.67       70.00
    nov2020 |          1        3.33       73.33
    nov2021 |          2        6.67       80.00
    oct2020 |          3       10.00       90.00
    oct2021 |          2        6.67       96.67
    sep2021 |          1        3.33      100.00
------------+-----------------------------------
      Total |         30      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1996

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        4.17        4.17
    apr2021 |          2        8.33       12.50
    aug2020 |          1        4.17       16.67
    aug2021 |          1        4.17       20.83
    dec2020 |          1        4.17       25.00
    dec2021 |          2        8.33       33.33
    feb2021 |          2        8.33       41.67
    jan2021 |          1        4.17       45.83
    jan2022 |          1        4.17       50.00
    jun2020 |          2        8.33       58.33
    jun2021 |          1        4.17       62.50
    mar2020 |          1        4.17       66.67
    mar2021 |          2        8.33       75.00
    may2020 |          2        8.33       83.33
    may2021 |          2        8.33       91.67
    oct2020 |          1        4.17       95.83
    sep2021 |          1        4.17      100.00
------------+-----------------------------------
      Total |         24      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1997

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          1        2.70        2.70
    aug2020 |          6       16.22       18.92
    aug2021 |          3        8.11       27.03
    dec2020 |          2        5.41       32.43
    dec2021 |          2        5.41       37.84
    feb2020 |          1        2.70       40.54
    jan2021 |          3        8.11       48.65
    jan2022 |          1        2.70       51.35
    jul2020 |          2        5.41       56.76
    jul2021 |          1        2.70       59.46
    jun2021 |          2        5.41       64.86
    mar2020 |          2        5.41       70.27
    mar2021 |          3        8.11       78.38
    may2020 |          2        5.41       83.78
    nov2020 |          1        2.70       86.49
    nov2021 |          1        2.70       89.19
    oct2020 |          1        2.70       91.89
    sep2020 |          3        8.11      100.00
------------+-----------------------------------
      Total |         37      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1998

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        3.70        3.70
    aug2020 |          1        3.70        7.41
    aug2021 |          3       11.11       18.52
    dec2020 |          1        3.70       22.22
    dec2021 |          1        3.70       25.93
    feb2021 |          1        3.70       29.63
    jan2021 |          1        3.70       33.33
    jul2020 |          1        3.70       37.04
    jul2021 |          1        3.70       40.74
    jun2020 |          3       11.11       51.85
    jun2021 |          1        3.70       55.56
    may2020 |          1        3.70       59.26
    may2021 |          2        7.41       66.67
    nov2020 |          1        3.70       70.37
    nov2021 |          2        7.41       77.78
    oct2021 |          2        7.41       85.19
    sep2020 |          3       11.11       96.30
    sep2021 |          1        3.70      100.00
------------+-----------------------------------
      Total |         27      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 1999

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        2.38        2.38
    apr2021 |          1        2.38        4.76
    aug2020 |          3        7.14       11.90
    dec2020 |          3        7.14       19.05
    dec2021 |          4        9.52       28.57
    feb2020 |          3        7.14       35.71
    feb2021 |          1        2.38       38.10
    jan2021 |          1        2.38       40.48
    jan2022 |          3        7.14       47.62
    jul2020 |          4        9.52       57.14
    jul2021 |          4        9.52       66.67
    jun2021 |          2        4.76       71.43
    mar2020 |          2        4.76       76.19
    may2020 |          1        2.38       78.57
    may2021 |          3        7.14       85.71
    nov2021 |          3        7.14       92.86
    oct2020 |          1        2.38       95.24
    sep2020 |          1        2.38       97.62
    sep2021 |          1        2.38      100.00
------------+-----------------------------------
      Total |         42      100.00

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> year_of_birth = 2000
no observations


. 
end of do-file

. do "C:\Users\lsh1703468\Documents\Repos\analysis\historical_matching.do"

. cap log close
