-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/contemporary_matching_may2021.log
  log type:  text
 opened on:  20 Oct 2022, 09:50:57

. clear

. 
. import delimited ./output/input_contemporary_matching_may2021.csv, delimiter(
> comma) varnames(1) case(preserve) 
(22 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,565 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,971 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,921 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,775 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,669 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,018 real changes made, 14,018 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,018 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,099 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,219 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,862 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,219 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,862 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,425 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,099 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,219 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,862 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(18,081 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,674 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,018 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(18,081 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,219 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. drop egfr_baseline_creatinine_feb2020

. drop age

. 
. * Deceased
. drop if deceased==1
(3,198 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop excess variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. 
. *Tabulate variables
. tab year_of_birth

year_of_bir |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
       1950 |        551        1.91        1.91
       1951 |        578        2.00        3.91
       1952 |        632        2.19        6.09
       1953 |        585        2.02        8.12
       1954 |        575        1.99       10.11
       1955 |        582        2.01       12.12
       1956 |        638        2.21       14.33
       1957 |        535        1.85       16.18
       1958 |        571        1.98       18.16
       1959 |        570        1.97       20.13
       1960 |        586        2.03       22.15
       1961 |        639        2.21       24.37
       1962 |        581        2.01       26.38
       1963 |        569        1.97       28.35
       1964 |        577        2.00       30.34
       1965 |        582        2.01       32.36
       1966 |        547        1.89       34.25
       1967 |        590        2.04       36.29
       1968 |        551        1.91       38.20
       1969 |        554        1.92       40.11
       1970 |        564        1.95       42.06
       1971 |        581        2.01       44.07
       1972 |        571        1.98       46.05
       1973 |        578        2.00       48.05
       1974 |        620        2.15       50.20
       1975 |        565        1.95       52.15
       1976 |        558        1.93       54.08
       1977 |        572        1.98       56.06
       1978 |        568        1.97       58.03
       1979 |        538        1.86       59.89
       1980 |        581        2.01       61.90
       1981 |        552        1.91       63.81
       1982 |        576        1.99       65.80
       1983 |        547        1.89       67.69
       1984 |        589        2.04       69.73
       1985 |        612        2.12       71.85
       1986 |        600        2.08       73.92
       1987 |        592        2.05       75.97
       1988 |        586        2.03       78.00
       1989 |        561        1.94       79.94
       1990 |        604        2.09       82.03
       1991 |        545        1.89       83.92
       1992 |        578        2.00       85.92
       1993 |        604        2.09       88.01
       1994 |        597        2.07       90.07
       1995 |        605        2.09       92.17
       1996 |        539        1.86       94.03
       1997 |        574        1.99       96.02
       1998 |        580        2.01       98.02
       1999 |        570        1.97      100.00
       2000 |          1        0.00      100.00
------------+-----------------------------------
      Total |     28,901      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,476        5.11        5.11
          1 |      5,426       18.77       23.88
          2 |      5,463       18.90       42.78
          3 |      5,446       18.84       61.63
          4 |      5,540       19.17       80.80
          5 |      5,550       19.20      100.00
------------+-----------------------------------
      Total |     28,901      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     14,646       50.68       50.68
       Male |     14,255       49.32      100.00
------------+-----------------------------------
      Total |     28,901      100.00

. 
. gen covid_date = date(covid_diagnosis_date, "YMD")
(19,909 missing values generated)

. format covid_date %td

. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)
(19,909 missing values generated)

. tab covid_month

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |        597        6.64        6.64
    apr2021 |        526        5.85       12.49
    aug2020 |        600        6.67       19.16
    dec2020 |        547        6.08       25.24
    feb2020 |        552        6.14       31.38
    feb2021 |        506        5.63       37.01
    jan2021 |        552        6.14       43.15
    jul2020 |        561        6.24       49.39
    jun2020 |        608        6.76       56.15
    mar2020 |        647        7.20       63.35
    mar2021 |        522        5.81       69.15
    may2020 |        581        6.46       75.61
    may2021 |        493        5.48       81.09
    nov2020 |        544        6.05       87.14
    oct2020 |        607        6.75       93.89
    sep2020 |        549        6.11      100.00
------------+-----------------------------------
      Total |      8,992      100.00

. bysort year_of_birth: tab covid_month

-------------------------------------------------------------------------------
-> year_of_birth = 1950

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          6        3.70        3.70
    apr2021 |          7        4.32        8.02
    aug2020 |          5        3.09       11.11
    dec2020 |         14        8.64       19.75
    feb2020 |         11        6.79       26.54
    feb2021 |         12        7.41       33.95
    jan2021 |          7        4.32       38.27
    jul2020 |         12        7.41       45.68
    jun2020 |         12        7.41       53.09
    mar2020 |         13        8.02       61.11
    mar2021 |         18       11.11       72.22
    may2020 |          9        5.56       77.78
    may2021 |          5        3.09       80.86
    nov2020 |          4        2.47       83.33
    oct2020 |         12        7.41       90.74
    sep2020 |         15        9.26      100.00
------------+-----------------------------------
      Total |        162      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1951

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        6.70        6.70
    apr2021 |         10        5.59       12.29
    aug2020 |         12        6.70       18.99
    dec2020 |          2        1.12       20.11
    feb2020 |         11        6.15       26.26
    feb2021 |         13        7.26       33.52
    jan2021 |         13        7.26       40.78
    jul2020 |          8        4.47       45.25
    jun2020 |         13        7.26       52.51
    mar2020 |         13        7.26       59.78
    mar2021 |          8        4.47       64.25
    may2020 |         16        8.94       73.18
    may2021 |         10        5.59       78.77
    nov2020 |         16        8.94       87.71
    oct2020 |         10        5.59       93.30
    sep2020 |         12        6.70      100.00
------------+-----------------------------------
      Total |        179      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1952

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        5.94        5.94
    apr2021 |         17        8.42       14.36
    aug2020 |         10        4.95       19.31
    dec2020 |         12        5.94       25.25
    feb2020 |         15        7.43       32.67
    feb2021 |         11        5.45       38.12
    jan2021 |         11        5.45       43.56
    jul2020 |         12        5.94       49.50
    jun2020 |          9        4.46       53.96
    mar2020 |         13        6.44       60.40
    mar2021 |         13        6.44       66.83
    may2020 |         17        8.42       75.25
    may2021 |         11        5.45       80.69
    nov2020 |         12        5.94       86.63
    oct2020 |         12        5.94       92.57
    sep2020 |         15        7.43      100.00
------------+-----------------------------------
      Total |        202      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1953

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         17        9.24        9.24
    apr2021 |          7        3.80       13.04
    aug2020 |         15        8.15       21.20
    dec2020 |         12        6.52       27.72
    feb2020 |         16        8.70       36.41
    feb2021 |          3        1.63       38.04
    jan2021 |          8        4.35       42.39
    jul2020 |         14        7.61       50.00
    jun2020 |          9        4.89       54.89
    mar2020 |         19       10.33       65.22
    mar2021 |          6        3.26       68.48
    may2020 |         12        6.52       75.00
    may2021 |          9        4.89       79.89
    nov2020 |         11        5.98       85.87
    oct2020 |         14        7.61       93.48
    sep2020 |         12        6.52      100.00
------------+-----------------------------------
      Total |        184      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1954

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         13        6.50        6.50
    apr2021 |          9        4.50       11.00
    aug2020 |          6        3.00       14.00
    dec2020 |         12        6.00       20.00
    feb2020 |         17        8.50       28.50
    feb2021 |         12        6.00       34.50
    jan2021 |          6        3.00       37.50
    jul2020 |         16        8.00       45.50
    jun2020 |         20       10.00       55.50
    mar2020 |         10        5.00       60.50
    mar2021 |         15        7.50       68.00
    may2020 |         17        8.50       76.50
    may2021 |         12        6.00       82.50
    nov2020 |         13        6.50       89.00
    oct2020 |         11        5.50       94.50
    sep2020 |         11        5.50      100.00
------------+-----------------------------------
      Total |        200      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1955

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        7.82        7.82
    apr2021 |          9        5.03       12.85
    aug2020 |          9        5.03       17.88
    dec2020 |         13        7.26       25.14
    feb2020 |         10        5.59       30.73
    feb2021 |          9        5.03       35.75
    jan2021 |         13        7.26       43.02
    jul2020 |         12        6.70       49.72
    jun2020 |         17        9.50       59.22
    mar2020 |         13        7.26       66.48
    mar2021 |         10        5.59       72.07
    may2020 |         11        6.15       78.21
    may2021 |         11        6.15       84.36
    nov2020 |         15        8.38       92.74
    oct2020 |          5        2.79       95.53
    sep2020 |          8        4.47      100.00
------------+-----------------------------------
      Total |        179      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1956

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         13        6.70        6.70
    apr2021 |          8        4.12       10.82
    aug2020 |         16        8.25       19.07
    dec2020 |         16        8.25       27.32
    feb2020 |         15        7.73       35.05
    feb2021 |          8        4.12       39.18
    jan2021 |         10        5.15       44.33
    jul2020 |         11        5.67       50.00
    jun2020 |         14        7.22       57.22
    mar2020 |         16        8.25       65.46
    mar2021 |         11        5.67       71.13
    may2020 |         11        5.67       76.80
    may2021 |         12        6.19       82.99
    nov2020 |         10        5.15       88.14
    oct2020 |         13        6.70       94.85
    sep2020 |         10        5.15      100.00
------------+-----------------------------------
      Total |        194      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1957

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         10        5.32        5.32
    apr2021 |          7        3.72        9.04
    aug2020 |         14        7.45       16.49
    dec2020 |          8        4.26       20.74
    feb2020 |         20       10.64       31.38
    feb2021 |          8        4.26       35.64
    jan2021 |         13        6.91       42.55
    jul2020 |         17        9.04       51.60
    jun2020 |         10        5.32       56.91
    mar2020 |         20       10.64       67.55
    mar2021 |          6        3.19       70.74
    may2020 |         19       10.11       80.85
    may2021 |         11        5.85       86.70
    nov2020 |          6        3.19       89.89
    oct2020 |          8        4.26       94.15
    sep2020 |         11        5.85      100.00
------------+-----------------------------------
      Total |        188      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1958

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          6        3.41        3.41
    apr2021 |         12        6.82       10.23
    aug2020 |         12        6.82       17.05
    dec2020 |          7        3.98       21.02
    feb2020 |         10        5.68       26.70
    feb2021 |          8        4.55       31.25
    jan2021 |         13        7.39       38.64
    jul2020 |          6        3.41       42.05
    jun2020 |          9        5.11       47.16
    mar2020 |         20       11.36       58.52
    mar2021 |         13        7.39       65.91
    may2020 |          6        3.41       69.32
    may2021 |         12        6.82       76.14
    nov2020 |         11        6.25       82.39
    oct2020 |         19       10.80       93.18
    sep2020 |         12        6.82      100.00
------------+-----------------------------------
      Total |        176      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1959

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         13        7.18        7.18
    apr2021 |         12        6.63       13.81
    aug2020 |         14        7.73       21.55
    dec2020 |          9        4.97       26.52
    feb2020 |         15        8.29       34.81
    feb2021 |          8        4.42       39.23
    jan2021 |         15        8.29       47.51
    jul2020 |         11        6.08       53.59
    jun2020 |         15        8.29       61.88
    mar2020 |          9        4.97       66.85
    mar2021 |          8        4.42       71.27
    may2020 |         16        8.84       80.11
    may2021 |          5        2.76       82.87
    nov2020 |         14        7.73       90.61
    oct2020 |          9        4.97       95.58
    sep2020 |          8        4.42      100.00
------------+-----------------------------------
      Total |        181      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1960

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         19       10.38       10.38
    apr2021 |         14        7.65       18.03
    aug2020 |         14        7.65       25.68
    dec2020 |         12        6.56       32.24
    feb2020 |         13        7.10       39.34
    feb2021 |         10        5.46       44.81
    jan2021 |         13        7.10       51.91
    jul2020 |          9        4.92       56.83
    jun2020 |          8        4.37       61.20
    mar2020 |          9        4.92       66.12
    mar2021 |          9        4.92       71.04
    may2020 |         11        6.01       77.05
    may2021 |          8        4.37       81.42
    nov2020 |         12        6.56       87.98
    oct2020 |          8        4.37       92.35
    sep2020 |         14        7.65      100.00
------------+-----------------------------------
      Total |        183      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1961

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          7        3.38        3.38
    apr2021 |          8        3.86        7.25
    aug2020 |         13        6.28       13.53
    dec2020 |         14        6.76       20.29
    feb2020 |         11        5.31       25.60
    feb2021 |         19        9.18       34.78
    jan2021 |         15        7.25       42.03
    jul2020 |         12        5.80       47.83
    jun2020 |         16        7.73       55.56
    mar2020 |         16        7.73       63.29
    mar2021 |          6        2.90       66.18
    may2020 |         13        6.28       72.46
    may2021 |         10        4.83       77.29
    nov2020 |         12        5.80       83.09
    oct2020 |         19        9.18       92.27
    sep2020 |         16        7.73      100.00
------------+-----------------------------------
      Total |        207      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1962

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          9        4.64        4.64
    apr2021 |         10        5.15        9.79
    aug2020 |         10        5.15       14.95
    dec2020 |         10        5.15       20.10
    feb2020 |         12        6.19       26.29
    feb2021 |          8        4.12       30.41
    jan2021 |         14        7.22       37.63
    jul2020 |         11        5.67       43.30
    jun2020 |         21       10.82       54.12
    mar2020 |          8        4.12       58.25
    mar2021 |         15        7.73       65.98
    may2020 |         11        5.67       71.65
    may2021 |          9        4.64       76.29
    nov2020 |         13        6.70       82.99
    oct2020 |         18        9.28       92.27
    sep2020 |         15        7.73      100.00
------------+-----------------------------------
      Total |        194      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1963

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         15        8.62        8.62
    apr2021 |          7        4.02       12.64
    aug2020 |          9        5.17       17.82
    dec2020 |         16        9.20       27.01
    feb2020 |          7        4.02       31.03
    feb2021 |         10        5.75       36.78
    jan2021 |         12        6.90       43.68
    jul2020 |          8        4.60       48.28
    jun2020 |         10        5.75       54.02
    mar2020 |         13        7.47       61.49
    mar2021 |          5        2.87       64.37
    may2020 |          8        4.60       68.97
    may2021 |         14        8.05       77.01
    nov2020 |         14        8.05       85.06
    oct2020 |         14        8.05       93.10
    sep2020 |         12        6.90      100.00
------------+-----------------------------------
      Total |        174      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1964

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         15        8.06        8.06
    apr2021 |          9        4.84       12.90
    aug2020 |         15        8.06       20.97
    dec2020 |         13        6.99       27.96
    feb2020 |         11        5.91       33.87
    feb2021 |         19       10.22       44.09
    jan2021 |         13        6.99       51.08
    jul2020 |         11        5.91       56.99
    jun2020 |          9        4.84       61.83
    mar2020 |         16        8.60       70.43
    mar2021 |          6        3.23       73.66
    may2020 |         10        5.38       79.03
    may2021 |         11        5.91       84.95
    nov2020 |         10        5.38       90.32
    oct2020 |         13        6.99       97.31
    sep2020 |          5        2.69      100.00
------------+-----------------------------------
      Total |        186      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1965

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        7.33        7.33
    apr2021 |         14        7.33       14.66
    aug2020 |         17        8.90       23.56
    dec2020 |         19        9.95       33.51
    feb2020 |         12        6.28       39.79
    feb2021 |          3        1.57       41.36
    jan2021 |         11        5.76       47.12
    jul2020 |          9        4.71       51.83
    jun2020 |         11        5.76       57.59
    mar2020 |         20       10.47       68.06
    mar2021 |          4        2.09       70.16
    may2020 |         10        5.24       75.39
    may2021 |          7        3.66       79.06
    nov2020 |         11        5.76       84.82
    oct2020 |         18        9.42       94.24
    sep2020 |         11        5.76      100.00
------------+-----------------------------------
      Total |        191      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1966

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          9        5.92        5.92
    apr2021 |          9        5.92       11.84
    aug2020 |          9        5.92       17.76
    dec2020 |         15        9.87       27.63
    feb2020 |         11        7.24       34.87
    feb2021 |          5        3.29       38.16
    jan2021 |          7        4.61       42.76
    jul2020 |         11        7.24       50.00
    jun2020 |          8        5.26       55.26
    mar2020 |         11        7.24       62.50
    mar2021 |         14        9.21       71.71
    may2020 |         14        9.21       80.92
    may2021 |          8        5.26       86.18
    nov2020 |          7        4.61       90.79
    oct2020 |          4        2.63       93.42
    sep2020 |         10        6.58      100.00
------------+-----------------------------------
      Total |        152      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1967

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         15        7.81        7.81
    apr2021 |          5        2.60       10.42
    aug2020 |         15        7.81       18.23
    dec2020 |         17        8.85       27.08
    feb2020 |          6        3.12       30.21
    feb2021 |         16        8.33       38.54
    jan2021 |         14        7.29       45.83
    jul2020 |         11        5.73       51.56
    jun2020 |         10        5.21       56.77
    mar2020 |         17        8.85       65.62
    mar2021 |         11        5.73       71.35
    may2020 |          9        4.69       76.04
    may2021 |         16        8.33       84.38
    nov2020 |         10        5.21       89.58
    oct2020 |         11        5.73       95.31
    sep2020 |          9        4.69      100.00
------------+-----------------------------------
      Total |        192      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1968

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          8        5.41        5.41
    apr2021 |         12        8.11       13.51
    aug2020 |          7        4.73       18.24
    dec2020 |          7        4.73       22.97
    feb2020 |         12        8.11       31.08
    feb2021 |          5        3.38       34.46
    jan2021 |         11        7.43       41.89
    jul2020 |         13        8.78       50.68
    jun2020 |          8        5.41       56.08
    mar2020 |          8        5.41       61.49
    mar2021 |          7        4.73       66.22
    may2020 |         12        8.11       74.32
    may2021 |          9        6.08       80.41
    nov2020 |          8        5.41       85.81
    oct2020 |         10        6.76       92.57
    sep2020 |         11        7.43      100.00
------------+-----------------------------------
      Total |        148      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1969

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         15        8.29        8.29
    apr2021 |         12        6.63       14.92
    aug2020 |         15        8.29       23.20
    dec2020 |         13        7.18       30.39
    feb2020 |         11        6.08       36.46
    feb2021 |         11        6.08       42.54
    jan2021 |         10        5.52       48.07
    jul2020 |         11        6.08       54.14
    jun2020 |         11        6.08       60.22
    mar2020 |          8        4.42       64.64
    mar2021 |          8        4.42       69.06
    may2020 |          9        4.97       74.03
    may2021 |          5        2.76       76.80
    nov2020 |         19       10.50       87.29
    oct2020 |         12        6.63       93.92
    sep2020 |         11        6.08      100.00
------------+-----------------------------------
      Total |        181      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1970

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        5.76        5.76
    apr2021 |         12        6.28       12.04
    aug2020 |         10        5.24       17.28
    dec2020 |         11        5.76       23.04
    feb2020 |          8        4.19       27.23
    feb2021 |         11        5.76       32.98
    jan2021 |         10        5.24       38.22
    jul2020 |         13        6.81       45.03
    jun2020 |         14        7.33       52.36
    mar2020 |          8        4.19       56.54
    mar2021 |         17        8.90       65.45
    may2020 |         12        6.28       71.73
    may2021 |         19        9.95       81.68
    nov2020 |         11        5.76       87.43
    oct2020 |         13        6.81       94.24
    sep2020 |         11        5.76      100.00
------------+-----------------------------------
      Total |        191      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1971

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        6.36        6.36
    apr2021 |         11        6.36       12.72
    aug2020 |         12        6.94       19.65
    dec2020 |          7        4.05       23.70
    feb2020 |          6        3.47       27.17
    feb2021 |         10        5.78       32.95
    jan2021 |         11        6.36       39.31
    jul2020 |          7        4.05       43.35
    jun2020 |         13        7.51       50.87
    mar2020 |         11        6.36       57.23
    mar2021 |         13        7.51       64.74
    may2020 |         15        8.67       73.41
    may2021 |         14        8.09       81.50
    nov2020 |         10        5.78       87.28
    oct2020 |          8        4.62       91.91
    sep2020 |         14        8.09      100.00
------------+-----------------------------------
      Total |        173      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1972

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          9        4.69        4.69
    apr2021 |          8        4.17        8.85
    aug2020 |         14        7.29       16.15
    dec2020 |         16        8.33       24.48
    feb2020 |          5        2.60       27.08
    feb2021 |         12        6.25       33.33
    jan2021 |         14        7.29       40.63
    jul2020 |         18        9.38       50.00
    jun2020 |         17        8.85       58.85
    mar2020 |          8        4.17       63.02
    mar2021 |         10        5.21       68.23
    may2020 |         12        6.25       74.48
    may2021 |          7        3.65       78.12
    nov2020 |         10        5.21       83.33
    oct2020 |         22       11.46       94.79
    sep2020 |         10        5.21      100.00
------------+-----------------------------------
      Total |        192      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1973

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          9        4.92        4.92
    apr2021 |         16        8.74       13.66
    aug2020 |         13        7.10       20.77
    dec2020 |         12        6.56       27.32
    feb2020 |         12        6.56       33.88
    feb2021 |         12        6.56       40.44
    jan2021 |         14        7.65       48.09
    jul2020 |         12        6.56       54.64
    jun2020 |          9        4.92       59.56
    mar2020 |         12        6.56       66.12
    mar2021 |         12        6.56       72.68
    may2020 |         12        6.56       79.23
    may2021 |         12        6.56       85.79
    nov2020 |          7        3.83       89.62
    oct2020 |         11        6.01       95.63
    sep2020 |          8        4.37      100.00
------------+-----------------------------------
      Total |        183      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1974

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         15        7.77        7.77
    apr2021 |         16        8.29       16.06
    aug2020 |         11        5.70       21.76
    dec2020 |          8        4.15       25.91
    feb2020 |          8        4.15       30.05
    feb2021 |         11        5.70       35.75
    jan2021 |          7        3.63       39.38
    jul2020 |         13        6.74       46.11
    jun2020 |         13        6.74       52.85
    mar2020 |         15        7.77       60.62
    mar2021 |         11        5.70       66.32
    may2020 |         11        5.70       72.02
    may2021 |         12        6.22       78.24
    nov2020 |         15        7.77       86.01
    oct2020 |         15        7.77       93.78
    sep2020 |         12        6.22      100.00
------------+-----------------------------------
      Total |        193      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1975

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          6        3.70        3.70
    apr2021 |         17       10.49       14.20
    aug2020 |         11        6.79       20.99
    dec2020 |          8        4.94       25.93
    feb2020 |          9        5.56       31.48
    feb2021 |         10        6.17       37.65
    jan2021 |          5        3.09       40.74
    jul2020 |         10        6.17       46.91
    jun2020 |         12        7.41       54.32
    mar2020 |         10        6.17       60.49
    mar2021 |         15        9.26       69.75
    may2020 |          9        5.56       75.31
    may2021 |         13        8.02       83.33
    nov2020 |         12        7.41       90.74
    oct2020 |          8        4.94       95.68
    sep2020 |          7        4.32      100.00
------------+-----------------------------------
      Total |        162      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1976

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          7        4.61        4.61
    apr2021 |          8        5.26        9.87
    aug2020 |          7        4.61       14.47
    dec2020 |          6        3.95       18.42
    feb2020 |          7        4.61       23.03
    feb2021 |          5        3.29       26.32
    jan2021 |         14        9.21       35.53
    jul2020 |          7        4.61       40.13
    jun2020 |         13        8.55       48.68
    mar2020 |         13        8.55       57.24
    mar2021 |         14        9.21       66.45
    may2020 |         12        7.89       74.34
    may2021 |          5        3.29       77.63
    nov2020 |         15        9.87       87.50
    oct2020 |          5        3.29       90.79
    sep2020 |         14        9.21      100.00
------------+-----------------------------------
      Total |        152      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1977

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         18       10.29       10.29
    apr2021 |          9        5.14       15.43
    aug2020 |         16        9.14       24.57
    dec2020 |         11        6.29       30.86
    feb2020 |          8        4.57       35.43
    feb2021 |         13        7.43       42.86
    jan2021 |         15        8.57       51.43
    jul2020 |         10        5.71       57.14
    jun2020 |          7        4.00       61.14
    mar2020 |          8        4.57       65.71
    mar2021 |          6        3.43       69.14
    may2020 |         18       10.29       79.43
    may2021 |          9        5.14       84.57
    nov2020 |          7        4.00       88.57
    oct2020 |         12        6.86       95.43
    sep2020 |          8        4.57      100.00
------------+-----------------------------------
      Total |        175      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1978

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         21       10.94       10.94
    apr2021 |         12        6.25       17.19
    aug2020 |         13        6.77       23.96
    dec2020 |         10        5.21       29.17
    feb2020 |         16        8.33       37.50
    feb2021 |         11        5.73       43.23
    jan2021 |          9        4.69       47.92
    jul2020 |          5        2.60       50.52
    jun2020 |         11        5.73       56.25
    mar2020 |         14        7.29       63.54
    mar2021 |         10        5.21       68.75
    may2020 |         14        7.29       76.04
    may2021 |         10        5.21       81.25
    nov2020 |         12        6.25       87.50
    oct2020 |         10        5.21       92.71
    sep2020 |         14        7.29      100.00
------------+-----------------------------------
      Total |        192      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1979

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         10        6.10        6.10
    apr2021 |          7        4.27       10.37
    aug2020 |         10        6.10       16.46
    dec2020 |         13        7.93       24.39
    feb2020 |          8        4.88       29.27
    feb2021 |         12        7.32       36.59
    jan2021 |          6        3.66       40.24
    jul2020 |         14        8.54       48.78
    jun2020 |         11        6.71       55.49
    mar2020 |         12        7.32       62.80
    mar2021 |         13        7.93       70.73
    may2020 |          7        4.27       75.00
    may2021 |          8        4.88       79.88
    nov2020 |          8        4.88       84.76
    oct2020 |         16        9.76       94.51
    sep2020 |          9        5.49      100.00
------------+-----------------------------------
      Total |        164      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1980

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          3        1.69        1.69
    apr2021 |         15        8.47       10.17
    aug2020 |         20       11.30       21.47
    dec2020 |          9        5.08       26.55
    feb2020 |         11        6.21       32.77
    feb2021 |          7        3.95       36.72
    jan2021 |          9        5.08       41.81
    jul2020 |         11        6.21       48.02
    jun2020 |         14        7.91       55.93
    mar2020 |         17        9.60       65.54
    mar2021 |          7        3.95       69.49
    may2020 |          6        3.39       72.88
    may2021 |          8        4.52       77.40
    nov2020 |          9        5.08       82.49
    oct2020 |         18       10.17       92.66
    sep2020 |         13        7.34      100.00
------------+-----------------------------------
      Total |        177      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1981

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          9        5.77        5.77
    apr2021 |          8        5.13       10.90
    aug2020 |         10        6.41       17.31
    dec2020 |          8        5.13       22.44
    feb2020 |         11        7.05       29.49
    feb2021 |         13        8.33       37.82
    jan2021 |         12        7.69       45.51
    jul2020 |          8        5.13       50.64
    jun2020 |         10        6.41       57.05
    mar2020 |         10        6.41       63.46
    mar2021 |          9        5.77       69.23
    may2020 |          6        3.85       73.08
    may2021 |          6        3.85       76.92
    nov2020 |         13        8.33       85.26
    oct2020 |         11        7.05       92.31
    sep2020 |         12        7.69      100.00
------------+-----------------------------------
      Total |        156      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1982

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         21       12.57       12.57
    apr2021 |          7        4.19       16.77
    aug2020 |          8        4.79       21.56
    dec2020 |         10        5.99       27.54
    feb2020 |         14        8.38       35.93
    feb2021 |          7        4.19       40.12
    jan2021 |         11        6.59       46.71
    jul2020 |          9        5.39       52.10
    jun2020 |         10        5.99       58.08
    mar2020 |          5        2.99       61.08
    mar2021 |         10        5.99       67.07
    may2020 |          7        4.19       71.26
    may2021 |          9        5.39       76.65
    nov2020 |         12        7.19       83.83
    oct2020 |         20       11.98       95.81
    sep2020 |          7        4.19      100.00
------------+-----------------------------------
      Total |        167      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1983

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         18       10.29       10.29
    apr2021 |          8        4.57       14.86
    aug2020 |         10        5.71       20.57
    dec2020 |         11        6.29       26.86
    feb2020 |         10        5.71       32.57
    feb2021 |          8        4.57       37.14
    jan2021 |         11        6.29       43.43
    jul2020 |          9        5.14       48.57
    jun2020 |         11        6.29       54.86
    mar2020 |         15        8.57       63.43
    mar2021 |         10        5.71       69.14
    may2020 |          9        5.14       74.29
    may2021 |         10        5.71       80.00
    nov2020 |         13        7.43       87.43
    oct2020 |         10        5.71       93.14
    sep2020 |         12        6.86      100.00
------------+-----------------------------------
      Total |        175      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1984

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          8        4.47        4.47
    apr2021 |         11        6.15       10.61
    aug2020 |         13        7.26       17.88
    dec2020 |         13        7.26       25.14
    feb2020 |         11        6.15       31.28
    feb2021 |          4        2.23       33.52
    jan2021 |         12        6.70       40.22
    jul2020 |         13        7.26       47.49
    jun2020 |         15        8.38       55.87
    mar2020 |          9        5.03       60.89
    mar2021 |         10        5.59       66.48
    may2020 |         23       12.85       79.33
    may2021 |          8        4.47       83.80
    nov2020 |         14        7.82       91.62
    oct2020 |          8        4.47       96.09
    sep2020 |          7        3.91      100.00
------------+-----------------------------------
      Total |        179      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1985

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         13        6.31        6.31
    apr2021 |         11        5.34       11.65
    aug2020 |         14        6.80       18.45
    dec2020 |         14        6.80       25.24
    feb2020 |         15        7.28       32.52
    feb2021 |         10        4.85       37.38
    jan2021 |         12        5.83       43.20
    jul2020 |         11        5.34       48.54
    jun2020 |         15        7.28       55.83
    mar2020 |         15        7.28       63.11
    mar2021 |         14        6.80       69.90
    may2020 |         17        8.25       78.16
    may2021 |          9        4.37       82.52
    nov2020 |          9        4.37       86.89
    oct2020 |         17        8.25       95.15
    sep2020 |         10        4.85      100.00
------------+-----------------------------------
      Total |        206      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1986

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        5.85        5.85
    apr2021 |          9        4.79       10.64
    aug2020 |          8        4.26       14.89
    dec2020 |          8        4.26       19.15
    feb2020 |          9        4.79       23.94
    feb2021 |         11        5.85       29.79
    jan2021 |         12        6.38       36.17
    jul2020 |         16        8.51       44.68
    jun2020 |         14        7.45       52.13
    mar2020 |         14        7.45       59.57
    mar2021 |         11        5.85       65.43
    may2020 |         13        6.91       72.34
    may2021 |         11        5.85       78.19
    nov2020 |         11        5.85       84.04
    oct2020 |         20       10.64       94.68
    sep2020 |         10        5.32      100.00
------------+-----------------------------------
      Total |        188      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1987

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         16        9.20        9.20
    apr2021 |          8        4.60       13.79
    aug2020 |         11        6.32       20.11
    dec2020 |          9        5.17       25.29
    feb2020 |         10        5.75       31.03
    feb2021 |         13        7.47       38.51
    jan2021 |         10        5.75       44.25
    jul2020 |         10        5.75       50.00
    jun2020 |          8        4.60       54.60
    mar2020 |         14        8.05       62.64
    mar2021 |         14        8.05       70.69
    may2020 |         12        6.90       77.59
    may2021 |          7        4.02       81.61
    nov2020 |          9        5.17       86.78
    oct2020 |         10        5.75       92.53
    sep2020 |         13        7.47      100.00
------------+-----------------------------------
      Total |        174      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1988

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         13        6.67        6.67
    apr2021 |         11        5.64       12.31
    aug2020 |         11        5.64       17.95
    dec2020 |         14        7.18       25.13
    feb2020 |          9        4.62       29.74
    feb2021 |         11        5.64       35.38
    jan2021 |         12        6.15       41.54
    jul2020 |         13        6.67       48.21
    jun2020 |         17        8.72       56.92
    mar2020 |         18        9.23       66.15
    mar2021 |         11        5.64       71.79
    may2020 |         12        6.15       77.95
    may2021 |          9        4.62       82.56
    nov2020 |         10        5.13       87.69
    oct2020 |         14        7.18       94.87
    sep2020 |         10        5.13      100.00
------------+-----------------------------------
      Total |        195      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1989

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        6.38        6.38
    apr2021 |          9        4.79       11.17
    aug2020 |         13        6.91       18.09
    dec2020 |         18        9.57       27.66
    feb2020 |         11        5.85       33.51
    feb2021 |          7        3.72       37.23
    jan2021 |          5        2.66       39.89
    jul2020 |          9        4.79       44.68
    jun2020 |          7        3.72       48.40
    mar2020 |         17        9.04       57.45
    mar2021 |         13        6.91       64.36
    may2020 |         13        6.91       71.28
    may2021 |         19       10.11       81.38
    nov2020 |          5        2.66       84.04
    oct2020 |         16        8.51       92.55
    sep2020 |         14        7.45      100.00
------------+-----------------------------------
      Total |        188      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1990

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         15        8.57        8.57
    apr2021 |         15        8.57       17.14
    aug2020 |         14        8.00       25.14
    dec2020 |          8        4.57       29.71
    feb2020 |          7        4.00       33.71
    feb2021 |         16        9.14       42.86
    jan2021 |         13        7.43       50.29
    jul2020 |          5        2.86       53.14
    jun2020 |          9        5.14       58.29
    mar2020 |         15        8.57       66.86
    mar2021 |         13        7.43       74.29
    may2020 |          5        2.86       77.14
    may2021 |          5        2.86       80.00
    nov2020 |         18       10.29       90.29
    oct2020 |          8        4.57       94.86
    sep2020 |          9        5.14      100.00
------------+-----------------------------------
      Total |        175      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1991

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        8.70        8.70
    apr2021 |         11        6.83       15.53
    aug2020 |         13        8.07       23.60
    dec2020 |          8        4.97       28.57
    feb2020 |          7        4.35       32.92
    feb2021 |         10        6.21       39.13
    jan2021 |          3        1.86       40.99
    jul2020 |          4        2.48       43.48
    jun2020 |         12        7.45       50.93
    mar2020 |         14        8.70       59.63
    mar2021 |         10        6.21       65.84
    may2020 |         10        6.21       72.05
    may2021 |         10        6.21       78.26
    nov2020 |         10        6.21       84.47
    oct2020 |         12        7.45       91.93
    sep2020 |         13        8.07      100.00
------------+-----------------------------------
      Total |        161      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1992

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          8        4.91        4.91
    apr2021 |         14        8.59       13.50
    aug2020 |          9        5.52       19.02
    dec2020 |          9        5.52       24.54
    feb2020 |         10        6.13       30.67
    feb2021 |         13        7.98       38.65
    jan2021 |          7        4.29       42.94
    jul2020 |         12        7.36       50.31
    jun2020 |         11        6.75       57.06
    mar2020 |         11        6.75       63.80
    mar2021 |         11        6.75       70.55
    may2020 |          8        4.91       75.46
    may2021 |          7        4.29       79.75
    nov2020 |         13        7.98       87.73
    oct2020 |          9        5.52       93.25
    sep2020 |         11        6.75      100.00
------------+-----------------------------------
      Total |        163      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1993

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         18        8.57        8.57
    apr2021 |         14        6.67       15.24
    aug2020 |         13        6.19       21.43
    dec2020 |         10        4.76       26.19
    feb2020 |         14        6.67       32.86
    feb2021 |         10        4.76       37.62
    jan2021 |         12        5.71       43.33
    jul2020 |         17        8.10       51.43
    jun2020 |         22       10.48       61.90
    mar2020 |         10        4.76       66.67
    mar2021 |          9        4.29       70.95
    may2020 |         14        6.67       77.62
    may2021 |         14        6.67       84.29
    nov2020 |         10        4.76       89.05
    oct2020 |         10        4.76       93.81
    sep2020 |         13        6.19      100.00
------------+-----------------------------------
      Total |        210      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1994

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        5.91        5.91
    apr2021 |          9        4.84       10.75
    aug2020 |         19       10.22       20.97
    dec2020 |          9        4.84       25.81
    feb2020 |         14        7.53       33.33
    feb2021 |          8        4.30       37.63
    jan2021 |         16        8.60       46.24
    jul2020 |          7        3.76       50.00
    jun2020 |         13        6.99       56.99
    mar2020 |         14        7.53       64.52
    mar2021 |         14        7.53       72.04
    may2020 |         11        5.91       77.96
    may2021 |         13        6.99       84.95
    nov2020 |          8        4.30       89.25
    oct2020 |         10        5.38       94.62
    sep2020 |         10        5.38      100.00
------------+-----------------------------------
      Total |        186      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1995

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          7        4.40        4.40
    apr2021 |         11        6.92       11.32
    aug2020 |         14        8.81       20.13
    dec2020 |          3        1.89       22.01
    feb2020 |         13        8.18       30.19
    feb2021 |         13        8.18       38.36
    jan2021 |         14        8.81       47.17
    jul2020 |          9        5.66       52.83
    jun2020 |         12        7.55       60.38
    mar2020 |         10        6.29       66.67
    mar2021 |          9        5.66       72.33
    may2020 |          9        5.66       77.99
    may2021 |          7        4.40       82.39
    nov2020 |          8        5.03       87.42
    oct2020 |          8        5.03       92.45
    sep2020 |         12        7.55      100.00
------------+-----------------------------------
      Total |        159      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1996

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        6.86        6.86
    apr2021 |         13        7.43       14.29
    aug2020 |          9        5.14       19.43
    dec2020 |         12        6.86       26.29
    feb2020 |         15        8.57       34.86
    feb2021 |         11        6.29       41.14
    jan2021 |         11        6.29       47.43
    jul2020 |         13        7.43       54.86
    jun2020 |          9        5.14       60.00
    mar2020 |         13        7.43       67.43
    mar2021 |          6        3.43       70.86
    may2020 |         10        5.71       76.57
    may2021 |         11        6.29       82.86
    nov2020 |         11        6.29       89.14
    oct2020 |         13        7.43       96.57
    sep2020 |          6        3.43      100.00
------------+-----------------------------------
      Total |        175      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1997

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        7.02        7.02
    apr2021 |         10        5.85       12.87
    aug2020 |          8        4.68       17.54
    dec2020 |          7        4.09       21.64
    feb2020 |          7        4.09       25.73
    feb2021 |         10        5.85       31.58
    jan2021 |          8        4.68       36.26
    jul2020 |         17        9.94       46.20
    jun2020 |         11        6.43       52.63
    mar2020 |         17        9.94       62.57
    mar2021 |         11        6.43       69.01
    may2020 |         16        9.36       78.36
    may2021 |          9        5.26       83.63
    nov2020 |          6        3.51       87.13
    oct2020 |         14        8.19       95.32
    sep2020 |          8        4.68      100.00
------------+-----------------------------------
      Total |        171      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1998

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          7        3.83        3.83
    apr2021 |          7        3.83        7.65
    aug2020 |         18        9.84       17.49
    dec2020 |          9        4.92       22.40
    feb2020 |         10        5.46       27.87
    feb2021 |          9        4.92       32.79
    jan2021 |         17        9.29       42.08
    jul2020 |         16        8.74       50.82
    jun2020 |         16        8.74       59.56
    mar2020 |         14        7.65       67.21
    mar2021 |          6        3.28       70.49
    may2020 |          9        4.92       75.41
    may2021 |          9        4.92       80.33
    nov2020 |         13        7.10       87.43
    oct2020 |         10        5.46       92.90
    sep2020 |         13        7.10      100.00
------------+-----------------------------------
      Total |        183      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1999

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         10        5.75        5.75
    apr2021 |         11        6.32       12.07
    aug2020 |         11        6.32       18.39
    dec2020 |         15        8.62       27.01
    feb2020 |         11        6.32       33.33
    feb2021 |         10        5.75       39.08
    jan2021 |         11        6.32       45.40
    jul2020 |         18       10.34       55.75
    jun2020 |         12        6.90       62.64
    mar2020 |         12        6.90       69.54
    mar2021 |         10        5.75       75.29
    may2020 |          8        4.60       79.89
    may2021 |          8        4.60       84.48
    nov2020 |          7        4.02       88.51
    oct2020 |          9        5.17       93.68
    sep2020 |         11        6.32      100.00
------------+-----------------------------------
      Total |        174      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 2000
no observations


. 
. gen death_date1 = date(death_date, "YMD")
(27,289 missing values generated)

. format death_date1 %td

. gen death_date_string=string(death_date1, "%td")

. gen death_month=substr( death_date_string ,3,7)
(27,289 missing values generated)

. tab death_month

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         41        2.54        2.54
    apr2021 |         48        2.98        5.52
    apr2022 |         57        3.54        9.06
    aug2020 |         39        2.42       11.48
    aug2021 |         56        3.47       14.95
    aug2022 |         56        3.47       18.42
    dec2020 |         68        4.22       22.64
    dec2021 |         52        3.23       25.87
    feb2020 |         55        3.41       29.28
    feb2021 |         55        3.41       32.69
    feb2022 |         51        3.16       35.86
    jan2021 |         50        3.10       38.96
    jan2022 |         55        3.41       42.37
    jul2020 |         56        3.47       45.84
    jul2021 |         55        3.41       49.26
    jul2022 |         55        3.41       52.67
    jun2020 |         43        2.67       55.33
    jun2021 |         46        2.85       58.19
    jun2022 |         66        4.09       62.28
    mar2020 |         45        2.79       65.07
    mar2021 |         48        2.98       68.05
    mar2022 |         54        3.35       71.40
    may2020 |         58        3.60       75.00
    may2021 |         57        3.54       78.54
    may2022 |         52        3.23       81.76
    nov2020 |         50        3.10       84.86
    nov2021 |         47        2.92       87.78
    oct2020 |         47        2.92       90.69
    oct2021 |         54        3.35       94.04
    sep2020 |         48        2.98       97.02
    sep2021 |         48        2.98      100.00
------------+-----------------------------------
      Total |      1,612      100.00

. bysort year_of_birth: tab death_month

-------------------------------------------------------------------------------
-> year_of_birth = 1950

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          2        5.41        5.41
    apr2021 |          1        2.70        8.11
    apr2022 |          2        5.41       13.51
    aug2021 |          1        2.70       16.22
    aug2022 |          1        2.70       18.92
    dec2020 |          3        8.11       27.03
    feb2020 |          1        2.70       29.73
    feb2021 |          1        2.70       32.43
    jan2022 |          3        8.11       40.54
    jul2020 |          2        5.41       45.95
    jul2021 |          1        2.70       48.65
    jun2020 |          2        5.41       54.05
    jun2021 |          1        2.70       56.76
    mar2020 |          3        8.11       64.86
    mar2021 |          1        2.70       67.57
    mar2022 |          2        5.41       72.97
    may2020 |          1        2.70       75.68
    may2021 |          2        5.41       81.08
    may2022 |          1        2.70       83.78
    nov2021 |          3        8.11       91.89
    oct2021 |          2        5.41       97.30
    sep2021 |          1        2.70      100.00
------------+-----------------------------------
      Total |         37      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1951

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        3.23        3.23
    apr2022 |          3        9.68       12.90
    aug2020 |          1        3.23       16.13
    aug2022 |          3        9.68       25.81
    dec2020 |          2        6.45       32.26
    feb2020 |          1        3.23       35.48
    feb2021 |          2        6.45       41.94
    feb2022 |          1        3.23       45.16
    jan2022 |          1        3.23       48.39
    jul2021 |          1        3.23       51.61
    jun2021 |          2        6.45       58.06
    jun2022 |          1        3.23       61.29
    mar2021 |          1        3.23       64.52
    may2020 |          1        3.23       67.74
    may2022 |          1        3.23       70.97
    nov2020 |          2        6.45       77.42
    nov2021 |          2        6.45       83.87
    oct2020 |          1        3.23       87.10
    oct2021 |          2        6.45       93.55
    sep2021 |          2        6.45      100.00
------------+-----------------------------------
      Total |         31      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1952

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        2.22        2.22
    apr2022 |          2        4.44        6.67
    aug2020 |          1        2.22        8.89
    aug2021 |          3        6.67       15.56
    aug2022 |          2        4.44       20.00
    dec2020 |          1        2.22       22.22
    dec2021 |          2        4.44       26.67
    feb2020 |          2        4.44       31.11
    feb2021 |          1        2.22       33.33
    feb2022 |          2        4.44       37.78
    jan2021 |          3        6.67       44.44
    jan2022 |          1        2.22       46.67
    jul2022 |          3        6.67       53.33
    jun2020 |          1        2.22       55.56
    jun2021 |          1        2.22       57.78
    jun2022 |          1        2.22       60.00
    mar2020 |          1        2.22       62.22
    mar2022 |          3        6.67       68.89
    may2020 |          2        4.44       73.33
    may2021 |          1        2.22       75.56
    may2022 |          1        2.22       77.78
    nov2021 |          4        8.89       86.67
    oct2020 |          1        2.22       88.89
    sep2020 |          2        4.44       93.33
    sep2021 |          3        6.67      100.00
------------+-----------------------------------
      Total |         45      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1953

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2022 |          1        3.57        3.57
    aug2020 |          2        7.14       10.71
    aug2021 |          1        3.57       14.29
    dec2021 |          3       10.71       25.00
    feb2021 |          2        7.14       32.14
    jan2022 |          2        7.14       39.29
    jul2021 |          1        3.57       42.86
    jul2022 |          2        7.14       50.00
    jun2020 |          1        3.57       53.57
    jun2021 |          1        3.57       57.14
    jun2022 |          1        3.57       60.71
    mar2021 |          2        7.14       67.86
    mar2022 |          1        3.57       71.43
    may2020 |          2        7.14       78.57
    may2021 |          2        7.14       85.71
    may2022 |          1        3.57       89.29
    sep2020 |          3       10.71      100.00
------------+-----------------------------------
      Total |         28      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1954

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        3.23        3.23
    apr2021 |          4       12.90       16.13
    apr2022 |          1        3.23       19.35
    aug2020 |          1        3.23       22.58
    dec2020 |          2        6.45       29.03
    feb2020 |          1        3.23       32.26
    feb2021 |          1        3.23       35.48
    feb2022 |          1        3.23       38.71
    jan2022 |          2        6.45       45.16
    jun2020 |          2        6.45       51.61
    jun2021 |          1        3.23       54.84
    may2020 |          1        3.23       58.06
    may2021 |          1        3.23       61.29
    may2022 |          2        6.45       67.74
    nov2020 |          2        6.45       74.19
    nov2021 |          1        3.23       77.42
    oct2020 |          2        6.45       83.87
    oct2021 |          2        6.45       90.32
    sep2021 |          3        9.68      100.00
------------+-----------------------------------
      Total |         31      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1955

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          2        8.70        8.70
    apr2021 |          1        4.35       13.04
    dec2020 |          1        4.35       17.39
    dec2021 |          1        4.35       21.74
    feb2020 |          1        4.35       26.09
    feb2022 |          2        8.70       34.78
    jul2020 |          1        4.35       39.13
    jul2021 |          2        8.70       47.83
    jul2022 |          1        4.35       52.17
    jun2021 |          2        8.70       60.87
    may2020 |          2        8.70       69.57
    may2021 |          1        4.35       73.91
    nov2020 |          1        4.35       78.26
    oct2020 |          1        4.35       82.61
    oct2021 |          1        4.35       86.96
    sep2020 |          1        4.35       91.30
    sep2021 |          2        8.70      100.00
------------+-----------------------------------
      Total |         23      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1956

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        3.12        3.12
    apr2021 |          1        3.12        6.25
    aug2020 |          1        3.12        9.38
    aug2021 |          2        6.25       15.62
    aug2022 |          2        6.25       21.88
    feb2020 |          2        6.25       28.12
    jan2021 |          2        6.25       34.38
    jan2022 |          1        3.12       37.50
    jul2021 |          1        3.12       40.62
    jul2022 |          1        3.12       43.75
    jun2021 |          2        6.25       50.00
    jun2022 |          2        6.25       56.25
    mar2022 |          3        9.38       65.62
    may2020 |          1        3.12       68.75
    may2021 |          2        6.25       75.00
    may2022 |          2        6.25       81.25
    nov2020 |          1        3.12       84.38
    nov2021 |          1        3.12       87.50
    oct2020 |          3        9.38       96.88
    sep2020 |          1        3.12      100.00
------------+-----------------------------------
      Total |         32      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1957

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2022 |          1        3.03        3.03
    aug2020 |          1        3.03        6.06
    aug2021 |          2        6.06       12.12
    dec2020 |          2        6.06       18.18
    dec2021 |          1        3.03       21.21
    feb2020 |          1        3.03       24.24
    feb2021 |          1        3.03       27.27
    jan2021 |          2        6.06       33.33
    jul2020 |          1        3.03       36.36
    jun2022 |          3        9.09       45.45
    mar2020 |          1        3.03       48.48
    mar2022 |          3        9.09       57.58
    may2020 |          2        6.06       63.64
    may2021 |          3        9.09       72.73
    may2022 |          1        3.03       75.76
    nov2020 |          2        6.06       81.82
    nov2021 |          1        3.03       84.85
    oct2021 |          1        3.03       87.88
    sep2020 |          1        3.03       90.91
    sep2021 |          3        9.09      100.00
------------+-----------------------------------
      Total |         33      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1958

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        2.94        2.94
    apr2022 |          2        5.88        8.82
    aug2020 |          1        2.94       11.76
    aug2022 |          3        8.82       20.59
    dec2020 |          1        2.94       23.53
    dec2021 |          2        5.88       29.41
    feb2020 |          1        2.94       32.35
    feb2021 |          2        5.88       38.24
    feb2022 |          3        8.82       47.06
    jan2021 |          1        2.94       50.00
    jan2022 |          1        2.94       52.94
    jul2020 |          2        5.88       58.82
    jul2021 |          1        2.94       61.76
    jun2021 |          1        2.94       64.71
    jun2022 |          3        8.82       73.53
    mar2021 |          2        5.88       79.41
    mar2022 |          1        2.94       82.35
    may2020 |          2        5.88       88.24
    sep2020 |          4       11.76      100.00
------------+-----------------------------------
      Total |         34      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1959

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          2        8.33        8.33
    apr2021 |          1        4.17       12.50
    apr2022 |          1        4.17       16.67
    aug2020 |          1        4.17       20.83
    dec2020 |          1        4.17       25.00
    feb2020 |          2        8.33       33.33
    feb2021 |          2        8.33       41.67
    jan2021 |          1        4.17       45.83
    jan2022 |          1        4.17       50.00
    jul2021 |          1        4.17       54.17
    jul2022 |          1        4.17       58.33
    jun2020 |          1        4.17       62.50
    mar2020 |          1        4.17       66.67
    may2021 |          1        4.17       70.83
    may2022 |          2        8.33       79.17
    oct2020 |          2        8.33       87.50
    oct2021 |          2        8.33       95.83
    sep2021 |          1        4.17      100.00
------------+-----------------------------------
      Total |         24      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1960

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        2.78        2.78
    apr2021 |          1        2.78        5.56
    apr2022 |          4       11.11       16.67
    aug2020 |          1        2.78       19.44
    aug2021 |          1        2.78       22.22
    aug2022 |          2        5.56       27.78
    dec2021 |          1        2.78       30.56
    feb2020 |          2        5.56       36.11
    feb2022 |          2        5.56       41.67
    jan2021 |          4       11.11       52.78
    jan2022 |          2        5.56       58.33
    jul2020 |          1        2.78       61.11
    jul2021 |          1        2.78       63.89
    jun2021 |          2        5.56       69.44
    jun2022 |          1        2.78       72.22
    mar2020 |          1        2.78       75.00
    mar2021 |          1        2.78       77.78
    mar2022 |          1        2.78       80.56
    may2020 |          2        5.56       86.11
    nov2020 |          2        5.56       91.67
    oct2021 |          1        2.78       94.44
    sep2020 |          2        5.56      100.00
------------+-----------------------------------
      Total |         36      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1961

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    aug2021 |          1        2.70        2.70
    aug2022 |          1        2.70        5.41
    dec2020 |          3        8.11       13.51
    dec2021 |          2        5.41       18.92
    feb2020 |          1        2.70       21.62
    feb2021 |          3        8.11       29.73
    jan2021 |          2        5.41       35.14
    jan2022 |          3        8.11       43.24
    jul2020 |          1        2.70       45.95
    jul2022 |          1        2.70       48.65
    jun2020 |          2        5.41       54.05
    jun2021 |          1        2.70       56.76
    jun2022 |          3        8.11       64.86
    mar2021 |          1        2.70       67.57
    mar2022 |          1        2.70       70.27
    may2020 |          1        2.70       72.97
    may2022 |          1        2.70       75.68
    nov2020 |          2        5.41       81.08
    oct2020 |          3        8.11       89.19
    oct2021 |          1        2.70       91.89
    sep2020 |          1        2.70       94.59
    sep2021 |          2        5.41      100.00
------------+-----------------------------------
      Total |         37      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1962

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          2        6.06        6.06
    aug2020 |          1        3.03        9.09
    aug2021 |          1        3.03       12.12
    dec2020 |          1        3.03       15.15
    feb2021 |          2        6.06       21.21
    feb2022 |          3        9.09       30.30
    jan2021 |          1        3.03       33.33
    jan2022 |          2        6.06       39.39
    jul2021 |          1        3.03       42.42
    jul2022 |          2        6.06       48.48
    jun2020 |          2        6.06       54.55
    jun2021 |          2        6.06       60.61
    jun2022 |          1        3.03       63.64
    mar2020 |          1        3.03       66.67
    mar2022 |          1        3.03       69.70
    may2022 |          2        6.06       75.76
    nov2020 |          2        6.06       81.82
    oct2020 |          3        9.09       90.91
    oct2021 |          1        3.03       93.94
    sep2021 |          2        6.06      100.00
------------+-----------------------------------
      Total |         33      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1963

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          3       11.11       11.11
    apr2022 |          1        3.70       14.81
    aug2021 |          3       11.11       25.93
    aug2022 |          1        3.70       29.63
    dec2021 |          1        3.70       33.33
    feb2020 |          1        3.70       37.04
    jan2022 |          1        3.70       40.74
    jul2020 |          1        3.70       44.44
    jul2021 |          1        3.70       48.15
    jun2020 |          2        7.41       55.56
    mar2021 |          1        3.70       59.26
    mar2022 |          1        3.70       62.96
    may2020 |          1        3.70       66.67
    may2021 |          1        3.70       70.37
    may2022 |          1        3.70       74.07
    nov2020 |          3       11.11       85.19
    oct2020 |          3       11.11       96.30
    oct2021 |          1        3.70      100.00
------------+-----------------------------------
      Total |         27      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1964

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    aug2021 |          2        6.25        6.25
    aug2022 |          1        3.12        9.38
    dec2020 |          2        6.25       15.62
    dec2021 |          1        3.12       18.75
    feb2021 |          1        3.12       21.88
    feb2022 |          2        6.25       28.12
    jan2021 |          3        9.38       37.50
    jul2020 |          2        6.25       43.75
    jul2021 |          2        6.25       50.00
    jun2020 |          1        3.12       53.12
    jun2021 |          5       15.62       68.75
    mar2020 |          2        6.25       75.00
    mar2021 |          2        6.25       81.25
    may2020 |          2        6.25       87.50
    may2022 |          1        3.12       90.62
    oct2021 |          1        3.12       93.75
    sep2021 |          2        6.25      100.00
------------+-----------------------------------
      Total |         32      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1965

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          2        7.14        7.14
    apr2022 |          2        7.14       14.29
    aug2020 |          2        7.14       21.43
    aug2022 |          2        7.14       28.57
    dec2021 |          2        7.14       35.71
    feb2020 |          1        3.57       39.29
    feb2021 |          1        3.57       42.86
    jan2022 |          1        3.57       46.43
    jul2020 |          1        3.57       50.00
    jun2020 |          1        3.57       53.57
    jun2022 |          1        3.57       57.14
    mar2020 |          2        7.14       64.29
    mar2021 |          1        3.57       67.86
    may2020 |          2        7.14       75.00
    nov2021 |          3       10.71       85.71
    oct2020 |          1        3.57       89.29
    oct2021 |          1        3.57       92.86
    sep2020 |          2        7.14      100.00
------------+-----------------------------------
      Total |         28      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1966

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        3.70        3.70
    aug2021 |          4       14.81       18.52
    aug2022 |          2        7.41       25.93
    dec2020 |          4       14.81       40.74
    dec2021 |          1        3.70       44.44
    feb2020 |          1        3.70       48.15
    feb2022 |          1        3.70       51.85
    jul2020 |          1        3.70       55.56
    jul2022 |          2        7.41       62.96
    jun2022 |          3       11.11       74.07
    mar2020 |          1        3.70       77.78
    mar2022 |          1        3.70       81.48
    may2022 |          1        3.70       85.19
    oct2020 |          2        7.41       92.59
    oct2021 |          1        3.70       96.30
    sep2020 |          1        3.70      100.00
------------+-----------------------------------
      Total |         27      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1967

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    aug2021 |          2        6.25        6.25
    aug2022 |          1        3.12        9.38
    dec2020 |          2        6.25       15.62
    dec2021 |          2        6.25       21.88
    feb2020 |          1        3.12       25.00
    feb2021 |          1        3.12       28.12
    feb2022 |          1        3.12       31.25
    jul2020 |          1        3.12       34.38
    jul2021 |          2        6.25       40.62
    jul2022 |          2        6.25       46.88
    jun2020 |          1        3.12       50.00
    jun2021 |          2        6.25       56.25
    jun2022 |          1        3.12       59.38
    mar2021 |          4       12.50       71.88
    mar2022 |          1        3.12       75.00
    may2021 |          3        9.38       84.38
    may2022 |          1        3.12       87.50
    nov2021 |          1        3.12       90.62
    oct2020 |          1        3.12       93.75
    oct2021 |          1        3.12       96.88
    sep2020 |          1        3.12      100.00
------------+-----------------------------------
      Total |         32      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1968

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    aug2020 |          1        2.78        2.78
    aug2021 |          2        5.56        8.33
    dec2020 |          1        2.78       11.11
    dec2021 |          1        2.78       13.89
    feb2020 |          3        8.33       22.22
    jan2021 |          6       16.67       38.89
    jan2022 |          1        2.78       41.67
    jul2020 |          1        2.78       44.44
    jul2022 |          2        5.56       50.00
    jun2021 |          1        2.78       52.78
    jun2022 |          1        2.78       55.56
    mar2020 |          1        2.78       58.33
    mar2021 |          2        5.56       63.89
    mar2022 |          2        5.56       69.44
    may2020 |          1        2.78       72.22
    may2022 |          2        5.56       77.78
    nov2020 |          2        5.56       83.33
    nov2021 |          2        5.56       88.89
    oct2020 |          1        2.78       91.67
    oct2021 |          2        5.56       97.22
    sep2021 |          1        2.78      100.00
------------+-----------------------------------
      Total |         36      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1969

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2022 |          2        8.33        8.33
    aug2020 |          1        4.17       12.50
    aug2021 |          2        8.33       20.83
    dec2020 |          2        8.33       29.17
    feb2020 |          1        4.17       33.33
    jan2021 |          1        4.17       37.50
    jan2022 |          2        8.33       45.83
    jul2020 |          3       12.50       58.33
    jul2022 |          1        4.17       62.50
    jun2022 |          1        4.17       66.67
    mar2020 |          1        4.17       70.83
    mar2021 |          1        4.17       75.00
    may2022 |          2        8.33       83.33
    nov2020 |          1        4.17       87.50
    oct2020 |          1        4.17       91.67
    oct2021 |          1        4.17       95.83
    sep2021 |          1        4.17      100.00
------------+-----------------------------------
      Total |         24      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1970

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          1        3.70        3.70
    aug2022 |          1        3.70        7.41
    dec2020 |          3       11.11       18.52
    feb2020 |          1        3.70       22.22
    feb2022 |          3       11.11       33.33
    jun2021 |          1        3.70       37.04
    mar2020 |          2        7.41       44.44
    mar2021 |          2        7.41       51.85
    may2020 |          2        7.41       59.26
    may2021 |          2        7.41       66.67
    may2022 |          4       14.81       81.48
    oct2020 |          1        3.70       85.19
    oct2021 |          2        7.41       92.59
    sep2020 |          1        3.70       96.30
    sep2021 |          1        3.70      100.00
------------+-----------------------------------
      Total |         27      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1971

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          1        2.70        2.70
    aug2020 |          1        2.70        5.41
    aug2021 |          2        5.41       10.81
    aug2022 |          2        5.41       16.22
    dec2021 |          1        2.70       18.92
    feb2020 |          4       10.81       29.73
    feb2021 |          1        2.70       32.43
    jan2021 |          1        2.70       35.14
    jan2022 |          3        8.11       43.24
    jul2020 |          2        5.41       48.65
    jul2021 |          3        8.11       56.76
    jul2022 |          1        2.70       59.46
    jun2020 |          3        8.11       67.57
    jun2021 |          1        2.70       70.27
    mar2021 |          1        2.70       72.97
    mar2022 |          1        2.70       75.68
    may2020 |          2        5.41       81.08
    may2021 |          1        2.70       83.78
    may2022 |          1        2.70       86.49
    nov2020 |          1        2.70       89.19
    nov2021 |          2        5.41       94.59
    oct2020 |          1        2.70       97.30
    sep2020 |          1        2.70      100.00
------------+-----------------------------------
      Total |         37      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1972

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        2.78        2.78
    apr2021 |          2        5.56        8.33
    apr2022 |          2        5.56       13.89
    aug2022 |          1        2.78       16.67
    dec2020 |          2        5.56       22.22
    dec2021 |          4       11.11       33.33
    feb2020 |          3        8.33       41.67
    feb2021 |          3        8.33       50.00
    jan2022 |          1        2.78       52.78
    jul2020 |          1        2.78       55.56
    jul2021 |          1        2.78       58.33
    jul2022 |          1        2.78       61.11
    jun2022 |          2        5.56       66.67
    mar2020 |          1        2.78       69.44
    mar2022 |          3        8.33       77.78
    may2020 |          1        2.78       80.56
    may2021 |          3        8.33       88.89
    nov2021 |          1        2.78       91.67
    oct2020 |          1        2.78       94.44
    sep2020 |          1        2.78       97.22
    sep2021 |          1        2.78      100.00
------------+-----------------------------------
      Total |         36      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1973

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        4.17        4.17
    apr2021 |          1        4.17        8.33
    apr2022 |          1        4.17       12.50
    aug2020 |          1        4.17       16.67
    aug2022 |          1        4.17       20.83
    dec2020 |          2        8.33       29.17
    dec2021 |          2        8.33       37.50
    feb2020 |          1        4.17       41.67
    jun2022 |          1        4.17       45.83
    mar2020 |          1        4.17       50.00
    mar2021 |          3       12.50       62.50
    may2021 |          5       20.83       83.33
    nov2021 |          2        8.33       91.67
    oct2021 |          1        4.17       95.83
    sep2020 |          1        4.17      100.00
------------+-----------------------------------
      Total |         24      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1974

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          3        9.38        9.38
    apr2022 |          1        3.12       12.50
    aug2021 |          2        6.25       18.75
    aug2022 |          1        3.12       21.88
    dec2020 |          1        3.12       25.00
    dec2021 |          2        6.25       31.25
    feb2021 |          1        3.12       34.38
    feb2022 |          2        6.25       40.62
    jul2020 |          1        3.12       43.75
    jul2021 |          1        3.12       46.88
    jun2021 |          1        3.12       50.00
    jun2022 |          1        3.12       53.12
    mar2022 |          2        6.25       59.38
    may2021 |          1        3.12       62.50
    may2022 |          3        9.38       71.88
    nov2021 |          1        3.12       75.00
    oct2020 |          2        6.25       81.25
    oct2021 |          3        9.38       90.62
    sep2020 |          2        6.25       96.88
    sep2021 |          1        3.12      100.00
------------+-----------------------------------
      Total |         32      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1975

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    aug2020 |          1        3.70        3.70
    aug2021 |          2        7.41       11.11
    aug2022 |          2        7.41       18.52
    dec2021 |          2        7.41       25.93
    feb2020 |          1        3.70       29.63
    feb2021 |          1        3.70       33.33
    jul2022 |          1        3.70       37.04
    jun2021 |          2        7.41       44.44
    jun2022 |          2        7.41       51.85
    mar2021 |          3       11.11       62.96
    mar2022 |          1        3.70       66.67
    may2020 |          1        3.70       70.37
    nov2020 |          1        3.70       74.07
    nov2021 |          2        7.41       81.48
    oct2020 |          1        3.70       85.19
    sep2020 |          2        7.41       92.59
    sep2021 |          2        7.41      100.00
------------+-----------------------------------
      Total |         27      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1976

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        2.78        2.78
    apr2021 |          1        2.78        5.56
    apr2022 |          2        5.56       11.11
    aug2022 |          2        5.56       16.67
    dec2020 |          2        5.56       22.22
    feb2022 |          1        2.78       25.00
    jan2021 |          2        5.56       30.56
    jul2020 |          3        8.33       38.89
    jul2021 |          2        5.56       44.44
    jul2022 |          3        8.33       52.78
    jun2020 |          3        8.33       61.11
    jun2022 |          1        2.78       63.89
    mar2020 |          1        2.78       66.67
    mar2021 |          1        2.78       69.44
    mar2022 |          3        8.33       77.78
    may2020 |          1        2.78       80.56
    may2021 |          1        2.78       83.33
    nov2020 |          1        2.78       86.11
    sep2020 |          2        5.56       91.67
    sep2021 |          3        8.33      100.00
------------+-----------------------------------
      Total |         36      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1977

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          2        7.69        7.69
    apr2022 |          2        7.69       15.38
    dec2020 |          2        7.69       23.08
    dec2021 |          2        7.69       30.77
    jan2022 |          1        3.85       34.62
    jul2021 |          1        3.85       38.46
    jul2022 |          3       11.54       50.00
    jun2022 |          2        7.69       57.69
    mar2020 |          1        3.85       61.54
    mar2022 |          2        7.69       69.23
    may2020 |          1        3.85       73.08
    nov2020 |          2        7.69       80.77
    oct2020 |          2        7.69       88.46
    oct2021 |          1        3.85       92.31
    sep2021 |          2        7.69      100.00
------------+-----------------------------------
      Total |         26      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1978

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          4       11.11       11.11
    apr2022 |          1        2.78       13.89
    aug2020 |          2        5.56       19.44
    aug2021 |          1        2.78       22.22
    aug2022 |          2        5.56       27.78
    dec2020 |          2        5.56       33.33
    feb2022 |          2        5.56       38.89
    jan2021 |          2        5.56       44.44
    jul2020 |          2        5.56       50.00
    jul2021 |          3        8.33       58.33
    jun2020 |          1        2.78       61.11
    jun2022 |          2        5.56       66.67
    mar2022 |          1        2.78       69.44
    may2020 |          3        8.33       77.78
    may2022 |          2        5.56       83.33
    nov2020 |          1        2.78       86.11
    nov2021 |          2        5.56       91.67
    sep2021 |          3        8.33      100.00
------------+-----------------------------------
      Total |         36      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1979

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          2        8.00        8.00
    aug2020 |          3       12.00       20.00
    aug2021 |          1        4.00       24.00
    dec2020 |          1        4.00       28.00
    feb2020 |          3       12.00       40.00
    feb2021 |          2        8.00       48.00
    feb2022 |          1        4.00       52.00
    jan2021 |          1        4.00       56.00
    jul2021 |          2        8.00       64.00
    jul2022 |          1        4.00       68.00
    jun2022 |          1        4.00       72.00
    mar2020 |          1        4.00       76.00
    may2020 |          1        4.00       80.00
    may2021 |          1        4.00       84.00
    may2022 |          1        4.00       88.00
    nov2020 |          2        8.00       96.00
    sep2021 |          1        4.00      100.00
------------+-----------------------------------
      Total |         25      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1980

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        4.55        4.55
    apr2022 |          2        9.09       13.64
    aug2020 |          1        4.55       18.18
    feb2020 |          2        9.09       27.27
    feb2021 |          1        4.55       31.82
    feb2022 |          1        4.55       36.36
    jan2022 |          1        4.55       40.91
    jul2022 |          2        9.09       50.00
    jun2022 |          1        4.55       54.55
    mar2020 |          1        4.55       59.09
    mar2022 |          1        4.55       63.64
    may2020 |          1        4.55       68.18
    may2021 |          1        4.55       72.73
    may2022 |          1        4.55       77.27
    nov2020 |          1        4.55       81.82
    nov2021 |          1        4.55       86.36
    oct2021 |          1        4.55       90.91
    sep2020 |          1        4.55       95.45
    sep2021 |          1        4.55      100.00
------------+-----------------------------------
      Total |         22      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1981

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        3.45        3.45
    aug2020 |          2        6.90       10.34
    aug2022 |          1        3.45       13.79
    dec2020 |          2        6.90       20.69
    dec2021 |          2        6.90       27.59
    feb2020 |          2        6.90       34.48
    feb2021 |          1        3.45       37.93
    feb2022 |          1        3.45       41.38
    jul2020 |          1        3.45       44.83
    jul2021 |          2        6.90       51.72
    jun2020 |          1        3.45       55.17
    jun2022 |          1        3.45       58.62
    mar2020 |          1        3.45       62.07
    mar2021 |          1        3.45       65.52
    mar2022 |          2        6.90       72.41
    may2020 |          1        3.45       75.86
    may2022 |          2        6.90       82.76
    nov2020 |          1        3.45       86.21
    nov2021 |          1        3.45       89.66
    oct2020 |          2        6.90       96.55
    sep2020 |          1        3.45      100.00
------------+-----------------------------------
      Total |         29      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1982

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          3        8.82        8.82
    apr2021 |          2        5.88       14.71
    aug2020 |          2        5.88       20.59
    dec2020 |          1        2.94       23.53
    dec2021 |          1        2.94       26.47
    feb2020 |          3        8.82       35.29
    feb2021 |          1        2.94       38.24
    feb2022 |          1        2.94       41.18
    jan2021 |          1        2.94       44.12
    jan2022 |          2        5.88       50.00
    jul2020 |          1        2.94       52.94
    jun2020 |          1        2.94       55.88
    jun2021 |          1        2.94       58.82
    jun2022 |          1        2.94       61.76
    mar2020 |          2        5.88       67.65
    mar2021 |          2        5.88       73.53
    mar2022 |          1        2.94       76.47
    may2021 |          2        5.88       82.35
    nov2021 |          1        2.94       85.29
    oct2020 |          1        2.94       88.24
    oct2021 |          1        2.94       91.18
    sep2020 |          2        5.88       97.06
    sep2021 |          1        2.94      100.00
------------+-----------------------------------
      Total |         34      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1983

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    aug2020 |          1        2.86        2.86
    aug2022 |          1        2.86        5.71
    dec2021 |          2        5.71       11.43
    feb2020 |          1        2.86       14.29
    feb2022 |          1        2.86       17.14
    jan2021 |          1        2.86       20.00
    jan2022 |          2        5.71       25.71
    jul2020 |          2        5.71       31.43
    jul2021 |          3        8.57       40.00
    jun2020 |          1        2.86       42.86
    jun2021 |          1        2.86       45.71
    jun2022 |          2        5.71       51.43
    mar2021 |          1        2.86       54.29
    mar2022 |          3        8.57       62.86
    may2021 |          3        8.57       71.43
    may2022 |          1        2.86       74.29
    nov2021 |          2        5.71       80.00
    oct2021 |          5       14.29       94.29
    sep2020 |          2        5.71      100.00
------------+-----------------------------------
      Total |         35      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1984

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        2.63        2.63
    apr2021 |          2        5.26        7.89
    apr2022 |          3        7.89       15.79
    aug2022 |          3        7.89       23.68
    dec2020 |          1        2.63       26.32
    dec2021 |          2        5.26       31.58
    feb2021 |          2        5.26       36.84
    feb2022 |          2        5.26       42.11
    jan2021 |          1        2.63       44.74
    jan2022 |          1        2.63       47.37
    jul2020 |          1        2.63       50.00
    jul2021 |          2        5.26       55.26
    jul2022 |          2        5.26       60.53
    jun2020 |          1        2.63       63.16
    jun2021 |          2        5.26       68.42
    jun2022 |          2        5.26       73.68
    mar2020 |          1        2.63       76.32
    mar2021 |          3        7.89       84.21
    may2022 |          1        2.63       86.84
    nov2020 |          2        5.26       92.11
    oct2020 |          1        2.63       94.74
    oct2021 |          2        5.26      100.00
------------+-----------------------------------
      Total |         38      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1985

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          2        5.26        5.26
    apr2021 |          1        2.63        7.89
    apr2022 |          2        5.26       13.16
    aug2020 |          1        2.63       15.79
    aug2021 |          1        2.63       18.42
    aug2022 |          1        2.63       21.05
    dec2020 |          2        5.26       26.32
    dec2021 |          2        5.26       31.58
    feb2020 |          1        2.63       34.21
    feb2021 |          1        2.63       36.84
    jan2022 |          1        2.63       39.47
    jul2020 |          3        7.89       47.37
    jul2021 |          4       10.53       57.89
    jul2022 |          3        7.89       65.79
    jun2020 |          1        2.63       68.42
    jun2021 |          1        2.63       71.05
    mar2020 |          1        2.63       73.68
    mar2021 |          1        2.63       76.32
    mar2022 |          1        2.63       78.95
    may2020 |          2        5.26       84.21
    may2022 |          1        2.63       86.84
    nov2020 |          1        2.63       89.47
    nov2021 |          2        5.26       94.74
    oct2021 |          1        2.63       97.37
    sep2020 |          1        2.63      100.00
------------+-----------------------------------
      Total |         38      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1986

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          1        3.57        3.57
    apr2022 |          3       10.71       14.29
    aug2021 |          1        3.57       17.86
    dec2020 |          1        3.57       21.43
    feb2020 |          1        3.57       25.00
    feb2021 |          1        3.57       28.57
    feb2022 |          1        3.57       32.14
    jan2021 |          1        3.57       35.71
    jul2020 |          1        3.57       39.29
    jul2021 |          1        3.57       42.86
    jul2022 |          1        3.57       46.43
    jun2020 |          2        7.14       53.57
    jun2021 |          2        7.14       60.71
    mar2021 |          1        3.57       64.29
    mar2022 |          2        7.14       71.43
    may2020 |          2        7.14       78.57
    may2021 |          1        3.57       82.14
    nov2020 |          1        3.57       85.71
    nov2021 |          3       10.71       96.43
    sep2020 |          1        3.57      100.00
------------+-----------------------------------
      Total |         28      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1987

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          3       11.54       11.54
    apr2021 |          1        3.85       15.38
    apr2022 |          1        3.85       19.23
    aug2021 |          1        3.85       23.08
    aug2022 |          1        3.85       26.92
    feb2020 |          2        7.69       34.62
    feb2021 |          1        3.85       38.46
    jul2020 |          3       11.54       50.00
    jul2022 |          1        3.85       53.85
    mar2020 |          2        7.69       61.54
    mar2021 |          1        3.85       65.38
    mar2022 |          1        3.85       69.23
    may2020 |          2        7.69       76.92
    may2021 |          1        3.85       80.77
    may2022 |          1        3.85       84.62
    nov2021 |          1        3.85       88.46
    oct2020 |          1        3.85       92.31
    sep2020 |          1        3.85       96.15
    sep2021 |          1        3.85      100.00
------------+-----------------------------------
      Total |         26      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1988

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          1        3.12        3.12
    apr2022 |          1        3.12        6.25
    aug2021 |          1        3.12        9.38
    aug2022 |          3        9.38       18.75
    dec2020 |          1        3.12       21.88
    feb2020 |          1        3.12       25.00
    feb2021 |          2        6.25       31.25
    feb2022 |          3        9.38       40.62
    jan2021 |          2        6.25       46.88
    jul2020 |          1        3.12       50.00
    jul2021 |          2        6.25       56.25
    jul2022 |          1        3.12       59.38
    jun2020 |          1        3.12       62.50
    jun2021 |          1        3.12       65.62
    mar2020 |          1        3.12       68.75
    mar2021 |          1        3.12       71.88
    mar2022 |          1        3.12       75.00
    may2020 |          1        3.12       78.12
    may2021 |          2        6.25       84.38
    may2022 |          1        3.12       87.50
    oct2021 |          2        6.25       93.75
    sep2020 |          2        6.25      100.00
------------+-----------------------------------
      Total |         32      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1989

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          1        3.03        3.03
    apr2022 |          2        6.06        9.09
    aug2020 |          1        3.03       12.12
    aug2021 |          1        3.03       15.15
    aug2022 |          3        9.09       24.24
    dec2020 |          2        6.06       30.30
    feb2021 |          2        6.06       36.36
    feb2022 |          3        9.09       45.45
    jan2022 |          4       12.12       57.58
    jul2021 |          1        3.03       60.61
    jun2020 |          1        3.03       63.64
    jun2021 |          1        3.03       66.67
    jun2022 |          1        3.03       69.70
    mar2021 |          1        3.03       72.73
    may2021 |          2        6.06       78.79
    may2022 |          2        6.06       84.85
    nov2020 |          1        3.03       87.88
    oct2021 |          1        3.03       90.91
    sep2020 |          3        9.09      100.00
------------+-----------------------------------
      Total |         33      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1990

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        3.33        3.33
    apr2022 |          1        3.33        6.67
    aug2020 |          3       10.00       16.67
    aug2021 |          2        6.67       23.33
    aug2022 |          2        6.67       30.00
    dec2021 |          2        6.67       36.67
    feb2020 |          1        3.33       40.00
    feb2021 |          2        6.67       46.67
    feb2022 |          1        3.33       50.00
    jan2022 |          2        6.67       56.67
    jul2020 |          2        6.67       63.33
    jul2022 |          4       13.33       76.67
    jun2022 |          1        3.33       80.00
    mar2022 |          1        3.33       83.33
    may2021 |          3       10.00       93.33
    oct2020 |          1        3.33       96.67
    sep2020 |          1        3.33      100.00
------------+-----------------------------------
      Total |         30      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1991

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        2.86        2.86
    apr2022 |          1        2.86        5.71
    aug2020 |          1        2.86        8.57
    aug2021 |          1        2.86       11.43
    aug2022 |          1        2.86       14.29
    dec2020 |          1        2.86       17.14
    dec2021 |          1        2.86       20.00
    feb2020 |          1        2.86       22.86
    feb2022 |          1        2.86       25.71
    jan2021 |          1        2.86       28.57
    jan2022 |          1        2.86       31.43
    jul2020 |          4       11.43       42.86
    jul2021 |          2        5.71       48.57
    jun2020 |          2        5.71       54.29
    jun2022 |          1        2.86       57.14
    mar2022 |          1        2.86       60.00
    may2020 |          2        5.71       65.71
    may2021 |          3        8.57       74.29
    nov2020 |          5       14.29       88.57
    nov2021 |          1        2.86       91.43
    oct2020 |          1        2.86       94.29
    oct2021 |          1        2.86       97.14
    sep2021 |          1        2.86      100.00
------------+-----------------------------------
      Total |         35      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1992

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        2.78        2.78
    apr2021 |          1        2.78        5.56
    apr2022 |          2        5.56       11.11
    aug2020 |          1        2.78       13.89
    dec2020 |          2        5.56       19.44
    feb2020 |          1        2.78       22.22
    feb2021 |          1        2.78       25.00
    jan2021 |          2        5.56       30.56
    jan2022 |          1        2.78       33.33
    jul2021 |          2        5.56       38.89
    jul2022 |          2        5.56       44.44
    jun2020 |          1        2.78       47.22
    jun2021 |          1        2.78       50.00
    jun2022 |          3        8.33       58.33
    mar2020 |          4       11.11       69.44
    mar2022 |          1        2.78       72.22
    may2020 |          2        5.56       77.78
    may2022 |          1        2.78       80.56
    nov2020 |          1        2.78       83.33
    nov2021 |          1        2.78       86.11
    oct2020 |          2        5.56       91.67
    oct2021 |          2        5.56       97.22
    sep2020 |          1        2.78      100.00
------------+-----------------------------------
      Total |         36      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1993

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          2        4.65        4.65
    apr2022 |          2        4.65        9.30
    aug2021 |          6       13.95       23.26
    dec2020 |          3        6.98       30.23
    dec2021 |          1        2.33       32.56
    feb2022 |          1        2.33       34.88
    jan2022 |          2        4.65       39.53
    jul2021 |          3        6.98       46.51
    jul2022 |          4        9.30       55.81
    jun2021 |          2        4.65       60.47
    jun2022 |          3        6.98       67.44
    mar2020 |          2        4.65       72.09
    mar2022 |          1        2.33       74.42
    may2021 |          2        4.65       79.07
    may2022 |          2        4.65       83.72
    nov2020 |          2        4.65       88.37
    oct2020 |          1        2.33       90.70
    oct2021 |          1        2.33       93.02
    sep2020 |          2        4.65       97.67
    sep2021 |          1        2.33      100.00
------------+-----------------------------------
      Total |         43      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1994

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2021 |          1        2.50        2.50
    apr2022 |          2        5.00        7.50
    aug2020 |          3        7.50       15.00
    aug2021 |          2        5.00       20.00
    aug2022 |          2        5.00       25.00
    dec2020 |          2        5.00       30.00
    dec2021 |          1        2.50       32.50
    feb2020 |          1        2.50       35.00
    feb2021 |          2        5.00       40.00
    feb2022 |          5       12.50       52.50
    jan2021 |          2        5.00       57.50
    jan2022 |          2        5.00       62.50
    jul2022 |          1        2.50       65.00
    jun2020 |          1        2.50       67.50
    jun2021 |          1        2.50       70.00
    jun2022 |          1        2.50       72.50
    mar2020 |          2        5.00       77.50
    mar2021 |          1        2.50       80.00
    may2020 |          2        5.00       85.00
    may2021 |          1        2.50       87.50
    nov2021 |          1        2.50       90.00
    oct2021 |          2        5.00       95.00
    sep2021 |          2        5.00      100.00
------------+-----------------------------------
      Total |         40      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1995

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        2.78        2.78
    apr2021 |          3        8.33       11.11
    apr2022 |          3        8.33       19.44
    aug2021 |          1        2.78       22.22
    dec2021 |          1        2.78       25.00
    feb2020 |          1        2.78       27.78
    feb2021 |          4       11.11       38.89
    jan2022 |          2        5.56       44.44
    jul2020 |          1        2.78       47.22
    jul2021 |          1        2.78       50.00
    jun2020 |          2        5.56       55.56
    jun2022 |          2        5.56       61.11
    mar2020 |          3        8.33       69.44
    mar2022 |          1        2.78       72.22
    may2021 |          1        2.78       75.00
    may2022 |          3        8.33       83.33
    nov2020 |          1        2.78       86.11
    oct2020 |          1        2.78       88.89
    oct2021 |          1        2.78       91.67
    sep2021 |          3        8.33      100.00
------------+-----------------------------------
      Total |         36      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1996

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          1        3.03        3.03
    aug2021 |          1        3.03        6.06
    aug2022 |          1        3.03        9.09
    dec2020 |          2        6.06       15.15
    dec2021 |          1        3.03       18.18
    feb2020 |          1        3.03       21.21
    feb2021 |          3        9.09       30.30
    feb2022 |          1        3.03       33.33
    jan2021 |          1        3.03       36.36
    jan2022 |          1        3.03       39.39
    jul2020 |          2        6.06       45.45
    jul2021 |          1        3.03       48.48
    jul2022 |          1        3.03       51.52
    jun2021 |          1        3.03       54.55
    jun2022 |          3        9.09       63.64
    mar2021 |          2        6.06       69.70
    mar2022 |          2        6.06       75.76
    may2020 |          1        3.03       78.79
    may2021 |          1        3.03       81.82
    nov2020 |          2        6.06       87.88
    oct2020 |          1        3.03       90.91
    oct2021 |          3        9.09      100.00
------------+-----------------------------------
      Total |         33      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1997

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          2        8.33        8.33
    apr2021 |          2        8.33       16.67
    aug2022 |          2        8.33       25.00
    dec2020 |          2        8.33       33.33
    dec2021 |          1        4.17       37.50
    feb2021 |          2        8.33       45.83
    jan2021 |          1        4.17       50.00
    jul2020 |          1        4.17       54.17
    jul2021 |          1        4.17       58.33
    jul2022 |          1        4.17       62.50
    jun2020 |          1        4.17       66.67
    jun2022 |          1        4.17       70.83
    may2020 |          1        4.17       75.00
    may2021 |          1        4.17       79.17
    may2022 |          1        4.17       83.33
    nov2021 |          1        4.17       87.50
    oct2020 |          2        8.33       95.83
    oct2021 |          1        4.17      100.00
------------+-----------------------------------
      Total |         24      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1998

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          2        4.35        4.35
    apr2021 |          2        4.35        8.70
    apr2022 |          1        2.17       10.87
    aug2022 |          1        2.17       13.04
    dec2020 |          2        4.35       17.39
    dec2021 |          2        4.35       21.74
    feb2021 |          1        2.17       23.91
    feb2022 |          1        2.17       26.09
    jan2021 |          3        6.52       32.61
    jul2020 |          4        8.70       41.30
    jul2021 |          2        4.35       45.65
    jul2022 |          2        4.35       50.00
    jun2020 |          3        6.52       56.52
    jun2021 |          2        4.35       60.87
    jun2022 |          3        6.52       67.39
    mar2020 |          3        6.52       73.91
    mar2021 |          2        4.35       78.26
    mar2022 |          1        2.17       80.43
    may2020 |          2        4.35       84.78
    may2022 |          1        2.17       86.96
    nov2020 |          2        4.35       91.30
    nov2021 |          2        4.35       95.65
    sep2020 |          1        2.17       97.83
    sep2021 |          1        2.17      100.00
------------+-----------------------------------
      Total |         46      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1999

death_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    aug2021 |          3        7.89        7.89
    aug2022 |          1        2.63       10.53
    dec2020 |          1        2.63       13.16
    feb2022 |          1        2.63       15.79
    jan2021 |          2        5.26       21.05
    jan2022 |          4       10.53       31.58
    jul2020 |          2        5.26       36.84
    jul2022 |          2        5.26       42.11
    jun2020 |          1        2.63       44.74
    jun2021 |          1        2.63       47.37
    jun2022 |          5       13.16       60.53
    mar2021 |          2        5.26       65.79
    may2020 |          4       10.53       76.32
    may2021 |          2        5.26       81.58
    may2022 |          1        2.63       84.21
    nov2020 |          2        5.26       89.47
    nov2021 |          2        5.26       94.74
    oct2021 |          2        5.26      100.00
------------+-----------------------------------
      Total |         38      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 2000
no observations


. 
. export delimited using "./output/contemporary_matching_may2021.csv", replace
(note: file ./output/contemporary_matching_may2021.csv not found)
file ./output/contemporary_matching_may2021.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/contemporary_matching_may2021.log
  log type:  text
 closed on:  20 Oct 2022, 09:50:58
-------------------------------------------------------------------------------
