-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/contemporary_northeast_matching.log
  log type:  text
 opened on:  19 Aug 2022, 12:07:52

. clear

. 
. import delimited ./output/input_contemporary_northeast_matching.csv, delimite
> r(comma) varnames(1) case(preserve) 
(13 vars, 1,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(205 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(41 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(41 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(32 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(30 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(288 real changes made, 288 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(288 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(651 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(178 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(185 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(178 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(185 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(217 real changes made)

. gen max_baseline_creatinine_feb2020=.
(651 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(178 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(185 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(363 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(434 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(288 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(363 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(178 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. drop egfr_baseline_creatinine_feb2020

. drop age

. 
. * Deceased
. drop if deceased==1
(65 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. replace imd = imd + 1
(586 real changes made)

. drop imd_o

. recode imd 5=1 4=2 3=3 2=4 1=5 .=.
(imd: 466 changes made)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" 

. label values imd imd

. label var imd "Index of Multiple Deprivation"

. noi di "DROPPING IF NO IMD" 
DROPPING IF NO IMD

. drop if imd>=.
(0 observations deleted)

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(576 missing values generated)

. replace stp = sum(stp)
(585 real changes made)

. drop stp_old

. drop region

. 
. export delimited using "./output/contemporary_northeast_matching", replace
(note: file ./output/contemporary_northeast_matching.csv not found)
file ./output/contemporary_northeast_matching.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/contemporary_northeast_matching.log
  log type:  text
 closed on:  19 Aug 2022, 12:07:52
-------------------------------------------------------------------------------
