-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2017.log
  log type:  text
 opened on:   5 Apr 2023, 10:20:35

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames
> (1) case(preserve) 
(53 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,581 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,999 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,872 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,761 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,698 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,043 real changes made, 14,043 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,043 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,089 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,203 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,843 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,203 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,843 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,541 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,089 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,203 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,843 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(18,046 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,548 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,043 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(18,046 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,203 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(15,719 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(15,719 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 ///
>                                                                              
>                    baseline_creatinine_oct2022     {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(7,225 real changes made, 7,225 to missing)
(7,225 missing values generated)
(16,370 missing values generated)
(4,627 real changes made)
(4,518 real changes made)
(4,627 real changes made)
(4,518 real changes made)
(5,746 real changes made)
(16,370 missing values generated)
(4,627 real changes made)
(4,518 real changes made)
(9,145 real changes made)
(10,624 real changes made)
(7,225 missing values generated)
(9,145 real changes made)
(4,627 real changes made)
(7,208 real changes made, 7,208 to missing)
(7,208 missing values generated)
(16,370 missing values generated)
(4,603 real changes made)
(4,559 real changes made)
(4,603 real changes made)
(4,559 real changes made)
(5,847 real changes made)
(16,370 missing values generated)
(4,603 real changes made)
(4,559 real changes made)
(9,162 real changes made)
(10,523 real changes made)
(7,208 missing values generated)
(9,162 real changes made)
(4,603 real changes made)
(7,188 real changes made, 7,188 to missing)
(7,188 missing values generated)
(16,370 missing values generated)
(4,615 real changes made)
(4,567 real changes made)
(4,615 real changes made)
(4,567 real changes made)
(5,786 real changes made)
(16,370 missing values generated)
(4,615 real changes made)
(4,567 real changes made)
(9,182 real changes made)
(10,584 real changes made)
(7,188 missing values generated)
(9,182 real changes made)
(4,615 real changes made)
(7,163 real changes made, 7,163 to missing)
(7,163 missing values generated)
(16,370 missing values generated)
(4,668 real changes made)
(4,539 real changes made)
(4,668 real changes made)
(4,539 real changes made)
(5,873 real changes made)
(16,370 missing values generated)
(4,668 real changes made)
(4,539 real changes made)
(9,207 real changes made)
(10,497 real changes made)
(7,163 missing values generated)
(9,207 real changes made)
(4,668 real changes made)
(7,301 real changes made, 7,301 to missing)
(7,301 missing values generated)
(16,370 missing values generated)
(4,576 real changes made)
(4,493 real changes made)
(4,576 real changes made)
(4,493 real changes made)
(5,767 real changes made)
(16,370 missing values generated)
(4,576 real changes made)
(4,493 real changes made)
(9,069 real changes made)
(10,603 real changes made)
(7,301 missing values generated)
(9,069 real changes made)
(4,576 real changes made)
(7,284 real changes made, 7,284 to missing)
(7,284 missing values generated)
(16,370 missing values generated)
(4,523 real changes made)
(4,563 real changes made)
(4,523 real changes made)
(4,563 real changes made)
(5,724 real changes made)
(16,370 missing values generated)
(4,523 real changes made)
(4,563 real changes made)
(9,086 real changes made)
(10,646 real changes made)
(7,284 missing values generated)
(9,086 real changes made)
(4,523 real changes made)
(7,213 real changes made, 7,213 to missing)
(7,213 missing values generated)
(16,370 missing values generated)
(4,635 real changes made)
(4,522 real changes made)
(4,635 real changes made)
(4,522 real changes made)
(5,797 real changes made)
(16,370 missing values generated)
(4,635 real changes made)
(4,522 real changes made)
(9,157 real changes made)
(10,573 real changes made)
(7,213 missing values generated)
(9,157 real changes made)
(4,635 real changes made)
(7,253 real changes made, 7,253 to missing)
(7,253 missing values generated)
(16,370 missing values generated)
(4,613 real changes made)
(4,504 real changes made)
(4,613 real changes made)
(4,504 real changes made)
(5,905 real changes made)
(16,370 missing values generated)
(4,613 real changes made)
(4,504 real changes made)
(9,117 real changes made)
(10,465 real changes made)
(7,253 missing values generated)
(9,117 real changes made)
(4,613 real changes made)
(7,217 real changes made, 7,217 to missing)
(7,217 missing values generated)
(16,370 missing values generated)
(4,597 real changes made)
(4,556 real changes made)
(4,597 real changes made)
(4,556 real changes made)
(5,742 real changes made)
(16,370 missing values generated)
(4,597 real changes made)
(4,556 real changes made)
(9,153 real changes made)
(10,628 real changes made)
(7,217 missing values generated)
(9,153 real changes made)
(4,597 real changes made)
(7,186 real changes made, 7,186 to missing)
(7,186 missing values generated)
(16,370 missing values generated)
(4,647 real changes made)
(4,537 real changes made)
(4,647 real changes made)
(4,537 real changes made)
(5,741 real changes made)
(16,370 missing values generated)
(4,647 real changes made)
(4,537 real changes made)
(9,184 real changes made)
(10,629 real changes made)
(7,186 missing values generated)
(9,184 real changes made)
(4,647 real changes made)
(7,296 real changes made, 7,296 to missing)
(7,296 missing values generated)
(16,370 missing values generated)
(4,593 real changes made)
(4,481 real changes made)
(4,593 real changes made)
(4,481 real changes made)
(5,742 real changes made)
(16,370 missing values generated)
(4,593 real changes made)
(4,481 real changes made)
(9,074 real changes made)
(10,628 real changes made)
(7,296 missing values generated)
(9,074 real changes made)
(4,593 real changes made)
(7,201 real changes made, 7,201 to missing)
(7,201 missing values generated)
(16,370 missing values generated)
(4,656 real changes made)
(4,513 real changes made)
(4,656 real changes made)
(4,513 real changes made)
(5,815 real changes made)
(16,370 missing values generated)
(4,656 real changes made)
(4,513 real changes made)
(9,169 real changes made)
(10,555 real changes made)
(7,201 missing values generated)
(9,169 real changes made)
(4,656 real changes made)
(7,196 real changes made, 7,196 to missing)
(7,196 missing values generated)
(16,370 missing values generated)
(4,623 real changes made)
(4,551 real changes made)
(4,623 real changes made)
(4,551 real changes made)
(5,820 real changes made)
(16,370 missing values generated)
(4,623 real changes made)
(4,551 real changes made)
(9,174 real changes made)
(10,550 real changes made)
(7,196 missing values generated)
(9,174 real changes made)
(4,623 real changes made)
(7,200 real changes made, 7,200 to missing)
(7,200 missing values generated)
(16,370 missing values generated)
(4,669 real changes made)
(4,501 real changes made)
(4,669 real changes made)
(4,501 real changes made)
(5,778 real changes made)
(16,370 missing values generated)
(4,669 real changes made)
(4,501 real changes made)
(9,170 real changes made)
(10,592 real changes made)
(7,200 missing values generated)
(9,170 real changes made)
(4,669 real changes made)
(7,243 real changes made, 7,243 to missing)
(7,243 missing values generated)
(16,370 missing values generated)
(4,651 real changes made)
(4,476 real changes made)
(4,651 real changes made)
(4,476 real changes made)
(5,791 real changes made)
(16,370 missing values generated)
(4,651 real changes made)
(4,476 real changes made)
(9,127 real changes made)
(10,579 real changes made)
(7,243 missing values generated)
(9,127 real changes made)
(4,651 real changes made)
(7,157 real changes made, 7,157 to missing)
(7,157 missing values generated)
(16,370 missing values generated)
(4,639 real changes made)
(4,574 real changes made)
(4,639 real changes made)
(4,574 real changes made)
(5,861 real changes made)
(16,370 missing values generated)
(4,639 real changes made)
(4,574 real changes made)
(9,213 real changes made)
(10,509 real changes made)
(7,157 missing values generated)
(9,213 real changes made)
(4,639 real changes made)
(7,146 real changes made, 7,146 to missing)
(7,146 missing values generated)
(16,370 missing values generated)
(4,680 real changes made)
(4,544 real changes made)
(4,680 real changes made)
(4,544 real changes made)
(5,797 real changes made)
(16,370 missing values generated)
(4,680 real changes made)
(4,544 real changes made)
(9,224 real changes made)
(10,573 real changes made)
(7,146 missing values generated)
(9,224 real changes made)
(4,680 real changes made)
(7,269 real changes made, 7,269 to missing)
(7,269 missing values generated)
(16,370 missing values generated)
(4,563 real changes made)
(4,538 real changes made)
(4,563 real changes made)
(4,538 real changes made)
(5,761 real changes made)
(16,370 missing values generated)
(4,563 real changes made)
(4,538 real changes made)
(9,101 real changes made)
(10,609 real changes made)
(7,269 missing values generated)
(9,101 real changes made)
(4,563 real changes made)
(7,159 real changes made, 7,159 to missing)
(7,159 missing values generated)
(16,370 missing values generated)
(4,647 real changes made)
(4,564 real changes made)
(4,647 real changes made)
(4,564 real changes made)
(5,877 real changes made)
(16,370 missing values generated)
(4,647 real changes made)
(4,564 real changes made)
(9,211 real changes made)
(10,493 real changes made)
(7,159 missing values generated)
(9,211 real changes made)
(4,647 real changes made)
(7,233 real changes made, 7,233 to missing)
(7,233 missing values generated)
(16,370 missing values generated)
(4,609 real changes made)
(4,528 real changes made)
(4,609 real changes made)
(4,528 real changes made)
(5,734 real changes made)
(16,370 missing values generated)
(4,609 real changes made)
(4,528 real changes made)
(9,137 real changes made)
(10,636 real changes made)
(7,233 missing values generated)
(9,137 real changes made)
(4,609 real changes made)
(7,294 real changes made, 7,294 to missing)
(7,294 missing values generated)
(16,370 missing values generated)
(4,596 real changes made)
(4,480 real changes made)
(4,596 real changes made)
(4,480 real changes made)
(5,795 real changes made)
(16,370 missing values generated)
(4,596 real changes made)
(4,480 real changes made)
(9,076 real changes made)
(10,575 real changes made)
(7,294 missing values generated)
(9,076 real changes made)
(4,596 real changes made)
(7,203 real changes made, 7,203 to missing)
(7,203 missing values generated)
(16,370 missing values generated)
(4,608 real changes made)
(4,559 real changes made)
(4,608 real changes made)
(4,559 real changes made)
(5,756 real changes made)
(16,370 missing values generated)
(4,608 real changes made)
(4,559 real changes made)
(9,167 real changes made)
(10,614 real changes made)
(7,203 missing values generated)
(9,167 real changes made)
(4,608 real changes made)
(7,232 real changes made, 7,232 to missing)
(7,232 missing values generated)
(16,370 missing values generated)
(4,577 real changes made)
(4,561 real changes made)
(4,577 real changes made)
(4,561 real changes made)
(5,853 real changes made)
(16,370 missing values generated)
(4,577 real changes made)
(4,561 real changes made)
(9,138 real changes made)
(10,517 real changes made)
(7,232 missing values generated)
(9,138 real changes made)
(4,577 real changes made)
(7,239 real changes made, 7,239 to missing)
(7,239 missing values generated)
(16,370 missing values generated)
(4,653 real changes made)
(4,478 real changes made)
(4,653 real changes made)
(4,478 real changes made)
(5,813 real changes made)
(16,370 missing values generated)
(4,653 real changes made)
(4,478 real changes made)
(9,131 real changes made)
(10,557 real changes made)
(7,239 missing values generated)
(9,131 real changes made)
(4,653 real changes made)
(7,271 real changes made, 7,271 to missing)
(7,271 missing values generated)
(16,370 missing values generated)
(4,591 real changes made)
(4,508 real changes made)
(4,591 real changes made)
(4,508 real changes made)
(5,742 real changes made)
(16,370 missing values generated)
(4,591 real changes made)
(4,508 real changes made)
(9,099 real changes made)
(10,628 real changes made)
(7,271 missing values generated)
(9,099 real changes made)
(4,591 real changes made)
(7,196 real changes made, 7,196 to missing)
(7,196 missing values generated)
(16,370 missing values generated)
(4,664 real changes made)
(4,510 real changes made)
(4,664 real changes made)
(4,510 real changes made)
(5,831 real changes made)
(16,370 missing values generated)
(4,664 real changes made)
(4,510 real changes made)
(9,174 real changes made)
(10,539 real changes made)
(7,196 missing values generated)
(9,174 real changes made)
(4,664 real changes made)
(7,248 real changes made, 7,248 to missing)
(7,248 missing values generated)
(16,370 missing values generated)
(4,607 real changes made)
(4,515 real changes made)
(4,607 real changes made)
(4,515 real changes made)
(5,716 real changes made)
(16,370 missing values generated)
(4,607 real changes made)
(4,515 real changes made)
(9,122 real changes made)
(10,654 real changes made)
(7,248 missing values generated)
(9,122 real changes made)
(4,607 real changes made)
(7,257 real changes made, 7,257 to missing)
(7,257 missing values generated)
(16,370 missing values generated)
(4,614 real changes made)
(4,499 real changes made)
(4,614 real changes made)
(4,499 real changes made)
(5,765 real changes made)
(16,370 missing values generated)
(4,614 real changes made)
(4,499 real changes made)
(9,113 real changes made)
(10,605 real changes made)
(7,257 missing values generated)
(9,113 real changes made)
(4,614 real changes made)
(7,132 real changes made, 7,132 to missing)
(7,132 missing values generated)
(16,370 missing values generated)
(4,657 real changes made)
(4,581 real changes made)
(4,657 real changes made)
(4,581 real changes made)
(5,837 real changes made)
(16,370 missing values generated)
(4,657 real changes made)
(4,581 real changes made)
(9,238 real changes made)
(10,533 real changes made)
(7,132 missing values generated)
(9,238 real changes made)
(4,657 real changes made)
(7,261 real changes made, 7,261 to missing)
(7,261 missing values generated)
(16,370 missing values generated)
(4,620 real changes made)
(4,489 real changes made)
(4,620 real changes made)
(4,489 real changes made)
(5,785 real changes made)
(16,370 missing values generated)
(4,620 real changes made)
(4,489 real changes made)
(9,109 real changes made)
(10,585 real changes made)
(7,261 missing values generated)
(9,109 real changes made)
(4,620 real changes made)
(7,223 real changes made, 7,223 to missing)
(7,223 missing values generated)
(16,370 missing values generated)
(4,575 real changes made)
(4,572 real changes made)
(4,575 real changes made)
(4,572 real changes made)
(5,807 real changes made)
(16,370 missing values generated)
(4,575 real changes made)
(4,572 real changes made)
(9,147 real changes made)
(10,563 real changes made)
(7,223 missing values generated)
(9,147 real changes made)
(4,575 real changes made)
(7,274 real changes made, 7,274 to missing)
(7,274 missing values generated)
(16,370 missing values generated)
(4,566 real changes made)
(4,530 real changes made)
(4,566 real changes made)
(4,530 real changes made)
(5,741 real changes made)
(16,370 missing values generated)
(4,566 real changes made)
(4,530 real changes made)
(9,096 real changes made)
(10,629 real changes made)
(7,274 missing values generated)
(9,096 real changes made)
(4,566 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(16,370 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr20
> 22 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if covid_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(302 real changes made)
(328 real changes made)
(312 real changes made)
(315 real changes made)
(287 real changes made)
(335 real changes made)
(303 real changes made)
(307 real changes made)
(297 real changes made)
(260 real changes made)
(360 real changes made)
(286 real changes made)
(254 real changes made)
(312 real changes made)
(299 real changes made)
(306 real changes made)
(255 real changes made)
(309 real changes made)
(260 real changes made)
(251 real changes made)
(249 real changes made)
(255 real changes made)
(282 real changes made)
(266 real changes made)
(208 real changes made)
(286 real changes made)
(252 real changes made)
(275 real changes made)
(240 real changes made)
(249 real changes made)
(222 real changes made)
(225 real changes made)
(223 real changes made)

. drop if baseline_egfr <15
(0 observations deleted)

. drop baseline_egfr

. drop covid_date_string

. 
. * COVID-19 death
. drop if deceased==1
(1,611 observations deleted)

. drop deceased

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. export delimited using "./output/covid_matching_2017.csv", replace
(note: file ./output/covid_matching_2017.csv not found)
file ./output/covid_matching_2017.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2017.log
  log type:  text
 closed on:   5 Apr 2023, 10:20:36
-------------------------------------------------------------------------------
