------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/covid_matching_2017.log
  log type:  text
 opened on:  28 Nov 2022, 23:39:28

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames(1) case(preserve) 
(encoding automatically selected: ISO-8859-9)
(53 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,568 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosis
. drop if has_follow_up==0
(1,979 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,868 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,766 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,672 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb2020, 20, 3000)
(14,055 real changes made, 14,055 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,055 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,147 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.7 if male==0
(9,247 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.9 if male==1
(8,845 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.329  if male==0
(9,247 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.411  if male==1
(8,845 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb2020<1
(11,431 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,147 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.7 if male==0
(9,247 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.9 if male==1
(8,845 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.209
(18,092 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb2020>1
(20,716 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_baseline_creatinine_feb2020*141
(14,055 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(0.993^age)
(18,092 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1.018 if male==0
(9,247 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine updated monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(14,333 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(14,333 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///                                                                 
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 ///
>                                                                                                 baseline_creatinine_feb2022 ///
>                                                                                                 baseline_creatinine_mar2022 ///
>                                                                                                 baseline_creatinine_apr2022 ///
>                                                                                                 baseline_creatinine_may2022 ///
>                                                                                                 baseline_creatinine_jun2022 ///
>                                                                                                 baseline_creatinine_jul2022 ///
>                                                                                                 baseline_creatinine_aug2022 ///
>                                                                                                 baseline_creatinine_sep2022 ///
>                                                                                                 baseline_creatinine_oct2022     {                                                                                               
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(7,842 real changes made, 7,842 to missing)
(7,842 missing values generated)
(17,814 missing values generated)
(5,141 real changes made)
(4,831 real changes made)
(5,141 real changes made)
(4,831 real changes made)
(6,328 real changes made)
(17,814 missing values generated)
(5,141 real changes made)
(4,831 real changes made)
(9,972 real changes made)
(11,486 real changes made)
(7,842 missing values generated)
(9,972 real changes made)
(5,141 real changes made)
(7,800 real changes made, 7,800 to missing)
(7,800 missing values generated)
(17,814 missing values generated)
(5,124 real changes made)
(4,890 real changes made)
(5,124 real changes made)
(4,890 real changes made)
(6,298 real changes made)
(17,814 missing values generated)
(5,124 real changes made)
(4,890 real changes made)
(10,014 real changes made)
(11,516 real changes made)
(7,800 missing values generated)
(10,014 real changes made)
(5,124 real changes made)
(7,779 real changes made, 7,779 to missing)
(7,779 missing values generated)
(17,814 missing values generated)
(5,160 real changes made)
(4,875 real changes made)
(5,160 real changes made)
(4,875 real changes made)
(6,328 real changes made)
(17,814 missing values generated)
(5,160 real changes made)
(4,875 real changes made)
(10,035 real changes made)
(11,486 real changes made)
(7,779 missing values generated)
(10,035 real changes made)
(5,160 real changes made)
(7,826 real changes made, 7,826 to missing)
(7,826 missing values generated)
(17,814 missing values generated)
(5,156 real changes made)
(4,832 real changes made)
(5,156 real changes made)
(4,832 real changes made)
(6,411 real changes made)
(17,814 missing values generated)
(5,156 real changes made)
(4,832 real changes made)
(9,988 real changes made)
(11,403 real changes made)
(7,826 missing values generated)
(9,988 real changes made)
(5,156 real changes made)
(7,868 real changes made, 7,868 to missing)
(7,868 missing values generated)
(17,814 missing values generated)
(5,083 real changes made)
(4,863 real changes made)
(5,083 real changes made)
(4,863 real changes made)
(6,222 real changes made)
(17,814 missing values generated)
(5,083 real changes made)
(4,863 real changes made)
(9,946 real changes made)
(11,592 real changes made)
(7,868 missing values generated)
(9,946 real changes made)
(5,083 real changes made)
(7,866 real changes made, 7,866 to missing)
(7,866 missing values generated)
(17,814 missing values generated)
(5,169 real changes made)
(4,779 real changes made)
(5,169 real changes made)
(4,779 real changes made)
(6,302 real changes made)
(17,814 missing values generated)
(5,169 real changes made)
(4,779 real changes made)
(9,948 real changes made)
(11,512 real changes made)
(7,866 missing values generated)
(9,948 real changes made)
(5,169 real changes made)
(7,813 real changes made, 7,813 to missing)
(7,813 missing values generated)
(17,814 missing values generated)
(5,137 real changes made)
(4,864 real changes made)
(5,137 real changes made)
(4,864 real changes made)
(6,372 real changes made)
(17,814 missing values generated)
(5,137 real changes made)
(4,864 real changes made)
(10,001 real changes made)
(11,442 real changes made)
(7,813 missing values generated)
(10,001 real changes made)
(5,137 real changes made)
(7,801 real changes made, 7,801 to missing)
(7,801 missing values generated)
(17,814 missing values generated)
(5,200 real changes made)
(4,813 real changes made)
(5,200 real changes made)
(4,813 real changes made)
(6,427 real changes made)
(17,814 missing values generated)
(5,200 real changes made)
(4,813 real changes made)
(10,013 real changes made)
(11,387 real changes made)
(7,801 missing values generated)
(10,013 real changes made)
(5,200 real changes made)
(7,826 real changes made, 7,826 to missing)
(7,826 missing values generated)
(17,814 missing values generated)
(5,152 real changes made)
(4,836 real changes made)
(5,152 real changes made)
(4,836 real changes made)
(6,370 real changes made)
(17,814 missing values generated)
(5,152 real changes made)
(4,836 real changes made)
(9,988 real changes made)
(11,444 real changes made)
(7,826 missing values generated)
(9,988 real changes made)
(5,152 real changes made)
(7,817 real changes made, 7,817 to missing)
(7,817 missing values generated)
(17,814 missing values generated)
(5,222 real changes made)
(4,775 real changes made)
(5,222 real changes made)
(4,775 real changes made)
(6,460 real changes made)
(17,814 missing values generated)
(5,222 real changes made)
(4,775 real changes made)
(9,997 real changes made)
(11,354 real changes made)
(7,817 missing values generated)
(9,997 real changes made)
(5,222 real changes made)
(7,784 real changes made, 7,784 to missing)
(7,784 missing values generated)
(17,814 missing values generated)
(5,201 real changes made)
(4,829 real changes made)
(5,201 real changes made)
(4,829 real changes made)
(6,336 real changes made)
(17,814 missing values generated)
(5,201 real changes made)
(4,829 real changes made)
(10,030 real changes made)
(11,478 real changes made)
(7,784 missing values generated)
(10,030 real changes made)
(5,201 real changes made)
(7,715 real changes made, 7,715 to missing)
(7,715 missing values generated)
(17,814 missing values generated)
(5,232 real changes made)
(4,867 real changes made)
(5,232 real changes made)
(4,867 real changes made)
(6,386 real changes made)
(17,814 missing values generated)
(5,232 real changes made)
(4,867 real changes made)
(10,099 real changes made)
(11,428 real changes made)
(7,715 missing values generated)
(10,099 real changes made)
(5,232 real changes made)
(7,817 real changes made, 7,817 to missing)
(7,817 missing values generated)
(17,814 missing values generated)
(5,223 real changes made)
(4,774 real changes made)
(5,223 real changes made)
(4,774 real changes made)
(6,324 real changes made)
(17,814 missing values generated)
(5,223 real changes made)
(4,774 real changes made)
(9,997 real changes made)
(11,490 real changes made)
(7,817 missing values generated)
(9,997 real changes made)
(5,223 real changes made)
(7,780 real changes made, 7,780 to missing)
(7,780 missing values generated)
(17,814 missing values generated)
(5,112 real changes made)
(4,922 real changes made)
(5,112 real changes made)
(4,922 real changes made)
(6,391 real changes made)
(17,814 missing values generated)
(5,112 real changes made)
(4,922 real changes made)
(10,034 real changes made)
(11,423 real changes made)
(7,780 missing values generated)
(10,034 real changes made)
(5,112 real changes made)
(7,869 real changes made, 7,869 to missing)
(7,869 missing values generated)
(17,814 missing values generated)
(5,109 real changes made)
(4,836 real changes made)
(5,109 real changes made)
(4,836 real changes made)
(6,310 real changes made)
(17,814 missing values generated)
(5,109 real changes made)
(4,836 real changes made)
(9,945 real changes made)
(11,504 real changes made)
(7,869 missing values generated)
(9,945 real changes made)
(5,109 real changes made)
(7,839 real changes made, 7,839 to missing)
(7,839 missing values generated)
(17,814 missing values generated)
(5,140 real changes made)
(4,835 real changes made)
(5,140 real changes made)
(4,835 real changes made)
(6,355 real changes made)
(17,814 missing values generated)
(5,140 real changes made)
(4,835 real changes made)
(9,975 real changes made)
(11,459 real changes made)
(7,839 missing values generated)
(9,975 real changes made)
(5,140 real changes made)
(7,932 real changes made, 7,932 to missing)
(7,932 missing values generated)
(17,814 missing values generated)
(5,074 real changes made)
(4,808 real changes made)
(5,074 real changes made)
(4,808 real changes made)
(6,339 real changes made)
(17,814 missing values generated)
(5,074 real changes made)
(4,808 real changes made)
(9,882 real changes made)
(11,475 real changes made)
(7,932 missing values generated)
(9,882 real changes made)
(5,074 real changes made)
(7,940 real changes made, 7,940 to missing)
(7,940 missing values generated)
(17,814 missing values generated)
(5,017 real changes made)
(4,857 real changes made)
(5,017 real changes made)
(4,857 real changes made)
(6,343 real changes made)
(17,814 missing values generated)
(5,017 real changes made)
(4,857 real changes made)
(9,874 real changes made)
(11,471 real changes made)
(7,940 missing values generated)
(9,874 real changes made)
(5,017 real changes made)
(7,850 real changes made, 7,850 to missing)
(7,850 missing values generated)
(17,814 missing values generated)
(5,122 real changes made)
(4,842 real changes made)
(5,122 real changes made)
(4,842 real changes made)
(6,288 real changes made)
(17,814 missing values generated)
(5,122 real changes made)
(4,842 real changes made)
(9,964 real changes made)
(11,526 real changes made)
(7,850 missing values generated)
(9,964 real changes made)
(5,122 real changes made)
(7,785 real changes made, 7,785 to missing)
(7,785 missing values generated)
(17,814 missing values generated)
(5,151 real changes made)
(4,878 real changes made)
(5,151 real changes made)
(4,878 real changes made)
(6,409 real changes made)
(17,814 missing values generated)
(5,151 real changes made)
(4,878 real changes made)
(10,029 real changes made)
(11,405 real changes made)
(7,785 missing values generated)
(10,029 real changes made)
(5,151 real changes made)
(7,835 real changes made, 7,835 to missing)
(7,835 missing values generated)
(17,814 missing values generated)
(5,159 real changes made)
(4,820 real changes made)
(5,159 real changes made)
(4,820 real changes made)
(6,338 real changes made)
(17,814 missing values generated)
(5,159 real changes made)
(4,820 real changes made)
(9,979 real changes made)
(11,476 real changes made)
(7,835 missing values generated)
(9,979 real changes made)
(5,159 real changes made)
(7,814 real changes made, 7,814 to missing)
(7,814 missing values generated)
(17,814 missing values generated)
(5,140 real changes made)
(4,860 real changes made)
(5,140 real changes made)
(4,860 real changes made)
(6,356 real changes made)
(17,814 missing values generated)
(5,140 real changes made)
(4,860 real changes made)
(10,000 real changes made)
(11,458 real changes made)
(7,814 missing values generated)
(10,000 real changes made)
(5,140 real changes made)
(7,899 real changes made, 7,899 to missing)
(7,899 missing values generated)
(17,814 missing values generated)
(5,050 real changes made)
(4,865 real changes made)
(5,050 real changes made)
(4,865 real changes made)
(6,275 real changes made)
(17,814 missing values generated)
(5,050 real changes made)
(4,865 real changes made)
(9,915 real changes made)
(11,539 real changes made)
(7,899 missing values generated)
(9,915 real changes made)
(5,050 real changes made)
(7,804 real changes made, 7,804 to missing)
(7,804 missing values generated)
(17,814 missing values generated)
(5,207 real changes made)
(4,803 real changes made)
(5,207 real changes made)
(4,803 real changes made)
(6,394 real changes made)
(17,814 missing values generated)
(5,207 real changes made)
(4,803 real changes made)
(10,010 real changes made)
(11,420 real changes made)
(7,804 missing values generated)
(10,010 real changes made)
(5,207 real changes made)
(7,917 real changes made, 7,917 to missing)
(7,917 missing values generated)
(17,814 missing values generated)
(5,056 real changes made)
(4,841 real changes made)
(5,056 real changes made)
(4,841 real changes made)
(6,201 real changes made)
(17,814 missing values generated)
(5,056 real changes made)
(4,841 real changes made)
(9,897 real changes made)
(11,613 real changes made)
(7,917 missing values generated)
(9,897 real changes made)
(5,056 real changes made)
(7,876 real changes made, 7,876 to missing)
(7,876 missing values generated)
(17,814 missing values generated)
(5,135 real changes made)
(4,803 real changes made)
(5,135 real changes made)
(4,803 real changes made)
(6,394 real changes made)
(17,814 missing values generated)
(5,135 real changes made)
(4,803 real changes made)
(9,938 real changes made)
(11,420 real changes made)
(7,876 missing values generated)
(9,938 real changes made)
(5,135 real changes made)
(7,871 real changes made, 7,871 to missing)
(7,871 missing values generated)
(17,814 missing values generated)
(5,102 real changes made)
(4,841 real changes made)
(5,102 real changes made)
(4,841 real changes made)
(6,347 real changes made)
(17,814 missing values generated)
(5,102 real changes made)
(4,841 real changes made)
(9,943 real changes made)
(11,467 real changes made)
(7,871 missing values generated)
(9,943 real changes made)
(5,102 real changes made)
(7,934 real changes made, 7,934 to missing)
(7,934 missing values generated)
(17,814 missing values generated)
(5,114 real changes made)
(4,766 real changes made)
(5,114 real changes made)
(4,766 real changes made)
(6,330 real changes made)
(17,814 missing values generated)
(5,114 real changes made)
(4,766 real changes made)
(9,880 real changes made)
(11,484 real changes made)
(7,934 missing values generated)
(9,880 real changes made)
(5,114 real changes made)
(7,901 real changes made, 7,901 to missing)
(7,901 missing values generated)
(17,814 missing values generated)
(5,090 real changes made)
(4,823 real changes made)
(5,090 real changes made)
(4,823 real changes made)
(6,276 real changes made)
(17,814 missing values generated)
(5,090 real changes made)
(4,823 real changes made)
(9,913 real changes made)
(11,538 real changes made)
(7,901 missing values generated)
(9,913 real changes made)
(5,090 real changes made)
(7,786 real changes made, 7,786 to missing)
(7,786 missing values generated)
(17,814 missing values generated)
(5,132 real changes made)
(4,896 real changes made)
(5,132 real changes made)
(4,896 real changes made)
(6,376 real changes made)
(17,814 missing values generated)
(5,132 real changes made)
(4,896 real changes made)
(10,028 real changes made)
(11,438 real changes made)
(7,786 missing values generated)
(10,028 real changes made)
(5,132 real changes made)
(7,833 real changes made, 7,833 to missing)
(7,833 missing values generated)
(17,814 missing values generated)
(5,188 real changes made)
(4,793 real changes made)
(5,188 real changes made)
(4,793 real changes made)
(6,369 real changes made)
(17,814 missing values generated)
(5,188 real changes made)
(4,793 real changes made)
(9,981 real changes made)
(11,445 real changes made)
(7,833 missing values generated)
(9,981 real changes made)
(5,188 real changes made)
(7,891 real changes made, 7,891 to missing)
(7,891 missing values generated)
(17,814 missing values generated)
(5,117 real changes made)
(4,806 real changes made)
(5,117 real changes made)
(4,806 real changes made)
(6,311 real changes made)
(17,814 missing values generated)
(5,117 real changes made)
(4,806 real changes made)
(9,923 real changes made)
(11,503 real changes made)
(7,891 missing values generated)
(9,923 real changes made)
(5,117 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(17,814 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 
> jul2022 aug2022 sep2022 oct2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if covid_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(363 real changes made)
(420 real changes made)
(347 real changes made)
(370 real changes made)
(371 real changes made)
(365 real changes made)
(388 real changes made)
(326 real changes made)
(334 real changes made)
(302 real changes made)
(324 real changes made)
(313 real changes made)
(264 real changes made)
(274 real changes made)
(303 real changes made)
(309 real changes made)
(312 real changes made)
(293 real changes made)
(308 real changes made)
(306 real changes made)
(292 real changes made)
(261 real changes made)
(268 real changes made)
(266 real changes made)
(248 real changes made)
(271 real changes made)
(250 real changes made)
(268 real changes made)
(259 real changes made)
(237 real changes made)
(246 real changes made)
(250 real changes made)
(260 real changes made)

. drop if baseline_egfr <15
(0 observations deleted)

. drop baseline_egfr

. drop covid_date_string

. 
. * COVID-19 death
. drop if deceased==1
(1,794 observations deleted)

. drop deceased

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. * Categorise time period
. gen period = 1

. replace period = 2 if covid_month=="sep2020"
(543 real changes made)

. replace period = 2 if covid_month=="oct2020"
(523 real changes made)

. replace period = 2 if covid_month=="nov2020"
(512 real changes made)

. replace period = 2 if covid_month=="dec2020"
(528 real changes made)

. replace period = 2 if covid_month=="jan2021"
(491 real changes made)

. replace period = 2 if covid_month=="feb2021"
(448 real changes made)

. replace period = 2 if covid_month=="mar2021"
(468 real changes made)

. replace period = 2 if covid_month=="apr2021"
(499 real changes made)

. replace period = 2 if covid_month=="may2021"
(529 real changes made)

. replace period = 2 if covid_month=="jun2021"
(477 real changes made)

. replace period = 3 if covid_month=="jul2021"
(474 real changes made)

. replace period = 3 if covid_month=="aug2021"
(500 real changes made)

. replace period = 3 if covid_month=="sep2021"
(471 real changes made)

. replace period = 3 if covid_month=="oct2021"
(493 real changes made)

. replace period = 3 if covid_month=="nov2021"
(423 real changes made)

. replace period = 4 if covid_month=="dec2021"
(433 real changes made)

. replace period = 4 if covid_month=="jan2022"
(429 real changes made)

. replace period = 4 if covid_month=="feb2022"
(376 real changes made)

. replace period = 4 if covid_month=="mar2022"
(420 real changes made)

. replace period = 4 if covid_month=="apr2022"
(392 real changes made)

. replace period = 4 if covid_month=="may2022"
(440 real changes made)

. replace period = 4 if covid_month=="jun2022"
(424 real changes made)

. replace period = 4 if covid_month=="jul2022"
(395 real changes made)

. replace period = 4 if covid_month=="aug2022"
(377 real changes made)

. replace period = 4 if covid_month=="sep2022"
(402 real changes made)

. replace period = 4 if covid_month=="oct2022"
(415 real changes made)

. label var period "COVID-19 period"

. tab period, m

   COVID-19 |
     period |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      4,138       25.83       25.83
          2 |      5,018       31.32       57.15
          3 |      2,361       14.74       71.89
          4 |      4,503       28.11      100.00
------------+-----------------------------------
      Total |     16,020      100.00

. 
. export delimited using "./output/covid_matching_2017.csv", replace
file ./output/covid_matching_2017.csv saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/covid_matching_2017.log
  log type:  text
 closed on:  28 Nov 2022, 23:39:31
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
