-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2017.log
  log type:  text
 opened on:  24 Jan 2023, 17:45:09

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames
> (1) case(preserve) 
(53 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,738 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,919 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,859 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,795 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,703 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,166 real changes made, 14,166 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,166 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(31,986 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,132 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,688 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,131 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,688 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,196 real changes made)

. gen max_baseline_creatinine_feb2020=.
(31,986 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,132 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,688 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(17,819 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,789 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,166 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(17,820 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,132 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(14,905 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(14,905 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///                           
>                                       
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 ///
>                                                                              
>                    baseline_creatinine_oct2022     {                         
>                                                                       
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(7,600 real changes made, 7,600 to missing)
(7,600 missing values generated)
(17,081 missing values generated)
(4,932 real changes made)
(4,549 real changes made)
(4,932 real changes made)
(4,549 real changes made)
(6,026 real changes made)
(17,081 missing values generated)
(4,932 real changes made)
(4,549 real changes made)
(9,481 real changes made)
(11,055 real changes made)
(7,600 missing values generated)
(9,481 real changes made)
(4,932 real changes made)
(7,532 real changes made, 7,532 to missing)
(7,532 missing values generated)
(17,081 missing values generated)
(4,936 real changes made)
(4,613 real changes made)
(4,936 real changes made)
(4,613 real changes made)
(6,100 real changes made)
(17,081 missing values generated)
(4,936 real changes made)
(4,613 real changes made)
(9,549 real changes made)
(10,981 real changes made)
(7,532 missing values generated)
(9,549 real changes made)
(4,936 real changes made)
(7,500 real changes made, 7,500 to missing)
(7,500 missing values generated)
(17,081 missing values generated)
(4,920 real changes made)
(4,661 real changes made)
(4,920 real changes made)
(4,661 real changes made)
(6,149 real changes made)
(17,081 missing values generated)
(4,920 real changes made)
(4,661 real changes made)
(9,581 real changes made)
(10,932 real changes made)
(7,500 missing values generated)
(9,581 real changes made)
(4,920 real changes made)
(7,466 real changes made, 7,466 to missing)
(7,466 missing values generated)
(17,081 missing values generated)
(4,909 real changes made)
(4,706 real changes made)
(4,909 real changes made)
(4,706 real changes made)
(6,103 real changes made)
(17,081 missing values generated)
(4,909 real changes made)
(4,706 real changes made)
(9,615 real changes made)
(10,978 real changes made)
(7,466 missing values generated)
(9,615 real changes made)
(4,909 real changes made)
(7,528 real changes made, 7,528 to missing)
(7,528 missing values generated)
(17,081 missing values generated)
(4,926 real changes made)
(4,627 real changes made)
(4,926 real changes made)
(4,627 real changes made)
(6,157 real changes made)
(17,081 missing values generated)
(4,926 real changes made)
(4,627 real changes made)
(9,553 real changes made)
(10,924 real changes made)
(7,528 missing values generated)
(9,553 real changes made)
(4,926 real changes made)
(7,531 real changes made, 7,531 to missing)
(7,531 missing values generated)
(17,081 missing values generated)
(4,867 real changes made)
(4,683 real changes made)
(4,867 real changes made)
(4,683 real changes made)
(6,099 real changes made)
(17,081 missing values generated)
(4,867 real changes made)
(4,683 real changes made)
(9,550 real changes made)
(10,982 real changes made)
(7,531 missing values generated)
(9,550 real changes made)
(4,867 real changes made)
(7,565 real changes made, 7,565 to missing)
(7,565 missing values generated)
(17,081 missing values generated)
(4,829 real changes made)
(4,687 real changes made)
(4,829 real changes made)
(4,687 real changes made)
(6,047 real changes made)
(17,081 missing values generated)
(4,829 real changes made)
(4,687 real changes made)
(9,516 real changes made)
(11,034 real changes made)
(7,565 missing values generated)
(9,516 real changes made)
(4,829 real changes made)
(7,511 real changes made, 7,511 to missing)
(7,511 missing values generated)
(17,081 missing values generated)
(4,941 real changes made)
(4,629 real changes made)
(4,941 real changes made)
(4,629 real changes made)
(6,148 real changes made)
(17,081 missing values generated)
(4,941 real changes made)
(4,629 real changes made)
(9,570 real changes made)
(10,933 real changes made)
(7,511 missing values generated)
(9,570 real changes made)
(4,941 real changes made)
(7,479 real changes made, 7,479 to missing)
(7,479 missing values generated)
(17,081 missing values generated)
(4,963 real changes made)
(4,639 real changes made)
(4,963 real changes made)
(4,639 real changes made)
(6,139 real changes made)
(17,081 missing values generated)
(4,963 real changes made)
(4,639 real changes made)
(9,602 real changes made)
(10,942 real changes made)
(7,479 missing values generated)
(9,602 real changes made)
(4,963 real changes made)
(7,566 real changes made, 7,566 to missing)
(7,566 missing values generated)
(17,081 missing values generated)
(4,933 real changes made)
(4,582 real changes made)
(4,933 real changes made)
(4,582 real changes made)
(6,084 real changes made)
(17,081 missing values generated)
(4,933 real changes made)
(4,582 real changes made)
(9,515 real changes made)
(10,997 real changes made)
(7,566 missing values generated)
(9,515 real changes made)
(4,933 real changes made)
(7,545 real changes made, 7,545 to missing)
(7,545 missing values generated)
(17,081 missing values generated)
(4,938 real changes made)
(4,598 real changes made)
(4,938 real changes made)
(4,598 real changes made)
(6,087 real changes made)
(17,081 missing values generated)
(4,938 real changes made)
(4,598 real changes made)
(9,536 real changes made)
(10,994 real changes made)
(7,545 missing values generated)
(9,536 real changes made)
(4,938 real changes made)
(7,542 real changes made, 7,542 to missing)
(7,542 missing values generated)
(17,081 missing values generated)
(4,935 real changes made)
(4,604 real changes made)
(4,935 real changes made)
(4,604 real changes made)
(6,003 real changes made)
(17,081 missing values generated)
(4,935 real changes made)
(4,604 real changes made)
(9,539 real changes made)
(11,078 real changes made)
(7,542 missing values generated)
(9,539 real changes made)
(4,935 real changes made)
(7,515 real changes made, 7,515 to missing)
(7,515 missing values generated)
(17,081 missing values generated)
(4,921 real changes made)
(4,645 real changes made)
(4,921 real changes made)
(4,645 real changes made)
(6,105 real changes made)
(17,081 missing values generated)
(4,921 real changes made)
(4,645 real changes made)
(9,566 real changes made)
(10,976 real changes made)
(7,515 missing values generated)
(9,566 real changes made)
(4,921 real changes made)
(7,477 real changes made, 7,477 to missing)
(7,477 missing values generated)
(17,081 missing values generated)
(4,934 real changes made)
(4,670 real changes made)
(4,934 real changes made)
(4,670 real changes made)
(6,068 real changes made)
(17,081 missing values generated)
(4,934 real changes made)
(4,670 real changes made)
(9,604 real changes made)
(11,013 real changes made)
(7,477 missing values generated)
(9,604 real changes made)
(4,934 real changes made)
(7,492 real changes made, 7,492 to missing)
(7,492 missing values generated)
(17,081 missing values generated)
(4,923 real changes made)
(4,666 real changes made)
(4,923 real changes made)
(4,666 real changes made)
(6,083 real changes made)
(17,081 missing values generated)
(4,923 real changes made)
(4,666 real changes made)
(9,589 real changes made)
(10,998 real changes made)
(7,492 missing values generated)
(9,589 real changes made)
(4,923 real changes made)
(7,544 real changes made, 7,544 to missing)
(7,544 missing values generated)
(17,081 missing values generated)
(4,922 real changes made)
(4,615 real changes made)
(4,922 real changes made)
(4,615 real changes made)
(6,083 real changes made)
(17,081 missing values generated)
(4,922 real changes made)
(4,615 real changes made)
(9,537 real changes made)
(10,998 real changes made)
(7,544 missing values generated)
(9,537 real changes made)
(4,922 real changes made)
(7,419 real changes made, 7,419 to missing)
(7,419 missing values generated)
(17,081 missing values generated)
(4,943 real changes made)
(4,719 real changes made)
(4,943 real changes made)
(4,719 real changes made)
(6,116 real changes made)
(17,081 missing values generated)
(4,943 real changes made)
(4,719 real changes made)
(9,662 real changes made)
(10,965 real changes made)
(7,419 missing values generated)
(9,662 real changes made)
(4,943 real changes made)
(7,527 real changes made, 7,527 to missing)
(7,527 missing values generated)
(17,081 missing values generated)
(4,950 real changes made)
(4,604 real changes made)
(4,950 real changes made)
(4,604 real changes made)
(6,011 real changes made)
(17,081 missing values generated)
(4,950 real changes made)
(4,604 real changes made)
(9,554 real changes made)
(11,070 real changes made)
(7,527 missing values generated)
(9,554 real changes made)
(4,950 real changes made)
(7,495 real changes made, 7,495 to missing)
(7,495 missing values generated)
(17,081 missing values generated)
(4,927 real changes made)
(4,659 real changes made)
(4,927 real changes made)
(4,659 real changes made)
(6,071 real changes made)
(17,081 missing values generated)
(4,927 real changes made)
(4,659 real changes made)
(9,586 real changes made)
(11,010 real changes made)
(7,495 missing values generated)
(9,586 real changes made)
(4,927 real changes made)
(7,480 real changes made, 7,480 to missing)
(7,480 missing values generated)
(17,081 missing values generated)
(4,904 real changes made)
(4,697 real changes made)
(4,904 real changes made)
(4,697 real changes made)
(6,023 real changes made)
(17,081 missing values generated)
(4,904 real changes made)
(4,697 real changes made)
(9,601 real changes made)
(11,058 real changes made)
(7,480 missing values generated)
(9,601 real changes made)
(4,904 real changes made)
(7,494 real changes made, 7,494 to missing)
(7,494 missing values generated)
(17,081 missing values generated)
(4,922 real changes made)
(4,665 real changes made)
(4,922 real changes made)
(4,665 real changes made)
(6,121 real changes made)
(17,081 missing values generated)
(4,922 real changes made)
(4,665 real changes made)
(9,587 real changes made)
(10,960 real changes made)
(7,494 missing values generated)
(9,587 real changes made)
(4,922 real changes made)
(7,628 real changes made, 7,628 to missing)
(7,628 missing values generated)
(17,081 missing values generated)
(4,856 real changes made)
(4,597 real changes made)
(4,856 real changes made)
(4,597 real changes made)
(6,006 real changes made)
(17,081 missing values generated)
(4,856 real changes made)
(4,597 real changes made)
(9,453 real changes made)
(11,075 real changes made)
(7,628 missing values generated)
(9,453 real changes made)
(4,856 real changes made)
(7,565 real changes made, 7,565 to missing)
(7,565 missing values generated)
(17,081 missing values generated)
(4,879 real changes made)
(4,637 real changes made)
(4,879 real changes made)
(4,637 real changes made)
(6,021 real changes made)
(17,081 missing values generated)
(4,879 real changes made)
(4,637 real changes made)
(9,516 real changes made)
(11,060 real changes made)
(7,565 missing values generated)
(9,516 real changes made)
(4,879 real changes made)
(7,509 real changes made, 7,509 to missing)
(7,509 missing values generated)
(17,081 missing values generated)
(4,875 real changes made)
(4,697 real changes made)
(4,875 real changes made)
(4,697 real changes made)
(6,003 real changes made)
(17,081 missing values generated)
(4,875 real changes made)
(4,697 real changes made)
(9,572 real changes made)
(11,078 real changes made)
(7,509 missing values generated)
(9,572 real changes made)
(4,875 real changes made)
(7,479 real changes made, 7,479 to missing)
(7,479 missing values generated)
(17,081 missing values generated)
(4,935 real changes made)
(4,667 real changes made)
(4,935 real changes made)
(4,667 real changes made)
(6,100 real changes made)
(17,081 missing values generated)
(4,935 real changes made)
(4,667 real changes made)
(9,602 real changes made)
(10,981 real changes made)
(7,479 missing values generated)
(9,602 real changes made)
(4,935 real changes made)
(7,486 real changes made, 7,486 to missing)
(7,486 missing values generated)
(17,081 missing values generated)
(4,900 real changes made)
(4,695 real changes made)
(4,900 real changes made)
(4,695 real changes made)
(6,124 real changes made)
(17,081 missing values generated)
(4,900 real changes made)
(4,695 real changes made)
(9,595 real changes made)
(10,957 real changes made)
(7,486 missing values generated)
(9,595 real changes made)
(4,900 real changes made)
(7,481 real changes made, 7,481 to missing)
(7,481 missing values generated)
(17,081 missing values generated)
(4,951 real changes made)
(4,649 real changes made)
(4,951 real changes made)
(4,649 real changes made)
(6,157 real changes made)
(17,081 missing values generated)
(4,951 real changes made)
(4,649 real changes made)
(9,600 real changes made)
(10,924 real changes made)
(7,481 missing values generated)
(9,600 real changes made)
(4,951 real changes made)
(7,460 real changes made, 7,460 to missing)
(7,460 missing values generated)
(17,081 missing values generated)
(4,939 real changes made)
(4,682 real changes made)
(4,939 real changes made)
(4,682 real changes made)
(6,037 real changes made)
(17,081 missing values generated)
(4,939 real changes made)
(4,682 real changes made)
(9,621 real changes made)
(11,044 real changes made)
(7,460 missing values generated)
(9,621 real changes made)
(4,939 real changes made)
(7,409 real changes made, 7,409 to missing)
(7,409 missing values generated)
(17,081 missing values generated)
(4,974 real changes made)
(4,698 real changes made)
(4,974 real changes made)
(4,698 real changes made)
(6,170 real changes made)
(17,081 missing values generated)
(4,974 real changes made)
(4,698 real changes made)
(9,672 real changes made)
(10,911 real changes made)
(7,409 missing values generated)
(9,672 real changes made)
(4,974 real changes made)
(7,495 real changes made, 7,495 to missing)
(7,495 missing values generated)
(17,081 missing values generated)
(4,936 real changes made)
(4,650 real changes made)
(4,936 real changes made)
(4,650 real changes made)
(6,013 real changes made)
(17,081 missing values generated)
(4,936 real changes made)
(4,650 real changes made)
(9,586 real changes made)
(11,068 real changes made)
(7,495 missing values generated)
(9,586 real changes made)
(4,936 real changes made)
(7,506 real changes made, 7,506 to missing)
(7,506 missing values generated)
(17,081 missing values generated)
(4,930 real changes made)
(4,645 real changes made)
(4,930 real changes made)
(4,645 real changes made)
(6,039 real changes made)
(17,081 missing values generated)
(4,930 real changes made)
(4,645 real changes made)
(9,575 real changes made)
(11,042 real changes made)
(7,506 missing values generated)
(9,575 real changes made)
(4,930 real changes made)
(7,595 real changes made, 7,595 to missing)
(7,595 missing values generated)
(17,081 missing values generated)
(4,943 real changes made)
(4,543 real changes made)
(4,943 real changes made)
(4,543 real changes made)
(6,007 real changes made)
(17,081 missing values generated)
(4,943 real changes made)
(4,543 real changes made)
(9,486 real changes made)
(11,074 real changes made)
(7,595 missing values generated)
(9,486 real changes made)
(4,943 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(17,081 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr20
> 22 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if covid_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(350 real changes made)
(353 real changes made)
(314 real changes made)
(347 real changes made)
(344 real changes made)
(347 real changes made)
(320 real changes made)
(302 real changes made)
(288 real changes made)
(302 real changes made)
(326 real changes made)
(315 real changes made)
(259 real changes made)
(310 real changes made)
(281 real changes made)
(295 real changes made)
(311 real changes made)
(270 real changes made)
(299 real changes made)
(288 real changes made)
(301 real changes made)
(274 real changes made)
(275 real changes made)
(260 real changes made)
(236 real changes made)
(264 real changes made)
(240 real changes made)
(266 real changes made)
(255 real changes made)
(280 real changes made)
(236 real changes made)
(250 real changes made)
(255 real changes made)

. drop if baseline_egfr <15
(0 observations deleted)

. drop baseline_egfr

. drop covid_date_string

. 
. * COVID-19 death
. drop if deceased==1
(1,743 observations deleted)

. drop deceased

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. export delimited using "./output/covid_matching_2017.csv", replace
(note: file ./output/covid_matching_2017.csv not found)
file ./output/covid_matching_2017.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2017.log
  log type:  text
 closed on:  24 Jan 2023, 17:45:16
-------------------------------------------------------------------------------
