------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/covid_matching.log
  log type:  text
 opened on:  17 Oct 2022, 00:44:01

. clear

. 
. import delimited ./output/input_covid_community_matching.csv, delimiter(comma) varnames(1) case(preserve) 
(encoding automatically selected: ISO-8859-2)
(47 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,643 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosis
. drop if has_follow_up==0
(1,974 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,838 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,764 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,662 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb2020, 20, 3000)
(14,313 real changes made, 14,313 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,313 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,119 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.7 if male==0
(9,095 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.9 if male==1
(8,711 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.329  if male==0
(9,095 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.411  if male==1
(8,711 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb2020<1
(11,248 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,119 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.7 if male==0
(9,095 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.9 if male==1
(8,711 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.209
(17,806 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb2020>1
(20,871 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_baseline_creatinine_feb2020*141
(14,313 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(0.993^age)
(17,806 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1.018 if male==0
(9,095 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine updated monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(17,768 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(17,768 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(6,317 real changes made, 6,317 to missing)
(6,317 missing values generated)
(14,351 missing values generated)
(4,091 real changes made)
(3,943 real changes made)
(4,091 real changes made)
(3,943 real changes made)
(5,082 real changes made)
(14,351 missing values generated)
(4,091 real changes made)
(3,943 real changes made)
(8,034 real changes made)
(9,269 real changes made)
(6,317 missing values generated)
(8,034 real changes made)
(4,091 real changes made)
(6,219 real changes made, 6,219 to missing)
(6,219 missing values generated)
(14,351 missing values generated)
(4,126 real changes made)
(4,006 real changes made)
(4,126 real changes made)
(4,006 real changes made)
(5,161 real changes made)
(14,351 missing values generated)
(4,126 real changes made)
(4,006 real changes made)
(8,132 real changes made)
(9,190 real changes made)
(6,219 missing values generated)
(8,132 real changes made)
(4,126 real changes made)
(6,397 real changes made, 6,397 to missing)
(6,397 missing values generated)
(14,351 missing values generated)
(4,074 real changes made)
(3,880 real changes made)
(4,074 real changes made)
(3,880 real changes made)
(5,076 real changes made)
(14,351 missing values generated)
(4,074 real changes made)
(3,880 real changes made)
(7,954 real changes made)
(9,275 real changes made)
(6,397 missing values generated)
(7,954 real changes made)
(4,074 real changes made)
(6,343 real changes made, 6,343 to missing)
(6,343 missing values generated)
(14,351 missing values generated)
(4,116 real changes made)
(3,892 real changes made)
(4,116 real changes made)
(3,892 real changes made)
(5,072 real changes made)
(14,351 missing values generated)
(4,116 real changes made)
(3,892 real changes made)
(8,008 real changes made)
(9,279 real changes made)
(6,343 missing values generated)
(8,008 real changes made)
(4,116 real changes made)
(6,327 real changes made, 6,327 to missing)
(6,327 missing values generated)
(14,351 missing values generated)
(4,098 real changes made)
(3,926 real changes made)
(4,098 real changes made)
(3,926 real changes made)
(5,158 real changes made)
(14,351 missing values generated)
(4,098 real changes made)
(3,926 real changes made)
(8,024 real changes made)
(9,193 real changes made)
(6,327 missing values generated)
(8,024 real changes made)
(4,098 real changes made)
(6,344 real changes made, 6,344 to missing)
(6,344 missing values generated)
(14,351 missing values generated)
(4,142 real changes made)
(3,865 real changes made)
(4,142 real changes made)
(3,865 real changes made)
(5,019 real changes made)
(14,351 missing values generated)
(4,142 real changes made)
(3,865 real changes made)
(8,007 real changes made)
(9,332 real changes made)
(6,344 missing values generated)
(8,007 real changes made)
(4,142 real changes made)
(6,222 real changes made, 6,222 to missing)
(6,222 missing values generated)
(14,351 missing values generated)
(4,147 real changes made)
(3,982 real changes made)
(4,147 real changes made)
(3,982 real changes made)
(5,171 real changes made)
(14,351 missing values generated)
(4,147 real changes made)
(3,982 real changes made)
(8,129 real changes made)
(9,180 real changes made)
(6,222 missing values generated)
(8,129 real changes made)
(4,147 real changes made)
(6,289 real changes made, 6,289 to missing)
(6,289 missing values generated)
(14,351 missing values generated)
(4,104 real changes made)
(3,958 real changes made)
(4,104 real changes made)
(3,958 real changes made)
(5,092 real changes made)
(14,351 missing values generated)
(4,104 real changes made)
(3,958 real changes made)
(8,062 real changes made)
(9,259 real changes made)
(6,289 missing values generated)
(8,062 real changes made)
(4,104 real changes made)
(6,362 real changes made, 6,362 to missing)
(6,362 missing values generated)
(14,351 missing values generated)
(4,062 real changes made)
(3,927 real changes made)
(4,062 real changes made)
(3,927 real changes made)
(5,107 real changes made)
(14,351 missing values generated)
(4,062 real changes made)
(3,927 real changes made)
(7,989 real changes made)
(9,244 real changes made)
(6,362 missing values generated)
(7,989 real changes made)
(4,062 real changes made)
(6,221 real changes made, 6,221 to missing)
(6,221 missing values generated)
(14,351 missing values generated)
(4,116 real changes made)
(4,014 real changes made)
(4,116 real changes made)
(4,014 real changes made)
(5,146 real changes made)
(14,351 missing values generated)
(4,116 real changes made)
(4,014 real changes made)
(8,130 real changes made)
(9,205 real changes made)
(6,221 missing values generated)
(8,130 real changes made)
(4,116 real changes made)
(6,311 real changes made, 6,311 to missing)
(6,311 missing values generated)
(14,351 missing values generated)
(4,096 real changes made)
(3,944 real changes made)
(4,096 real changes made)
(3,944 real changes made)
(5,052 real changes made)
(14,351 missing values generated)
(4,096 real changes made)
(3,944 real changes made)
(8,040 real changes made)
(9,299 real changes made)
(6,311 missing values generated)
(8,040 real changes made)
(4,096 real changes made)
(6,330 real changes made, 6,330 to missing)
(6,330 missing values generated)
(14,351 missing values generated)
(4,076 real changes made)
(3,945 real changes made)
(4,076 real changes made)
(3,945 real changes made)
(5,074 real changes made)
(14,351 missing values generated)
(4,076 real changes made)
(3,945 real changes made)
(8,021 real changes made)
(9,277 real changes made)
(6,330 missing values generated)
(8,021 real changes made)
(4,076 real changes made)
(6,228 real changes made, 6,228 to missing)
(6,228 missing values generated)
(14,351 missing values generated)
(4,133 real changes made)
(3,990 real changes made)
(4,133 real changes made)
(3,990 real changes made)
(5,145 real changes made)
(14,351 missing values generated)
(4,133 real changes made)
(3,990 real changes made)
(8,123 real changes made)
(9,206 real changes made)
(6,228 missing values generated)
(8,123 real changes made)
(4,133 real changes made)
(6,342 real changes made, 6,342 to missing)
(6,342 missing values generated)
(14,351 missing values generated)
(4,068 real changes made)
(3,941 real changes made)
(4,068 real changes made)
(3,941 real changes made)
(5,006 real changes made)
(14,351 missing values generated)
(4,068 real changes made)
(3,941 real changes made)
(8,009 real changes made)
(9,345 real changes made)
(6,342 missing values generated)
(8,009 real changes made)
(4,068 real changes made)
(6,327 real changes made, 6,327 to missing)
(6,327 missing values generated)
(14,351 missing values generated)
(4,067 real changes made)
(3,957 real changes made)
(4,067 real changes made)
(3,957 real changes made)
(5,100 real changes made)
(14,351 missing values generated)
(4,067 real changes made)
(3,957 real changes made)
(8,024 real changes made)
(9,251 real changes made)
(6,327 missing values generated)
(8,024 real changes made)
(4,067 real changes made)
(6,348 real changes made, 6,348 to missing)
(6,348 missing values generated)
(14,351 missing values generated)
(4,104 real changes made)
(3,899 real changes made)
(4,104 real changes made)
(3,899 real changes made)
(5,068 real changes made)
(14,351 missing values generated)
(4,104 real changes made)
(3,899 real changes made)
(8,003 real changes made)
(9,283 real changes made)
(6,348 missing values generated)
(8,003 real changes made)
(4,104 real changes made)
(6,366 real changes made, 6,366 to missing)
(6,366 missing values generated)
(14,351 missing values generated)
(4,077 real changes made)
(3,908 real changes made)
(4,077 real changes made)
(3,908 real changes made)
(5,111 real changes made)
(14,351 missing values generated)
(4,077 real changes made)
(3,908 real changes made)
(7,985 real changes made)
(9,240 real changes made)
(6,366 missing values generated)
(7,985 real changes made)
(4,077 real changes made)
(6,274 real changes made, 6,274 to missing)
(6,274 missing values generated)
(14,351 missing values generated)
(4,116 real changes made)
(3,961 real changes made)
(4,116 real changes made)
(3,961 real changes made)
(5,107 real changes made)
(14,351 missing values generated)
(4,116 real changes made)
(3,961 real changes made)
(8,077 real changes made)
(9,244 real changes made)
(6,274 missing values generated)
(8,077 real changes made)
(4,116 real changes made)
(6,347 real changes made, 6,347 to missing)
(6,347 missing values generated)
(14,351 missing values generated)
(4,083 real changes made)
(3,921 real changes made)
(4,083 real changes made)
(3,921 real changes made)
(5,056 real changes made)
(14,351 missing values generated)
(4,083 real changes made)
(3,921 real changes made)
(8,004 real changes made)
(9,295 real changes made)
(6,347 missing values generated)
(8,004 real changes made)
(4,083 real changes made)
(6,298 real changes made, 6,298 to missing)
(6,298 missing values generated)
(14,351 missing values generated)
(4,117 real changes made)
(3,936 real changes made)
(4,117 real changes made)
(3,936 real changes made)
(5,132 real changes made)
(14,351 missing values generated)
(4,117 real changes made)
(3,936 real changes made)
(8,053 real changes made)
(9,219 real changes made)
(6,298 missing values generated)
(8,053 real changes made)
(4,117 real changes made)
(6,369 real changes made, 6,369 to missing)
(6,369 missing values generated)
(14,351 missing values generated)
(4,072 real changes made)
(3,910 real changes made)
(4,072 real changes made)
(3,910 real changes made)
(5,097 real changes made)
(14,351 missing values generated)
(4,072 real changes made)
(3,910 real changes made)
(7,982 real changes made)
(9,254 real changes made)
(6,369 missing values generated)
(7,982 real changes made)
(4,072 real changes made)
(6,319 real changes made, 6,319 to missing)
(6,319 missing values generated)
(14,351 missing values generated)
(4,054 real changes made)
(3,978 real changes made)
(4,054 real changes made)
(3,978 real changes made)
(5,112 real changes made)
(14,351 missing values generated)
(4,054 real changes made)
(3,978 real changes made)
(8,032 real changes made)
(9,239 real changes made)
(6,319 missing values generated)
(8,032 real changes made)
(4,054 real changes made)
(6,407 real changes made, 6,407 to missing)
(6,407 missing values generated)
(14,351 missing values generated)
(3,967 real changes made)
(3,977 real changes made)
(3,967 real changes made)
(3,977 real changes made)
(5,024 real changes made)
(14,351 missing values generated)
(3,967 real changes made)
(3,977 real changes made)
(7,944 real changes made)
(9,327 real changes made)
(6,407 missing values generated)
(7,944 real changes made)
(3,967 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(14,351 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. drop if baseline_egfr <15
  4. drop egfr_baseline_creatinine_`x'
  5. }
(332 real changes made)
(0 observations deleted)
(380 real changes made)
(0 observations deleted)
(359 real changes made)
(0 observations deleted)
(394 real changes made)
(0 observations deleted)
(373 real changes made)
(0 observations deleted)
(361 real changes made)
(0 observations deleted)
(326 real changes made)
(0 observations deleted)
(335 real changes made)
(0 observations deleted)
(326 real changes made)
(0 observations deleted)
(322 real changes made)
(0 observations deleted)
(353 real changes made)
(0 observations deleted)
(343 real changes made)
(0 observations deleted)
(321 real changes made)
(0 observations deleted)
(333 real changes made)
(0 observations deleted)
(288 real changes made)
(0 observations deleted)
(373 real changes made)
(0 observations deleted)
(306 real changes made)
(0 observations deleted)
(353 real changes made)
(0 observations deleted)
(297 real changes made)
(0 observations deleted)
(308 real changes made)
(0 observations deleted)
(294 real changes made)
(0 observations deleted)
(288 real changes made)
(0 observations deleted)
(306 real changes made)
(0 observations deleted)
(272 real changes made)
(0 observations deleted)

. drop baseline_egfr

. drop covid_month

. drop covid_date_string

. drop age

. 
. * COVID-19 death
. drop if deceased==1
(1,420 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. export delimited using "./output/covid_community_matching.csv", replace
(file ./output/covid_community_matching.csv not found)
file ./output/covid_community_matching.csv saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/covid_matching.log
  log type:  text
 closed on:  17 Oct 2022, 00:44:04
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
