-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2017.log
  log type:  text
 opened on:  12 May 2023, 09:04:31

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames
> (1) case(preserve) 
(53 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,546 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,968 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,863 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,795 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,700 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,257 real changes made, 14,257 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,257 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,128 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,123 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,748 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,123 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,748 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,337 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,128 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,123 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,748 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(17,871 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,791 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,257 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(17,871 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,123 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(16,252 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(16,252 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 ///
>                                                                              
>                    baseline_creatinine_oct2022     {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(6,930 real changes made, 6,930 to missing)
(6,930 missing values generated)
(15,876 missing values generated)
(4,538 real changes made)
(4,408 real changes made)
(4,538 real changes made)
(4,408 real changes made)
(5,694 real changes made)
(15,876 missing values generated)
(4,538 real changes made)
(4,408 real changes made)
(8,946 real changes made)
(10,182 real changes made)
(6,930 missing values generated)
(8,946 real changes made)
(4,538 real changes made)
(7,006 real changes made, 7,006 to missing)
(7,006 missing values generated)
(15,876 missing values generated)
(4,536 real changes made)
(4,334 real changes made)
(4,536 real changes made)
(4,334 real changes made)
(5,620 real changes made)
(15,876 missing values generated)
(4,536 real changes made)
(4,334 real changes made)
(8,870 real changes made)
(10,256 real changes made)
(7,006 missing values generated)
(8,870 real changes made)
(4,536 real changes made)
(7,055 real changes made, 7,055 to missing)
(7,055 missing values generated)
(15,876 missing values generated)
(4,463 real changes made)
(4,358 real changes made)
(4,463 real changes made)
(4,358 real changes made)
(5,635 real changes made)
(15,876 missing values generated)
(4,463 real changes made)
(4,358 real changes made)
(8,821 real changes made)
(10,241 real changes made)
(7,055 missing values generated)
(8,821 real changes made)
(4,463 real changes made)
(6,948 real changes made, 6,948 to missing)
(6,948 missing values generated)
(15,876 missing values generated)
(4,597 real changes made)
(4,331 real changes made)
(4,597 real changes made)
(4,331 real changes made)
(5,605 real changes made)
(15,876 missing values generated)
(4,597 real changes made)
(4,331 real changes made)
(8,928 real changes made)
(10,271 real changes made)
(6,948 missing values generated)
(8,928 real changes made)
(4,597 real changes made)
(7,004 real changes made, 7,004 to missing)
(7,004 missing values generated)
(15,876 missing values generated)
(4,519 real changes made)
(4,353 real changes made)
(4,519 real changes made)
(4,353 real changes made)
(5,651 real changes made)
(15,876 missing values generated)
(4,519 real changes made)
(4,353 real changes made)
(8,872 real changes made)
(10,225 real changes made)
(7,004 missing values generated)
(8,872 real changes made)
(4,519 real changes made)
(6,972 real changes made, 6,972 to missing)
(6,972 missing values generated)
(15,876 missing values generated)
(4,529 real changes made)
(4,375 real changes made)
(4,529 real changes made)
(4,375 real changes made)
(5,595 real changes made)
(15,876 missing values generated)
(4,529 real changes made)
(4,375 real changes made)
(8,904 real changes made)
(10,281 real changes made)
(6,972 missing values generated)
(8,904 real changes made)
(4,529 real changes made)
(7,035 real changes made, 7,035 to missing)
(7,035 missing values generated)
(15,876 missing values generated)
(4,492 real changes made)
(4,349 real changes made)
(4,492 real changes made)
(4,349 real changes made)
(5,606 real changes made)
(15,876 missing values generated)
(4,492 real changes made)
(4,349 real changes made)
(8,841 real changes made)
(10,270 real changes made)
(7,035 missing values generated)
(8,841 real changes made)
(4,492 real changes made)
(6,939 real changes made, 6,939 to missing)
(6,939 missing values generated)
(15,876 missing values generated)
(4,511 real changes made)
(4,426 real changes made)
(4,511 real changes made)
(4,426 real changes made)
(5,716 real changes made)
(15,876 missing values generated)
(4,511 real changes made)
(4,426 real changes made)
(8,937 real changes made)
(10,160 real changes made)
(6,939 missing values generated)
(8,937 real changes made)
(4,511 real changes made)
(6,971 real changes made, 6,971 to missing)
(6,971 missing values generated)
(15,876 missing values generated)
(4,590 real changes made)
(4,315 real changes made)
(4,590 real changes made)
(4,315 real changes made)
(5,683 real changes made)
(15,876 missing values generated)
(4,590 real changes made)
(4,315 real changes made)
(8,905 real changes made)
(10,193 real changes made)
(6,971 missing values generated)
(8,905 real changes made)
(4,590 real changes made)
(6,969 real changes made, 6,969 to missing)
(6,969 missing values generated)
(15,876 missing values generated)
(4,557 real changes made)
(4,350 real changes made)
(4,557 real changes made)
(4,350 real changes made)
(5,733 real changes made)
(15,876 missing values generated)
(4,557 real changes made)
(4,350 real changes made)
(8,907 real changes made)
(10,143 real changes made)
(6,969 missing values generated)
(8,907 real changes made)
(4,557 real changes made)
(6,967 real changes made, 6,967 to missing)
(6,967 missing values generated)
(15,876 missing values generated)
(4,559 real changes made)
(4,350 real changes made)
(4,559 real changes made)
(4,350 real changes made)
(5,659 real changes made)
(15,876 missing values generated)
(4,559 real changes made)
(4,350 real changes made)
(8,909 real changes made)
(10,217 real changes made)
(6,967 missing values generated)
(8,909 real changes made)
(4,559 real changes made)
(6,999 real changes made, 6,999 to missing)
(6,999 missing values generated)
(15,876 missing values generated)
(4,551 real changes made)
(4,326 real changes made)
(4,551 real changes made)
(4,326 real changes made)
(5,654 real changes made)
(15,876 missing values generated)
(4,551 real changes made)
(4,326 real changes made)
(8,877 real changes made)
(10,222 real changes made)
(6,999 missing values generated)
(8,877 real changes made)
(4,551 real changes made)
(6,929 real changes made, 6,929 to missing)
(6,929 missing values generated)
(15,876 missing values generated)
(4,576 real changes made)
(4,371 real changes made)
(4,576 real changes made)
(4,371 real changes made)
(5,708 real changes made)
(15,876 missing values generated)
(4,576 real changes made)
(4,371 real changes made)
(8,947 real changes made)
(10,168 real changes made)
(6,929 missing values generated)
(8,947 real changes made)
(4,576 real changes made)
(6,984 real changes made, 6,984 to missing)
(6,984 missing values generated)
(15,876 missing values generated)
(4,568 real changes made)
(4,324 real changes made)
(4,568 real changes made)
(4,324 real changes made)
(5,588 real changes made)
(15,876 missing values generated)
(4,568 real changes made)
(4,324 real changes made)
(8,892 real changes made)
(10,288 real changes made)
(6,984 missing values generated)
(8,892 real changes made)
(4,568 real changes made)
(6,964 real changes made, 6,964 to missing)
(6,964 missing values generated)
(15,876 missing values generated)
(4,570 real changes made)
(4,342 real changes made)
(4,570 real changes made)
(4,342 real changes made)
(5,688 real changes made)
(15,876 missing values generated)
(4,570 real changes made)
(4,342 real changes made)
(8,912 real changes made)
(10,188 real changes made)
(6,964 missing values generated)
(8,912 real changes made)
(4,570 real changes made)
(7,043 real changes made, 7,043 to missing)
(7,043 missing values generated)
(15,876 missing values generated)
(4,549 real changes made)
(4,284 real changes made)
(4,549 real changes made)
(4,284 real changes made)
(5,608 real changes made)
(15,876 missing values generated)
(4,549 real changes made)
(4,284 real changes made)
(8,833 real changes made)
(10,268 real changes made)
(7,043 missing values generated)
(8,833 real changes made)
(4,549 real changes made)
(6,995 real changes made, 6,995 to missing)
(6,995 missing values generated)
(15,876 missing values generated)
(4,488 real changes made)
(4,393 real changes made)
(4,488 real changes made)
(4,393 real changes made)
(5,617 real changes made)
(15,876 missing values generated)
(4,488 real changes made)
(4,393 real changes made)
(8,881 real changes made)
(10,259 real changes made)
(6,995 missing values generated)
(8,881 real changes made)
(4,488 real changes made)
(6,984 real changes made, 6,984 to missing)
(6,984 missing values generated)
(15,876 missing values generated)
(4,550 real changes made)
(4,342 real changes made)
(4,550 real changes made)
(4,342 real changes made)
(5,665 real changes made)
(15,876 missing values generated)
(4,550 real changes made)
(4,342 real changes made)
(8,892 real changes made)
(10,211 real changes made)
(6,984 missing values generated)
(8,892 real changes made)
(4,550 real changes made)
(6,938 real changes made, 6,938 to missing)
(6,938 missing values generated)
(15,876 missing values generated)
(4,557 real changes made)
(4,381 real changes made)
(4,557 real changes made)
(4,381 real changes made)
(5,739 real changes made)
(15,876 missing values generated)
(4,557 real changes made)
(4,381 real changes made)
(8,938 real changes made)
(10,137 real changes made)
(6,938 missing values generated)
(8,938 real changes made)
(4,557 real changes made)
(6,997 real changes made, 6,997 to missing)
(6,997 missing values generated)
(15,876 missing values generated)
(4,510 real changes made)
(4,369 real changes made)
(4,510 real changes made)
(4,369 real changes made)
(5,631 real changes made)
(15,876 missing values generated)
(4,510 real changes made)
(4,369 real changes made)
(8,879 real changes made)
(10,245 real changes made)
(6,997 missing values generated)
(8,879 real changes made)
(4,510 real changes made)
(7,049 real changes made, 7,049 to missing)
(7,049 missing values generated)
(15,876 missing values generated)
(4,513 real changes made)
(4,314 real changes made)
(4,513 real changes made)
(4,314 real changes made)
(5,546 real changes made)
(15,876 missing values generated)
(4,513 real changes made)
(4,314 real changes made)
(8,827 real changes made)
(10,330 real changes made)
(7,049 missing values generated)
(8,827 real changes made)
(4,513 real changes made)
(6,886 real changes made, 6,886 to missing)
(6,886 missing values generated)
(15,876 missing values generated)
(4,626 real changes made)
(4,364 real changes made)
(4,626 real changes made)
(4,364 real changes made)
(5,791 real changes made)
(15,876 missing values generated)
(4,626 real changes made)
(4,364 real changes made)
(8,990 real changes made)
(10,085 real changes made)
(6,886 missing values generated)
(8,990 real changes made)
(4,626 real changes made)
(7,061 real changes made, 7,061 to missing)
(7,061 missing values generated)
(15,876 missing values generated)
(4,461 real changes made)
(4,354 real changes made)
(4,461 real changes made)
(4,354 real changes made)
(5,511 real changes made)
(15,876 missing values generated)
(4,461 real changes made)
(4,354 real changes made)
(8,815 real changes made)
(10,365 real changes made)
(7,061 missing values generated)
(8,815 real changes made)
(4,461 real changes made)
(6,961 real changes made, 6,961 to missing)
(6,961 missing values generated)
(15,876 missing values generated)
(4,563 real changes made)
(4,352 real changes made)
(4,563 real changes made)
(4,352 real changes made)
(5,623 real changes made)
(15,876 missing values generated)
(4,563 real changes made)
(4,352 real changes made)
(8,915 real changes made)
(10,253 real changes made)
(6,961 missing values generated)
(8,915 real changes made)
(4,563 real changes made)
(7,001 real changes made, 7,001 to missing)
(7,001 missing values generated)
(15,876 missing values generated)
(4,628 real changes made)
(4,247 real changes made)
(4,628 real changes made)
(4,247 real changes made)
(5,663 real changes made)
(15,876 missing values generated)
(4,628 real changes made)
(4,247 real changes made)
(8,875 real changes made)
(10,213 real changes made)
(7,001 missing values generated)
(8,875 real changes made)
(4,628 real changes made)
(7,021 real changes made, 7,021 to missing)
(7,021 missing values generated)
(15,876 missing values generated)
(4,522 real changes made)
(4,333 real changes made)
(4,522 real changes made)
(4,333 real changes made)
(5,707 real changes made)
(15,876 missing values generated)
(4,522 real changes made)
(4,333 real changes made)
(8,855 real changes made)
(10,169 real changes made)
(7,021 missing values generated)
(8,855 real changes made)
(4,522 real changes made)
(6,955 real changes made, 6,955 to missing)
(6,955 missing values generated)
(15,876 missing values generated)
(4,520 real changes made)
(4,401 real changes made)
(4,520 real changes made)
(4,401 real changes made)
(5,629 real changes made)
(15,876 missing values generated)
(4,520 real changes made)
(4,401 real changes made)
(8,921 real changes made)
(10,247 real changes made)
(6,955 missing values generated)
(8,921 real changes made)
(4,520 real changes made)
(7,012 real changes made, 7,012 to missing)
(7,012 missing values generated)
(15,876 missing values generated)
(4,558 real changes made)
(4,306 real changes made)
(4,558 real changes made)
(4,306 real changes made)
(5,638 real changes made)
(15,876 missing values generated)
(4,558 real changes made)
(4,306 real changes made)
(8,864 real changes made)
(10,238 real changes made)
(7,012 missing values generated)
(8,864 real changes made)
(4,558 real changes made)
(7,004 real changes made, 7,004 to missing)
(7,004 missing values generated)
(15,876 missing values generated)
(4,599 real changes made)
(4,273 real changes made)
(4,599 real changes made)
(4,273 real changes made)
(5,585 real changes made)
(15,876 missing values generated)
(4,599 real changes made)
(4,273 real changes made)
(8,872 real changes made)
(10,291 real changes made)
(7,004 missing values generated)
(8,872 real changes made)
(4,599 real changes made)
(6,956 real changes made, 6,956 to missing)
(6,956 missing values generated)
(15,876 missing values generated)
(4,562 real changes made)
(4,358 real changes made)
(4,562 real changes made)
(4,358 real changes made)
(5,636 real changes made)
(15,876 missing values generated)
(4,562 real changes made)
(4,358 real changes made)
(8,920 real changes made)
(10,240 real changes made)
(6,956 missing values generated)
(8,920 real changes made)
(4,562 real changes made)
(7,006 real changes made, 7,006 to missing)
(7,006 missing values generated)
(15,876 missing values generated)
(4,541 real changes made)
(4,329 real changes made)
(4,541 real changes made)
(4,329 real changes made)
(5,636 real changes made)
(15,876 missing values generated)
(4,541 real changes made)
(4,329 real changes made)
(8,870 real changes made)
(10,240 real changes made)
(7,006 missing values generated)
(8,870 real changes made)
(4,541 real changes made)
(7,053 real changes made, 7,053 to missing)
(7,053 missing values generated)
(15,876 missing values generated)
(4,487 real changes made)
(4,336 real changes made)
(4,487 real changes made)
(4,336 real changes made)
(5,530 real changes made)
(15,876 missing values generated)
(4,487 real changes made)
(4,336 real changes made)
(8,823 real changes made)
(10,346 real changes made)
(7,053 missing values generated)
(8,823 real changes made)
(4,487 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(15,876 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr20
> 22 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if covid_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(329 real changes made)
(322 real changes made)
(296 real changes made)
(337 real changes made)
(308 real changes made)
(328 real changes made)
(292 real changes made)
(300 real changes made)
(303 real changes made)
(286 real changes made)
(293 real changes made)
(297 real changes made)
(236 real changes made)
(304 real changes made)
(278 real changes made)
(275 real changes made)
(268 real changes made)
(261 real changes made)
(241 real changes made)
(264 real changes made)
(246 real changes made)
(250 real changes made)
(257 real changes made)
(280 real changes made)
(236 real changes made)
(228 real changes made)
(240 real changes made)
(252 real changes made)
(217 real changes made)
(266 real changes made)
(213 real changes made)
(219 real changes made)
(217 real changes made)

. drop if baseline_egfr <15
(0 observations deleted)

. drop baseline_egfr

. drop covid_date_string

. 
. * COVID-19 death
. drop if deceased==1
(1,580 observations deleted)

. drop deceased

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. export delimited using "./output/covid_matching_2017.csv", replace
(note: file ./output/covid_matching_2017.csv not found)
file ./output/covid_matching_2017.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2017.log
  log type:  text
 closed on:  12 May 2023, 09:04:35
-------------------------------------------------------------------------------
