-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_northeast_matching.log
  log type:  text
 opened on:  19 Aug 2022, 12:07:54

. clear

. 
. import delimited ./output/input_covid_northeast_matching.csv, delimiter(comma
> ) varnames(1) case(preserve) 
(41 vars, 1,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(188 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(37 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(38 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(35 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(36 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(277 real changes made, 277 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(277 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(666 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(200 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(189 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(200 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(189 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(246 real changes made)

. gen max_baseline_creatinine_feb2020=.
(666 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(200 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(189 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(389 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(420 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(277 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(389 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(200 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(349 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(349 observations deleted)

. drop covid_diagnosis_date

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(154 real changes made, 154 to missing)
(154 missing values generated)
(317 missing values generated)
(79 real changes made)
(84 real changes made)
(79 real changes made)
(84 real changes made)
(97 real changes made)
(317 missing values generated)
(79 real changes made)
(84 real changes made)
(163 real changes made)
(220 real changes made)
(154 missing values generated)
(163 real changes made)
(79 real changes made)
(144 real changes made, 144 to missing)
(144 missing values generated)
(317 missing values generated)
(89 real changes made)
(84 real changes made)
(89 real changes made)
(84 real changes made)
(109 real changes made)
(317 missing values generated)
(89 real changes made)
(84 real changes made)
(173 real changes made)
(208 real changes made)
(144 missing values generated)
(173 real changes made)
(89 real changes made)
(133 real changes made, 133 to missing)
(133 missing values generated)
(317 missing values generated)
(104 real changes made)
(80 real changes made)
(104 real changes made)
(80 real changes made)
(123 real changes made)
(317 missing values generated)
(104 real changes made)
(80 real changes made)
(184 real changes made)
(194 real changes made)
(133 missing values generated)
(184 real changes made)
(104 real changes made)
(145 real changes made, 145 to missing)
(145 missing values generated)
(317 missing values generated)
(84 real changes made)
(88 real changes made)
(84 real changes made)
(88 real changes made)
(114 real changes made)
(317 missing values generated)
(84 real changes made)
(88 real changes made)
(172 real changes made)
(203 real changes made)
(145 missing values generated)
(172 real changes made)
(84 real changes made)
(136 real changes made, 136 to missing)
(136 missing values generated)
(317 missing values generated)
(87 real changes made)
(94 real changes made)
(87 real changes made)
(94 real changes made)
(102 real changes made)
(317 missing values generated)
(87 real changes made)
(94 real changes made)
(181 real changes made)
(215 real changes made)
(136 missing values generated)
(181 real changes made)
(87 real changes made)
(138 real changes made, 138 to missing)
(138 missing values generated)
(317 missing values generated)
(91 real changes made)
(88 real changes made)
(91 real changes made)
(88 real changes made)
(122 real changes made)
(317 missing values generated)
(91 real changes made)
(88 real changes made)
(179 real changes made)
(195 real changes made)
(138 missing values generated)
(179 real changes made)
(91 real changes made)
(127 real changes made, 127 to missing)
(127 missing values generated)
(317 missing values generated)
(103 real changes made)
(87 real changes made)
(103 real changes made)
(87 real changes made)
(124 real changes made)
(317 missing values generated)
(103 real changes made)
(87 real changes made)
(190 real changes made)
(193 real changes made)
(127 missing values generated)
(190 real changes made)
(103 real changes made)
(140 real changes made, 140 to missing)
(140 missing values generated)
(317 missing values generated)
(83 real changes made)
(94 real changes made)
(83 real changes made)
(94 real changes made)
(118 real changes made)
(317 missing values generated)
(83 real changes made)
(94 real changes made)
(177 real changes made)
(199 real changes made)
(140 missing values generated)
(177 real changes made)
(83 real changes made)
(139 real changes made, 139 to missing)
(139 missing values generated)
(317 missing values generated)
(92 real changes made)
(86 real changes made)
(92 real changes made)
(86 real changes made)
(110 real changes made)
(317 missing values generated)
(92 real changes made)
(86 real changes made)
(178 real changes made)
(207 real changes made)
(139 missing values generated)
(178 real changes made)
(92 real changes made)
(122 real changes made, 122 to missing)
(122 missing values generated)
(317 missing values generated)
(94 real changes made)
(101 real changes made)
(94 real changes made)
(101 real changes made)
(122 real changes made)
(317 missing values generated)
(94 real changes made)
(101 real changes made)
(195 real changes made)
(195 real changes made)
(122 missing values generated)
(195 real changes made)
(94 real changes made)
(138 real changes made, 138 to missing)
(138 missing values generated)
(317 missing values generated)
(86 real changes made)
(93 real changes made)
(86 real changes made)
(93 real changes made)
(112 real changes made)
(317 missing values generated)
(86 real changes made)
(93 real changes made)
(179 real changes made)
(205 real changes made)
(138 missing values generated)
(179 real changes made)
(86 real changes made)
(138 real changes made, 138 to missing)
(138 missing values generated)
(317 missing values generated)
(98 real changes made)
(81 real changes made)
(98 real changes made)
(81 real changes made)
(117 real changes made)
(317 missing values generated)
(98 real changes made)
(81 real changes made)
(179 real changes made)
(200 real changes made)
(138 missing values generated)
(179 real changes made)
(98 real changes made)
(139 real changes made, 139 to missing)
(139 missing values generated)
(317 missing values generated)
(91 real changes made)
(87 real changes made)
(91 real changes made)
(87 real changes made)
(109 real changes made)
(317 missing values generated)
(91 real changes made)
(87 real changes made)
(178 real changes made)
(208 real changes made)
(139 missing values generated)
(178 real changes made)
(91 real changes made)
(131 real changes made, 131 to missing)
(131 missing values generated)
(317 missing values generated)
(86 real changes made)
(100 real changes made)
(86 real changes made)
(100 real changes made)
(117 real changes made)
(317 missing values generated)
(86 real changes made)
(100 real changes made)
(186 real changes made)
(200 real changes made)
(131 missing values generated)
(186 real changes made)
(86 real changes made)
(143 real changes made, 143 to missing)
(143 missing values generated)
(317 missing values generated)
(83 real changes made)
(91 real changes made)
(83 real changes made)
(91 real changes made)
(99 real changes made)
(317 missing values generated)
(83 real changes made)
(91 real changes made)
(174 real changes made)
(218 real changes made)
(143 missing values generated)
(174 real changes made)
(83 real changes made)
(138 real changes made, 138 to missing)
(138 missing values generated)
(317 missing values generated)
(93 real changes made)
(86 real changes made)
(93 real changes made)
(86 real changes made)
(114 real changes made)
(317 missing values generated)
(93 real changes made)
(86 real changes made)
(179 real changes made)
(203 real changes made)
(138 missing values generated)
(179 real changes made)
(93 real changes made)
(136 real changes made, 136 to missing)
(136 missing values generated)
(317 missing values generated)
(85 real changes made)
(96 real changes made)
(85 real changes made)
(96 real changes made)
(116 real changes made)
(317 missing values generated)
(85 real changes made)
(96 real changes made)
(181 real changes made)
(201 real changes made)
(136 missing values generated)
(181 real changes made)
(85 real changes made)
(129 real changes made, 129 to missing)
(129 missing values generated)
(317 missing values generated)
(99 real changes made)
(89 real changes made)
(99 real changes made)
(89 real changes made)
(116 real changes made)
(317 missing values generated)
(99 real changes made)
(89 real changes made)
(188 real changes made)
(201 real changes made)
(129 missing values generated)
(188 real changes made)
(99 real changes made)
(139 real changes made, 139 to missing)
(139 missing values generated)
(317 missing values generated)
(83 real changes made)
(95 real changes made)
(83 real changes made)
(95 real changes made)
(98 real changes made)
(317 missing values generated)
(83 real changes made)
(95 real changes made)
(178 real changes made)
(219 real changes made)
(139 missing values generated)
(178 real changes made)
(83 real changes made)
(136 real changes made, 136 to missing)
(136 missing values generated)
(317 missing values generated)
(95 real changes made)
(86 real changes made)
(95 real changes made)
(86 real changes made)
(108 real changes made)
(317 missing values generated)
(95 real changes made)
(86 real changes made)
(181 real changes made)
(209 real changes made)
(136 missing values generated)
(181 real changes made)
(95 real changes made)
(134 real changes made, 134 to missing)
(134 missing values generated)
(317 missing values generated)
(93 real changes made)
(90 real changes made)
(93 real changes made)
(90 real changes made)
(105 real changes made)
(317 missing values generated)
(93 real changes made)
(90 real changes made)
(183 real changes made)
(212 real changes made)
(134 missing values generated)
(183 real changes made)
(93 real changes made)
(145 real changes made, 145 to missing)
(145 missing values generated)
(317 missing values generated)
(80 real changes made)
(92 real changes made)
(80 real changes made)
(92 real changes made)
(112 real changes made)
(317 missing values generated)
(80 real changes made)
(92 real changes made)
(172 real changes made)
(205 real changes made)
(145 missing values generated)
(172 real changes made)
(80 real changes made)
(133 real changes made, 133 to missing)
(133 missing values generated)
(317 missing values generated)
(93 real changes made)
(91 real changes made)
(93 real changes made)
(91 real changes made)
(111 real changes made)
(317 missing values generated)
(93 real changes made)
(91 real changes made)
(184 real changes made)
(206 real changes made)
(133 missing values generated)
(184 real changes made)
(93 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(317 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. drop if baseline_egfr <15
  4. drop egfr_baseline_creatinine_`x'
  5. }
(10 real changes made)
(0 observations deleted)
(7 real changes made)
(0 observations deleted)
(7 real changes made)
(0 observations deleted)
(5 real changes made)
(0 observations deleted)
(3 real changes made)
(0 observations deleted)
(10 real changes made)
(0 observations deleted)
(9 real changes made)
(0 observations deleted)
(7 real changes made)
(0 observations deleted)
(9 real changes made)
(0 observations deleted)
(3 real changes made)
(0 observations deleted)
(13 real changes made)
(0 observations deleted)
(10 real changes made)
(0 observations deleted)
(8 real changes made)
(0 observations deleted)
(4 real changes made)
(0 observations deleted)
(10 real changes made)
(0 observations deleted)
(7 real changes made)
(0 observations deleted)
(3 real changes made)
(0 observations deleted)
(10 real changes made)
(0 observations deleted)
(5 real changes made)
(0 observations deleted)
(5 real changes made)
(0 observations deleted)
(9 real changes made)
(0 observations deleted)
(6 real changes made)
(0 observations deleted)
(6 real changes made)
(0 observations deleted)
(7 real changes made)
(0 observations deleted)

. drop baseline_egfr

. drop covid_month

. drop covid_date_string

. drop age

. 
. * COVID-19 death
. drop if deceased==1
(43 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. replace imd = imd + 1
(274 real changes made)

. drop imd_o

. recode imd 5=1 4=2 3=3 2=4 1=5 .=.
(imd: 195 changes made)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" 

. label values imd imd

. label var imd "Index of Multiple Deprivation"

. noi di "DROPPING IF NO IMD" 
DROPPING IF NO IMD

. drop if imd>=.
(0 observations deleted)

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(264 missing values generated)

. replace stp = sum(stp)
(273 real changes made)

. drop stp_old

. drop region

. export delimited using "./output/covid_northeast_matching", replace
(note: file ./output/covid_northeast_matching.csv not found)
file ./output/covid_northeast_matching.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_northeast_matching.log
  log type:  text
 closed on:  19 Aug 2022, 12:07:55
-------------------------------------------------------------------------------
