-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2017.log
  log type:  text
 opened on:  24 Dec 2022, 12:00:49

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames
> (1) case(preserve) 
(53 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,461 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(2,000 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,898 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,759 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,684 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,226 real changes made, 14,226 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,226 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,198 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,192 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,780 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,192 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,780 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,290 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,198 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,192 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,780 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(17,972 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,908 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,226 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(17,972 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,192 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(14,720 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(14,720 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///                           
>                                       
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 ///
>                                                                              
>                    baseline_creatinine_oct2022     {                         
>                                                                       
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(7,747 real changes made, 7,747 to missing)
(7,747 missing values generated)
(17,478 missing values generated)
(5,017 real changes made)
(4,714 real changes made)
(5,017 real changes made)
(4,714 real changes made)
(6,188 real changes made)
(17,478 missing values generated)
(5,017 real changes made)
(4,714 real changes made)
(9,731 real changes made)
(11,290 real changes made)
(7,747 missing values generated)
(9,731 real changes made)
(5,017 real changes made)
(7,794 real changes made, 7,794 to missing)
(7,794 missing values generated)
(17,478 missing values generated)
(5,040 real changes made)
(4,644 real changes made)
(5,040 real changes made)
(4,644 real changes made)
(6,066 real changes made)
(17,478 missing values generated)
(5,040 real changes made)
(4,644 real changes made)
(9,684 real changes made)
(11,412 real changes made)
(7,794 missing values generated)
(9,684 real changes made)
(5,040 real changes made)
(7,693 real changes made, 7,693 to missing)
(7,693 missing values generated)
(17,478 missing values generated)
(5,041 real changes made)
(4,744 real changes made)
(5,041 real changes made)
(4,744 real changes made)
(6,205 real changes made)
(17,478 missing values generated)
(5,041 real changes made)
(4,744 real changes made)
(9,785 real changes made)
(11,273 real changes made)
(7,693 missing values generated)
(9,785 real changes made)
(5,041 real changes made)
(7,719 real changes made, 7,719 to missing)
(7,719 missing values generated)
(17,478 missing values generated)
(5,069 real changes made)
(4,690 real changes made)
(5,069 real changes made)
(4,690 real changes made)
(6,195 real changes made)
(17,478 missing values generated)
(5,069 real changes made)
(4,690 real changes made)
(9,759 real changes made)
(11,283 real changes made)
(7,719 missing values generated)
(9,759 real changes made)
(5,069 real changes made)
(7,685 real changes made, 7,685 to missing)
(7,685 missing values generated)
(17,478 missing values generated)
(5,039 real changes made)
(4,754 real changes made)
(5,039 real changes made)
(4,754 real changes made)
(6,203 real changes made)
(17,478 missing values generated)
(5,039 real changes made)
(4,754 real changes made)
(9,793 real changes made)
(11,275 real changes made)
(7,685 missing values generated)
(9,793 real changes made)
(5,039 real changes made)
(7,715 real changes made, 7,715 to missing)
(7,715 missing values generated)
(17,478 missing values generated)
(5,105 real changes made)
(4,658 real changes made)
(5,105 real changes made)
(4,658 real changes made)
(6,183 real changes made)
(17,478 missing values generated)
(5,105 real changes made)
(4,658 real changes made)
(9,763 real changes made)
(11,295 real changes made)
(7,715 missing values generated)
(9,763 real changes made)
(5,105 real changes made)
(7,770 real changes made, 7,770 to missing)
(7,770 missing values generated)
(17,478 missing values generated)
(5,023 real changes made)
(4,685 real changes made)
(5,023 real changes made)
(4,685 real changes made)
(6,141 real changes made)
(17,478 missing values generated)
(5,023 real changes made)
(4,685 real changes made)
(9,708 real changes made)
(11,337 real changes made)
(7,770 missing values generated)
(9,708 real changes made)
(5,023 real changes made)
(7,648 real changes made, 7,648 to missing)
(7,648 missing values generated)
(17,478 missing values generated)
(5,048 real changes made)
(4,782 real changes made)
(5,048 real changes made)
(4,782 real changes made)
(6,160 real changes made)
(17,478 missing values generated)
(5,048 real changes made)
(4,782 real changes made)
(9,830 real changes made)
(11,318 real changes made)
(7,648 missing values generated)
(9,830 real changes made)
(5,048 real changes made)
(7,677 real changes made, 7,677 to missing)
(7,677 missing values generated)
(17,478 missing values generated)
(5,032 real changes made)
(4,769 real changes made)
(5,032 real changes made)
(4,769 real changes made)
(6,202 real changes made)
(17,478 missing values generated)
(5,032 real changes made)
(4,769 real changes made)
(9,801 real changes made)
(11,276 real changes made)
(7,677 missing values generated)
(9,801 real changes made)
(5,032 real changes made)
(7,663 real changes made, 7,663 to missing)
(7,663 missing values generated)
(17,478 missing values generated)
(5,078 real changes made)
(4,737 real changes made)
(5,078 real changes made)
(4,737 real changes made)
(6,229 real changes made)
(17,478 missing values generated)
(5,078 real changes made)
(4,737 real changes made)
(9,815 real changes made)
(11,249 real changes made)
(7,663 missing values generated)
(9,815 real changes made)
(5,078 real changes made)
(7,637 real changes made, 7,637 to missing)
(7,637 missing values generated)
(17,478 missing values generated)
(5,026 real changes made)
(4,815 real changes made)
(5,026 real changes made)
(4,815 real changes made)
(6,246 real changes made)
(17,478 missing values generated)
(5,026 real changes made)
(4,815 real changes made)
(9,841 real changes made)
(11,232 real changes made)
(7,637 missing values generated)
(9,841 real changes made)
(5,026 real changes made)
(7,687 real changes made, 7,687 to missing)
(7,687 missing values generated)
(17,478 missing values generated)
(5,002 real changes made)
(4,789 real changes made)
(5,002 real changes made)
(4,789 real changes made)
(6,198 real changes made)
(17,478 missing values generated)
(5,002 real changes made)
(4,789 real changes made)
(9,791 real changes made)
(11,280 real changes made)
(7,687 missing values generated)
(9,791 real changes made)
(5,002 real changes made)
(7,672 real changes made, 7,672 to missing)
(7,672 missing values generated)
(17,478 missing values generated)
(5,065 real changes made)
(4,741 real changes made)
(5,065 real changes made)
(4,741 real changes made)
(6,212 real changes made)
(17,478 missing values generated)
(5,065 real changes made)
(4,741 real changes made)
(9,806 real changes made)
(11,266 real changes made)
(7,672 missing values generated)
(9,806 real changes made)
(5,065 real changes made)
(7,695 real changes made, 7,695 to missing)
(7,695 missing values generated)
(17,478 missing values generated)
(5,053 real changes made)
(4,730 real changes made)
(5,053 real changes made)
(4,730 real changes made)
(6,238 real changes made)
(17,478 missing values generated)
(5,053 real changes made)
(4,730 real changes made)
(9,783 real changes made)
(11,240 real changes made)
(7,695 missing values generated)
(9,783 real changes made)
(5,053 real changes made)
(7,666 real changes made, 7,666 to missing)
(7,666 missing values generated)
(17,478 missing values generated)
(5,082 real changes made)
(4,730 real changes made)
(5,082 real changes made)
(4,730 real changes made)
(6,089 real changes made)
(17,478 missing values generated)
(5,082 real changes made)
(4,730 real changes made)
(9,812 real changes made)
(11,389 real changes made)
(7,666 missing values generated)
(9,812 real changes made)
(5,082 real changes made)
(7,772 real changes made, 7,772 to missing)
(7,772 missing values generated)
(17,478 missing values generated)
(4,991 real changes made)
(4,715 real changes made)
(4,991 real changes made)
(4,715 real changes made)
(6,109 real changes made)
(17,478 missing values generated)
(4,991 real changes made)
(4,715 real changes made)
(9,706 real changes made)
(11,369 real changes made)
(7,772 missing values generated)
(9,706 real changes made)
(4,991 real changes made)
(7,674 real changes made, 7,674 to missing)
(7,674 missing values generated)
(17,478 missing values generated)
(5,014 real changes made)
(4,790 real changes made)
(5,014 real changes made)
(4,790 real changes made)
(6,198 real changes made)
(17,478 missing values generated)
(5,014 real changes made)
(4,790 real changes made)
(9,804 real changes made)
(11,280 real changes made)
(7,674 missing values generated)
(9,804 real changes made)
(5,014 real changes made)
(7,758 real changes made, 7,758 to missing)
(7,758 missing values generated)
(17,478 missing values generated)
(5,038 real changes made)
(4,682 real changes made)
(5,038 real changes made)
(4,682 real changes made)
(6,156 real changes made)
(17,478 missing values generated)
(5,038 real changes made)
(4,682 real changes made)
(9,720 real changes made)
(11,322 real changes made)
(7,758 missing values generated)
(9,720 real changes made)
(5,038 real changes made)
(7,664 real changes made, 7,664 to missing)
(7,664 missing values generated)
(17,478 missing values generated)
(5,031 real changes made)
(4,783 real changes made)
(5,031 real changes made)
(4,783 real changes made)
(6,256 real changes made)
(17,478 missing values generated)
(5,031 real changes made)
(4,783 real changes made)
(9,814 real changes made)
(11,222 real changes made)
(7,664 missing values generated)
(9,814 real changes made)
(5,031 real changes made)
(7,668 real changes made, 7,668 to missing)
(7,668 missing values generated)
(17,478 missing values generated)
(5,011 real changes made)
(4,799 real changes made)
(5,011 real changes made)
(4,799 real changes made)
(6,220 real changes made)
(17,478 missing values generated)
(5,011 real changes made)
(4,799 real changes made)
(9,810 real changes made)
(11,258 real changes made)
(7,668 missing values generated)
(9,810 real changes made)
(5,011 real changes made)
(7,761 real changes made, 7,761 to missing)
(7,761 missing values generated)
(17,478 missing values generated)
(5,031 real changes made)
(4,686 real changes made)
(5,031 real changes made)
(4,686 real changes made)
(6,214 real changes made)
(17,478 missing values generated)
(5,031 real changes made)
(4,686 real changes made)
(9,717 real changes made)
(11,264 real changes made)
(7,761 missing values generated)
(9,717 real changes made)
(5,031 real changes made)
(7,691 real changes made, 7,691 to missing)
(7,691 missing values generated)
(17,478 missing values generated)
(5,017 real changes made)
(4,770 real changes made)
(5,017 real changes made)
(4,770 real changes made)
(6,113 real changes made)
(17,478 missing values generated)
(5,017 real changes made)
(4,770 real changes made)
(9,787 real changes made)
(11,365 real changes made)
(7,691 missing values generated)
(9,787 real changes made)
(5,017 real changes made)
(7,684 real changes made, 7,684 to missing)
(7,684 missing values generated)
(17,478 missing values generated)
(5,097 real changes made)
(4,697 real changes made)
(5,097 real changes made)
(4,697 real changes made)
(6,324 real changes made)
(17,478 missing values generated)
(5,097 real changes made)
(4,697 real changes made)
(9,794 real changes made)
(11,154 real changes made)
(7,684 missing values generated)
(9,794 real changes made)
(5,097 real changes made)
(7,686 real changes made, 7,686 to missing)
(7,686 missing values generated)
(17,478 missing values generated)
(5,064 real changes made)
(4,728 real changes made)
(5,064 real changes made)
(4,728 real changes made)
(6,206 real changes made)
(17,478 missing values generated)
(5,064 real changes made)
(4,728 real changes made)
(9,792 real changes made)
(11,272 real changes made)
(7,686 missing values generated)
(9,792 real changes made)
(5,064 real changes made)
(7,826 real changes made, 7,826 to missing)
(7,826 missing values generated)
(17,478 missing values generated)
(4,972 real changes made)
(4,680 real changes made)
(4,972 real changes made)
(4,680 real changes made)
(6,130 real changes made)
(17,478 missing values generated)
(4,972 real changes made)
(4,680 real changes made)
(9,652 real changes made)
(11,348 real changes made)
(7,826 missing values generated)
(9,652 real changes made)
(4,972 real changes made)
(7,696 real changes made, 7,696 to missing)
(7,696 missing values generated)
(17,478 missing values generated)
(5,042 real changes made)
(4,740 real changes made)
(5,042 real changes made)
(4,740 real changes made)
(6,153 real changes made)
(17,478 missing values generated)
(5,042 real changes made)
(4,740 real changes made)
(9,782 real changes made)
(11,325 real changes made)
(7,696 missing values generated)
(9,782 real changes made)
(5,042 real changes made)
(7,565 real changes made, 7,565 to missing)
(7,565 missing values generated)
(17,478 missing values generated)
(5,146 real changes made)
(4,767 real changes made)
(5,146 real changes made)
(4,767 real changes made)
(6,228 real changes made)
(17,478 missing values generated)
(5,146 real changes made)
(4,767 real changes made)
(9,913 real changes made)
(11,250 real changes made)
(7,565 missing values generated)
(9,913 real changes made)
(5,146 real changes made)
(7,558 real changes made, 7,558 to missing)
(7,558 missing values generated)
(17,478 missing values generated)
(5,137 real changes made)
(4,783 real changes made)
(5,137 real changes made)
(4,783 real changes made)
(6,300 real changes made)
(17,478 missing values generated)
(5,137 real changes made)
(4,783 real changes made)
(9,920 real changes made)
(11,178 real changes made)
(7,558 missing values generated)
(9,920 real changes made)
(5,137 real changes made)
(7,719 real changes made, 7,719 to missing)
(7,719 missing values generated)
(17,478 missing values generated)
(5,001 real changes made)
(4,758 real changes made)
(5,001 real changes made)
(4,758 real changes made)
(6,136 real changes made)
(17,478 missing values generated)
(5,001 real changes made)
(4,758 real changes made)
(9,759 real changes made)
(11,342 real changes made)
(7,719 missing values generated)
(9,759 real changes made)
(5,001 real changes made)
(7,672 real changes made, 7,672 to missing)
(7,672 missing values generated)
(17,478 missing values generated)
(5,081 real changes made)
(4,725 real changes made)
(5,081 real changes made)
(4,725 real changes made)
(6,170 real changes made)
(17,478 missing values generated)
(5,081 real changes made)
(4,725 real changes made)
(9,806 real changes made)
(11,308 real changes made)
(7,672 missing values generated)
(9,806 real changes made)
(5,081 real changes made)
(7,684 real changes made, 7,684 to missing)
(7,684 missing values generated)
(17,478 missing values generated)
(5,013 real changes made)
(4,781 real changes made)
(5,013 real changes made)
(4,781 real changes made)
(6,195 real changes made)
(17,478 missing values generated)
(5,013 real changes made)
(4,781 real changes made)
(9,794 real changes made)
(11,283 real changes made)
(7,684 missing values generated)
(9,794 real changes made)
(5,013 real changes made)
(7,639 real changes made, 7,639 to missing)
(7,639 missing values generated)
(17,478 missing values generated)
(5,102 real changes made)
(4,737 real changes made)
(5,102 real changes made)
(4,737 real changes made)
(6,202 real changes made)
(17,478 missing values generated)
(5,102 real changes made)
(4,737 real changes made)
(9,839 real changes made)
(11,276 real changes made)
(7,639 missing values generated)
(9,839 real changes made)
(5,102 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(17,478 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr20
> 22 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if covid_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(341 real changes made)
(403 real changes made)
(331 real changes made)
(339 real changes made)
(356 real changes made)
(332 real changes made)
(334 real changes made)
(311 real changes made)
(342 real changes made)
(330 real changes made)
(360 real changes made)
(315 real changes made)
(278 real changes made)
(323 real changes made)
(280 real changes made)
(312 real changes made)
(307 real changes made)
(299 real changes made)
(309 real changes made)
(255 real changes made)
(273 real changes made)
(282 real changes made)
(271 real changes made)
(264 real changes made)
(256 real changes made)
(270 real changes made)
(237 real changes made)
(287 real changes made)
(275 real changes made)
(235 real changes made)
(299 real changes made)
(223 real changes made)
(247 real changes made)

. drop if baseline_egfr <15
(0 observations deleted)

. drop baseline_egfr

. drop covid_date_string

. 
. * COVID-19 death
. drop if deceased==1
(1,733 observations deleted)

. drop deceased

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. export delimited using "./output/covid_matching_2017.csv", replace
(note: file ./output/covid_matching_2017.csv not found)
file ./output/covid_matching_2017.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2017.log
  log type:  text
 closed on:  24 Dec 2022, 12:00:57
-------------------------------------------------------------------------------
