-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2020.log
  log type:  text
 opened on:  24 Apr 2024, 10:44:07

. clear

. 
. *import delimited ./output/input_covid_matching.csv, delimiter(comma) varname
> s(1) case(preserve) 
. import delimited ./output/input_asthma_matching_2020.csv, delimiter(comma) va
> rnames(1) case(preserve) 
(55 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,576 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,938 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,874 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,766 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,712 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,090 real changes made, 14,090 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,090 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,134 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,181 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,863 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,181 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,863 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,490 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,134 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,181 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,863 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(18,044 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,644 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,090 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(18,044 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,181 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(1 observation deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(29,898 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(29,898 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 ///
>                                                                              
>                    baseline_creatinine_oct2022     ///
>                                                                              
>                    baseline_creatinine_nov2022 ///
>                                                                              
>                    baseline_creatinine_dec2022     {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(976 real changes made, 976 to missing)
(976 missing values generated)
(2,235 missing values generated)
(645 real changes made)
(614 real changes made)
(645 real changes made)
(614 real changes made)
(806 real changes made)
(2,235 missing values generated)
(645 real changes made)
(614 real changes made)
(1,259 real changes made)
(1,429 real changes made)
(976 missing values generated)
(1,259 real changes made)
(645 real changes made)
(964 real changes made, 964 to missing)
(964 missing values generated)
(2,235 missing values generated)
(647 real changes made)
(624 real changes made)
(647 real changes made)
(624 real changes made)
(804 real changes made)
(2,235 missing values generated)
(647 real changes made)
(624 real changes made)
(1,271 real changes made)
(1,431 real changes made)
(964 missing values generated)
(1,271 real changes made)
(647 real changes made)
(981 real changes made, 981 to missing)
(981 missing values generated)
(2,235 missing values generated)
(628 real changes made)
(626 real changes made)
(628 real changes made)
(626 real changes made)
(784 real changes made)
(2,235 missing values generated)
(628 real changes made)
(626 real changes made)
(1,254 real changes made)
(1,451 real changes made)
(981 missing values generated)
(1,254 real changes made)
(628 real changes made)
(1,006 real changes made, 1,006 to missing)
(1,006 missing values generated)
(2,235 missing values generated)
(643 real changes made)
(586 real changes made)
(643 real changes made)
(586 real changes made)
(787 real changes made)
(2,235 missing values generated)
(643 real changes made)
(586 real changes made)
(1,229 real changes made)
(1,448 real changes made)
(1,006 missing values generated)
(1,229 real changes made)
(643 real changes made)
(979 real changes made, 979 to missing)
(979 missing values generated)
(2,235 missing values generated)
(632 real changes made)
(624 real changes made)
(632 real changes made)
(624 real changes made)
(782 real changes made)
(2,235 missing values generated)
(632 real changes made)
(624 real changes made)
(1,256 real changes made)
(1,453 real changes made)
(979 missing values generated)
(1,256 real changes made)
(632 real changes made)
(949 real changes made, 949 to missing)
(949 missing values generated)
(2,235 missing values generated)
(659 real changes made)
(627 real changes made)
(659 real changes made)
(627 real changes made)
(816 real changes made)
(2,235 missing values generated)
(659 real changes made)
(627 real changes made)
(1,286 real changes made)
(1,419 real changes made)
(949 missing values generated)
(1,286 real changes made)
(659 real changes made)
(967 real changes made, 967 to missing)
(967 missing values generated)
(2,235 missing values generated)
(637 real changes made)
(631 real changes made)
(637 real changes made)
(631 real changes made)
(821 real changes made)
(2,235 missing values generated)
(637 real changes made)
(631 real changes made)
(1,268 real changes made)
(1,414 real changes made)
(967 missing values generated)
(1,268 real changes made)
(637 real changes made)
(970 real changes made, 970 to missing)
(970 missing values generated)
(2,235 missing values generated)
(626 real changes made)
(639 real changes made)
(626 real changes made)
(639 real changes made)
(814 real changes made)
(2,235 missing values generated)
(626 real changes made)
(639 real changes made)
(1,265 real changes made)
(1,421 real changes made)
(970 missing values generated)
(1,265 real changes made)
(626 real changes made)
(990 real changes made, 990 to missing)
(990 missing values generated)
(2,235 missing values generated)
(619 real changes made)
(626 real changes made)
(619 real changes made)
(626 real changes made)
(772 real changes made)
(2,235 missing values generated)
(619 real changes made)
(626 real changes made)
(1,245 real changes made)
(1,463 real changes made)
(990 missing values generated)
(1,245 real changes made)
(619 real changes made)
(964 real changes made, 964 to missing)
(964 missing values generated)
(2,235 missing values generated)
(666 real changes made)
(605 real changes made)
(666 real changes made)
(605 real changes made)
(784 real changes made)
(2,235 missing values generated)
(666 real changes made)
(605 real changes made)
(1,271 real changes made)
(1,451 real changes made)
(964 missing values generated)
(1,271 real changes made)
(666 real changes made)
(988 real changes made, 988 to missing)
(988 missing values generated)
(2,235 missing values generated)
(639 real changes made)
(608 real changes made)
(639 real changes made)
(608 real changes made)
(793 real changes made)
(2,235 missing values generated)
(639 real changes made)
(608 real changes made)
(1,247 real changes made)
(1,442 real changes made)
(988 missing values generated)
(1,247 real changes made)
(639 real changes made)
(972 real changes made, 972 to missing)
(972 missing values generated)
(2,235 missing values generated)
(655 real changes made)
(608 real changes made)
(655 real changes made)
(608 real changes made)
(798 real changes made)
(2,235 missing values generated)
(655 real changes made)
(608 real changes made)
(1,263 real changes made)
(1,437 real changes made)
(972 missing values generated)
(1,263 real changes made)
(655 real changes made)
(1,010 real changes made, 1,010 to missing)
(1,010 missing values generated)
(2,235 missing values generated)
(632 real changes made)
(593 real changes made)
(632 real changes made)
(593 real changes made)
(780 real changes made)
(2,235 missing values generated)
(632 real changes made)
(593 real changes made)
(1,225 real changes made)
(1,455 real changes made)
(1,010 missing values generated)
(1,225 real changes made)
(632 real changes made)
(967 real changes made, 967 to missing)
(967 missing values generated)
(2,235 missing values generated)
(651 real changes made)
(617 real changes made)
(651 real changes made)
(617 real changes made)
(802 real changes made)
(2,235 missing values generated)
(651 real changes made)
(617 real changes made)
(1,268 real changes made)
(1,433 real changes made)
(967 missing values generated)
(1,268 real changes made)
(651 real changes made)
(1,005 real changes made, 1,005 to missing)
(1,005 missing values generated)
(2,235 missing values generated)
(618 real changes made)
(612 real changes made)
(618 real changes made)
(612 real changes made)
(771 real changes made)
(2,235 missing values generated)
(618 real changes made)
(612 real changes made)
(1,230 real changes made)
(1,464 real changes made)
(1,005 missing values generated)
(1,230 real changes made)
(618 real changes made)
(944 real changes made, 944 to missing)
(944 missing values generated)
(2,235 missing values generated)
(646 real changes made)
(645 real changes made)
(646 real changes made)
(645 real changes made)
(800 real changes made)
(2,235 missing values generated)
(646 real changes made)
(645 real changes made)
(1,291 real changes made)
(1,435 real changes made)
(944 missing values generated)
(1,291 real changes made)
(646 real changes made)
(981 real changes made, 981 to missing)
(981 missing values generated)
(2,235 missing values generated)
(648 real changes made)
(606 real changes made)
(648 real changes made)
(606 real changes made)
(806 real changes made)
(2,235 missing values generated)
(648 real changes made)
(606 real changes made)
(1,254 real changes made)
(1,429 real changes made)
(981 missing values generated)
(1,254 real changes made)
(648 real changes made)
(963 real changes made, 963 to missing)
(963 missing values generated)
(2,235 missing values generated)
(644 real changes made)
(628 real changes made)
(644 real changes made)
(628 real changes made)
(810 real changes made)
(2,235 missing values generated)
(644 real changes made)
(628 real changes made)
(1,272 real changes made)
(1,425 real changes made)
(963 missing values generated)
(1,272 real changes made)
(644 real changes made)
(944 real changes made, 944 to missing)
(944 missing values generated)
(2,235 missing values generated)
(644 real changes made)
(647 real changes made)
(644 real changes made)
(647 real changes made)
(792 real changes made)
(2,235 missing values generated)
(644 real changes made)
(647 real changes made)
(1,291 real changes made)
(1,443 real changes made)
(944 missing values generated)
(1,291 real changes made)
(644 real changes made)
(930 real changes made, 930 to missing)
(930 missing values generated)
(2,235 missing values generated)
(664 real changes made)
(641 real changes made)
(664 real changes made)
(641 real changes made)
(841 real changes made)
(2,235 missing values generated)
(664 real changes made)
(641 real changes made)
(1,305 real changes made)
(1,394 real changes made)
(930 missing values generated)
(1,305 real changes made)
(664 real changes made)
(982 real changes made, 982 to missing)
(982 missing values generated)
(2,235 missing values generated)
(674 real changes made)
(579 real changes made)
(674 real changes made)
(579 real changes made)
(804 real changes made)
(2,235 missing values generated)
(674 real changes made)
(579 real changes made)
(1,253 real changes made)
(1,431 real changes made)
(982 missing values generated)
(1,253 real changes made)
(674 real changes made)
(1,011 real changes made, 1,011 to missing)
(1,011 missing values generated)
(2,235 missing values generated)
(630 real changes made)
(594 real changes made)
(630 real changes made)
(594 real changes made)
(779 real changes made)
(2,235 missing values generated)
(630 real changes made)
(594 real changes made)
(1,224 real changes made)
(1,456 real changes made)
(1,011 missing values generated)
(1,224 real changes made)
(630 real changes made)
(987 real changes made, 987 to missing)
(987 missing values generated)
(2,235 missing values generated)
(654 real changes made)
(594 real changes made)
(654 real changes made)
(594 real changes made)
(798 real changes made)
(2,235 missing values generated)
(654 real changes made)
(594 real changes made)
(1,248 real changes made)
(1,437 real changes made)
(987 missing values generated)
(1,248 real changes made)
(654 real changes made)
(971 real changes made, 971 to missing)
(971 missing values generated)
(2,235 missing values generated)
(644 real changes made)
(620 real changes made)
(644 real changes made)
(620 real changes made)
(818 real changes made)
(2,235 missing values generated)
(644 real changes made)
(620 real changes made)
(1,264 real changes made)
(1,417 real changes made)
(971 missing values generated)
(1,264 real changes made)
(644 real changes made)
(1,024 real changes made, 1,024 to missing)
(1,024 missing values generated)
(2,235 missing values generated)
(631 real changes made)
(580 real changes made)
(631 real changes made)
(580 real changes made)
(757 real changes made)
(2,235 missing values generated)
(631 real changes made)
(580 real changes made)
(1,211 real changes made)
(1,478 real changes made)
(1,024 missing values generated)
(1,211 real changes made)
(631 real changes made)
(977 real changes made, 977 to missing)
(977 missing values generated)
(2,235 missing values generated)
(632 real changes made)
(626 real changes made)
(632 real changes made)
(626 real changes made)
(813 real changes made)
(2,235 missing values generated)
(632 real changes made)
(626 real changes made)
(1,258 real changes made)
(1,422 real changes made)
(977 missing values generated)
(1,258 real changes made)
(632 real changes made)
(973 real changes made, 973 to missing)
(973 missing values generated)
(2,235 missing values generated)
(648 real changes made)
(614 real changes made)
(648 real changes made)
(614 real changes made)
(773 real changes made)
(2,235 missing values generated)
(648 real changes made)
(614 real changes made)
(1,262 real changes made)
(1,462 real changes made)
(973 missing values generated)
(1,262 real changes made)
(648 real changes made)
(990 real changes made, 990 to missing)
(990 missing values generated)
(2,235 missing values generated)
(637 real changes made)
(608 real changes made)
(637 real changes made)
(608 real changes made)
(804 real changes made)
(2,235 missing values generated)
(637 real changes made)
(608 real changes made)
(1,245 real changes made)
(1,431 real changes made)
(990 missing values generated)
(1,245 real changes made)
(637 real changes made)
(1,039 real changes made, 1,039 to missing)
(1,039 missing values generated)
(2,235 missing values generated)
(609 real changes made)
(587 real changes made)
(609 real changes made)
(587 real changes made)
(774 real changes made)
(2,235 missing values generated)
(609 real changes made)
(587 real changes made)
(1,196 real changes made)
(1,461 real changes made)
(1,039 missing values generated)
(1,196 real changes made)
(609 real changes made)
(973 real changes made, 973 to missing)
(973 missing values generated)
(2,235 missing values generated)
(630 real changes made)
(632 real changes made)
(630 real changes made)
(632 real changes made)
(793 real changes made)
(2,235 missing values generated)
(630 real changes made)
(632 real changes made)
(1,262 real changes made)
(1,442 real changes made)
(973 missing values generated)
(1,262 real changes made)
(630 real changes made)
(1,018 real changes made, 1,018 to missing)
(1,018 missing values generated)
(2,235 missing values generated)
(622 real changes made)
(595 real changes made)
(622 real changes made)
(595 real changes made)
(773 real changes made)
(2,235 missing values generated)
(622 real changes made)
(595 real changes made)
(1,217 real changes made)
(1,462 real changes made)
(1,018 missing values generated)
(1,217 real changes made)
(622 real changes made)
(981 real changes made, 981 to missing)
(981 missing values generated)
(2,235 missing values generated)
(651 real changes made)
(603 real changes made)
(651 real changes made)
(603 real changes made)
(796 real changes made)
(2,235 missing values generated)
(651 real changes made)
(603 real changes made)
(1,254 real changes made)
(1,439 real changes made)
(981 missing values generated)
(1,254 real changes made)
(651 real changes made)
(1,034 real changes made, 1,034 to missing)
(1,034 missing values generated)
(2,235 missing values generated)
(603 real changes made)
(598 real changes made)
(603 real changes made)
(598 real changes made)
(750 real changes made)
(2,235 missing values generated)
(603 real changes made)
(598 real changes made)
(1,201 real changes made)
(1,485 real changes made)
(1,034 missing values generated)
(1,201 real changes made)
(603 real changes made)
(976 real changes made, 976 to missing)
(976 missing values generated)
(2,235 missing values generated)
(642 real changes made)
(617 real changes made)
(642 real changes made)
(617 real changes made)
(799 real changes made)
(2,235 missing values generated)
(642 real changes made)
(617 real changes made)
(1,259 real changes made)
(1,436 real changes made)
(976 missing values generated)
(1,259 real changes made)
(642 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(2,235 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr20
> 22 may2022 jun2022 jul2022 aug2022 sep2022 oct2022 nov2022 dec2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if covid_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(46 real changes made)
(38 real changes made)
(42 real changes made)
(36 real changes made)
(29 real changes made)
(41 real changes made)
(37 real changes made)
(42 real changes made)
(32 real changes made)
(35 real changes made)
(28 real changes made)
(34 real changes made)
(29 real changes made)
(37 real changes made)
(35 real changes made)
(32 real changes made)
(40 real changes made)
(40 real changes made)
(44 real changes made)
(34 real changes made)
(40 real changes made)
(40 real changes made)
(33 real changes made)
(35 real changes made)
(34 real changes made)
(35 real changes made)
(32 real changes made)
(41 real changes made)
(39 real changes made)
(43 real changes made)
(33 real changes made)
(34 real changes made)
(43 real changes made)
(32 real changes made)
(44 real changes made)

. drop if baseline_egfr <15
(0 observations deleted)

. drop baseline_egfr

. drop covid_date_string

. 
. * COVID-19 death
. drop if deceased==1
(215 observations deleted)

. drop deceased

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. export delimited using "./output/covid_matching_2020.csv", replace
(note: file ./output/covid_matching_2020.csv not found)
file ./output/covid_matching_2020.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2020.log
  log type:  text
 closed on:  24 Apr 2024, 10:44:10
-------------------------------------------------------------------------------
