-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_matching.log
  log type:  text
 opened on:  20 Oct 2022, 16:01:33

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames
> (1) case(preserve) 
(46 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,562 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,950 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,885 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,782 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,695 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,119 real changes made, 14,119 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,119 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,126 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,036 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,971 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,036 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,971 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,350 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,126 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,036 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,971 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(18,007 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,776 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,119 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(18,007 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,036 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(17,844 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(17,844 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(6,247 real changes made, 6,247 to missing)
(6,247 missing values generated)
(14,282 missing values generated)
(4,111 real changes made)
(3,924 real changes made)
(4,111 real changes made)
(3,924 real changes made)
(5,066 real changes made)
(14,282 missing values generated)
(4,111 real changes made)
(3,924 real changes made)
(8,035 real changes made)
(9,216 real changes made)
(6,247 missing values generated)
(8,035 real changes made)
(4,111 real changes made)
(6,319 real changes made, 6,319 to missing)
(6,319 missing values generated)
(14,282 missing values generated)
(4,081 real changes made)
(3,882 real changes made)
(4,081 real changes made)
(3,882 real changes made)
(5,054 real changes made)
(14,282 missing values generated)
(4,081 real changes made)
(3,882 real changes made)
(7,963 real changes made)
(9,228 real changes made)
(6,319 missing values generated)
(7,963 real changes made)
(4,081 real changes made)
(6,294 real changes made, 6,294 to missing)
(6,294 missing values generated)
(14,282 missing values generated)
(4,057 real changes made)
(3,931 real changes made)
(4,057 real changes made)
(3,931 real changes made)
(4,990 real changes made)
(14,282 missing values generated)
(4,057 real changes made)
(3,931 real changes made)
(7,988 real changes made)
(9,292 real changes made)
(6,294 missing values generated)
(7,988 real changes made)
(4,057 real changes made)
(6,263 real changes made, 6,263 to missing)
(6,263 missing values generated)
(14,282 missing values generated)
(4,074 real changes made)
(3,945 real changes made)
(4,074 real changes made)
(3,945 real changes made)
(5,058 real changes made)
(14,282 missing values generated)
(4,074 real changes made)
(3,945 real changes made)
(8,019 real changes made)
(9,224 real changes made)
(6,263 missing values generated)
(8,019 real changes made)
(4,074 real changes made)
(6,296 real changes made, 6,296 to missing)
(6,296 missing values generated)
(14,282 missing values generated)
(4,061 real changes made)
(3,925 real changes made)
(4,061 real changes made)
(3,925 real changes made)
(5,031 real changes made)
(14,282 missing values generated)
(4,061 real changes made)
(3,925 real changes made)
(7,986 real changes made)
(9,251 real changes made)
(6,296 missing values generated)
(7,986 real changes made)
(4,061 real changes made)
(6,271 real changes made, 6,271 to missing)
(6,271 missing values generated)
(14,282 missing values generated)
(4,068 real changes made)
(3,943 real changes made)
(4,068 real changes made)
(3,943 real changes made)
(5,137 real changes made)
(14,282 missing values generated)
(4,068 real changes made)
(3,943 real changes made)
(8,011 real changes made)
(9,145 real changes made)
(6,271 missing values generated)
(8,011 real changes made)
(4,068 real changes made)
(6,277 real changes made, 6,277 to missing)
(6,277 missing values generated)
(14,282 missing values generated)
(4,082 real changes made)
(3,923 real changes made)
(4,082 real changes made)
(3,923 real changes made)
(5,110 real changes made)
(14,282 missing values generated)
(4,082 real changes made)
(3,923 real changes made)
(8,005 real changes made)
(9,172 real changes made)
(6,277 missing values generated)
(8,005 real changes made)
(4,082 real changes made)
(6,223 real changes made, 6,223 to missing)
(6,223 missing values generated)
(14,282 missing values generated)
(4,043 real changes made)
(4,016 real changes made)
(4,043 real changes made)
(4,016 real changes made)
(5,030 real changes made)
(14,282 missing values generated)
(4,043 real changes made)
(4,016 real changes made)
(8,059 real changes made)
(9,252 real changes made)
(6,223 missing values generated)
(8,059 real changes made)
(4,043 real changes made)
(6,333 real changes made, 6,333 to missing)
(6,333 missing values generated)
(14,282 missing values generated)
(4,062 real changes made)
(3,887 real changes made)
(4,062 real changes made)
(3,887 real changes made)
(5,029 real changes made)
(14,282 missing values generated)
(4,062 real changes made)
(3,887 real changes made)
(7,949 real changes made)
(9,253 real changes made)
(6,333 missing values generated)
(7,949 real changes made)
(4,062 real changes made)
(6,300 real changes made, 6,300 to missing)
(6,300 missing values generated)
(14,282 missing values generated)
(4,054 real changes made)
(3,928 real changes made)
(4,054 real changes made)
(3,928 real changes made)
(5,104 real changes made)
(14,282 missing values generated)
(4,054 real changes made)
(3,928 real changes made)
(7,982 real changes made)
(9,178 real changes made)
(6,300 missing values generated)
(7,982 real changes made)
(4,054 real changes made)
(6,281 real changes made, 6,281 to missing)
(6,281 missing values generated)
(14,282 missing values generated)
(3,997 real changes made)
(4,004 real changes made)
(3,997 real changes made)
(4,004 real changes made)
(5,113 real changes made)
(14,282 missing values generated)
(3,997 real changes made)
(4,004 real changes made)
(8,001 real changes made)
(9,169 real changes made)
(6,281 missing values generated)
(8,001 real changes made)
(3,997 real changes made)
(6,251 real changes made, 6,251 to missing)
(6,251 missing values generated)
(14,282 missing values generated)
(4,123 real changes made)
(3,908 real changes made)
(4,123 real changes made)
(3,908 real changes made)
(5,037 real changes made)
(14,282 missing values generated)
(4,123 real changes made)
(3,908 real changes made)
(8,031 real changes made)
(9,245 real changes made)
(6,251 missing values generated)
(8,031 real changes made)
(4,123 real changes made)
(6,279 real changes made, 6,279 to missing)
(6,279 missing values generated)
(14,282 missing values generated)
(4,104 real changes made)
(3,899 real changes made)
(4,104 real changes made)
(3,899 real changes made)
(5,046 real changes made)
(14,282 missing values generated)
(4,104 real changes made)
(3,899 real changes made)
(8,003 real changes made)
(9,236 real changes made)
(6,279 missing values generated)
(8,003 real changes made)
(4,104 real changes made)
(6,408 real changes made, 6,408 to missing)
(6,408 missing values generated)
(14,282 missing values generated)
(4,034 real changes made)
(3,840 real changes made)
(4,034 real changes made)
(3,840 real changes made)
(5,028 real changes made)
(14,282 missing values generated)
(4,034 real changes made)
(3,840 real changes made)
(7,874 real changes made)
(9,254 real changes made)
(6,408 missing values generated)
(7,874 real changes made)
(4,034 real changes made)
(6,339 real changes made, 6,339 to missing)
(6,339 missing values generated)
(14,282 missing values generated)
(4,055 real changes made)
(3,888 real changes made)
(4,055 real changes made)
(3,888 real changes made)
(4,999 real changes made)
(14,282 missing values generated)
(4,055 real changes made)
(3,888 real changes made)
(7,943 real changes made)
(9,283 real changes made)
(6,339 missing values generated)
(7,943 real changes made)
(4,055 real changes made)
(6,171 real changes made, 6,171 to missing)
(6,171 missing values generated)
(14,282 missing values generated)
(4,130 real changes made)
(3,981 real changes made)
(4,130 real changes made)
(3,981 real changes made)
(5,179 real changes made)
(14,282 missing values generated)
(4,130 real changes made)
(3,981 real changes made)
(8,111 real changes made)
(9,103 real changes made)
(6,171 missing values generated)
(8,111 real changes made)
(4,130 real changes made)
(6,303 real changes made, 6,303 to missing)
(6,303 missing values generated)
(14,282 missing values generated)
(4,058 real changes made)
(3,921 real changes made)
(4,058 real changes made)
(3,921 real changes made)
(5,075 real changes made)
(14,282 missing values generated)
(4,058 real changes made)
(3,921 real changes made)
(7,979 real changes made)
(9,207 real changes made)
(6,303 missing values generated)
(7,979 real changes made)
(4,058 real changes made)
(6,213 real changes made, 6,213 to missing)
(6,213 missing values generated)
(14,282 missing values generated)
(4,199 real changes made)
(3,870 real changes made)
(4,199 real changes made)
(3,870 real changes made)
(5,084 real changes made)
(14,282 missing values generated)
(4,199 real changes made)
(3,870 real changes made)
(8,069 real changes made)
(9,198 real changes made)
(6,213 missing values generated)
(8,069 real changes made)
(4,199 real changes made)
(6,279 real changes made, 6,279 to missing)
(6,279 missing values generated)
(14,282 missing values generated)
(4,050 real changes made)
(3,953 real changes made)
(4,050 real changes made)
(3,953 real changes made)
(4,973 real changes made)
(14,282 missing values generated)
(4,050 real changes made)
(3,953 real changes made)
(8,003 real changes made)
(9,309 real changes made)
(6,279 missing values generated)
(8,003 real changes made)
(4,050 real changes made)
(6,266 real changes made, 6,266 to missing)
(6,266 missing values generated)
(14,282 missing values generated)
(4,057 real changes made)
(3,959 real changes made)
(4,057 real changes made)
(3,959 real changes made)
(5,098 real changes made)
(14,282 missing values generated)
(4,057 real changes made)
(3,959 real changes made)
(8,016 real changes made)
(9,184 real changes made)
(6,266 missing values generated)
(8,016 real changes made)
(4,057 real changes made)
(6,251 real changes made, 6,251 to missing)
(6,251 missing values generated)
(14,282 missing values generated)
(4,074 real changes made)
(3,957 real changes made)
(4,074 real changes made)
(3,957 real changes made)
(5,144 real changes made)
(14,282 missing values generated)
(4,074 real changes made)
(3,957 real changes made)
(8,031 real changes made)
(9,138 real changes made)
(6,251 missing values generated)
(8,031 real changes made)
(4,074 real changes made)
(6,222 real changes made, 6,222 to missing)
(6,222 missing values generated)
(14,282 missing values generated)
(4,108 real changes made)
(3,952 real changes made)
(4,108 real changes made)
(3,952 real changes made)
(5,120 real changes made)
(14,282 missing values generated)
(4,108 real changes made)
(3,952 real changes made)
(8,060 real changes made)
(9,162 real changes made)
(6,222 missing values generated)
(8,060 real changes made)
(4,108 real changes made)
(6,283 real changes made, 6,283 to missing)
(6,283 missing values generated)
(14,282 missing values generated)
(4,064 real changes made)
(3,935 real changes made)
(4,064 real changes made)
(3,935 real changes made)
(5,002 real changes made)
(14,282 missing values generated)
(4,064 real changes made)
(3,935 real changes made)
(7,999 real changes made)
(9,280 real changes made)
(6,283 missing values generated)
(7,999 real changes made)
(4,064 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(14,282 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. drop if baseline_egfr <15
  4. drop egfr_baseline_creatinine_`x'
  5. }
(351 real changes made)
(0 observations deleted)
(363 real changes made)
(0 observations deleted)
(353 real changes made)
(0 observations deleted)
(374 real changes made)
(0 observations deleted)
(372 real changes made)
(0 observations deleted)
(387 real changes made)
(0 observations deleted)
(349 real changes made)
(0 observations deleted)
(331 real changes made)
(0 observations deleted)
(384 real changes made)
(0 observations deleted)
(356 real changes made)
(0 observations deleted)
(354 real changes made)
(0 observations deleted)
(381 real changes made)
(0 observations deleted)
(289 real changes made)
(0 observations deleted)
(326 real changes made)
(0 observations deleted)
(299 real changes made)
(0 observations deleted)
(320 real changes made)
(0 observations deleted)
(337 real changes made)
(0 observations deleted)
(292 real changes made)
(0 observations deleted)
(317 real changes made)
(0 observations deleted)
(312 real changes made)
(0 observations deleted)
(309 real changes made)
(0 observations deleted)
(298 real changes made)
(0 observations deleted)
(280 real changes made)
(0 observations deleted)
(291 real changes made)
(0 observations deleted)

. drop baseline_egfr

. drop covid_date_string

. drop age

. 
. * COVID-19 death
. drop if deceased==1
(1,403 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab year_of_birth

year_of_bir |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
       1950 |        262        2.03        2.03
       1951 |        249        1.93        3.97
       1952 |        273        2.12        6.09
       1953 |        248        1.93        8.01
       1954 |        244        1.89        9.91
       1955 |        248        1.93       11.83
       1956 |        252        1.96       13.79
       1957 |        254        1.97       15.76
       1958 |        249        1.93       17.70
       1959 |        254        1.97       19.67
       1960 |        286        2.22       21.89
       1961 |        252        1.96       23.85
       1962 |        244        1.89       25.74
       1963 |        261        2.03       27.77
       1964 |        292        2.27       30.03
       1965 |        265        2.06       32.09
       1966 |        243        1.89       33.98
       1967 |        256        1.99       35.97
       1968 |        283        2.20       38.16
       1969 |        281        2.18       40.34
       1970 |        265        2.06       42.40
       1971 |        247        1.92       44.32
       1972 |        275        2.14       46.46
       1973 |        257        2.00       48.45
       1974 |        255        1.98       50.43
       1975 |        267        2.07       52.50
       1976 |        252        1.96       54.46
       1977 |        234        1.82       56.28
       1978 |        244        1.89       58.17
       1979 |        233        1.81       59.98
       1980 |        272        2.11       62.09
       1981 |        273        2.12       64.21
       1982 |        258        2.00       66.22
       1983 |        276        2.14       68.36
       1984 |        221        1.72       70.08
       1985 |        249        1.93       72.01
       1986 |        268        2.08       74.09
       1987 |        241        1.87       75.96
       1988 |        254        1.97       77.93
       1989 |        263        2.04       79.98
       1990 |        243        1.89       81.86
       1991 |        254        1.97       83.83
       1992 |        263        2.04       85.88
       1993 |        278        2.16       88.03
       1994 |        239        1.86       89.89
       1995 |        293        2.28       92.17
       1996 |        260        2.02       94.18
       1997 |        243        1.89       96.07
       1998 |        265        2.06       98.13
       1999 |        241        1.87      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        640        4.97        4.97
          1 |      2,399       18.63       23.60
          2 |      2,409       18.70       42.30
          3 |      2,539       19.71       62.02
          4 |      2,420       18.79       80.81
          5 |      2,472       19.19      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      6,612       51.34       51.34
       Male |      6,267       48.66      100.00
------------+-----------------------------------
      Total |     12,879      100.00

. bysort year_of_birth: tab covid_month

-------------------------------------------------------------------------------
-> year_of_birth = 1950

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        4.58        4.58
    apr2021 |         10        3.82        8.40
    aug2020 |          5        1.91       10.31
    aug2021 |          5        1.91       12.21
    dec2020 |         12        4.58       16.79
    dec2021 |          9        3.44       20.23
    feb2020 |         14        5.34       25.57
    feb2021 |         14        5.34       30.92
    jan2021 |         15        5.73       36.64
    jan2022 |          4        1.53       38.17
    jul2020 |         13        4.96       43.13
    jul2021 |         13        4.96       48.09
    jun2020 |         12        4.58       52.67
    jun2021 |         12        4.58       57.25
    mar2020 |         15        5.73       62.98
    mar2021 |         12        4.58       67.56
    may2020 |         11        4.20       71.76
    may2021 |         12        4.58       76.34
    nov2020 |         15        5.73       82.06
    nov2021 |         13        4.96       87.02
    oct2020 |         10        3.82       90.84
    oct2021 |          4        1.53       92.37
    sep2020 |         12        4.58       96.95
    sep2021 |          8        3.05      100.00
------------+-----------------------------------
      Total |        262      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1951

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         17        6.83        6.83
    apr2021 |         10        4.02       10.84
    aug2020 |         12        4.82       15.66
    aug2021 |          6        2.41       18.07
    dec2020 |         14        5.62       23.69
    dec2021 |          6        2.41       26.10
    feb2020 |         11        4.42       30.52
    feb2021 |          9        3.61       34.14
    jan2021 |         15        6.02       40.16
    jan2022 |         14        5.62       45.78
    jul2020 |          5        2.01       47.79
    jul2021 |          9        3.61       51.41
    jun2020 |         12        4.82       56.22
    jun2021 |          8        3.21       59.44
    mar2020 |         17        6.83       66.27
    mar2021 |         10        4.02       70.28
    may2020 |         14        5.62       75.90
    may2021 |         14        5.62       81.53
    nov2020 |         10        4.02       85.54
    nov2021 |          8        3.21       88.76
    oct2020 |          9        3.61       92.37
    oct2021 |          5        2.01       94.38
    sep2020 |          5        2.01       96.39
    sep2021 |          9        3.61      100.00
------------+-----------------------------------
      Total |        249      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1952

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        4.03        4.03
    apr2021 |         15        5.49        9.52
    aug2020 |         11        4.03       13.55
    aug2021 |         12        4.40       17.95
    dec2020 |          9        3.30       21.25
    dec2021 |         10        3.66       24.91
    feb2020 |         11        4.03       28.94
    feb2021 |          9        3.30       32.23
    jan2021 |         15        5.49       37.73
    jan2022 |         12        4.40       42.12
    jul2020 |         12        4.40       46.52
    jul2021 |         10        3.66       50.18
    jun2020 |         10        3.66       53.85
    jun2021 |         10        3.66       57.51
    mar2020 |         12        4.40       61.90
    mar2021 |          8        2.93       64.84
    may2020 |         14        5.13       69.96
    may2021 |         13        4.76       74.73
    nov2020 |         12        4.40       79.12
    nov2021 |          9        3.30       82.42
    oct2020 |          9        3.30       85.71
    oct2021 |         10        3.66       89.38
    sep2020 |         16        5.86       95.24
    sep2021 |         13        4.76      100.00
------------+-----------------------------------
      Total |        273      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1953

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        5.65        5.65
    apr2021 |          9        3.63        9.27
    aug2020 |          8        3.23       12.50
    aug2021 |         12        4.84       17.34
    dec2020 |          8        3.23       20.56
    dec2021 |          9        3.63       24.19
    feb2020 |         11        4.44       28.63
    feb2021 |         13        5.24       33.87
    jan2021 |          8        3.23       37.10
    jan2022 |         10        4.03       41.13
    jul2020 |          9        3.63       44.76
    jul2021 |         15        6.05       50.81
    jun2020 |         10        4.03       54.84
    jun2021 |          9        3.63       58.47
    mar2020 |         15        6.05       64.52
    mar2021 |         12        4.84       69.35
    may2020 |          8        3.23       72.58
    may2021 |         15        6.05       78.63
    nov2020 |          7        2.82       81.45
    nov2021 |         10        4.03       85.48
    oct2020 |         14        5.65       91.13
    oct2021 |          6        2.42       93.55
    sep2020 |         11        4.44       97.98
    sep2021 |          5        2.02      100.00
------------+-----------------------------------
      Total |        248      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1954

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          8        3.28        3.28
    apr2021 |         11        4.51        7.79
    aug2020 |          7        2.87       10.66
    aug2021 |         10        4.10       14.75
    dec2020 |         13        5.33       20.08
    dec2021 |         11        4.51       24.59
    feb2020 |         10        4.10       28.69
    feb2021 |          4        1.64       30.33
    jan2021 |          9        3.69       34.02
    jan2022 |          9        3.69       37.70
    jul2020 |         13        5.33       43.03
    jul2021 |          7        2.87       45.90
    jun2020 |         12        4.92       50.82
    jun2021 |         11        4.51       55.33
    mar2020 |          6        2.46       57.79
    mar2021 |          9        3.69       61.48
    may2020 |          9        3.69       65.16
    may2021 |         11        4.51       69.67
    nov2020 |         14        5.74       75.41
    nov2021 |          8        3.28       78.69
    oct2020 |         10        4.10       82.79
    oct2021 |         12        4.92       87.70
    sep2020 |         16        6.56       94.26
    sep2021 |         14        5.74      100.00
------------+-----------------------------------
      Total |        244      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1955

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        4.84        4.84
    apr2021 |         11        4.44        9.27
    aug2020 |         12        4.84       14.11
    aug2021 |          8        3.23       17.34
    dec2020 |         11        4.44       21.77
    dec2021 |         16        6.45       28.23
    feb2020 |         12        4.84       33.06
    feb2021 |          8        3.23       36.29
    jan2021 |          8        3.23       39.52
    jan2022 |          7        2.82       42.34
    jul2020 |         11        4.44       46.77
    jul2021 |         13        5.24       52.02
    jun2020 |         14        5.65       57.66
    jun2021 |          8        3.23       60.89
    mar2020 |         11        4.44       65.32
    mar2021 |          9        3.63       68.95
    may2020 |         12        4.84       73.79
    may2021 |          7        2.82       76.61
    nov2020 |         14        5.65       82.26
    nov2021 |          7        2.82       85.08
    oct2020 |         13        5.24       90.32
    oct2021 |          9        3.63       93.95
    sep2020 |          6        2.42       96.37
    sep2021 |          9        3.63      100.00
------------+-----------------------------------
      Total |        248      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1956

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          7        2.78        2.78
    apr2021 |          7        2.78        5.56
    aug2020 |         11        4.37        9.92
    aug2021 |         12        4.76       14.68
    dec2020 |          6        2.38       17.06
    dec2021 |          2        0.79       17.86
    feb2020 |         13        5.16       23.02
    feb2021 |          7        2.78       25.79
    jan2021 |          9        3.57       29.37
    jan2022 |          3        1.19       30.56
    jul2020 |         13        5.16       35.71
    jul2021 |         13        5.16       40.87
    jun2020 |          7        2.78       43.65
    jun2021 |         17        6.75       50.40
    mar2020 |         14        5.56       55.95
    mar2021 |         14        5.56       61.51
    may2020 |         17        6.75       68.25
    may2021 |         15        5.95       74.21
    nov2020 |          9        3.57       77.78
    nov2021 |          9        3.57       81.35
    oct2020 |         11        4.37       85.71
    oct2021 |          8        3.17       88.89
    sep2020 |          9        3.57       92.46
    sep2021 |         19        7.54      100.00
------------+-----------------------------------
      Total |        252      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1957

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        5.51        5.51
    apr2021 |         10        3.94        9.45
    aug2020 |         10        3.94       13.39
    aug2021 |          3        1.18       14.57
    dec2020 |         11        4.33       18.90
    dec2021 |          8        3.15       22.05
    feb2020 |         10        3.94       25.98
    feb2021 |          8        3.15       29.13
    jan2021 |          5        1.97       31.10
    jan2022 |         10        3.94       35.04
    jul2020 |         10        3.94       38.98
    jul2021 |         13        5.12       44.09
    jun2020 |          8        3.15       47.24
    jun2021 |         16        6.30       53.54
    mar2020 |         15        5.91       59.45
    mar2021 |          8        3.15       62.60
    may2020 |         18        7.09       69.69
    may2021 |         10        3.94       73.62
    nov2020 |         11        4.33       77.95
    nov2021 |         12        4.72       82.68
    oct2020 |         22        8.66       91.34
    oct2021 |         11        4.33       95.67
    sep2020 |          4        1.57       97.24
    sep2021 |          7        2.76      100.00
------------+-----------------------------------
      Total |        254      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1958

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         16        6.43        6.43
    apr2021 |         11        4.42       10.84
    aug2020 |         11        4.42       15.26
    aug2021 |          7        2.81       18.07
    dec2020 |         15        6.02       24.10
    dec2021 |          3        1.20       25.30
    feb2020 |         10        4.02       29.32
    feb2021 |          7        2.81       32.13
    jan2021 |         11        4.42       36.55
    jan2022 |          7        2.81       39.36
    jul2020 |          7        2.81       42.17
    jul2021 |          6        2.41       44.58
    jun2020 |         13        5.22       49.80
    jun2021 |          9        3.61       53.41
    mar2020 |         11        4.42       57.83
    mar2021 |         12        4.82       62.65
    may2020 |         21        8.43       71.08
    may2021 |          5        2.01       73.09
    nov2020 |         14        5.62       78.71
    nov2021 |          9        3.61       82.33
    oct2020 |         13        5.22       87.55
    oct2021 |          6        2.41       89.96
    sep2020 |         13        5.22       95.18
    sep2021 |         12        4.82      100.00
------------+-----------------------------------
      Total |        249      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1959

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          8        3.15        3.15
    apr2021 |         10        3.94        7.09
    aug2020 |         11        4.33       11.42
    aug2021 |         12        4.72       16.14
    dec2020 |         11        4.33       20.47
    dec2021 |          6        2.36       22.83
    feb2020 |         16        6.30       29.13
    feb2021 |         11        4.33       33.46
    jan2021 |         13        5.12       38.58
    jan2022 |          7        2.76       41.34
    jul2020 |         18        7.09       48.43
    jul2021 |         11        4.33       52.76
    jun2020 |         11        4.33       57.09
    jun2021 |          8        3.15       60.24
    mar2020 |         13        5.12       65.35
    mar2021 |         13        5.12       70.47
    may2020 |         13        5.12       75.59
    may2021 |          7        2.76       78.35
    nov2020 |          8        3.15       81.50
    nov2021 |          8        3.15       84.65
    oct2020 |         11        4.33       88.98
    oct2021 |         11        4.33       93.31
    sep2020 |         12        4.72       98.03
    sep2021 |          5        1.97      100.00
------------+-----------------------------------
      Total |        254      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1960

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         19        6.64        6.64
    apr2021 |         12        4.20       10.84
    aug2020 |         10        3.50       14.34
    aug2021 |          8        2.80       17.13
    dec2020 |         11        3.85       20.98
    dec2021 |          9        3.15       24.13
    feb2020 |          8        2.80       26.92
    feb2021 |          7        2.45       29.37
    jan2021 |         18        6.29       35.66
    jan2022 |          7        2.45       38.11
    jul2020 |         17        5.94       44.06
    jul2021 |         12        4.20       48.25
    jun2020 |         14        4.90       53.15
    jun2021 |         13        4.55       57.69
    mar2020 |         11        3.85       61.54
    mar2021 |         10        3.50       65.03
    may2020 |         14        4.90       69.93
    may2021 |         18        6.29       76.22
    nov2020 |         16        5.59       81.82
    nov2021 |         13        4.55       86.36
    oct2020 |         14        4.90       91.26
    oct2021 |          9        3.15       94.41
    sep2020 |          8        2.80       97.20
    sep2021 |          8        2.80      100.00
------------+-----------------------------------
      Total |        286      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1961

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        4.37        4.37
    apr2021 |          9        3.57        7.94
    aug2020 |         16        6.35       14.29
    aug2021 |          9        3.57       17.86
    dec2020 |         16        6.35       24.21
    dec2021 |          8        3.17       27.38
    feb2020 |          7        2.78       30.16
    feb2021 |          6        2.38       32.54
    jan2021 |          4        1.59       34.13
    jan2022 |          8        3.17       37.30
    jul2020 |          9        3.57       40.87
    jul2021 |         13        5.16       46.03
    jun2020 |         17        6.75       52.78
    jun2021 |          8        3.17       55.95
    mar2020 |         13        5.16       61.11
    mar2021 |         13        5.16       66.27
    may2020 |         12        4.76       71.03
    may2021 |          7        2.78       73.81
    nov2020 |         11        4.37       78.17
    nov2021 |         10        3.97       82.14
    oct2020 |         18        7.14       89.29
    oct2021 |          3        1.19       90.48
    sep2020 |         15        5.95       96.43
    sep2021 |          9        3.57      100.00
------------+-----------------------------------
      Total |        252      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1962

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        4.92        4.92
    apr2021 |          7        2.87        7.79
    aug2020 |          9        3.69       11.48
    aug2021 |         10        4.10       15.57
    dec2020 |         13        5.33       20.90
    dec2021 |          8        3.28       24.18
    feb2020 |         16        6.56       30.74
    feb2021 |         10        4.10       34.84
    jan2021 |         14        5.74       40.57
    jan2022 |          9        3.69       44.26
    jul2020 |         10        4.10       48.36
    jul2021 |          9        3.69       52.05
    jun2020 |         10        4.10       56.15
    jun2021 |          8        3.28       59.43
    mar2020 |         13        5.33       64.75
    mar2021 |         10        4.10       68.85
    may2020 |          9        3.69       72.54
    may2021 |         13        5.33       77.87
    nov2020 |         12        4.92       82.79
    nov2021 |          6        2.46       85.25
    oct2020 |         10        4.10       89.34
    oct2021 |          7        2.87       92.21
    sep2020 |         10        4.10       96.31
    sep2021 |          9        3.69      100.00
------------+-----------------------------------
      Total |        244      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1963

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          9        3.45        3.45
    apr2021 |         10        3.83        7.28
    aug2020 |         13        4.98       12.26
    aug2021 |          5        1.92       14.18
    dec2020 |          8        3.07       17.24
    dec2021 |         10        3.83       21.07
    feb2020 |         11        4.21       25.29
    feb2021 |         10        3.83       29.12
    jan2021 |         15        5.75       34.87
    jan2022 |         10        3.83       38.70
    jul2020 |         11        4.21       42.91
    jul2021 |         13        4.98       47.89
    jun2020 |         13        4.98       52.87
    jun2021 |         13        4.98       57.85
    mar2020 |         11        4.21       62.07
    mar2021 |          8        3.07       65.13
    may2020 |         14        5.36       70.50
    may2021 |         15        5.75       76.25
    nov2020 |         13        4.98       81.23
    nov2021 |          9        3.45       84.67
    oct2020 |         12        4.60       89.27
    oct2021 |         12        4.60       93.87
    sep2020 |          9        3.45       97.32
    sep2021 |          7        2.68      100.00
------------+-----------------------------------
      Total |        261      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1964

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         13        4.45        4.45
    apr2021 |         10        3.42        7.88
    aug2020 |         13        4.45       12.33
    aug2021 |          7        2.40       14.73
    dec2020 |         13        4.45       19.18
    dec2021 |          9        3.08       22.26
    feb2020 |          7        2.40       24.66
    feb2021 |         18        6.16       30.82
    jan2021 |         17        5.82       36.64
    jan2022 |          8        2.74       39.38
    jul2020 |          8        2.74       42.12
    jul2021 |         13        4.45       46.58
    jun2020 |         12        4.11       50.68
    jun2021 |         16        5.48       56.16
    mar2020 |         14        4.79       60.96
    mar2021 |         15        5.14       66.10
    may2020 |         16        5.48       71.58
    may2021 |         11        3.77       75.34
    nov2020 |         11        3.77       79.11
    nov2021 |         12        4.11       83.22
    oct2020 |         13        4.45       87.67
    oct2021 |         10        3.42       91.10
    sep2020 |         15        5.14       96.23
    sep2021 |         11        3.77      100.00
------------+-----------------------------------
      Total |        292      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1965

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          9        3.40        3.40
    apr2021 |         13        4.91        8.30
    aug2020 |         11        4.15       12.45
    aug2021 |         18        6.79       19.25
    dec2020 |         12        4.53       23.77
    dec2021 |         10        3.77       27.55
    feb2020 |          4        1.51       29.06
    feb2021 |          9        3.40       32.45
    jan2021 |         15        5.66       38.11
    jan2022 |          9        3.40       41.51
    jul2020 |         17        6.42       47.92
    jul2021 |         13        4.91       52.83
    jun2020 |         18        6.79       59.62
    jun2021 |          7        2.64       62.26
    mar2020 |          5        1.89       64.15
    mar2021 |         11        4.15       68.30
    may2020 |         13        4.91       73.21
    may2021 |         11        4.15       77.36
    nov2020 |         12        4.53       81.89
    nov2021 |         11        4.15       86.04
    oct2020 |          9        3.40       89.43
    oct2021 |         12        4.53       93.96
    sep2020 |          9        3.40       97.36
    sep2021 |          7        2.64      100.00
------------+-----------------------------------
      Total |        265      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1966

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        4.94        4.94
    apr2021 |         11        4.53        9.47
    aug2020 |          8        3.29       12.76
    aug2021 |         14        5.76       18.52
    dec2020 |         18        7.41       25.93
    dec2021 |          6        2.47       28.40
    feb2020 |         12        4.94       33.33
    feb2021 |         10        4.12       37.45
    jan2021 |         13        5.35       42.80
    jan2022 |         12        4.94       47.74
    jul2020 |         11        4.53       52.26
    jul2021 |          8        3.29       55.56
    jun2020 |         12        4.94       60.49
    jun2021 |          8        3.29       63.79
    mar2020 |         17        7.00       70.78
    mar2021 |          5        2.06       72.84
    may2020 |         12        4.94       77.78
    may2021 |          6        2.47       80.25
    nov2020 |          4        1.65       81.89
    nov2021 |          8        3.29       85.19
    oct2020 |         12        4.94       90.12
    oct2021 |          7        2.88       93.00
    sep2020 |          7        2.88       95.88
    sep2021 |         10        4.12      100.00
------------+-----------------------------------
      Total |        243      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1967

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         16        6.25        6.25
    apr2021 |          5        1.95        8.20
    aug2020 |          9        3.52       11.72
    aug2021 |         12        4.69       16.41
    dec2020 |         16        6.25       22.66
    dec2021 |          3        1.17       23.83
    feb2020 |         13        5.08       28.91
    feb2021 |         11        4.30       33.20
    jan2021 |         16        6.25       39.45
    jan2022 |         10        3.91       43.36
    jul2020 |          7        2.73       46.09
    jul2021 |         10        3.91       50.00
    jun2020 |         11        4.30       54.30
    jun2021 |          6        2.34       56.64
    mar2020 |         15        5.86       62.50
    mar2021 |         12        4.69       67.19
    may2020 |         12        4.69       71.88
    may2021 |         11        4.30       76.17
    nov2020 |          9        3.52       79.69
    nov2021 |         12        4.69       84.38
    oct2020 |          6        2.34       86.72
    oct2021 |         12        4.69       91.41
    sep2020 |         10        3.91       95.31
    sep2021 |         12        4.69      100.00
------------+-----------------------------------
      Total |        256      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1968

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         15        5.30        5.30
    apr2021 |         12        4.24        9.54
    aug2020 |         10        3.53       13.07
    aug2021 |         13        4.59       17.67
    dec2020 |         14        4.95       22.61
    dec2021 |         11        3.89       26.50
    feb2020 |         13        4.59       31.10
    feb2021 |          4        1.41       32.51
    jan2021 |         13        4.59       37.10
    jan2022 |          6        2.12       39.22
    jul2020 |         11        3.89       43.11
    jul2021 |         12        4.24       47.35
    jun2020 |         11        3.89       51.24
    jun2021 |         15        5.30       56.54
    mar2020 |         11        3.89       60.42
    mar2021 |          9        3.18       63.60
    may2020 |         21        7.42       71.02
    may2021 |         14        4.95       75.97
    nov2020 |         13        4.59       80.57
    nov2021 |         10        3.53       84.10
    oct2020 |         12        4.24       88.34
    oct2021 |          8        2.83       91.17
    sep2020 |         16        5.65       96.82
    sep2021 |          9        3.18      100.00
------------+-----------------------------------
      Total |        283      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1969

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        4.98        4.98
    apr2021 |          9        3.20        8.19
    aug2020 |         16        5.69       13.88
    aug2021 |          8        2.85       16.73
    dec2020 |          7        2.49       19.22
    dec2021 |         10        3.56       22.78
    feb2020 |         13        4.63       27.40
    feb2021 |          9        3.20       30.60
    jan2021 |         13        4.63       35.23
    jan2022 |          7        2.49       37.72
    jul2020 |          7        2.49       40.21
    jul2021 |          8        2.85       43.06
    jun2020 |         10        3.56       46.62
    jun2021 |         18        6.41       53.02
    mar2020 |         11        3.91       56.94
    mar2021 |         12        4.27       61.21
    may2020 |         13        4.63       65.84
    may2021 |         19        6.76       72.60
    nov2020 |         15        5.34       77.94
    nov2021 |          7        2.49       80.43
    oct2020 |         11        3.91       84.34
    oct2021 |         13        4.63       88.97
    sep2020 |         16        5.69       94.66
    sep2021 |         15        5.34      100.00
------------+-----------------------------------
      Total |        281      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1970

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          9        3.40        3.40
    apr2021 |         13        4.91        8.30
    aug2020 |         12        4.53       12.83
    aug2021 |         18        6.79       19.62
    dec2020 |         11        4.15       23.77
    dec2021 |          9        3.40       27.17
    feb2020 |         17        6.42       33.58
    feb2021 |          6        2.26       35.85
    jan2021 |         14        5.28       41.13
    jan2022 |         13        4.91       46.04
    jul2020 |          7        2.64       48.68
    jul2021 |         10        3.77       52.45
    jun2020 |          7        2.64       55.09
    jun2021 |         14        5.28       60.38
    mar2020 |         20        7.55       67.92
    mar2021 |          7        2.64       70.57
    may2020 |         12        4.53       75.09
    may2021 |          9        3.40       78.49
    nov2020 |         10        3.77       82.26
    nov2021 |         12        4.53       86.79
    oct2020 |         10        3.77       90.57
    oct2021 |          8        3.02       93.58
    sep2020 |          8        3.02       96.60
    sep2021 |          9        3.40      100.00
------------+-----------------------------------
      Total |        265      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1971

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          9        3.64        3.64
    apr2021 |         10        4.05        7.69
    aug2020 |         13        5.26       12.96
    aug2021 |         13        5.26       18.22
    dec2020 |         13        5.26       23.48
    dec2021 |         10        4.05       27.53
    feb2020 |          7        2.83       30.36
    feb2021 |         12        4.86       35.22
    jan2021 |         10        4.05       39.27
    jan2022 |          8        3.24       42.51
    jul2020 |         10        4.05       46.56
    jul2021 |         13        5.26       51.82
    jun2020 |          9        3.64       55.47
    jun2021 |          7        2.83       58.30
    mar2020 |          7        2.83       61.13
    mar2021 |          8        3.24       64.37
    may2020 |         25       10.12       74.49
    may2021 |         11        4.45       78.95
    nov2020 |         11        4.45       83.40
    nov2021 |          4        1.62       85.02
    oct2020 |          9        3.64       88.66
    oct2021 |         12        4.86       93.52
    sep2020 |          6        2.43       95.95
    sep2021 |         10        4.05      100.00
------------+-----------------------------------
      Total |        247      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1972

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         15        5.45        5.45
    apr2021 |          8        2.91        8.36
    aug2020 |         12        4.36       12.73
    aug2021 |         10        3.64       16.36
    dec2020 |         15        5.45       21.82
    dec2021 |          9        3.27       25.09
    feb2020 |         14        5.09       30.18
    feb2021 |         13        4.73       34.91
    jan2021 |         14        5.09       40.00
    jan2022 |          8        2.91       42.91
    jul2020 |         21        7.64       50.55
    jul2021 |         11        4.00       54.55
    jun2020 |          7        2.55       57.09
    jun2021 |         12        4.36       61.45
    mar2020 |         13        4.73       66.18
    mar2021 |          6        2.18       68.36
    may2020 |         11        4.00       72.36
    may2021 |          8        2.91       75.27
    nov2020 |          9        3.27       78.55
    nov2021 |         14        5.09       83.64
    oct2020 |         13        4.73       88.36
    oct2021 |          9        3.27       91.64
    sep2020 |         11        4.00       95.64
    sep2021 |         12        4.36      100.00
------------+-----------------------------------
      Total |        275      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1973

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         16        6.23        6.23
    apr2021 |         13        5.06       11.28
    aug2020 |          7        2.72       14.01
    aug2021 |          8        3.11       17.12
    dec2020 |         14        5.45       22.57
    dec2021 |          9        3.50       26.07
    feb2020 |         17        6.61       32.68
    feb2021 |         10        3.89       36.58
    jan2021 |          8        3.11       39.69
    jan2022 |          6        2.33       42.02
    jul2020 |          9        3.50       45.53
    jul2021 |          7        2.72       48.25
    jun2020 |         10        3.89       52.14
    jun2021 |         13        5.06       57.20
    mar2020 |          9        3.50       60.70
    mar2021 |         10        3.89       64.59
    may2020 |         20        7.78       72.37
    may2021 |          8        3.11       75.49
    nov2020 |         13        5.06       80.54
    nov2021 |         10        3.89       84.44
    oct2020 |         13        5.06       89.49
    oct2021 |          9        3.50       93.00
    sep2020 |         14        5.45       98.44
    sep2021 |          4        1.56      100.00
------------+-----------------------------------
      Total |        257      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1974

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         13        5.10        5.10
    apr2021 |          9        3.53        8.63
    aug2020 |         10        3.92       12.55
    aug2021 |         11        4.31       16.86
    dec2020 |         10        3.92       20.78
    dec2021 |          9        3.53       24.31
    feb2020 |          9        3.53       27.84
    feb2021 |          9        3.53       31.37
    jan2021 |         13        5.10       36.47
    jan2022 |         12        4.71       41.18
    jul2020 |          7        2.75       43.92
    jul2021 |         13        5.10       49.02
    jun2020 |         14        5.49       54.51
    jun2021 |          9        3.53       58.04
    mar2020 |         13        5.10       63.14
    mar2021 |          7        2.75       65.88
    may2020 |         17        6.67       72.55
    may2021 |          9        3.53       76.08
    nov2020 |          8        3.14       79.22
    nov2021 |         11        4.31       83.53
    oct2020 |         12        4.71       88.24
    oct2021 |         11        4.31       92.55
    sep2020 |          7        2.75       95.29
    sep2021 |         12        4.71      100.00
------------+-----------------------------------
      Total |        255      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1975

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        4.12        4.12
    apr2021 |         11        4.12        8.24
    aug2020 |         15        5.62       13.86
    aug2021 |         13        4.87       18.73
    dec2020 |         13        4.87       23.60
    dec2021 |         15        5.62       29.21
    feb2020 |         15        5.62       34.83
    feb2021 |         13        4.87       39.70
    jan2021 |         10        3.75       43.45
    jan2022 |          9        3.37       46.82
    jul2020 |         12        4.49       51.31
    jul2021 |          4        1.50       52.81
    jun2020 |         12        4.49       57.30
    jun2021 |         10        3.75       61.05
    mar2020 |         13        4.87       65.92
    mar2021 |          6        2.25       68.16
    may2020 |          7        2.62       70.79
    may2021 |          8        3.00       73.78
    nov2020 |         11        4.12       77.90
    nov2021 |         12        4.49       82.40
    oct2020 |         11        4.12       86.52
    oct2021 |         12        4.49       91.01
    sep2020 |          9        3.37       94.38
    sep2021 |         15        5.62      100.00
------------+-----------------------------------
      Total |        267      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1976

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        5.56        5.56
    apr2021 |          9        3.57        9.13
    aug2020 |         19        7.54       16.67
    aug2021 |          6        2.38       19.05
    dec2020 |          8        3.17       22.22
    dec2021 |          5        1.98       24.21
    feb2020 |         14        5.56       29.76
    feb2021 |          7        2.78       32.54
    jan2021 |          9        3.57       36.11
    jan2022 |          9        3.57       39.68
    jul2020 |          9        3.57       43.25
    jul2021 |         15        5.95       49.21
    jun2020 |         12        4.76       53.97
    jun2021 |         13        5.16       59.13
    mar2020 |         12        4.76       63.89
    mar2021 |         11        4.37       68.25
    may2020 |         12        4.76       73.02
    may2021 |          8        3.17       76.19
    nov2020 |         13        5.16       81.35
    nov2021 |          7        2.78       84.13
    oct2020 |          8        3.17       87.30
    oct2021 |         10        3.97       91.27
    sep2020 |         12        4.76       96.03
    sep2021 |         10        3.97      100.00
------------+-----------------------------------
      Total |        252      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1977

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        5.98        5.98
    apr2021 |         12        5.13       11.11
    aug2020 |          6        2.56       13.68
    aug2021 |         13        5.56       19.23
    dec2020 |         11        4.70       23.93
    dec2021 |          8        3.42       27.35
    feb2020 |         15        6.41       33.76
    feb2021 |         10        4.27       38.03
    jan2021 |         11        4.70       42.74
    jan2022 |         12        5.13       47.86
    jul2020 |         10        4.27       52.14
    jul2021 |          5        2.14       54.27
    jun2020 |         10        4.27       58.55
    jun2021 |         10        4.27       62.82
    mar2020 |         12        5.13       67.95
    mar2021 |         11        4.70       72.65
    may2020 |          9        3.85       76.50
    may2021 |          4        1.71       78.21
    nov2020 |          6        2.56       80.77
    nov2021 |          8        3.42       84.19
    oct2020 |         12        5.13       89.32
    oct2021 |          5        2.14       91.45
    sep2020 |          8        3.42       94.87
    sep2021 |         12        5.13      100.00
------------+-----------------------------------
      Total |        234      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1978

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          8        3.28        3.28
    apr2021 |         11        4.51        7.79
    aug2020 |         10        4.10       11.89
    aug2021 |          4        1.64       13.52
    dec2020 |          8        3.28       16.80
    dec2021 |         13        5.33       22.13
    feb2020 |          9        3.69       25.82
    feb2021 |         10        4.10       29.92
    jan2021 |         16        6.56       36.48
    jan2022 |          7        2.87       39.34
    jul2020 |         12        4.92       44.26
    jul2021 |          9        3.69       47.95
    jun2020 |         12        4.92       52.87
    jun2021 |         10        4.10       56.97
    mar2020 |          6        2.46       59.43
    mar2021 |         17        6.97       66.39
    may2020 |          8        3.28       69.67
    may2021 |          4        1.64       71.31
    nov2020 |         14        5.74       77.05
    nov2021 |          9        3.69       80.74
    oct2020 |         12        4.92       85.66
    oct2021 |         10        4.10       89.75
    sep2020 |         13        5.33       95.08
    sep2021 |         12        4.92      100.00
------------+-----------------------------------
      Total |        244      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1979

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          9        3.86        3.86
    apr2021 |          7        3.00        6.87
    aug2020 |         11        4.72       11.59
    aug2021 |          7        3.00       14.59
    dec2020 |         10        4.29       18.88
    dec2021 |         12        5.15       24.03
    feb2020 |         10        4.29       28.33
    feb2021 |          7        3.00       31.33
    jan2021 |          5        2.15       33.48
    jan2022 |         15        6.44       39.91
    jul2020 |         13        5.58       45.49
    jul2021 |         12        5.15       50.64
    jun2020 |         12        5.15       55.79
    jun2021 |         11        4.72       60.52
    mar2020 |         12        5.15       65.67
    mar2021 |         11        4.72       70.39
    may2020 |          8        3.43       73.82
    may2021 |         11        4.72       78.54
    nov2020 |         10        4.29       82.83
    nov2021 |          8        3.43       86.27
    oct2020 |          9        3.86       90.13
    oct2021 |          9        3.86       93.99
    sep2020 |         11        4.72       98.71
    sep2021 |          3        1.29      100.00
------------+-----------------------------------
      Total |        233      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1980

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          6        2.21        2.21
    apr2021 |          7        2.57        4.78
    aug2020 |         13        4.78        9.56
    aug2021 |          7        2.57       12.13
    dec2020 |         12        4.41       16.54
    dec2021 |          7        2.57       19.12
    feb2020 |         12        4.41       23.53
    feb2021 |         11        4.04       27.57
    jan2021 |         13        4.78       32.35
    jan2022 |          8        2.94       35.29
    jul2020 |         20        7.35       42.65
    jul2021 |          8        2.94       45.59
    jun2020 |          6        2.21       47.79
    jun2021 |         10        3.68       51.47
    mar2020 |         17        6.25       57.72
    mar2021 |         12        4.41       62.13
    may2020 |         14        5.15       67.28
    may2021 |          3        1.10       68.38
    nov2020 |         14        5.15       73.53
    nov2021 |         17        6.25       79.78
    oct2020 |         10        3.68       83.46
    oct2021 |         14        5.15       88.60
    sep2020 |         19        6.99       95.59
    sep2021 |         12        4.41      100.00
------------+-----------------------------------
      Total |        272      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1981

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          8        2.93        2.93
    apr2021 |         10        3.66        6.59
    aug2020 |         15        5.49       12.09
    aug2021 |         13        4.76       16.85
    dec2020 |          8        2.93       19.78
    dec2021 |          7        2.56       22.34
    feb2020 |         12        4.40       26.74
    feb2021 |          8        2.93       29.67
    jan2021 |         11        4.03       33.70
    jan2022 |         10        3.66       37.36
    jul2020 |         19        6.96       44.32
    jul2021 |         13        4.76       49.08
    jun2020 |         13        4.76       53.85
    jun2021 |         18        6.59       60.44
    mar2020 |         19        6.96       67.40
    mar2021 |          8        2.93       70.33
    may2020 |         11        4.03       74.36
    may2021 |          9        3.30       77.66
    nov2020 |         12        4.40       82.05
    nov2021 |          8        2.93       84.98
    oct2020 |          6        2.20       87.18
    oct2021 |          9        3.30       90.48
    sep2020 |         13        4.76       95.24
    sep2021 |         13        4.76      100.00
------------+-----------------------------------
      Total |        273      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1982

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          8        3.10        3.10
    apr2021 |         12        4.65        7.75
    aug2020 |          8        3.10       10.85
    aug2021 |          8        3.10       13.95
    dec2020 |         16        6.20       20.16
    dec2021 |          8        3.10       23.26
    feb2020 |         14        5.43       28.68
    feb2021 |         11        4.26       32.95
    jan2021 |         12        4.65       37.60
    jan2022 |          5        1.94       39.53
    jul2020 |         12        4.65       44.19
    jul2021 |         12        4.65       48.84
    jun2020 |         12        4.65       53.49
    jun2021 |         12        4.65       58.14
    mar2020 |         15        5.81       63.95
    mar2021 |          9        3.49       67.44
    may2020 |          7        2.71       70.16
    may2021 |          8        3.10       73.26
    nov2020 |          8        3.10       76.36
    nov2021 |         10        3.88       80.23
    oct2020 |         17        6.59       86.82
    oct2021 |         13        5.04       91.86
    sep2020 |         15        5.81       97.67
    sep2021 |          6        2.33      100.00
------------+-----------------------------------
      Total |        258      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1983

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         14        5.07        5.07
    apr2021 |         13        4.71        9.78
    aug2020 |         11        3.99       13.77
    aug2021 |          7        2.54       16.30
    dec2020 |         14        5.07       21.38
    dec2021 |         11        3.99       25.36
    feb2020 |         12        4.35       29.71
    feb2021 |         10        3.62       33.33
    jan2021 |          9        3.26       36.59
    jan2022 |         13        4.71       41.30
    jul2020 |         14        5.07       46.38
    jul2021 |          3        1.09       47.46
    jun2020 |         16        5.80       53.26
    jun2021 |          9        3.26       56.52
    mar2020 |         16        5.80       62.32
    mar2021 |         16        5.80       68.12
    may2020 |         14        5.07       73.19
    may2021 |         11        3.99       77.17
    nov2020 |         14        5.07       82.25
    nov2021 |          5        1.81       84.06
    oct2020 |         14        5.07       89.13
    oct2021 |         12        4.35       93.48
    sep2020 |         10        3.62       97.10
    sep2021 |          8        2.90      100.00
------------+-----------------------------------
      Total |        276      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1984

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          6        2.71        2.71
    apr2021 |          5        2.26        4.98
    aug2020 |         10        4.52        9.50
    aug2021 |         14        6.33       15.84
    dec2020 |         13        5.88       21.72
    dec2021 |          8        3.62       25.34
    feb2020 |          7        3.17       28.51
    feb2021 |          4        1.81       30.32
    jan2021 |          7        3.17       33.48
    jan2022 |          9        4.07       37.56
    jul2020 |          9        4.07       41.63
    jul2021 |         10        4.52       46.15
    jun2020 |         11        4.98       51.13
    jun2021 |         11        4.98       56.11
    mar2020 |          8        3.62       59.73
    mar2021 |         13        5.88       65.61
    may2020 |         13        5.88       71.49
    may2021 |         10        4.52       76.02
    nov2020 |          9        4.07       80.09
    nov2021 |          7        3.17       83.26
    oct2020 |         13        5.88       89.14
    oct2021 |          8        3.62       92.76
    sep2020 |         12        5.43       98.19
    sep2021 |          4        1.81      100.00
------------+-----------------------------------
      Total |        221      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1985

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        4.42        4.42
    apr2021 |          8        3.21        7.63
    aug2020 |         13        5.22       12.85
    aug2021 |         10        4.02       16.87
    dec2020 |         17        6.83       23.69
    dec2021 |          5        2.01       25.70
    feb2020 |         14        5.62       31.33
    feb2021 |          7        2.81       34.14
    jan2021 |          9        3.61       37.75
    jan2022 |         10        4.02       41.77
    jul2020 |         14        5.62       47.39
    jul2021 |          7        2.81       50.20
    jun2020 |         20        8.03       58.23
    jun2021 |          8        3.21       61.45
    mar2020 |          8        3.21       64.66
    mar2021 |         10        4.02       68.67
    may2020 |          9        3.61       72.29
    may2021 |         12        4.82       77.11
    nov2020 |          9        3.61       80.72
    nov2021 |          7        2.81       83.53
    oct2020 |          7        2.81       86.35
    oct2021 |          9        3.61       89.96
    sep2020 |          9        3.61       93.57
    sep2021 |         16        6.43      100.00
------------+-----------------------------------
      Total |        249      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1986

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        4.10        4.10
    apr2021 |         14        5.22        9.33
    aug2020 |         10        3.73       13.06
    aug2021 |         17        6.34       19.40
    dec2020 |         10        3.73       23.13
    dec2021 |          9        3.36       26.49
    feb2020 |         12        4.48       30.97
    feb2021 |          3        1.12       32.09
    jan2021 |         14        5.22       37.31
    jan2022 |          6        2.24       39.55
    jul2020 |         12        4.48       44.03
    jul2021 |         10        3.73       47.76
    jun2020 |         11        4.10       51.87
    jun2021 |          8        2.99       54.85
    mar2020 |         11        4.10       58.96
    mar2021 |          9        3.36       62.31
    may2020 |         16        5.97       68.28
    may2021 |         10        3.73       72.01
    nov2020 |         13        4.85       76.87
    nov2021 |         13        4.85       81.72
    oct2020 |         12        4.48       86.19
    oct2021 |         12        4.48       90.67
    sep2020 |         12        4.48       95.15
    sep2021 |         13        4.85      100.00
------------+-----------------------------------
      Total |        268      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1987

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        4.56        4.56
    apr2021 |          8        3.32        7.88
    aug2020 |          9        3.73       11.62
    aug2021 |         12        4.98       16.60
    dec2020 |          6        2.49       19.09
    dec2021 |         10        4.15       23.24
    feb2020 |         14        5.81       29.05
    feb2021 |          6        2.49       31.54
    jan2021 |         20        8.30       39.83
    jan2022 |         10        4.15       43.98
    jul2020 |         10        4.15       48.13
    jul2021 |          9        3.73       51.87
    jun2020 |         12        4.98       56.85
    jun2021 |         10        4.15       61.00
    mar2020 |         10        4.15       65.15
    mar2021 |          9        3.73       68.88
    may2020 |          6        2.49       71.37
    may2021 |          7        2.90       74.27
    nov2020 |         14        5.81       80.08
    nov2021 |          9        3.73       83.82
    oct2020 |         11        4.56       88.38
    oct2021 |         10        4.15       92.53
    sep2020 |         12        4.98       97.51
    sep2021 |          6        2.49      100.00
------------+-----------------------------------
      Total |        241      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1988

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         10        3.94        3.94
    apr2021 |          7        2.76        6.69
    aug2020 |         15        5.91       12.60
    aug2021 |         10        3.94       16.54
    dec2020 |         10        3.94       20.47
    dec2021 |         12        4.72       25.20
    feb2020 |          9        3.54       28.74
    feb2021 |         11        4.33       33.07
    jan2021 |          4        1.57       34.65
    jan2022 |         11        4.33       38.98
    jul2020 |         12        4.72       43.70
    jul2021 |          9        3.54       47.24
    jun2020 |          7        2.76       50.00
    jun2021 |          8        3.15       53.15
    mar2020 |         14        5.51       58.66
    mar2021 |         10        3.94       62.60
    may2020 |         10        3.94       66.54
    may2021 |          7        2.76       69.29
    nov2020 |         13        5.12       74.41
    nov2021 |         11        4.33       78.74
    oct2020 |         17        6.69       85.43
    oct2021 |         12        4.72       90.16
    sep2020 |         12        4.72       94.88
    sep2021 |         13        5.12      100.00
------------+-----------------------------------
      Total |        254      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1989

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          8        3.04        3.04
    apr2021 |         21        7.98       11.03
    aug2020 |          8        3.04       14.07
    aug2021 |          9        3.42       17.49
    dec2020 |         13        4.94       22.43
    dec2021 |          8        3.04       25.48
    feb2020 |         10        3.80       29.28
    feb2021 |          8        3.04       32.32
    jan2021 |         10        3.80       36.12
    jan2022 |         13        4.94       41.06
    jul2020 |         13        4.94       46.01
    jul2021 |         16        6.08       52.09
    jun2020 |          9        3.42       55.51
    jun2021 |          7        2.66       58.17
    mar2020 |         16        6.08       64.26
    mar2021 |          8        3.04       67.30
    may2020 |          9        3.42       70.72
    may2021 |         10        3.80       74.52
    nov2020 |         14        5.32       79.85
    nov2021 |          8        3.04       82.89
    oct2020 |         14        5.32       88.21
    oct2021 |         11        4.18       92.40
    sep2020 |         13        4.94       97.34
    sep2021 |          7        2.66      100.00
------------+-----------------------------------
      Total |        263      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1990

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        4.94        4.94
    apr2021 |          4        1.65        6.58
    aug2020 |          9        3.70       10.29
    aug2021 |         11        4.53       14.81
    dec2020 |         10        4.12       18.93
    dec2021 |         12        4.94       23.87
    feb2020 |         11        4.53       28.40
    feb2021 |         14        5.76       34.16
    jan2021 |         13        5.35       39.51
    jan2022 |          9        3.70       43.21
    jul2020 |          9        3.70       46.91
    jul2021 |          8        3.29       50.21
    jun2020 |         10        4.12       54.32
    jun2021 |         10        4.12       58.44
    mar2020 |          8        3.29       61.73
    mar2021 |         10        4.12       65.84
    may2020 |         13        5.35       71.19
    may2021 |         11        4.53       75.72
    nov2020 |         13        5.35       81.07
    nov2021 |         11        4.53       85.60
    oct2020 |         11        4.53       90.12
    oct2021 |         12        4.94       95.06
    sep2020 |          3        1.23       96.30
    sep2021 |          9        3.70      100.00
------------+-----------------------------------
      Total |        243      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1991

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         10        3.94        3.94
    apr2021 |          6        2.36        6.30
    aug2020 |         20        7.87       14.17
    aug2021 |         10        3.94       18.11
    dec2020 |         14        5.51       23.62
    dec2021 |          9        3.54       27.17
    feb2020 |         10        3.94       31.10
    feb2021 |         10        3.94       35.04
    jan2021 |          9        3.54       38.58
    jan2022 |          6        2.36       40.94
    jul2020 |         12        4.72       45.67
    jul2021 |          6        2.36       48.03
    jun2020 |         20        7.87       55.91
    jun2021 |          9        3.54       59.45
    mar2020 |          9        3.54       62.99
    mar2021 |         14        5.51       68.50
    may2020 |         13        5.12       73.62
    may2021 |         12        4.72       78.35
    nov2020 |         12        4.72       83.07
    nov2021 |         10        3.94       87.01
    oct2020 |         16        6.30       93.31
    oct2021 |          6        2.36       95.67
    sep2020 |          6        2.36       98.03
    sep2021 |          5        1.97      100.00
------------+-----------------------------------
      Total |        254      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1992

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         15        5.70        5.70
    apr2021 |          8        3.04        8.75
    aug2020 |         17        6.46       15.21
    aug2021 |          7        2.66       17.87
    dec2020 |          9        3.42       21.29
    dec2021 |          9        3.42       24.71
    feb2020 |         20        7.60       32.32
    feb2021 |          7        2.66       34.98
    jan2021 |         14        5.32       40.30
    jan2022 |         10        3.80       44.11
    jul2020 |         20        7.60       51.71
    jul2021 |         12        4.56       56.27
    jun2020 |         14        5.32       61.60
    jun2021 |          9        3.42       65.02
    mar2020 |         14        5.32       70.34
    mar2021 |          7        2.66       73.00
    may2020 |         11        4.18       77.19
    may2021 |          7        2.66       79.85
    nov2020 |          8        3.04       82.89
    nov2021 |          9        3.42       86.31
    oct2020 |         12        4.56       90.87
    oct2021 |          9        3.42       94.30
    sep2020 |          5        1.90       96.20
    sep2021 |         10        3.80      100.00
------------+-----------------------------------
      Total |        263      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1993

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          9        3.24        3.24
    apr2021 |         11        3.96        7.19
    aug2020 |         11        3.96       11.15
    aug2021 |          7        2.52       13.67
    dec2020 |         11        3.96       17.63
    dec2021 |          8        2.88       20.50
    feb2020 |         16        5.76       26.26
    feb2021 |         13        4.68       30.94
    jan2021 |         13        4.68       35.61
    jan2022 |         18        6.47       42.09
    jul2020 |         16        5.76       47.84
    jul2021 |          7        2.52       50.36
    jun2020 |         11        3.96       54.32
    jun2021 |         13        4.68       58.99
    mar2020 |          9        3.24       62.23
    mar2021 |         10        3.60       65.83
    may2020 |          7        2.52       68.35
    may2021 |         14        5.04       73.38
    nov2020 |          5        1.80       75.18
    nov2021 |         17        6.12       81.29
    oct2020 |         14        5.04       86.33
    oct2021 |          5        1.80       88.13
    sep2020 |         14        5.04       93.17
    sep2021 |         19        6.83      100.00
------------+-----------------------------------
      Total |        278      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1994

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         10        4.18        4.18
    apr2021 |          8        3.35        7.53
    aug2020 |         12        5.02       12.55
    aug2021 |          8        3.35       15.90
    dec2020 |          5        2.09       17.99
    dec2021 |          6        2.51       20.50
    feb2020 |          9        3.77       24.27
    feb2021 |          5        2.09       26.36
    jan2021 |         10        4.18       30.54
    jan2022 |         10        4.18       34.73
    jul2020 |         11        4.60       39.33
    jul2021 |         14        5.86       45.19
    jun2020 |         11        4.60       49.79
    jun2021 |          9        3.77       53.56
    mar2020 |         17        7.11       60.67
    mar2021 |         12        5.02       65.69
    may2020 |         17        7.11       72.80
    may2021 |         12        5.02       77.82
    nov2020 |          9        3.77       81.59
    nov2021 |          3        1.26       82.85
    oct2020 |         16        6.69       89.54
    oct2021 |         13        5.44       94.98
    sep2020 |          7        2.93       97.91
    sep2021 |          5        2.09      100.00
------------+-----------------------------------
      Total |        239      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1995

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         11        3.75        3.75
    apr2021 |          5        1.71        5.46
    aug2020 |         13        4.44        9.90
    aug2021 |          7        2.39       12.29
    dec2020 |          8        2.73       15.02
    dec2021 |         10        3.41       18.43
    feb2020 |         14        4.78       23.21
    feb2021 |         13        4.44       27.65
    jan2021 |         20        6.83       34.47
    jan2022 |          9        3.07       37.54
    jul2020 |         20        6.83       44.37
    jul2021 |         13        4.44       48.81
    jun2020 |         23        7.85       56.66
    jun2021 |         12        4.10       60.75
    mar2020 |         10        3.41       64.16
    mar2021 |         12        4.10       68.26
    may2020 |         19        6.48       74.74
    may2021 |         13        4.44       79.18
    nov2020 |          9        3.07       82.25
    nov2021 |         16        5.46       87.71
    oct2020 |          8        2.73       90.44
    oct2021 |          7        2.39       92.83
    sep2020 |         14        4.78       97.61
    sep2021 |          7        2.39      100.00
------------+-----------------------------------
      Total |        293      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1996

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |          7        2.69        2.69
    apr2021 |          9        3.46        6.15
    aug2020 |         16        6.15       12.31
    aug2021 |          8        3.08       15.38
    dec2020 |         11        4.23       19.62
    dec2021 |          8        3.08       22.69
    feb2020 |         12        4.62       27.31
    feb2021 |          8        3.08       30.38
    jan2021 |         12        4.62       35.00
    jan2022 |          7        2.69       37.69
    jul2020 |         14        5.38       43.08
    jul2021 |         15        5.77       48.85
    jun2020 |         12        4.62       53.46
    jun2021 |          7        2.69       56.15
    mar2020 |         12        4.62       60.77
    mar2021 |         14        5.38       66.15
    may2020 |          4        1.54       67.69
    may2021 |         12        4.62       72.31
    nov2020 |          9        3.46       75.77
    nov2021 |         13        5.00       80.77
    oct2020 |         10        3.85       84.62
    oct2021 |         14        5.38       90.00
    sep2020 |         13        5.00       95.00
    sep2021 |         13        5.00      100.00
------------+-----------------------------------
      Total |        260      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1997

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         12        4.94        4.94
    apr2021 |          7        2.88        7.82
    aug2020 |          8        3.29       11.11
    aug2021 |         11        4.53       15.64
    dec2020 |         14        5.76       21.40
    dec2021 |         10        4.12       25.51
    feb2020 |          9        3.70       29.22
    feb2021 |          9        3.70       32.92
    jan2021 |         10        4.12       37.04
    jan2022 |          8        3.29       40.33
    jul2020 |         12        4.94       45.27
    jul2021 |         10        4.12       49.38
    jun2020 |          8        3.29       52.67
    jun2021 |         15        6.17       58.85
    mar2020 |         15        6.17       65.02
    mar2021 |          5        2.06       67.08
    may2020 |          8        3.29       70.37
    may2021 |          9        3.70       74.07
    nov2020 |          9        3.70       77.78
    nov2021 |          9        3.70       81.48
    oct2020 |         13        5.35       86.83
    oct2021 |         14        5.76       92.59
    sep2020 |          5        2.06       94.65
    sep2021 |         13        5.35      100.00
------------+-----------------------------------
      Total |        243      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1998

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         10        3.77        3.77
    apr2021 |          9        3.40        7.17
    aug2020 |         13        4.91       12.08
    aug2021 |          7        2.64       14.72
    dec2020 |         13        4.91       19.62
    dec2021 |         10        3.77       23.40
    feb2020 |         12        4.53       27.92
    feb2021 |          9        3.40       31.32
    jan2021 |          9        3.40       34.72
    jan2022 |          9        3.40       38.11
    jul2020 |         12        4.53       42.64
    jul2021 |         10        3.77       46.42
    jun2020 |         10        3.77       50.19
    jun2021 |         14        5.28       55.47
    mar2020 |         13        4.91       60.38
    mar2021 |         16        6.04       66.42
    may2020 |          7        2.64       69.06
    may2021 |          7        2.64       71.70
    nov2020 |         22        8.30       80.00
    nov2021 |          6        2.26       82.26
    oct2020 |         16        6.04       88.30
    oct2021 |          6        2.26       90.57
    sep2020 |         16        6.04       96.60
    sep2021 |          9        3.40      100.00
------------+-----------------------------------
      Total |        265      100.00

-------------------------------------------------------------------------------
-> year_of_birth = 1999

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |         16        6.64        6.64
    apr2021 |          8        3.32        9.96
    aug2020 |         12        4.98       14.94
    aug2021 |          6        2.49       17.43
    dec2020 |         11        4.56       21.99
    dec2021 |          9        3.73       25.73
    feb2020 |         11        4.56       30.29
    feb2021 |         11        4.56       34.85
    jan2021 |         11        4.56       39.42
    jan2022 |          7        2.90       42.32
    jul2020 |         12        4.98       47.30
    jul2021 |          7        2.90       50.21
    jun2020 |         12        4.98       55.19
    jun2021 |          8        3.32       58.51
    mar2020 |         14        5.81       64.32
    mar2021 |         10        4.15       68.46
    may2020 |         11        4.56       73.03
    may2021 |         11        4.56       77.59
    nov2020 |         12        4.98       82.57
    nov2021 |         10        4.15       86.72
    oct2020 |         10        4.15       90.87
    oct2021 |          6        2.49       93.36
    sep2020 |          9        3.73       97.10
    sep2021 |          7        2.90      100.00
------------+-----------------------------------
      Total |        241      100.00


. 
. export delimited using "./output/covid_matching.csv", replace
(note: file ./output/covid_matching.csv not found)
file ./output/covid_matching.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_matching.log
  log type:  text
 closed on:  20 Oct 2022, 16:01:38
-------------------------------------------------------------------------------
