-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2020.log
  log type:  text
 opened on:  19 Jul 2023, 12:43:14

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames
> (1) case(preserve) 
(55 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,651 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,968 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,884 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,789 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,681 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,036 real changes made, 14,036 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,036 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,027 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,300 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,691 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,300 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,691 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,377 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,027 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,300 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,691 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(17,991 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,650 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,036 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(17,991 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,300 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(15,803 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(15,803 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 ///
>                                                                              
>                    baseline_creatinine_oct2022     ///
>                                                                              
>                    baseline_creatinine_nov2022 ///
>                                                                              
>                    baseline_creatinine_dec2022     {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(7,127 real changes made, 7,127 to missing)
(7,127 missing values generated)
(16,224 missing values generated)
(4,654 real changes made)
(4,443 real changes made)
(4,654 real changes made)
(4,443 real changes made)
(5,756 real changes made)
(16,224 missing values generated)
(4,654 real changes made)
(4,443 real changes made)
(9,097 real changes made)
(10,468 real changes made)
(7,127 missing values generated)
(9,097 real changes made)
(4,654 real changes made)
(7,159 real changes made, 7,159 to missing)
(7,159 missing values generated)
(16,224 missing values generated)
(4,638 real changes made)
(4,427 real changes made)
(4,638 real changes made)
(4,427 real changes made)
(5,750 real changes made)
(16,224 missing values generated)
(4,638 real changes made)
(4,427 real changes made)
(9,065 real changes made)
(10,474 real changes made)
(7,159 missing values generated)
(9,065 real changes made)
(4,638 real changes made)
(7,172 real changes made, 7,172 to missing)
(7,172 missing values generated)
(16,224 missing values generated)
(4,660 real changes made)
(4,392 real changes made)
(4,660 real changes made)
(4,392 real changes made)
(5,809 real changes made)
(16,224 missing values generated)
(4,660 real changes made)
(4,392 real changes made)
(9,052 real changes made)
(10,415 real changes made)
(7,172 missing values generated)
(9,052 real changes made)
(4,660 real changes made)
(7,166 real changes made, 7,166 to missing)
(7,166 missing values generated)
(16,224 missing values generated)
(4,598 real changes made)
(4,460 real changes made)
(4,598 real changes made)
(4,460 real changes made)
(5,731 real changes made)
(16,224 missing values generated)
(4,598 real changes made)
(4,460 real changes made)
(9,058 real changes made)
(10,493 real changes made)
(7,166 missing values generated)
(9,058 real changes made)
(4,598 real changes made)
(7,150 real changes made, 7,150 to missing)
(7,150 missing values generated)
(16,224 missing values generated)
(4,703 real changes made)
(4,371 real changes made)
(4,703 real changes made)
(4,371 real changes made)
(5,782 real changes made)
(16,224 missing values generated)
(4,703 real changes made)
(4,371 real changes made)
(9,074 real changes made)
(10,442 real changes made)
(7,150 missing values generated)
(9,074 real changes made)
(4,703 real changes made)
(7,196 real changes made, 7,196 to missing)
(7,196 missing values generated)
(16,224 missing values generated)
(4,663 real changes made)
(4,365 real changes made)
(4,663 real changes made)
(4,365 real changes made)
(5,728 real changes made)
(16,224 missing values generated)
(4,663 real changes made)
(4,365 real changes made)
(9,028 real changes made)
(10,496 real changes made)
(7,196 missing values generated)
(9,028 real changes made)
(4,663 real changes made)
(7,110 real changes made, 7,110 to missing)
(7,110 missing values generated)
(16,224 missing values generated)
(4,575 real changes made)
(4,539 real changes made)
(4,575 real changes made)
(4,539 real changes made)
(5,659 real changes made)
(16,224 missing values generated)
(4,575 real changes made)
(4,539 real changes made)
(9,114 real changes made)
(10,565 real changes made)
(7,110 missing values generated)
(9,114 real changes made)
(4,575 real changes made)
(7,227 real changes made, 7,227 to missing)
(7,227 missing values generated)
(16,224 missing values generated)
(4,676 real changes made)
(4,321 real changes made)
(4,676 real changes made)
(4,321 real changes made)
(5,726 real changes made)
(16,224 missing values generated)
(4,676 real changes made)
(4,321 real changes made)
(8,997 real changes made)
(10,498 real changes made)
(7,227 missing values generated)
(8,997 real changes made)
(4,676 real changes made)
(7,103 real changes made, 7,103 to missing)
(7,103 missing values generated)
(16,224 missing values generated)
(4,687 real changes made)
(4,434 real changes made)
(4,687 real changes made)
(4,434 real changes made)
(5,711 real changes made)
(16,224 missing values generated)
(4,687 real changes made)
(4,434 real changes made)
(9,121 real changes made)
(10,513 real changes made)
(7,103 missing values generated)
(9,121 real changes made)
(4,687 real changes made)
(7,101 real changes made, 7,101 to missing)
(7,101 missing values generated)
(16,224 missing values generated)
(4,703 real changes made)
(4,420 real changes made)
(4,703 real changes made)
(4,420 real changes made)
(5,754 real changes made)
(16,224 missing values generated)
(4,703 real changes made)
(4,420 real changes made)
(9,123 real changes made)
(10,470 real changes made)
(7,101 missing values generated)
(9,123 real changes made)
(4,703 real changes made)
(7,141 real changes made, 7,141 to missing)
(7,141 missing values generated)
(16,224 missing values generated)
(4,672 real changes made)
(4,411 real changes made)
(4,672 real changes made)
(4,411 real changes made)
(5,766 real changes made)
(16,224 missing values generated)
(4,672 real changes made)
(4,411 real changes made)
(9,083 real changes made)
(10,458 real changes made)
(7,141 missing values generated)
(9,083 real changes made)
(4,672 real changes made)
(7,167 real changes made, 7,167 to missing)
(7,167 missing values generated)
(16,224 missing values generated)
(4,681 real changes made)
(4,376 real changes made)
(4,681 real changes made)
(4,376 real changes made)
(5,744 real changes made)
(16,224 missing values generated)
(4,681 real changes made)
(4,376 real changes made)
(9,057 real changes made)
(10,480 real changes made)
(7,167 missing values generated)
(9,057 real changes made)
(4,681 real changes made)
(7,110 real changes made, 7,110 to missing)
(7,110 missing values generated)
(16,224 missing values generated)
(4,677 real changes made)
(4,437 real changes made)
(4,677 real changes made)
(4,437 real changes made)
(5,774 real changes made)
(16,224 missing values generated)
(4,677 real changes made)
(4,437 real changes made)
(9,114 real changes made)
(10,450 real changes made)
(7,110 missing values generated)
(9,114 real changes made)
(4,677 real changes made)
(7,130 real changes made, 7,130 to missing)
(7,130 missing values generated)
(16,224 missing values generated)
(4,688 real changes made)
(4,406 real changes made)
(4,688 real changes made)
(4,406 real changes made)
(5,839 real changes made)
(16,224 missing values generated)
(4,688 real changes made)
(4,406 real changes made)
(9,094 real changes made)
(10,385 real changes made)
(7,130 missing values generated)
(9,094 real changes made)
(4,688 real changes made)
(7,139 real changes made, 7,139 to missing)
(7,139 missing values generated)
(16,224 missing values generated)
(4,721 real changes made)
(4,364 real changes made)
(4,721 real changes made)
(4,364 real changes made)
(5,629 real changes made)
(16,224 missing values generated)
(4,721 real changes made)
(4,364 real changes made)
(9,085 real changes made)
(10,595 real changes made)
(7,139 missing values generated)
(9,085 real changes made)
(4,721 real changes made)
(7,164 real changes made, 7,164 to missing)
(7,164 missing values generated)
(16,224 missing values generated)
(4,628 real changes made)
(4,432 real changes made)
(4,628 real changes made)
(4,432 real changes made)
(5,733 real changes made)
(16,224 missing values generated)
(4,628 real changes made)
(4,432 real changes made)
(9,060 real changes made)
(10,491 real changes made)
(7,164 missing values generated)
(9,060 real changes made)
(4,628 real changes made)
(7,108 real changes made, 7,108 to missing)
(7,108 missing values generated)
(16,224 missing values generated)
(4,685 real changes made)
(4,431 real changes made)
(4,685 real changes made)
(4,431 real changes made)
(5,736 real changes made)
(16,224 missing values generated)
(4,685 real changes made)
(4,431 real changes made)
(9,116 real changes made)
(10,488 real changes made)
(7,108 missing values generated)
(9,116 real changes made)
(4,685 real changes made)
(7,119 real changes made, 7,119 to missing)
(7,119 missing values generated)
(16,224 missing values generated)
(4,687 real changes made)
(4,418 real changes made)
(4,687 real changes made)
(4,418 real changes made)
(5,713 real changes made)
(16,224 missing values generated)
(4,687 real changes made)
(4,418 real changes made)
(9,105 real changes made)
(10,511 real changes made)
(7,119 missing values generated)
(9,105 real changes made)
(4,687 real changes made)
(7,131 real changes made, 7,131 to missing)
(7,131 missing values generated)
(16,224 missing values generated)
(4,666 real changes made)
(4,427 real changes made)
(4,666 real changes made)
(4,427 real changes made)
(5,779 real changes made)
(16,224 missing values generated)
(4,666 real changes made)
(4,427 real changes made)
(9,093 real changes made)
(10,445 real changes made)
(7,131 missing values generated)
(9,093 real changes made)
(4,666 real changes made)
(7,097 real changes made, 7,097 to missing)
(7,097 missing values generated)
(16,224 missing values generated)
(4,654 real changes made)
(4,473 real changes made)
(4,654 real changes made)
(4,473 real changes made)
(5,843 real changes made)
(16,224 missing values generated)
(4,654 real changes made)
(4,473 real changes made)
(9,127 real changes made)
(10,381 real changes made)
(7,097 missing values generated)
(9,127 real changes made)
(4,654 real changes made)
(7,139 real changes made, 7,139 to missing)
(7,139 missing values generated)
(16,224 missing values generated)
(4,724 real changes made)
(4,361 real changes made)
(4,724 real changes made)
(4,361 real changes made)
(5,824 real changes made)
(16,224 missing values generated)
(4,724 real changes made)
(4,361 real changes made)
(9,085 real changes made)
(10,400 real changes made)
(7,139 missing values generated)
(9,085 real changes made)
(4,724 real changes made)
(7,144 real changes made, 7,144 to missing)
(7,144 missing values generated)
(16,224 missing values generated)
(4,677 real changes made)
(4,403 real changes made)
(4,677 real changes made)
(4,403 real changes made)
(5,765 real changes made)
(16,224 missing values generated)
(4,677 real changes made)
(4,403 real changes made)
(9,080 real changes made)
(10,459 real changes made)
(7,144 missing values generated)
(9,080 real changes made)
(4,677 real changes made)
(7,160 real changes made, 7,160 to missing)
(7,160 missing values generated)
(16,224 missing values generated)
(4,659 real changes made)
(4,405 real changes made)
(4,659 real changes made)
(4,405 real changes made)
(5,737 real changes made)
(16,224 missing values generated)
(4,659 real changes made)
(4,405 real changes made)
(9,064 real changes made)
(10,487 real changes made)
(7,160 missing values generated)
(9,064 real changes made)
(4,659 real changes made)
(7,085 real changes made, 7,085 to missing)
(7,085 missing values generated)
(16,224 missing values generated)
(4,660 real changes made)
(4,479 real changes made)
(4,660 real changes made)
(4,479 real changes made)
(5,798 real changes made)
(16,224 missing values generated)
(4,660 real changes made)
(4,479 real changes made)
(9,139 real changes made)
(10,426 real changes made)
(7,085 missing values generated)
(9,139 real changes made)
(4,660 real changes made)
(7,150 real changes made, 7,150 to missing)
(7,150 missing values generated)
(16,224 missing values generated)
(4,658 real changes made)
(4,416 real changes made)
(4,658 real changes made)
(4,416 real changes made)
(5,745 real changes made)
(16,224 missing values generated)
(4,658 real changes made)
(4,416 real changes made)
(9,074 real changes made)
(10,479 real changes made)
(7,150 missing values generated)
(9,074 real changes made)
(4,658 real changes made)
(7,204 real changes made, 7,204 to missing)
(7,204 missing values generated)
(16,224 missing values generated)
(4,616 real changes made)
(4,404 real changes made)
(4,616 real changes made)
(4,404 real changes made)
(5,725 real changes made)
(16,224 missing values generated)
(4,616 real changes made)
(4,404 real changes made)
(9,020 real changes made)
(10,499 real changes made)
(7,204 missing values generated)
(9,020 real changes made)
(4,616 real changes made)
(7,096 real changes made, 7,096 to missing)
(7,096 missing values generated)
(16,224 missing values generated)
(4,656 real changes made)
(4,472 real changes made)
(4,656 real changes made)
(4,472 real changes made)
(5,742 real changes made)
(16,224 missing values generated)
(4,656 real changes made)
(4,472 real changes made)
(9,128 real changes made)
(10,482 real changes made)
(7,096 missing values generated)
(9,128 real changes made)
(4,656 real changes made)
(7,074 real changes made, 7,074 to missing)
(7,074 missing values generated)
(16,224 missing values generated)
(4,697 real changes made)
(4,453 real changes made)
(4,697 real changes made)
(4,453 real changes made)
(5,872 real changes made)
(16,224 missing values generated)
(4,697 real changes made)
(4,453 real changes made)
(9,150 real changes made)
(10,352 real changes made)
(7,074 missing values generated)
(9,150 real changes made)
(4,697 real changes made)
(7,137 real changes made, 7,137 to missing)
(7,137 missing values generated)
(16,224 missing values generated)
(4,635 real changes made)
(4,452 real changes made)
(4,635 real changes made)
(4,452 real changes made)
(5,802 real changes made)
(16,224 missing values generated)
(4,635 real changes made)
(4,452 real changes made)
(9,087 real changes made)
(10,422 real changes made)
(7,137 missing values generated)
(9,087 real changes made)
(4,635 real changes made)
(7,201 real changes made, 7,201 to missing)
(7,201 missing values generated)
(16,224 missing values generated)
(4,615 real changes made)
(4,408 real changes made)
(4,615 real changes made)
(4,408 real changes made)
(5,723 real changes made)
(16,224 missing values generated)
(4,615 real changes made)
(4,408 real changes made)
(9,023 real changes made)
(10,501 real changes made)
(7,201 missing values generated)
(9,023 real changes made)
(4,615 real changes made)
(7,085 real changes made, 7,085 to missing)
(7,085 missing values generated)
(16,224 missing values generated)
(4,716 real changes made)
(4,423 real changes made)
(4,716 real changes made)
(4,423 real changes made)
(5,679 real changes made)
(16,224 missing values generated)
(4,716 real changes made)
(4,423 real changes made)
(9,139 real changes made)
(10,545 real changes made)
(7,085 missing values generated)
(9,139 real changes made)
(4,716 real changes made)
(7,205 real changes made, 7,205 to missing)
(7,205 missing values generated)
(16,224 missing values generated)
(4,616 real changes made)
(4,403 real changes made)
(4,616 real changes made)
(4,403 real changes made)
(5,740 real changes made)
(16,224 missing values generated)
(4,616 real changes made)
(4,403 real changes made)
(9,019 real changes made)
(10,484 real changes made)
(7,205 missing values generated)
(9,019 real changes made)
(4,616 real changes made)
(7,169 real changes made, 7,169 to missing)
(7,169 missing values generated)
(16,224 missing values generated)
(4,649 real changes made)
(4,406 real changes made)
(4,649 real changes made)
(4,406 real changes made)
(5,749 real changes made)
(16,224 missing values generated)
(4,649 real changes made)
(4,406 real changes made)
(9,055 real changes made)
(10,475 real changes made)
(7,169 missing values generated)
(9,055 real changes made)
(4,649 real changes made)
(7,159 real changes made, 7,159 to missing)
(7,159 missing values generated)
(16,224 missing values generated)
(4,690 real changes made)
(4,375 real changes made)
(4,690 real changes made)
(4,375 real changes made)
(5,836 real changes made)
(16,224 missing values generated)
(4,690 real changes made)
(4,375 real changes made)
(9,065 real changes made)
(10,388 real changes made)
(7,159 missing values generated)
(9,065 real changes made)
(4,690 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(16,224 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr20
> 22 may2022 jun2022 jul2022 aug2022 sep2022 oct2022 nov2022 dec2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if covid_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(277 real changes made)
(281 real changes made)
(298 real changes made)
(296 real changes made)
(281 real changes made)
(283 real changes made)
(275 real changes made)
(281 real changes made)
(275 real changes made)
(268 real changes made)
(282 real changes made)
(279 real changes made)
(237 real changes made)
(295 real changes made)
(251 real changes made)
(251 real changes made)
(239 real changes made)
(266 real changes made)
(262 real changes made)
(271 real changes made)
(267 real changes made)
(246 real changes made)
(260 real changes made)
(234 real changes made)
(189 real changes made)
(225 real changes made)
(211 real changes made)
(243 real changes made)
(204 real changes made)
(247 real changes made)
(243 real changes made)
(206 real changes made)
(229 real changes made)
(185 real changes made)
(213 real changes made)

. drop if baseline_egfr <15
(0 observations deleted)

. drop baseline_egfr

. drop covid_date_string

. 
. * COVID-19 death
. drop if deceased==1
(1,627 observations deleted)

. drop deceased

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. export delimited using "./output/covid_matching_2020.csv", replace
(note: file ./output/covid_matching_2020.csv not found)
file ./output/covid_matching_2020.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2020.log
  log type:  text
 closed on:  19 Jul 2023, 12:43:18
-------------------------------------------------------------------------------
