-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2020.log
  log type:  text
 opened on:  29 Sep 2023, 11:42:42

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames
> (1) case(preserve) 
(60 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,495 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,953 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,862 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,817 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,696 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,153 real changes made, 14,153 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,153 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,177 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,234 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,790 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,234 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,790 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,494 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,177 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,234 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,790 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(18,024 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,683 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,153 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(18,024 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,234 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(15,147 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(15,147 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 ///
>                                                                              
>                    baseline_creatinine_oct2022     ///
>                                                                              
>                    baseline_creatinine_nov2022 ///
>                                                                              
>                    baseline_creatinine_dec2022     ///
>                                                                              
>                    baseline_creatinine_jan2023 ///
>                                                                              
>                    baseline_creatinine_feb2023 ///
>                                                                              
>                    baseline_creatinine_mar2023 ///
>                                                                              
>                    baseline_creatinine_apr2023 ///
>                                                                              
>                    baseline_creatinine_may2023 {   
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(7,440 real changes made, 7,440 to missing)
(7,440 missing values generated)
(17,030 missing values generated)
(4,880 real changes made)
(4,710 real changes made)
(4,880 real changes made)
(4,710 real changes made)
(6,126 real changes made)
(17,030 missing values generated)
(4,880 real changes made)
(4,710 real changes made)
(9,590 real changes made)
(10,904 real changes made)
(7,440 missing values generated)
(9,590 real changes made)
(4,880 real changes made)
(7,508 real changes made, 7,508 to missing)
(7,508 missing values generated)
(17,030 missing values generated)
(4,825 real changes made)
(4,697 real changes made)
(4,825 real changes made)
(4,697 real changes made)
(5,954 real changes made)
(17,030 missing values generated)
(4,825 real changes made)
(4,697 real changes made)
(9,522 real changes made)
(11,076 real changes made)
(7,508 missing values generated)
(9,522 real changes made)
(4,825 real changes made)
(7,464 real changes made, 7,464 to missing)
(7,464 missing values generated)
(17,030 missing values generated)
(4,819 real changes made)
(4,747 real changes made)
(4,819 real changes made)
(4,747 real changes made)
(6,035 real changes made)
(17,030 missing values generated)
(4,819 real changes made)
(4,747 real changes made)
(9,566 real changes made)
(10,995 real changes made)
(7,464 missing values generated)
(9,566 real changes made)
(4,819 real changes made)
(7,502 real changes made, 7,502 to missing)
(7,502 missing values generated)
(17,030 missing values generated)
(4,808 real changes made)
(4,720 real changes made)
(4,808 real changes made)
(4,720 real changes made)
(6,102 real changes made)
(17,030 missing values generated)
(4,808 real changes made)
(4,720 real changes made)
(9,528 real changes made)
(10,928 real changes made)
(7,502 missing values generated)
(9,528 real changes made)
(4,808 real changes made)
(7,471 real changes made, 7,471 to missing)
(7,471 missing values generated)
(17,030 missing values generated)
(4,834 real changes made)
(4,725 real changes made)
(4,834 real changes made)
(4,725 real changes made)
(6,068 real changes made)
(17,030 missing values generated)
(4,834 real changes made)
(4,725 real changes made)
(9,559 real changes made)
(10,962 real changes made)
(7,471 missing values generated)
(9,559 real changes made)
(4,834 real changes made)
(7,543 real changes made, 7,543 to missing)
(7,543 missing values generated)
(17,030 missing values generated)
(4,812 real changes made)
(4,675 real changes made)
(4,812 real changes made)
(4,675 real changes made)
(6,028 real changes made)
(17,030 missing values generated)
(4,812 real changes made)
(4,675 real changes made)
(9,487 real changes made)
(11,002 real changes made)
(7,543 missing values generated)
(9,487 real changes made)
(4,812 real changes made)
(7,578 real changes made, 7,578 to missing)
(7,578 missing values generated)
(17,030 missing values generated)
(4,706 real changes made)
(4,746 real changes made)
(4,706 real changes made)
(4,746 real changes made)
(5,957 real changes made)
(17,030 missing values generated)
(4,706 real changes made)
(4,746 real changes made)
(9,452 real changes made)
(11,073 real changes made)
(7,578 missing values generated)
(9,452 real changes made)
(4,706 real changes made)
(7,483 real changes made, 7,483 to missing)
(7,483 missing values generated)
(17,030 missing values generated)
(4,788 real changes made)
(4,759 real changes made)
(4,788 real changes made)
(4,759 real changes made)
(6,007 real changes made)
(17,030 missing values generated)
(4,788 real changes made)
(4,759 real changes made)
(9,547 real changes made)
(11,023 real changes made)
(7,483 missing values generated)
(9,547 real changes made)
(4,788 real changes made)
(7,535 real changes made, 7,535 to missing)
(7,535 missing values generated)
(17,030 missing values generated)
(4,767 real changes made)
(4,728 real changes made)
(4,767 real changes made)
(4,728 real changes made)
(6,014 real changes made)
(17,030 missing values generated)
(4,767 real changes made)
(4,728 real changes made)
(9,495 real changes made)
(11,016 real changes made)
(7,535 missing values generated)
(9,495 real changes made)
(4,767 real changes made)
(7,544 real changes made, 7,544 to missing)
(7,544 missing values generated)
(17,030 missing values generated)
(4,779 real changes made)
(4,707 real changes made)
(4,779 real changes made)
(4,707 real changes made)
(5,991 real changes made)
(17,030 missing values generated)
(4,779 real changes made)
(4,707 real changes made)
(9,486 real changes made)
(11,039 real changes made)
(7,544 missing values generated)
(9,486 real changes made)
(4,779 real changes made)
(7,534 real changes made, 7,534 to missing)
(7,534 missing values generated)
(17,030 missing values generated)
(4,804 real changes made)
(4,692 real changes made)
(4,804 real changes made)
(4,692 real changes made)
(6,058 real changes made)
(17,030 missing values generated)
(4,804 real changes made)
(4,692 real changes made)
(9,496 real changes made)
(10,972 real changes made)
(7,534 missing values generated)
(9,496 real changes made)
(4,804 real changes made)
(7,447 real changes made, 7,447 to missing)
(7,447 missing values generated)
(17,030 missing values generated)
(4,847 real changes made)
(4,736 real changes made)
(4,847 real changes made)
(4,736 real changes made)
(6,037 real changes made)
(17,030 missing values generated)
(4,847 real changes made)
(4,736 real changes made)
(9,583 real changes made)
(10,993 real changes made)
(7,447 missing values generated)
(9,583 real changes made)
(4,847 real changes made)
(7,547 real changes made, 7,547 to missing)
(7,547 missing values generated)
(17,030 missing values generated)
(4,864 real changes made)
(4,619 real changes made)
(4,864 real changes made)
(4,619 real changes made)
(5,972 real changes made)
(17,030 missing values generated)
(4,864 real changes made)
(4,619 real changes made)
(9,483 real changes made)
(11,058 real changes made)
(7,547 missing values generated)
(9,483 real changes made)
(4,864 real changes made)
(7,494 real changes made, 7,494 to missing)
(7,494 missing values generated)
(17,030 missing values generated)
(4,801 real changes made)
(4,735 real changes made)
(4,801 real changes made)
(4,735 real changes made)
(6,039 real changes made)
(17,030 missing values generated)
(4,801 real changes made)
(4,735 real changes made)
(9,536 real changes made)
(10,991 real changes made)
(7,494 missing values generated)
(9,536 real changes made)
(4,801 real changes made)
(7,586 real changes made, 7,586 to missing)
(7,586 missing values generated)
(17,030 missing values generated)
(4,750 real changes made)
(4,694 real changes made)
(4,750 real changes made)
(4,694 real changes made)
(6,015 real changes made)
(17,030 missing values generated)
(4,750 real changes made)
(4,694 real changes made)
(9,444 real changes made)
(11,015 real changes made)
(7,586 missing values generated)
(9,444 real changes made)
(4,750 real changes made)
(7,593 real changes made, 7,593 to missing)
(7,593 missing values generated)
(17,030 missing values generated)
(4,791 real changes made)
(4,646 real changes made)
(4,791 real changes made)
(4,646 real changes made)
(6,011 real changes made)
(17,030 missing values generated)
(4,791 real changes made)
(4,646 real changes made)
(9,437 real changes made)
(11,019 real changes made)
(7,593 missing values generated)
(9,437 real changes made)
(4,791 real changes made)
(7,404 real changes made, 7,404 to missing)
(7,404 missing values generated)
(17,030 missing values generated)
(4,840 real changes made)
(4,786 real changes made)
(4,840 real changes made)
(4,786 real changes made)
(6,110 real changes made)
(17,030 missing values generated)
(4,840 real changes made)
(4,786 real changes made)
(9,626 real changes made)
(10,920 real changes made)
(7,404 missing values generated)
(9,626 real changes made)
(4,840 real changes made)
(7,499 real changes made, 7,499 to missing)
(7,499 missing values generated)
(17,030 missing values generated)
(4,835 real changes made)
(4,696 real changes made)
(4,835 real changes made)
(4,696 real changes made)
(6,080 real changes made)
(17,030 missing values generated)
(4,835 real changes made)
(4,696 real changes made)
(9,531 real changes made)
(10,950 real changes made)
(7,499 missing values generated)
(9,531 real changes made)
(4,835 real changes made)
(7,455 real changes made, 7,455 to missing)
(7,455 missing values generated)
(17,030 missing values generated)
(4,821 real changes made)
(4,754 real changes made)
(4,821 real changes made)
(4,754 real changes made)
(6,024 real changes made)
(17,030 missing values generated)
(4,821 real changes made)
(4,754 real changes made)
(9,575 real changes made)
(11,006 real changes made)
(7,455 missing values generated)
(9,575 real changes made)
(4,821 real changes made)
(7,530 real changes made, 7,530 to missing)
(7,530 missing values generated)
(17,030 missing values generated)
(4,828 real changes made)
(4,672 real changes made)
(4,828 real changes made)
(4,672 real changes made)
(6,028 real changes made)
(17,030 missing values generated)
(4,828 real changes made)
(4,672 real changes made)
(9,500 real changes made)
(11,002 real changes made)
(7,530 missing values generated)
(9,500 real changes made)
(4,828 real changes made)
(7,508 real changes made, 7,508 to missing)
(7,508 missing values generated)
(17,030 missing values generated)
(4,757 real changes made)
(4,765 real changes made)
(4,757 real changes made)
(4,765 real changes made)
(6,008 real changes made)
(17,030 missing values generated)
(4,757 real changes made)
(4,765 real changes made)
(9,522 real changes made)
(11,022 real changes made)
(7,508 missing values generated)
(9,522 real changes made)
(4,757 real changes made)
(7,464 real changes made, 7,464 to missing)
(7,464 missing values generated)
(17,030 missing values generated)
(4,803 real changes made)
(4,763 real changes made)
(4,803 real changes made)
(4,763 real changes made)
(6,095 real changes made)
(17,030 missing values generated)
(4,803 real changes made)
(4,763 real changes made)
(9,566 real changes made)
(10,935 real changes made)
(7,464 missing values generated)
(9,566 real changes made)
(4,803 real changes made)
(7,514 real changes made, 7,514 to missing)
(7,514 missing values generated)
(17,030 missing values generated)
(4,811 real changes made)
(4,705 real changes made)
(4,811 real changes made)
(4,705 real changes made)
(5,932 real changes made)
(17,030 missing values generated)
(4,811 real changes made)
(4,705 real changes made)
(9,516 real changes made)
(11,098 real changes made)
(7,514 missing values generated)
(9,516 real changes made)
(4,811 real changes made)
(7,449 real changes made, 7,449 to missing)
(7,449 missing values generated)
(17,030 missing values generated)
(4,834 real changes made)
(4,747 real changes made)
(4,834 real changes made)
(4,747 real changes made)
(6,103 real changes made)
(17,030 missing values generated)
(4,834 real changes made)
(4,747 real changes made)
(9,581 real changes made)
(10,927 real changes made)
(7,449 missing values generated)
(9,581 real changes made)
(4,834 real changes made)
(7,562 real changes made, 7,562 to missing)
(7,562 missing values generated)
(17,030 missing values generated)
(4,779 real changes made)
(4,689 real changes made)
(4,779 real changes made)
(4,689 real changes made)
(6,049 real changes made)
(17,030 missing values generated)
(4,779 real changes made)
(4,689 real changes made)
(9,468 real changes made)
(10,981 real changes made)
(7,562 missing values generated)
(9,468 real changes made)
(4,779 real changes made)
(7,548 real changes made, 7,548 to missing)
(7,548 missing values generated)
(17,030 missing values generated)
(4,774 real changes made)
(4,708 real changes made)
(4,774 real changes made)
(4,708 real changes made)
(6,027 real changes made)
(17,030 missing values generated)
(4,774 real changes made)
(4,708 real changes made)
(9,482 real changes made)
(11,003 real changes made)
(7,548 missing values generated)
(9,482 real changes made)
(4,774 real changes made)
(7,474 real changes made, 7,474 to missing)
(7,474 missing values generated)
(17,030 missing values generated)
(4,858 real changes made)
(4,698 real changes made)
(4,858 real changes made)
(4,698 real changes made)
(6,008 real changes made)
(17,030 missing values generated)
(4,858 real changes made)
(4,698 real changes made)
(9,556 real changes made)
(11,022 real changes made)
(7,474 missing values generated)
(9,556 real changes made)
(4,858 real changes made)
(7,479 real changes made, 7,479 to missing)
(7,479 missing values generated)
(17,030 missing values generated)
(4,802 real changes made)
(4,749 real changes made)
(4,802 real changes made)
(4,749 real changes made)
(6,097 real changes made)
(17,030 missing values generated)
(4,802 real changes made)
(4,749 real changes made)
(9,551 real changes made)
(10,933 real changes made)
(7,479 missing values generated)
(9,551 real changes made)
(4,802 real changes made)
(7,474 real changes made, 7,474 to missing)
(7,474 missing values generated)
(17,030 missing values generated)
(4,868 real changes made)
(4,688 real changes made)
(4,868 real changes made)
(4,688 real changes made)
(6,077 real changes made)
(17,030 missing values generated)
(4,868 real changes made)
(4,688 real changes made)
(9,556 real changes made)
(10,953 real changes made)
(7,474 missing values generated)
(9,556 real changes made)
(4,868 real changes made)
(7,511 real changes made, 7,511 to missing)
(7,511 missing values generated)
(17,030 missing values generated)
(4,806 real changes made)
(4,713 real changes made)
(4,806 real changes made)
(4,713 real changes made)
(6,079 real changes made)
(17,030 missing values generated)
(4,806 real changes made)
(4,713 real changes made)
(9,519 real changes made)
(10,951 real changes made)
(7,511 missing values generated)
(9,519 real changes made)
(4,806 real changes made)
(7,493 real changes made, 7,493 to missing)
(7,493 missing values generated)
(17,030 missing values generated)
(4,844 real changes made)
(4,693 real changes made)
(4,844 real changes made)
(4,693 real changes made)
(6,045 real changes made)
(17,030 missing values generated)
(4,844 real changes made)
(4,693 real changes made)
(9,537 real changes made)
(10,985 real changes made)
(7,493 missing values generated)
(9,537 real changes made)
(4,844 real changes made)
(7,498 real changes made, 7,498 to missing)
(7,498 missing values generated)
(17,030 missing values generated)
(4,790 real changes made)
(4,742 real changes made)
(4,790 real changes made)
(4,742 real changes made)
(5,981 real changes made)
(17,030 missing values generated)
(4,790 real changes made)
(4,742 real changes made)
(9,532 real changes made)
(11,049 real changes made)
(7,498 missing values generated)
(9,532 real changes made)
(4,790 real changes made)
(7,538 real changes made, 7,538 to missing)
(7,538 missing values generated)
(17,030 missing values generated)
(4,706 real changes made)
(4,786 real changes made)
(4,706 real changes made)
(4,786 real changes made)
(6,009 real changes made)
(17,030 missing values generated)
(4,706 real changes made)
(4,786 real changes made)
(9,492 real changes made)
(11,021 real changes made)
(7,538 missing values generated)
(9,492 real changes made)
(4,706 real changes made)
(7,361 real changes made, 7,361 to missing)
(7,361 missing values generated)
(17,030 missing values generated)
(4,977 real changes made)
(4,692 real changes made)
(4,977 real changes made)
(4,692 real changes made)
(6,147 real changes made)
(17,030 missing values generated)
(4,977 real changes made)
(4,692 real changes made)
(9,669 real changes made)
(10,883 real changes made)
(7,361 missing values generated)
(9,669 real changes made)
(4,977 real changes made)
(7,460 real changes made, 7,460 to missing)
(7,460 missing values generated)
(17,030 missing values generated)
(4,858 real changes made)
(4,712 real changes made)
(4,858 real changes made)
(4,712 real changes made)
(6,014 real changes made)
(17,030 missing values generated)
(4,858 real changes made)
(4,712 real changes made)
(9,570 real changes made)
(11,016 real changes made)
(7,460 missing values generated)
(9,570 real changes made)
(4,858 real changes made)
(7,519 real changes made, 7,519 to missing)
(7,519 missing values generated)
(17,030 missing values generated)
(4,838 real changes made)
(4,673 real changes made)
(4,838 real changes made)
(4,673 real changes made)
(6,044 real changes made)
(17,030 missing values generated)
(4,838 real changes made)
(4,673 real changes made)
(9,511 real changes made)
(10,986 real changes made)
(7,519 missing values generated)
(9,511 real changes made)
(4,838 real changes made)
(7,396 real changes made, 7,396 to missing)
(7,396 missing values generated)
(17,030 missing values generated)
(4,860 real changes made)
(4,774 real changes made)
(4,860 real changes made)
(4,774 real changes made)
(6,054 real changes made)
(17,030 missing values generated)
(4,860 real changes made)
(4,774 real changes made)
(9,634 real changes made)
(10,976 real changes made)
(7,396 missing values generated)
(9,634 real changes made)
(4,860 real changes made)
(7,478 real changes made, 7,478 to missing)
(7,478 missing values generated)
(17,030 missing values generated)
(4,857 real changes made)
(4,695 real changes made)
(4,857 real changes made)
(4,695 real changes made)
(6,019 real changes made)
(17,030 missing values generated)
(4,857 real changes made)
(4,695 real changes made)
(9,552 real changes made)
(11,011 real changes made)
(7,478 missing values generated)
(9,552 real changes made)
(4,857 real changes made)
(7,440 real changes made, 7,440 to missing)
(7,440 missing values generated)
(17,030 missing values generated)
(4,877 real changes made)
(4,713 real changes made)
(4,877 real changes made)
(4,713 real changes made)
(6,160 real changes made)
(17,030 missing values generated)
(4,877 real changes made)
(4,713 real changes made)
(9,590 real changes made)
(10,870 real changes made)
(7,440 missing values generated)
(9,590 real changes made)
(4,877 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(17,030 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr20
> 22 may2022 jun2022 jul2022 aug2022 sep2022 oct2022 nov2022 dec2022 jan2023 fe
> b2023 mar2023 apr2023 may2023"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if covid_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(276 real changes made)
(305 real changes made)
(284 real changes made)
(302 real changes made)
(298 real changes made)
(251 real changes made)
(276 real changes made)
(249 real changes made)
(269 real changes made)
(234 real changes made)
(260 real changes made)
(226 real changes made)
(215 real changes made)
(251 real changes made)
(267 real changes made)
(248 real changes made)
(209 real changes made)
(248 real changes made)
(238 real changes made)
(253 real changes made)
(217 real changes made)
(231 real changes made)
(253 real changes made)
(240 real changes made)
(203 real changes made)
(211 real changes made)
(234 real changes made)
(211 real changes made)
(217 real changes made)
(220 real changes made)
(236 real changes made)
(233 real changes made)
(231 real changes made)
(193 real changes made)
(215 real changes made)
(208 real changes made)
(181 real changes made)
(223 real changes made)
(203 real changes made)
(206 real changes made)

. drop if baseline_egfr <15
(0 observations deleted)

. drop baseline_egfr

. drop covid_date_string

. 
. * COVID-19 death
. drop if deceased==1
(1,771 observations deleted)

. drop deceased

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. export delimited using "./output/covid_matching_2020.csv", replace
(note: file ./output/covid_matching_2020.csv not found)
file ./output/covid_matching_2020.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2020.log
  log type:  text
 closed on:  29 Sep 2023, 11:42:51
-------------------------------------------------------------------------------
