------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/covid_matching.log
  log type:  text
 opened on:  30 Sep 2022, 00:07:44

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames(1) case(preserve) 
(encoding automatically selected: ISO-8859-9)
(46 vars, 50,000 obs)

. 
end of do-file

. browse

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD72b4_000000.tmp"

. **Exclusions
. * Age <18
. drop if age <18
(10,582 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosis
. drop if has_follow_up==0
(1,977 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,885 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,768 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,719 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb2020, 20, 3000)
(14,087 real changes made, 14,087 to missing)

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD72b4_000000.tmp"

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,087 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,069 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.7 if male==0
(9,204 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.9 if male==1
(8,778 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.329  if male==0
(9,204 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.411  if male==1
(8,778 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb2020<1
(11,388 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,069 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.7 if male==0
(9,204 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.9 if male==1
(8,778 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.209
(17,982 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb2020>1
(20,681 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_baseline_creatinine_feb2020*141
(14,087 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(0.993^age)
(17,982 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1.018 if male==0
(9,204 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine updated monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(17,715 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(17,715 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(6,395 real changes made, 6,395 to missing)
(6,395 missing values generated)
(14,354 missing values generated)
(4,056 real changes made)
(3,903 real changes made)
(4,056 real changes made)
(3,903 real changes made)
(5,064 real changes made)
(14,354 missing values generated)
(4,056 real changes made)
(3,903 real changes made)
(7,959 real changes made)
(9,290 real changes made)
(6,395 missing values generated)
(7,959 real changes made)
(4,056 real changes made)
(6,272 real changes made, 6,272 to missing)
(6,272 missing values generated)
(14,354 missing values generated)
(4,155 real changes made)
(3,927 real changes made)
(4,155 real changes made)
(3,927 real changes made)
(5,140 real changes made)
(14,354 missing values generated)
(4,155 real changes made)
(3,927 real changes made)
(8,082 real changes made)
(9,214 real changes made)
(6,272 missing values generated)
(8,082 real changes made)
(4,155 real changes made)
(6,344 real changes made, 6,344 to missing)
(6,344 missing values generated)
(14,354 missing values generated)
(4,083 real changes made)
(3,927 real changes made)
(4,083 real changes made)
(3,927 real changes made)
(5,136 real changes made)
(14,354 missing values generated)
(4,083 real changes made)
(3,927 real changes made)
(8,010 real changes made)
(9,218 real changes made)
(6,344 missing values generated)
(8,010 real changes made)
(4,083 real changes made)
(6,373 real changes made, 6,373 to missing)
(6,373 missing values generated)
(14,354 missing values generated)
(4,045 real changes made)
(3,936 real changes made)
(4,045 real changes made)
(3,936 real changes made)
(5,001 real changes made)
(14,354 missing values generated)
(4,045 real changes made)
(3,936 real changes made)
(7,981 real changes made)
(9,353 real changes made)
(6,373 missing values generated)
(7,981 real changes made)
(4,045 real changes made)
(6,345 real changes made, 6,345 to missing)
(6,345 missing values generated)
(14,354 missing values generated)
(4,070 real changes made)
(3,939 real changes made)
(4,070 real changes made)
(3,939 real changes made)
(5,090 real changes made)
(14,354 missing values generated)
(4,070 real changes made)
(3,939 real changes made)
(8,009 real changes made)
(9,264 real changes made)
(6,345 missing values generated)
(8,009 real changes made)
(4,070 real changes made)
(6,198 real changes made, 6,198 to missing)
(6,198 missing values generated)
(14,354 missing values generated)
(4,099 real changes made)
(4,057 real changes made)
(4,099 real changes made)
(4,057 real changes made)
(5,179 real changes made)
(14,354 missing values generated)
(4,099 real changes made)
(4,057 real changes made)
(8,156 real changes made)
(9,175 real changes made)
(6,198 missing values generated)
(8,156 real changes made)
(4,099 real changes made)
(6,419 real changes made, 6,419 to missing)
(6,419 missing values generated)
(14,354 missing values generated)
(4,019 real changes made)
(3,916 real changes made)
(4,019 real changes made)
(3,916 real changes made)
(5,004 real changes made)
(14,354 missing values generated)
(4,019 real changes made)
(3,916 real changes made)
(7,935 real changes made)
(9,350 real changes made)
(6,419 missing values generated)
(7,935 real changes made)
(4,019 real changes made)
(6,353 real changes made, 6,353 to missing)
(6,353 missing values generated)
(14,354 missing values generated)
(4,089 real changes made)
(3,912 real changes made)
(4,089 real changes made)
(3,912 real changes made)
(5,058 real changes made)
(14,354 missing values generated)
(4,089 real changes made)
(3,912 real changes made)
(8,001 real changes made)
(9,296 real changes made)
(6,353 missing values generated)
(8,001 real changes made)
(4,089 real changes made)
(6,339 real changes made, 6,339 to missing)
(6,339 missing values generated)
(14,354 missing values generated)
(4,067 real changes made)
(3,948 real changes made)
(4,067 real changes made)
(3,948 real changes made)
(5,004 real changes made)
(14,354 missing values generated)
(4,067 real changes made)
(3,948 real changes made)
(8,015 real changes made)
(9,350 real changes made)
(6,339 missing values generated)
(8,015 real changes made)
(4,067 real changes made)
(6,323 real changes made, 6,323 to missing)
(6,323 missing values generated)
(14,354 missing values generated)
(4,069 real changes made)
(3,962 real changes made)
(4,069 real changes made)
(3,962 real changes made)
(5,065 real changes made)
(14,354 missing values generated)
(4,069 real changes made)
(3,962 real changes made)
(8,031 real changes made)
(9,289 real changes made)
(6,323 missing values generated)
(8,031 real changes made)
(4,069 real changes made)
(6,271 real changes made, 6,271 to missing)
(6,271 missing values generated)
(14,354 missing values generated)
(4,115 real changes made)
(3,968 real changes made)
(4,115 real changes made)
(3,968 real changes made)
(5,127 real changes made)
(14,354 missing values generated)
(4,115 real changes made)
(3,968 real changes made)
(8,083 real changes made)
(9,227 real changes made)
(6,271 missing values generated)
(8,083 real changes made)
(4,115 real changes made)
(6,384 real changes made, 6,384 to missing)
(6,384 missing values generated)
(14,354 missing values generated)
(4,059 real changes made)
(3,911 real changes made)
(4,059 real changes made)
(3,911 real changes made)
(5,052 real changes made)
(14,354 missing values generated)
(4,059 real changes made)
(3,911 real changes made)
(7,970 real changes made)
(9,302 real changes made)
(6,384 missing values generated)
(7,970 real changes made)
(4,059 real changes made)
(6,286 real changes made, 6,286 to missing)
(6,286 missing values generated)
(14,354 missing values generated)
(4,116 real changes made)
(3,952 real changes made)
(4,116 real changes made)
(3,952 real changes made)
(5,109 real changes made)
(14,354 missing values generated)
(4,116 real changes made)
(3,952 real changes made)
(8,068 real changes made)
(9,245 real changes made)
(6,286 missing values generated)
(8,068 real changes made)
(4,116 real changes made)
(6,265 real changes made, 6,265 to missing)
(6,265 missing values generated)
(14,354 missing values generated)
(4,135 real changes made)
(3,954 real changes made)
(4,135 real changes made)
(3,954 real changes made)
(5,125 real changes made)
(14,354 missing values generated)
(4,135 real changes made)
(3,954 real changes made)
(8,089 real changes made)
(9,229 real changes made)
(6,265 missing values generated)
(8,089 real changes made)
(4,135 real changes made)
(6,314 real changes made, 6,314 to missing)
(6,314 missing values generated)
(14,354 missing values generated)
(4,046 real changes made)
(3,994 real changes made)
(4,046 real changes made)
(3,994 real changes made)
(5,130 real changes made)
(14,354 missing values generated)
(4,046 real changes made)
(3,994 real changes made)
(8,040 real changes made)
(9,224 real changes made)
(6,314 missing values generated)
(8,040 real changes made)
(4,046 real changes made)
(6,288 real changes made, 6,288 to missing)
(6,288 missing values generated)
(14,354 missing values generated)
(4,163 real changes made)
(3,903 real changes made)
(4,163 real changes made)
(3,903 real changes made)
(5,046 real changes made)
(14,354 missing values generated)
(4,163 real changes made)
(3,903 real changes made)
(8,066 real changes made)
(9,308 real changes made)
(6,288 missing values generated)
(8,066 real changes made)
(4,163 real changes made)
(6,385 real changes made, 6,385 to missing)
(6,385 missing values generated)
(14,354 missing values generated)
(4,074 real changes made)
(3,895 real changes made)
(4,074 real changes made)
(3,895 real changes made)
(5,088 real changes made)
(14,354 missing values generated)
(4,074 real changes made)
(3,895 real changes made)
(7,969 real changes made)
(9,266 real changes made)
(6,385 missing values generated)
(7,969 real changes made)
(4,074 real changes made)
(6,255 real changes made, 6,255 to missing)
(6,255 missing values generated)
(14,354 missing values generated)
(4,143 real changes made)
(3,956 real changes made)
(4,143 real changes made)
(3,956 real changes made)
(5,099 real changes made)
(14,354 missing values generated)
(4,143 real changes made)
(3,956 real changes made)
(8,099 real changes made)
(9,255 real changes made)
(6,255 missing values generated)
(8,099 real changes made)
(4,143 real changes made)
(6,319 real changes made, 6,319 to missing)
(6,319 missing values generated)
(14,354 missing values generated)
(4,074 real changes made)
(3,961 real changes made)
(4,074 real changes made)
(3,961 real changes made)
(5,094 real changes made)
(14,354 missing values generated)
(4,074 real changes made)
(3,961 real changes made)
(8,035 real changes made)
(9,260 real changes made)
(6,319 missing values generated)
(8,035 real changes made)
(4,074 real changes made)
(6,340 real changes made, 6,340 to missing)
(6,340 missing values generated)
(14,354 missing values generated)
(4,077 real changes made)
(3,937 real changes made)
(4,077 real changes made)
(3,937 real changes made)
(5,123 real changes made)
(14,354 missing values generated)
(4,077 real changes made)
(3,937 real changes made)
(8,014 real changes made)
(9,231 real changes made)
(6,340 missing values generated)
(8,014 real changes made)
(4,077 real changes made)
(6,303 real changes made, 6,303 to missing)
(6,303 missing values generated)
(14,354 missing values generated)
(4,080 real changes made)
(3,971 real changes made)
(4,080 real changes made)
(3,971 real changes made)
(5,056 real changes made)
(14,354 missing values generated)
(4,080 real changes made)
(3,971 real changes made)
(8,051 real changes made)
(9,298 real changes made)
(6,303 missing values generated)
(8,051 real changes made)
(4,080 real changes made)
(6,370 real changes made, 6,370 to missing)
(6,370 missing values generated)
(14,354 missing values generated)
(4,071 real changes made)
(3,913 real changes made)
(4,071 real changes made)
(3,913 real changes made)
(4,946 real changes made)
(14,354 missing values generated)
(4,071 real changes made)
(3,913 real changes made)
(7,984 real changes made)
(9,408 real changes made)
(6,370 missing values generated)
(7,984 real changes made)
(4,071 real changes made)
(6,277 real changes made, 6,277 to missing)
(6,277 missing values generated)
(14,354 missing values generated)
(4,092 real changes made)
(3,985 real changes made)
(4,092 real changes made)
(3,985 real changes made)
(5,090 real changes made)
(14,354 missing values generated)
(4,092 real changes made)
(3,985 real changes made)
(8,077 real changes made)
(9,264 real changes made)
(6,277 missing values generated)
(8,077 real changes made)
(4,092 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(14,354 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD72b4_000000.tmp"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. drop if baseline_egfr <15
  4. drop egfr_baseline_creatinine_`x'
  5. }

. 
end of do-file

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"foreach x of  local month_year  {
invalid syntax
r(198);

. 
.   2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
2. is not a valid command name
r(199);

. 
.   3. drop if baseline_egfr <15
3. is not a valid command name
r(199);

. 
.   4. drop egfr_baseline_creatinine_`x'
4. is not a valid command name
r(199);

. 
.   5. }
5. is not a valid command name
r(199);

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"

. foreach x of  local month_year  {
  2. 
.   2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. 
.   3. drop if baseline_egfr <15
  4. 
.   4. drop egfr_baseline_creatinine_`x'
  5. 
.   5. }
2. is not a valid command name
r(199);

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"foreach x of  local month_year  {
invalid syntax
r(198);

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"

. foreach x of  local month_year  {
  2. 
. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. 
. drop if baseline_egfr <15
  4. 
. drop egfr_baseline_creatinine_`x'
  5. 
. }
(326 real changes made)
(0 observations deleted)
(374 real changes made)
(0 observations deleted)
(333 real changes made)
(0 observations deleted)
(356 real changes made)
(0 observations deleted)
(362 real changes made)
(0 observations deleted)
(390 real changes made)
(0 observations deleted)
(353 real changes made)
(0 observations deleted)
(357 real changes made)
(0 observations deleted)
(342 real changes made)
(0 observations deleted)
(317 real changes made)
(0 observations deleted)
(353 real changes made)
(0 observations deleted)
(342 real changes made)
(0 observations deleted)
(292 real changes made)
(0 observations deleted)
(347 real changes made)
(0 observations deleted)
(340 real changes made)
(0 observations deleted)
(329 real changes made)
(0 observations deleted)
(319 real changes made)
(0 observations deleted)
(334 real changes made)
(0 observations deleted)
(317 real changes made)
(0 observations deleted)
(293 real changes made)
(0 observations deleted)
(306 real changes made)
(0 observations deleted)
(286 real changes made)
(0 observations deleted)
(275 real changes made)
(0 observations deleted)
(288 real changes made)
(0 observations deleted)

. clear

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD72b4_000000.tmp"

. sysdir set PLUS ./analysis/adofiles

. sysdir set PERSONAL ./analysis/adofiles

. pwd
C:\Users\lsh1703468\Documents\repos

. 
. 
. * Open a log file
. cap log close
