-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2017.log
  log type:  text
 opened on:   1 Nov 2022, 14:20:46

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames
> (1) case(preserve) 
(53 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,486 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,963 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,894 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,795 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,689 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace creatinine_feb2020 = . if !inrange(creatinine_feb2020, 20, 3000)
(14,137 real changes made, 14,137 to missing)

. gen mgdl_creatinine_feb2020 = creatinine_feb2020/88.4
(14,137 missing values generated)

. gen min_creatinine_feb2020=.
(32,173 missing values generated)

. replace min_creatinine_feb2020 = mgdl_creatinine_feb2020/0.7 if male==0
(9,198 real changes made)

. replace min_creatinine_feb2020 = mgdl_creatinine_feb2020/0.9 if male==1
(8,838 real changes made)

. replace min_creatinine_feb2020 = min_creatinine_feb2020^-0.329  if male==0
(9,198 real changes made)

. replace min_creatinine_feb2020 = min_creatinine_feb2020^-0.411  if male==1
(8,838 real changes made)

. replace min_creatinine_feb2020 = 1 if min_creatinine_feb2020<1
(11,311 real changes made)

. gen max_creatinine_feb2020=.
(32,173 missing values generated)

. replace max_creatinine_feb2020 = mgdl_creatinine_feb2020/0.7 if male==0
(9,198 real changes made)

. replace max_creatinine_feb2020 = mgdl_creatinine_feb2020/0.9 if male==1
(8,838 real changes made)

. replace max_creatinine_feb2020 = max_creatinine_feb2020^-1.209
(18,036 real changes made)

. replace max_creatinine_feb2020 = 1 if max_creatinine_feb2020>1
(20,862 real changes made)

. gen egfr_creatinine_feb2020 = min_creatinine_feb2020*max_creatinine_feb2020*1
> 41
(14,137 missing values generated)

. replace egfr_creatinine_feb2020 = egfr_creatinine_feb2020*(0.993^age)
(18,036 real changes made)

. replace egfr_creatinine_feb2020 = egfr_creatinine_feb2020*1.018 if male==0
(9,198 real changes made)

. drop if egfr_creatinine_feb2020 <15
(0 observations deleted)

. drop creatinine_feb2020

. drop mgdl_creatinine_feb2020

. drop min_creatinine_feb2020

. drop max_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(14,445 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(14,445 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach creatinine_monthly of varlist   creatinine_mar2020 ///
>                                                                              
>    creatinine_apr2020 ///
>                                                                              
>    creatinine_may2020 ///
>                                                                              
>    creatinine_jun2020 ///
>                                                                              
>    creatinine_jul2020 ///
>                                                                              
>    creatinine_aug2020 ///
>                                                                              
>    creatinine_sep2020 ///
>                                                                              
>    creatinine_oct2020 ///                                                    
>                                       
>                                                                              
>    creatinine_nov2020 ///
>                                                                              
>    creatinine_dec2020 ///
>                                                                              
>    creatinine_jan2021 ///
>                                                                              
>    creatinine_feb2021 ///
>                                                                              
>    creatinine_mar2021 ///
>                                                                              
>    creatinine_apr2021 ///
>                                                                              
>    creatinine_may2021 ///
>                                                                              
>    creatinine_jun2021 ///
>                                                                              
>    creatinine_jul2021 ///
>                                                                              
>    creatinine_aug2021 ///
>                                                                              
>    creatinine_sep2021 ///
>                                                                              
>    creatinine_oct2021 ///
>                                                                              
>    creatinine_nov2021 ///
>                                                                              
>    creatinine_dec2021 ///
>                                                                              
>    creatinine_jan2022 ///
>                                                                              
>    creatinine_feb2022 ///
>                                                                              
>    creatinine_mar2022 ///
>                                                                              
>    creatinine_apr2022 ///
>                                                                              
>    creatinine_may2022 ///
>                                                                              
>    creatinine_jun2022 ///
>                                                                              
>    creatinine_jul2022 ///
>                                                                              
>    creatinine_aug2022 ///
>                                                                              
>    creatinine_sep2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 300
> 0)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if male==
> 0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if male==
> 1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if male
> ==0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if male
> ==1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if male==
> 0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if male==
> 1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_m
> onthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if mal
> e==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(7,891 real changes made, 7,891 to missing)
(7,891 missing values generated)
(17,728 missing values generated)
(5,014 real changes made)
(4,823 real changes made)
(5,014 real changes made)
(4,823 real changes made)
(6,132 real changes made)
(17,728 missing values generated)
(5,014 real changes made)
(4,823 real changes made)
(9,837 real changes made)
(11,596 real changes made)
(7,891 missing values generated)
(9,837 real changes made)
(5,014 real changes made)
(7,844 real changes made, 7,844 to missing)
(7,844 missing values generated)
(17,728 missing values generated)
(5,022 real changes made)
(4,862 real changes made)
(5,022 real changes made)
(4,862 real changes made)
(6,309 real changes made)
(17,728 missing values generated)
(5,022 real changes made)
(4,862 real changes made)
(9,884 real changes made)
(11,419 real changes made)
(7,844 missing values generated)
(9,884 real changes made)
(5,022 real changes made)
(7,806 real changes made, 7,806 to missing)
(7,806 missing values generated)
(17,728 missing values generated)
(5,042 real changes made)
(4,880 real changes made)
(5,042 real changes made)
(4,880 real changes made)
(6,277 real changes made)
(17,728 missing values generated)
(5,042 real changes made)
(4,880 real changes made)
(9,922 real changes made)
(11,451 real changes made)
(7,806 missing values generated)
(9,922 real changes made)
(5,042 real changes made)
(7,778 real changes made, 7,778 to missing)
(7,778 missing values generated)
(17,728 missing values generated)
(5,117 real changes made)
(4,833 real changes made)
(5,117 real changes made)
(4,833 real changes made)
(6,336 real changes made)
(17,728 missing values generated)
(5,117 real changes made)
(4,833 real changes made)
(9,950 real changes made)
(11,392 real changes made)
(7,778 missing values generated)
(9,950 real changes made)
(5,117 real changes made)
(7,781 real changes made, 7,781 to missing)
(7,781 missing values generated)
(17,728 missing values generated)
(5,068 real changes made)
(4,879 real changes made)
(5,068 real changes made)
(4,879 real changes made)
(6,341 real changes made)
(17,728 missing values generated)
(5,068 real changes made)
(4,879 real changes made)
(9,947 real changes made)
(11,387 real changes made)
(7,781 missing values generated)
(9,947 real changes made)
(5,068 real changes made)
(7,797 real changes made, 7,797 to missing)
(7,797 missing values generated)
(17,728 missing values generated)
(5,022 real changes made)
(4,909 real changes made)
(5,022 real changes made)
(4,909 real changes made)
(6,319 real changes made)
(17,728 missing values generated)
(5,022 real changes made)
(4,909 real changes made)
(9,931 real changes made)
(11,409 real changes made)
(7,797 missing values generated)
(9,931 real changes made)
(5,022 real changes made)
(7,814 real changes made, 7,814 to missing)
(7,814 missing values generated)
(17,728 missing values generated)
(5,070 real changes made)
(4,844 real changes made)
(5,070 real changes made)
(4,844 real changes made)
(6,301 real changes made)
(17,728 missing values generated)
(5,070 real changes made)
(4,844 real changes made)
(9,914 real changes made)
(11,427 real changes made)
(7,814 missing values generated)
(9,914 real changes made)
(5,070 real changes made)
(7,775 real changes made, 7,775 to missing)
(7,775 missing values generated)
(17,728 missing values generated)
(5,049 real changes made)
(4,904 real changes made)
(5,049 real changes made)
(4,904 real changes made)
(6,208 real changes made)
(17,728 missing values generated)
(5,049 real changes made)
(4,904 real changes made)
(9,953 real changes made)
(11,520 real changes made)
(7,775 missing values generated)
(9,953 real changes made)
(5,049 real changes made)
(7,798 real changes made, 7,798 to missing)
(7,798 missing values generated)
(17,728 missing values generated)
(5,115 real changes made)
(4,815 real changes made)
(5,115 real changes made)
(4,815 real changes made)
(6,236 real changes made)
(17,728 missing values generated)
(5,115 real changes made)
(4,815 real changes made)
(9,930 real changes made)
(11,492 real changes made)
(7,798 missing values generated)
(9,930 real changes made)
(5,115 real changes made)
(7,700 real changes made, 7,700 to missing)
(7,700 missing values generated)
(17,728 missing values generated)
(5,170 real changes made)
(4,858 real changes made)
(5,170 real changes made)
(4,858 real changes made)
(6,332 real changes made)
(17,728 missing values generated)
(5,170 real changes made)
(4,858 real changes made)
(10,028 real changes made)
(11,396 real changes made)
(7,700 missing values generated)
(10,028 real changes made)
(5,170 real changes made)
(7,833 real changes made, 7,833 to missing)
(7,833 missing values generated)
(17,728 missing values generated)
(5,043 real changes made)
(4,852 real changes made)
(5,043 real changes made)
(4,852 real changes made)
(6,230 real changes made)
(17,728 missing values generated)
(5,043 real changes made)
(4,852 real changes made)
(9,895 real changes made)
(11,498 real changes made)
(7,833 missing values generated)
(9,895 real changes made)
(5,043 real changes made)
(7,758 real changes made, 7,758 to missing)
(7,758 missing values generated)
(17,728 missing values generated)
(5,038 real changes made)
(4,932 real changes made)
(5,038 real changes made)
(4,932 real changes made)
(6,395 real changes made)
(17,728 missing values generated)
(5,038 real changes made)
(4,932 real changes made)
(9,970 real changes made)
(11,333 real changes made)
(7,758 missing values generated)
(9,970 real changes made)
(5,038 real changes made)
(7,770 real changes made, 7,770 to missing)
(7,770 missing values generated)
(17,728 missing values generated)
(5,028 real changes made)
(4,930 real changes made)
(5,028 real changes made)
(4,930 real changes made)
(6,266 real changes made)
(17,728 missing values generated)
(5,028 real changes made)
(4,930 real changes made)
(9,958 real changes made)
(11,462 real changes made)
(7,770 missing values generated)
(9,958 real changes made)
(5,028 real changes made)
(7,842 real changes made, 7,842 to missing)
(7,842 missing values generated)
(17,728 missing values generated)
(5,025 real changes made)
(4,861 real changes made)
(5,025 real changes made)
(4,861 real changes made)
(6,222 real changes made)
(17,728 missing values generated)
(5,025 real changes made)
(4,861 real changes made)
(9,886 real changes made)
(11,506 real changes made)
(7,842 missing values generated)
(9,886 real changes made)
(5,025 real changes made)
(7,781 real changes made, 7,781 to missing)
(7,781 missing values generated)
(17,728 missing values generated)
(5,068 real changes made)
(4,879 real changes made)
(5,068 real changes made)
(4,879 real changes made)
(6,245 real changes made)
(17,728 missing values generated)
(5,068 real changes made)
(4,879 real changes made)
(9,947 real changes made)
(11,483 real changes made)
(7,781 missing values generated)
(9,947 real changes made)
(5,068 real changes made)
(7,872 real changes made, 7,872 to missing)
(7,872 missing values generated)
(17,728 missing values generated)
(5,027 real changes made)
(4,829 real changes made)
(5,027 real changes made)
(4,829 real changes made)
(6,302 real changes made)
(17,728 missing values generated)
(5,027 real changes made)
(4,829 real changes made)
(9,856 real changes made)
(11,426 real changes made)
(7,872 missing values generated)
(9,856 real changes made)
(5,027 real changes made)
(7,831 real changes made, 7,831 to missing)
(7,831 missing values generated)
(17,728 missing values generated)
(5,110 real changes made)
(4,787 real changes made)
(5,110 real changes made)
(4,787 real changes made)
(6,290 real changes made)
(17,728 missing values generated)
(5,110 real changes made)
(4,787 real changes made)
(9,897 real changes made)
(11,438 real changes made)
(7,831 missing values generated)
(9,897 real changes made)
(5,110 real changes made)
(7,742 real changes made, 7,742 to missing)
(7,742 missing values generated)
(17,728 missing values generated)
(5,093 real changes made)
(4,893 real changes made)
(5,093 real changes made)
(4,893 real changes made)
(6,389 real changes made)
(17,728 missing values generated)
(5,093 real changes made)
(4,893 real changes made)
(9,986 real changes made)
(11,339 real changes made)
(7,742 missing values generated)
(9,986 real changes made)
(5,093 real changes made)
(7,796 real changes made, 7,796 to missing)
(7,796 missing values generated)
(17,728 missing values generated)
(5,048 real changes made)
(4,884 real changes made)
(5,048 real changes made)
(4,884 real changes made)
(6,291 real changes made)
(17,728 missing values generated)
(5,048 real changes made)
(4,884 real changes made)
(9,932 real changes made)
(11,437 real changes made)
(7,796 missing values generated)
(9,932 real changes made)
(5,048 real changes made)
(7,745 real changes made, 7,745 to missing)
(7,745 missing values generated)
(17,728 missing values generated)
(5,108 real changes made)
(4,875 real changes made)
(5,108 real changes made)
(4,875 real changes made)
(6,296 real changes made)
(17,728 missing values generated)
(5,108 real changes made)
(4,875 real changes made)
(9,983 real changes made)
(11,432 real changes made)
(7,745 missing values generated)
(9,983 real changes made)
(5,108 real changes made)
(7,845 real changes made, 7,845 to missing)
(7,845 missing values generated)
(17,728 missing values generated)
(5,029 real changes made)
(4,854 real changes made)
(5,029 real changes made)
(4,854 real changes made)
(6,272 real changes made)
(17,728 missing values generated)
(5,029 real changes made)
(4,854 real changes made)
(9,883 real changes made)
(11,456 real changes made)
(7,845 missing values generated)
(9,883 real changes made)
(5,029 real changes made)
(7,867 real changes made, 7,867 to missing)
(7,867 missing values generated)
(17,728 missing values generated)
(4,985 real changes made)
(4,876 real changes made)
(4,985 real changes made)
(4,876 real changes made)
(6,240 real changes made)
(17,728 missing values generated)
(4,985 real changes made)
(4,876 real changes made)
(9,861 real changes made)
(11,488 real changes made)
(7,867 missing values generated)
(9,861 real changes made)
(4,985 real changes made)
(7,840 real changes made, 7,840 to missing)
(7,840 missing values generated)
(17,728 missing values generated)
(5,031 real changes made)
(4,857 real changes made)
(5,031 real changes made)
(4,857 real changes made)
(6,320 real changes made)
(17,728 missing values generated)
(5,031 real changes made)
(4,857 real changes made)
(9,888 real changes made)
(11,408 real changes made)
(7,840 missing values generated)
(9,888 real changes made)
(5,031 real changes made)
(7,777 real changes made, 7,777 to missing)
(7,777 missing values generated)
(17,728 missing values generated)
(5,094 real changes made)
(4,857 real changes made)
(5,094 real changes made)
(4,857 real changes made)
(6,304 real changes made)
(17,728 missing values generated)
(5,094 real changes made)
(4,857 real changes made)
(9,951 real changes made)
(11,424 real changes made)
(7,777 missing values generated)
(9,951 real changes made)
(5,094 real changes made)
(7,750 real changes made, 7,750 to missing)
(7,750 missing values generated)
(17,728 missing values generated)
(5,082 real changes made)
(4,896 real changes made)
(5,082 real changes made)
(4,896 real changes made)
(6,337 real changes made)
(17,728 missing values generated)
(5,082 real changes made)
(4,896 real changes made)
(9,978 real changes made)
(11,391 real changes made)
(7,750 missing values generated)
(9,978 real changes made)
(5,082 real changes made)
(7,747 real changes made, 7,747 to missing)
(7,747 missing values generated)
(17,728 missing values generated)
(5,097 real changes made)
(4,884 real changes made)
(5,097 real changes made)
(4,884 real changes made)
(6,340 real changes made)
(17,728 missing values generated)
(5,097 real changes made)
(4,884 real changes made)
(9,981 real changes made)
(11,388 real changes made)
(7,747 missing values generated)
(9,981 real changes made)
(5,097 real changes made)
(7,747 real changes made, 7,747 to missing)
(7,747 missing values generated)
(17,728 missing values generated)
(5,033 real changes made)
(4,948 real changes made)
(5,033 real changes made)
(4,948 real changes made)
(6,281 real changes made)
(17,728 missing values generated)
(5,033 real changes made)
(4,948 real changes made)
(9,981 real changes made)
(11,447 real changes made)
(7,747 missing values generated)
(9,981 real changes made)
(5,033 real changes made)
(7,892 real changes made, 7,892 to missing)
(7,892 missing values generated)
(17,728 missing values generated)
(5,014 real changes made)
(4,822 real changes made)
(5,014 real changes made)
(4,822 real changes made)
(6,186 real changes made)
(17,728 missing values generated)
(5,014 real changes made)
(4,822 real changes made)
(9,836 real changes made)
(11,542 real changes made)
(7,892 missing values generated)
(9,836 real changes made)
(5,014 real changes made)
(7,723 real changes made, 7,723 to missing)
(7,723 missing values generated)
(17,728 missing values generated)
(5,139 real changes made)
(4,866 real changes made)
(5,139 real changes made)
(4,866 real changes made)
(6,426 real changes made)
(17,728 missing values generated)
(5,139 real changes made)
(4,866 real changes made)
(10,005 real changes made)
(11,302 real changes made)
(7,723 missing values generated)
(10,005 real changes made)
(5,139 real changes made)
(7,722 real changes made, 7,722 to missing)
(7,722 missing values generated)
(17,728 missing values generated)
(5,093 real changes made)
(4,913 real changes made)
(5,093 real changes made)
(4,913 real changes made)
(6,312 real changes made)
(17,728 missing values generated)
(5,093 real changes made)
(4,913 real changes made)
(10,006 real changes made)
(11,416 real changes made)
(7,722 missing values generated)
(10,006 real changes made)
(5,093 real changes made)
(7,725 real changes made, 7,725 to missing)
(7,725 missing values generated)
(17,728 missing values generated)
(5,100 real changes made)
(4,903 real changes made)
(5,100 real changes made)
(4,903 real changes made)
(6,358 real changes made)
(17,728 missing values generated)
(5,100 real changes made)
(4,903 real changes made)
(10,003 real changes made)
(11,370 real changes made)
(7,725 missing values generated)
(10,003 real changes made)
(5,100 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(17,728 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr20
> 22 may2022 jun2022 jul2022 aug2022 sep2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_creatinine_`x' if  covid_month=="`x'"
  3. drop if baseline_egfr <15
  4. drop egfr_creatinine_`x'
  5. }
(346 real changes made)
(0 observations deleted)
(414 real changes made)
(0 observations deleted)
(376 real changes made)
(0 observations deleted)
(371 real changes made)
(0 observations deleted)
(334 real changes made)
(0 observations deleted)
(362 real changes made)
(0 observations deleted)
(375 real changes made)
(0 observations deleted)
(348 real changes made)
(0 observations deleted)
(362 real changes made)
(0 observations deleted)
(349 real changes made)
(0 observations deleted)
(323 real changes made)
(0 observations deleted)
(364 real changes made)
(0 observations deleted)
(294 real changes made)
(0 observations deleted)
(315 real changes made)
(0 observations deleted)
(302 real changes made)
(0 observations deleted)
(311 real changes made)
(0 observations deleted)
(282 real changes made)
(0 observations deleted)
(289 real changes made)
(0 observations deleted)
(302 real changes made)
(0 observations deleted)
(294 real changes made)
(0 observations deleted)
(288 real changes made)
(0 observations deleted)
(299 real changes made)
(0 observations deleted)
(301 real changes made)
(0 observations deleted)
(243 real changes made)
(0 observations deleted)
(261 real changes made)
(0 observations deleted)
(275 real changes made)
(0 observations deleted)
(261 real changes made)
(0 observations deleted)
(274 real changes made)
(0 observations deleted)
(213 real changes made)
(0 observations deleted)
(283 real changes made)
(0 observations deleted)
(260 real changes made)
(0 observations deleted)
(225 real changes made)
(0 observations deleted)

. drop baseline_egfr

. drop covid_date_string

. 
. * COVID-19 death
. drop if deceased==1
(1,723 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        250        1.56        1.56
         19 |        225        1.41        2.97
         20 |        230        1.44        4.40
         21 |        253        1.58        5.99
         22 |        236        1.47        7.46
         23 |        265        1.66        9.12
         24 |        264        1.65       10.77
         25 |        270        1.69       12.45
         26 |        288        1.80       14.25
         27 |        254        1.59       15.84
         28 |        270        1.69       17.53
         29 |        282        1.76       19.29
         30 |        305        1.91       21.19
         31 |        282        1.76       22.96
         32 |        260        1.62       24.58
         33 |        278        1.74       26.32
         34 |        265        1.66       27.97
         35 |        268        1.67       29.65
         36 |        250        1.56       31.21
         37 |        267        1.67       32.88
         38 |        282        1.76       34.64
         39 |        277        1.73       36.37
         40 |        251        1.57       37.94
         41 |        224        1.40       39.34
         42 |        253        1.58       40.92
         43 |        231        1.44       42.36
         44 |        225        1.41       43.77
         45 |        295        1.84       45.61
         46 |        277        1.73       47.34
         47 |        291        1.82       49.16
         48 |        259        1.62       50.78
         49 |        260        1.62       52.40
         50 |        293        1.83       54.23
         51 |        293        1.83       56.06
         52 |        288        1.80       57.86
         53 |        259        1.62       59.48
         54 |        291        1.82       61.30
         55 |        272        1.70       63.00
         56 |        273        1.71       64.70
         57 |        265        1.66       66.36
         58 |        254        1.59       67.95
         59 |        265        1.66       69.60
         60 |        210        1.31       70.92
         61 |        216        1.35       72.26
         62 |        244        1.52       73.79
         63 |        243        1.52       75.31
         64 |        215        1.34       76.65
         65 |        191        1.19       77.84
         66 |        193        1.21       79.05
         67 |        230        1.44       80.49
         68 |        219        1.37       81.86
         69 |        212        1.32       83.18
         70 |        218        1.36       84.54
         71 |        231        1.44       85.99
         72 |        216        1.35       87.34
         73 |        186        1.16       88.50
         74 |        179        1.12       89.62
         75 |        124        0.77       90.39
         76 |        138        0.86       91.25
         77 |        128        0.80       92.05
         78 |        144        0.90       92.95
         79 |        135        0.84       93.80
         80 |        110        0.69       94.48
         81 |         94        0.59       95.07
         82 |        117        0.73       95.80
         83 |         90        0.56       96.36
         84 |        101        0.63       96.99
         85 |         59        0.37       97.36
         86 |         70        0.44       97.80
         87 |         55        0.34       98.14
         88 |         52        0.32       98.47
         89 |         68        0.42       98.89
         90 |         20        0.12       99.02
         91 |         24        0.15       99.17
         92 |         29        0.18       99.35
         93 |         32        0.20       99.55
         94 |         27        0.17       99.72
         95 |         11        0.07       99.79
         96 |          9        0.06       99.84
         97 |          4        0.02       99.87
         98 |          7        0.04       99.91
         99 |          6        0.04       99.95
        100 |          1        0.01       99.96
        102 |          2        0.01       99.97
        103 |          1        0.01       99.98
        104 |          1        0.01       99.98
        107 |          1        0.01       99.99
        108 |          1        0.01       99.99
        109 |          1        0.01      100.00
------------+-----------------------------------
      Total |     16,005      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        830        5.19        5.19
          1 |      3,124       19.52       24.70
          2 |      2,971       18.56       43.27
          3 |      3,023       18.89       62.16
          4 |      3,014       18.83       80.99
          5 |      3,043       19.01      100.00
------------+-----------------------------------
      Total |     16,005      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      8,163       51.00       51.00
       Male |      7,842       49.00      100.00
------------+-----------------------------------
      Total |     16,005      100.00

. tab covid_month

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |        575        3.59        3.59
    apr2021 |        506        3.16        6.75
    apr2022 |        459        2.87        9.62
    aug2020 |        599        3.74       13.36
    aug2021 |        493        3.08       16.44
    aug2022 |        411        2.57       19.01
    dec2020 |        524        3.27       22.29
    dec2021 |        473        2.96       25.24
    feb2020 |        556        3.47       28.72
    feb2021 |        491        3.07       31.78
    feb2022 |        393        2.46       34.24
    jan2021 |        567        3.54       37.78
    jan2022 |        414        2.59       40.37
    jul2020 |        605        3.78       44.15
    jul2021 |        473        2.96       47.10
    jul2022 |        445        2.78       49.88
    jun2020 |        547        3.42       53.30
    jun2021 |        480        3.00       56.30
    jun2022 |        372        2.32       58.63
    mar2020 |        649        4.05       62.68
    mar2021 |        498        3.11       65.79
    mar2022 |        451        2.82       68.61
    may2020 |        586        3.66       72.27
    may2021 |        500        3.12       75.40
    may2022 |        420        2.62       78.02
    nov2020 |        567        3.54       81.56
    nov2021 |        498        3.11       84.67
    oct2020 |        559        3.49       88.17
    oct2021 |        480        3.00       91.17
    sep2020 |        564        3.52       94.69
    sep2021 |        471        2.94       97.63
    sep2022 |        379        2.37      100.00
------------+-----------------------------------
      Total |     16,005      100.00

. 
. export delimited using "./output/covid_matching_2017.csv", replace
(note: file ./output/covid_matching_2017.csv not found)
file ./output/covid_matching_2017.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2017.log
  log type:  text
 closed on:   1 Nov 2022, 14:20:50
-------------------------------------------------------------------------------
