-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2020.log
  log type:  text
 opened on:  26 Oct 2022, 12:17:02

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames
> (1) case(preserve) 
(53 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,522 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(2,011 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,865 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,815 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,637 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,231 real changes made, 14,231 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,231 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,150 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(8,995 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,924 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(8,995 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,924 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,424 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,150 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(8,995 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,924 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(17,919 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,726 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,231 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(17,919 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(8,995 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(14,353 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(14,353 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(7,869 real changes made, 7,869 to missing)
(7,869 missing values generated)
(17,797 missing values generated)
(5,060 real changes made)
(4,868 real changes made)
(5,060 real changes made)
(4,868 real changes made)
(6,277 real changes made)
(17,797 missing values generated)
(5,060 real changes made)
(4,868 real changes made)
(9,928 real changes made)
(11,520 real changes made)
(7,869 missing values generated)
(9,928 real changes made)
(5,060 real changes made)
(7,798 real changes made, 7,798 to missing)
(7,798 missing values generated)
(17,797 missing values generated)
(5,149 real changes made)
(4,850 real changes made)
(5,149 real changes made)
(4,850 real changes made)
(6,300 real changes made)
(17,797 missing values generated)
(5,149 real changes made)
(4,850 real changes made)
(9,999 real changes made)
(11,497 real changes made)
(7,798 missing values generated)
(9,999 real changes made)
(5,149 real changes made)
(7,770 real changes made, 7,770 to missing)
(7,770 missing values generated)
(17,797 missing values generated)
(5,120 real changes made)
(4,907 real changes made)
(5,120 real changes made)
(4,907 real changes made)
(6,302 real changes made)
(17,797 missing values generated)
(5,120 real changes made)
(4,907 real changes made)
(10,027 real changes made)
(11,495 real changes made)
(7,770 missing values generated)
(10,027 real changes made)
(5,120 real changes made)
(7,893 real changes made, 7,893 to missing)
(7,893 missing values generated)
(17,797 missing values generated)
(5,093 real changes made)
(4,811 real changes made)
(5,093 real changes made)
(4,811 real changes made)
(6,223 real changes made)
(17,797 missing values generated)
(5,093 real changes made)
(4,811 real changes made)
(9,904 real changes made)
(11,574 real changes made)
(7,893 missing values generated)
(9,904 real changes made)
(5,093 real changes made)
(7,804 real changes made, 7,804 to missing)
(7,804 missing values generated)
(17,797 missing values generated)
(5,067 real changes made)
(4,926 real changes made)
(5,067 real changes made)
(4,926 real changes made)
(6,371 real changes made)
(17,797 missing values generated)
(5,067 real changes made)
(4,926 real changes made)
(9,993 real changes made)
(11,426 real changes made)
(7,804 missing values generated)
(9,993 real changes made)
(5,067 real changes made)
(7,738 real changes made, 7,738 to missing)
(7,738 missing values generated)
(17,797 missing values generated)
(5,190 real changes made)
(4,869 real changes made)
(5,190 real changes made)
(4,869 real changes made)
(6,370 real changes made)
(17,797 missing values generated)
(5,190 real changes made)
(4,869 real changes made)
(10,059 real changes made)
(11,427 real changes made)
(7,738 missing values generated)
(10,059 real changes made)
(5,190 real changes made)
(7,790 real changes made, 7,790 to missing)
(7,790 missing values generated)
(17,797 missing values generated)
(5,069 real changes made)
(4,938 real changes made)
(5,069 real changes made)
(4,938 real changes made)
(6,304 real changes made)
(17,797 missing values generated)
(5,069 real changes made)
(4,938 real changes made)
(10,007 real changes made)
(11,493 real changes made)
(7,790 missing values generated)
(10,007 real changes made)
(5,069 real changes made)
(7,900 real changes made, 7,900 to missing)
(7,900 missing values generated)
(17,797 missing values generated)
(5,039 real changes made)
(4,858 real changes made)
(5,039 real changes made)
(4,858 real changes made)
(6,319 real changes made)
(17,797 missing values generated)
(5,039 real changes made)
(4,858 real changes made)
(9,897 real changes made)
(11,478 real changes made)
(7,900 missing values generated)
(9,897 real changes made)
(5,039 real changes made)
(7,813 real changes made, 7,813 to missing)
(7,813 missing values generated)
(17,797 missing values generated)
(5,130 real changes made)
(4,854 real changes made)
(5,130 real changes made)
(4,854 real changes made)
(6,364 real changes made)
(17,797 missing values generated)
(5,130 real changes made)
(4,854 real changes made)
(9,984 real changes made)
(11,433 real changes made)
(7,813 missing values generated)
(9,984 real changes made)
(5,130 real changes made)
(7,838 real changes made, 7,838 to missing)
(7,838 missing values generated)
(17,797 missing values generated)
(5,128 real changes made)
(4,831 real changes made)
(5,128 real changes made)
(4,831 real changes made)
(6,259 real changes made)
(17,797 missing values generated)
(5,128 real changes made)
(4,831 real changes made)
(9,959 real changes made)
(11,538 real changes made)
(7,838 missing values generated)
(9,959 real changes made)
(5,128 real changes made)
(7,857 real changes made, 7,857 to missing)
(7,857 missing values generated)
(17,797 missing values generated)
(5,059 real changes made)
(4,881 real changes made)
(5,059 real changes made)
(4,881 real changes made)
(6,276 real changes made)
(17,797 missing values generated)
(5,059 real changes made)
(4,881 real changes made)
(9,940 real changes made)
(11,521 real changes made)
(7,857 missing values generated)
(9,940 real changes made)
(5,059 real changes made)
(7,922 real changes made, 7,922 to missing)
(7,922 missing values generated)
(17,797 missing values generated)
(5,068 real changes made)
(4,807 real changes made)
(5,068 real changes made)
(4,807 real changes made)
(6,295 real changes made)
(17,797 missing values generated)
(5,068 real changes made)
(4,807 real changes made)
(9,875 real changes made)
(11,502 real changes made)
(7,922 missing values generated)
(9,875 real changes made)
(5,068 real changes made)
(7,842 real changes made, 7,842 to missing)
(7,842 missing values generated)
(17,797 missing values generated)
(5,116 real changes made)
(4,839 real changes made)
(5,116 real changes made)
(4,839 real changes made)
(6,297 real changes made)
(17,797 missing values generated)
(5,116 real changes made)
(4,839 real changes made)
(9,955 real changes made)
(11,500 real changes made)
(7,842 missing values generated)
(9,955 real changes made)
(5,116 real changes made)
(7,794 real changes made, 7,794 to missing)
(7,794 missing values generated)
(17,797 missing values generated)
(5,124 real changes made)
(4,879 real changes made)
(5,124 real changes made)
(4,879 real changes made)
(6,327 real changes made)
(17,797 missing values generated)
(5,124 real changes made)
(4,879 real changes made)
(10,003 real changes made)
(11,470 real changes made)
(7,794 missing values generated)
(10,003 real changes made)
(5,124 real changes made)
(7,835 real changes made, 7,835 to missing)
(7,835 missing values generated)
(17,797 missing values generated)
(5,106 real changes made)
(4,856 real changes made)
(5,106 real changes made)
(4,856 real changes made)
(6,314 real changes made)
(17,797 missing values generated)
(5,106 real changes made)
(4,856 real changes made)
(9,962 real changes made)
(11,483 real changes made)
(7,835 missing values generated)
(9,962 real changes made)
(5,106 real changes made)
(7,854 real changes made, 7,854 to missing)
(7,854 missing values generated)
(17,797 missing values generated)
(5,075 real changes made)
(4,868 real changes made)
(5,075 real changes made)
(4,868 real changes made)
(6,309 real changes made)
(17,797 missing values generated)
(5,075 real changes made)
(4,868 real changes made)
(9,943 real changes made)
(11,488 real changes made)
(7,854 missing values generated)
(9,943 real changes made)
(5,075 real changes made)
(7,801 real changes made, 7,801 to missing)
(7,801 missing values generated)
(17,797 missing values generated)
(5,135 real changes made)
(4,861 real changes made)
(5,135 real changes made)
(4,861 real changes made)
(6,333 real changes made)
(17,797 missing values generated)
(5,135 real changes made)
(4,861 real changes made)
(9,996 real changes made)
(11,464 real changes made)
(7,801 missing values generated)
(9,996 real changes made)
(5,135 real changes made)
(7,945 real changes made, 7,945 to missing)
(7,945 missing values generated)
(17,797 missing values generated)
(4,988 real changes made)
(4,864 real changes made)
(4,988 real changes made)
(4,864 real changes made)
(6,177 real changes made)
(17,797 missing values generated)
(4,988 real changes made)
(4,864 real changes made)
(9,852 real changes made)
(11,620 real changes made)
(7,945 missing values generated)
(9,852 real changes made)
(4,988 real changes made)
(7,772 real changes made, 7,772 to missing)
(7,772 missing values generated)
(17,797 missing values generated)
(5,063 real changes made)
(4,962 real changes made)
(5,063 real changes made)
(4,962 real changes made)
(6,409 real changes made)
(17,797 missing values generated)
(5,063 real changes made)
(4,962 real changes made)
(10,025 real changes made)
(11,388 real changes made)
(7,772 missing values generated)
(10,025 real changes made)
(5,063 real changes made)
(7,783 real changes made, 7,783 to missing)
(7,783 missing values generated)
(17,797 missing values generated)
(5,127 real changes made)
(4,887 real changes made)
(5,127 real changes made)
(4,887 real changes made)
(6,351 real changes made)
(17,797 missing values generated)
(5,127 real changes made)
(4,887 real changes made)
(10,014 real changes made)
(11,446 real changes made)
(7,783 missing values generated)
(10,014 real changes made)
(5,127 real changes made)
(7,836 real changes made, 7,836 to missing)
(7,836 missing values generated)
(17,797 missing values generated)
(5,115 real changes made)
(4,846 real changes made)
(5,115 real changes made)
(4,846 real changes made)
(6,396 real changes made)
(17,797 missing values generated)
(5,115 real changes made)
(4,846 real changes made)
(9,961 real changes made)
(11,401 real changes made)
(7,836 missing values generated)
(9,961 real changes made)
(5,115 real changes made)
(7,720 real changes made, 7,720 to missing)
(7,720 missing values generated)
(17,797 missing values generated)
(5,174 real changes made)
(4,903 real changes made)
(5,174 real changes made)
(4,903 real changes made)
(6,375 real changes made)
(17,797 missing values generated)
(5,174 real changes made)
(4,903 real changes made)
(10,077 real changes made)
(11,422 real changes made)
(7,720 missing values generated)
(10,077 real changes made)
(5,174 real changes made)
(7,927 real changes made, 7,927 to missing)
(7,927 missing values generated)
(17,797 missing values generated)
(5,012 real changes made)
(4,858 real changes made)
(5,012 real changes made)
(4,858 real changes made)
(6,284 real changes made)
(17,797 missing values generated)
(5,012 real changes made)
(4,858 real changes made)
(9,870 real changes made)
(11,513 real changes made)
(7,927 missing values generated)
(9,870 real changes made)
(5,012 real changes made)
(7,763 real changes made, 7,763 to missing)
(7,763 missing values generated)
(17,797 missing values generated)
(5,144 real changes made)
(4,890 real changes made)
(5,144 real changes made)
(4,890 real changes made)
(6,425 real changes made)
(17,797 missing values generated)
(5,144 real changes made)
(4,890 real changes made)
(10,034 real changes made)
(11,372 real changes made)
(7,763 missing values generated)
(10,034 real changes made)
(5,144 real changes made)
(7,836 real changes made, 7,836 to missing)
(7,836 missing values generated)
(17,797 missing values generated)
(5,098 real changes made)
(4,863 real changes made)
(5,098 real changes made)
(4,863 real changes made)
(6,416 real changes made)
(17,797 missing values generated)
(5,098 real changes made)
(4,863 real changes made)
(9,961 real changes made)
(11,381 real changes made)
(7,836 missing values generated)
(9,961 real changes made)
(5,098 real changes made)
(7,822 real changes made, 7,822 to missing)
(7,822 missing values generated)
(17,797 missing values generated)
(5,070 real changes made)
(4,905 real changes made)
(5,070 real changes made)
(4,905 real changes made)
(6,339 real changes made)
(17,797 missing values generated)
(5,070 real changes made)
(4,905 real changes made)
(9,975 real changes made)
(11,458 real changes made)
(7,822 missing values generated)
(9,975 real changes made)
(5,070 real changes made)
(7,857 real changes made, 7,857 to missing)
(7,857 missing values generated)
(17,797 missing values generated)
(5,038 real changes made)
(4,902 real changes made)
(5,038 real changes made)
(4,902 real changes made)
(6,292 real changes made)
(17,797 missing values generated)
(5,038 real changes made)
(4,902 real changes made)
(9,940 real changes made)
(11,505 real changes made)
(7,857 missing values generated)
(9,940 real changes made)
(5,038 real changes made)
(7,821 real changes made, 7,821 to missing)
(7,821 missing values generated)
(17,797 missing values generated)
(5,186 real changes made)
(4,790 real changes made)
(5,186 real changes made)
(4,790 real changes made)
(6,409 real changes made)
(17,797 missing values generated)
(5,186 real changes made)
(4,790 real changes made)
(9,976 real changes made)
(11,388 real changes made)
(7,821 missing values generated)
(9,976 real changes made)
(5,186 real changes made)
(7,802 real changes made, 7,802 to missing)
(7,802 missing values generated)
(17,797 missing values generated)
(5,046 real changes made)
(4,949 real changes made)
(5,046 real changes made)
(4,949 real changes made)
(6,343 real changes made)
(17,797 missing values generated)
(5,046 real changes made)
(4,949 real changes made)
(9,995 real changes made)
(11,454 real changes made)
(7,802 missing values generated)
(9,995 real changes made)
(5,046 real changes made)
(7,833 real changes made, 7,833 to missing)
(7,833 missing values generated)
(17,797 missing values generated)
(5,139 real changes made)
(4,825 real changes made)
(5,139 real changes made)
(4,825 real changes made)
(6,331 real changes made)
(17,797 missing values generated)
(5,139 real changes made)
(4,825 real changes made)
(9,964 real changes made)
(11,466 real changes made)
(7,833 missing values generated)
(9,964 real changes made)
(5,139 real changes made)
(7,815 real changes made, 7,815 to missing)
(7,815 missing values generated)
(17,797 missing values generated)
(5,070 real changes made)
(4,912 real changes made)
(5,070 real changes made)
(4,912 real changes made)
(6,338 real changes made)
(17,797 missing values generated)
(5,070 real changes made)
(4,912 real changes made)
(9,982 real changes made)
(11,459 real changes made)
(7,815 missing values generated)
(9,982 real changes made)
(5,070 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(17,797 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr20
> 22 may2022 jun2022 jul2022 aug2022 sep2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. drop if baseline_egfr <15
  4. drop egfr_baseline_creatinine_`x'
  5. }
(336 real changes made)
(0 observations deleted)
(395 real changes made)
(0 observations deleted)
(366 real changes made)
(0 observations deleted)
(374 real changes made)
(0 observations deleted)
(359 real changes made)
(0 observations deleted)
(368 real changes made)
(0 observations deleted)
(376 real changes made)
(0 observations deleted)
(327 real changes made)
(0 observations deleted)
(321 real changes made)
(0 observations deleted)
(360 real changes made)
(0 observations deleted)
(371 real changes made)
(0 observations deleted)
(365 real changes made)
(0 observations deleted)
(319 real changes made)
(0 observations deleted)
(310 real changes made)
(0 observations deleted)
(335 real changes made)
(0 observations deleted)
(321 real changes made)
(0 observations deleted)
(303 real changes made)
(0 observations deleted)
(329 real changes made)
(0 observations deleted)
(320 real changes made)
(0 observations deleted)
(280 real changes made)
(0 observations deleted)
(314 real changes made)
(0 observations deleted)
(297 real changes made)
(0 observations deleted)
(288 real changes made)
(0 observations deleted)
(298 real changes made)
(0 observations deleted)
(234 real changes made)
(0 observations deleted)
(307 real changes made)
(0 observations deleted)
(235 real changes made)
(0 observations deleted)
(246 real changes made)
(0 observations deleted)
(265 real changes made)
(0 observations deleted)
(266 real changes made)
(0 observations deleted)
(230 real changes made)
(0 observations deleted)
(254 real changes made)
(0 observations deleted)

. drop baseline_egfr

. drop covid_date_string

. 
. * COVID-19 death
. drop if deceased==1
(1,765 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        227        1.42        1.42
         19 |        224        1.40        2.81
         20 |        237        1.48        4.29
         21 |        228        1.42        5.71
         22 |        263        1.64        7.35
         23 |        260        1.62        8.98
         24 |        269        1.68       10.65
         25 |        276        1.72       12.38
         26 |        271        1.69       14.07
         27 |        290        1.81       15.87
         28 |        282        1.76       17.63
         29 |        291        1.82       19.45
         30 |        241        1.50       20.95
         31 |        265        1.65       22.60
         32 |        274        1.71       24.31
         33 |        279        1.74       26.05
         34 |        266        1.66       27.71
         35 |        268        1.67       29.38
         36 |        273        1.70       31.09
         37 |        290        1.81       32.90
         38 |        277        1.73       34.62
         39 |        284        1.77       36.40
         40 |        232        1.45       37.84
         41 |        239        1.49       39.33
         42 |        244        1.52       40.86
         43 |        222        1.38       42.24
         44 |        247        1.54       43.78
         45 |        298        1.86       45.64
         46 |        288        1.80       47.44
         47 |        299        1.87       49.30
         48 |        254        1.58       50.89
         49 |        324        2.02       52.91
         50 |        262        1.63       54.54
         51 |        259        1.62       56.16
         52 |        293        1.83       57.98
         53 |        264        1.65       59.63
         54 |        262        1.63       61.26
         55 |        256        1.60       62.86
         56 |        271        1.69       64.55
         57 |        237        1.48       66.03
         58 |        269        1.68       67.71
         59 |        250        1.56       69.27
         60 |        204        1.27       70.54
         61 |        217        1.35       71.89
         62 |        216        1.35       73.24
         63 |        231        1.44       74.68
         64 |        217        1.35       76.04
         65 |        212        1.32       77.36
         66 |        212        1.32       78.68
         67 |        186        1.16       79.84
         68 |        221        1.38       81.22
         69 |        231        1.44       82.66
         70 |        196        1.22       83.88
         71 |        215        1.34       85.22
         72 |        222        1.38       86.61
         73 |        207        1.29       87.90
         74 |        194        1.21       89.11
         75 |        122        0.76       89.87
         76 |        154        0.96       90.83
         77 |        126        0.79       91.62
         78 |        130        0.81       92.43
         79 |        161        1.00       93.43
         80 |         98        0.61       94.04
         81 |        103        0.64       94.69
         82 |         93        0.58       95.27
         83 |        112        0.70       95.96
         84 |        107        0.67       96.63
         85 |         74        0.46       97.09
         86 |         50        0.31       97.41
         87 |         72        0.45       97.85
         88 |         69        0.43       98.28
         89 |         73        0.46       98.74
         90 |         28        0.17       98.91
         91 |         27        0.17       99.08
         92 |         39        0.24       99.33
         93 |         33        0.21       99.53
         94 |         31        0.19       99.73
         95 |          3        0.02       99.74
         96 |         14        0.09       99.83
         97 |          4        0.02       99.86
         98 |         12        0.07       99.93
         99 |          7        0.04       99.98
        104 |          1        0.01       99.98
        105 |          2        0.01       99.99
        109 |          1        0.01      100.00
------------+-----------------------------------
      Total |     16,032      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        807        5.03        5.03
          1 |      2,996       18.69       23.72
          2 |      2,987       18.63       42.35
          3 |      3,087       19.26       61.61
          4 |      3,071       19.16       80.76
          5 |      3,084       19.24      100.00
------------+-----------------------------------
      Total |     16,032      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      8,162       50.91       50.91
       Male |      7,870       49.09      100.00
------------+-----------------------------------
      Total |     16,032      100.00

. tab covid_month

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |        561        3.50        3.50
    apr2021 |        543        3.39        6.89
    apr2022 |        409        2.55        9.44
    aug2020 |        564        3.52       12.96
    aug2021 |        519        3.24       16.19
    aug2022 |        360        2.25       18.44
    dec2020 |        549        3.42       21.86
    dec2021 |        465        2.90       24.76
    feb2020 |        525        3.27       28.04
    feb2021 |        497        3.10       31.14
    feb2022 |        373        2.33       33.46
    jan2021 |        599        3.74       37.20
    jan2022 |        495        3.09       40.29
    jul2020 |        575        3.59       43.87
    jul2021 |        494        3.08       46.96
    jul2022 |        420        2.62       49.58
    jun2020 |        581        3.62       53.20
    jun2021 |        515        3.21       56.41
    jun2022 |        427        2.66       59.08
    mar2020 |        609        3.80       62.87
    mar2021 |        503        3.14       66.01
    mar2022 |        484        3.02       69.03
    may2020 |        612        3.82       72.85
    may2021 |        521        3.25       76.10
    may2022 |        410        2.56       78.66
    nov2020 |        546        3.41       82.06
    nov2021 |        428        2.67       84.73
    oct2020 |        549        3.42       88.15
    oct2021 |        505        3.15       91.30
    sep2020 |        527        3.29       94.59
    sep2021 |        464        2.89       97.49
    sep2022 |        403        2.51      100.00
------------+-----------------------------------
      Total |     16,032      100.00

. 
. export delimited using "./output/covid_matching_2020.csv", replace
(note: file ./output/covid_matching_2020.csv not found)
file ./output/covid_matching_2020.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2020.log
  log type:  text
 closed on:  26 Oct 2022, 12:17:05
-------------------------------------------------------------------------------
