-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_england.log
  log type:  text
 opened on:  11 Jul 2022, 21:14:01

. clear

. 
. import delimited ./output/input_covid_england.csv, delimiter(comma) varnames(
> 1) case(preserve) 
(101 vars, 1,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(225 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(36 observations deleted)

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(35 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(32 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(34 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(279 real changes made, 279 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(279 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(638 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(188 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(171 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(188 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(171 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(240 real changes made)

. gen max_baseline_creatinine_feb2020=.
(638 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(188 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(171 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(359 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(398 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(279 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(359 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(188 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(327 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(327 observations deleted)

. drop covid_diagnosis_date

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(144 real changes made, 144 to missing)
(144 missing values generated)
(311 missing values generated)
(85 real changes made)
(82 real changes made)
(85 real changes made)
(82 real changes made)
(112 real changes made)
(311 missing values generated)
(85 real changes made)
(82 real changes made)
(167 real changes made)
(199 real changes made)
(144 missing values generated)
(167 real changes made)
(85 real changes made)
(133 real changes made, 133 to missing)
(133 missing values generated)
(311 missing values generated)
(103 real changes made)
(75 real changes made)
(103 real changes made)
(75 real changes made)
(106 real changes made)
(311 missing values generated)
(103 real changes made)
(75 real changes made)
(178 real changes made)
(205 real changes made)
(133 missing values generated)
(178 real changes made)
(103 real changes made)
(149 real changes made, 149 to missing)
(149 missing values generated)
(311 missing values generated)
(86 real changes made)
(76 real changes made)
(86 real changes made)
(76 real changes made)
(112 real changes made)
(311 missing values generated)
(86 real changes made)
(76 real changes made)
(162 real changes made)
(199 real changes made)
(149 missing values generated)
(162 real changes made)
(86 real changes made)
(126 real changes made, 126 to missing)
(126 missing values generated)
(311 missing values generated)
(103 real changes made)
(82 real changes made)
(103 real changes made)
(82 real changes made)
(118 real changes made)
(311 missing values generated)
(103 real changes made)
(82 real changes made)
(185 real changes made)
(193 real changes made)
(126 missing values generated)
(185 real changes made)
(103 real changes made)
(136 real changes made, 136 to missing)
(136 missing values generated)
(311 missing values generated)
(94 real changes made)
(81 real changes made)
(94 real changes made)
(81 real changes made)
(97 real changes made)
(311 missing values generated)
(94 real changes made)
(81 real changes made)
(175 real changes made)
(214 real changes made)
(136 missing values generated)
(175 real changes made)
(94 real changes made)
(139 real changes made, 139 to missing)
(139 missing values generated)
(311 missing values generated)
(92 real changes made)
(80 real changes made)
(92 real changes made)
(80 real changes made)
(113 real changes made)
(311 missing values generated)
(92 real changes made)
(80 real changes made)
(172 real changes made)
(198 real changes made)
(139 missing values generated)
(172 real changes made)
(92 real changes made)
(133 real changes made, 133 to missing)
(133 missing values generated)
(311 missing values generated)
(93 real changes made)
(85 real changes made)
(93 real changes made)
(85 real changes made)
(107 real changes made)
(311 missing values generated)
(93 real changes made)
(85 real changes made)
(178 real changes made)
(204 real changes made)
(133 missing values generated)
(178 real changes made)
(93 real changes made)
(146 real changes made, 146 to missing)
(146 missing values generated)
(311 missing values generated)
(85 real changes made)
(80 real changes made)
(85 real changes made)
(80 real changes made)
(101 real changes made)
(311 missing values generated)
(85 real changes made)
(80 real changes made)
(165 real changes made)
(210 real changes made)
(146 missing values generated)
(165 real changes made)
(85 real changes made)
(146 real changes made, 146 to missing)
(146 missing values generated)
(311 missing values generated)
(82 real changes made)
(83 real changes made)
(82 real changes made)
(83 real changes made)
(105 real changes made)
(311 missing values generated)
(82 real changes made)
(83 real changes made)
(165 real changes made)
(206 real changes made)
(146 missing values generated)
(165 real changes made)
(82 real changes made)
(121 real changes made, 121 to missing)
(121 missing values generated)
(311 missing values generated)
(101 real changes made)
(89 real changes made)
(101 real changes made)
(89 real changes made)
(114 real changes made)
(311 missing values generated)
(101 real changes made)
(89 real changes made)
(190 real changes made)
(197 real changes made)
(121 missing values generated)
(190 real changes made)
(101 real changes made)
(133 real changes made, 133 to missing)
(133 missing values generated)
(311 missing values generated)
(94 real changes made)
(84 real changes made)
(94 real changes made)
(84 real changes made)
(103 real changes made)
(311 missing values generated)
(94 real changes made)
(84 real changes made)
(178 real changes made)
(208 real changes made)
(133 missing values generated)
(178 real changes made)
(94 real changes made)
(136 real changes made, 136 to missing)
(136 missing values generated)
(311 missing values generated)
(93 real changes made)
(82 real changes made)
(93 real changes made)
(82 real changes made)
(117 real changes made)
(311 missing values generated)
(93 real changes made)
(82 real changes made)
(175 real changes made)
(194 real changes made)
(136 missing values generated)
(175 real changes made)
(93 real changes made)
(138 real changes made, 138 to missing)
(138 missing values generated)
(311 missing values generated)
(97 real changes made)
(76 real changes made)
(97 real changes made)
(76 real changes made)
(123 real changes made)
(311 missing values generated)
(97 real changes made)
(76 real changes made)
(173 real changes made)
(188 real changes made)
(138 missing values generated)
(173 real changes made)
(97 real changes made)
(144 real changes made, 144 to missing)
(144 missing values generated)
(311 missing values generated)
(87 real changes made)
(80 real changes made)
(87 real changes made)
(80 real changes made)
(102 real changes made)
(311 missing values generated)
(87 real changes made)
(80 real changes made)
(167 real changes made)
(209 real changes made)
(144 missing values generated)
(167 real changes made)
(87 real changes made)
(130 real changes made, 130 to missing)
(130 missing values generated)
(311 missing values generated)
(97 real changes made)
(84 real changes made)
(97 real changes made)
(84 real changes made)
(118 real changes made)
(311 missing values generated)
(97 real changes made)
(84 real changes made)
(181 real changes made)
(193 real changes made)
(130 missing values generated)
(181 real changes made)
(97 real changes made)
(150 real changes made, 150 to missing)
(150 missing values generated)
(311 missing values generated)
(87 real changes made)
(74 real changes made)
(87 real changes made)
(74 real changes made)
(105 real changes made)
(311 missing values generated)
(87 real changes made)
(74 real changes made)
(161 real changes made)
(206 real changes made)
(150 missing values generated)
(161 real changes made)
(87 real changes made)
(137 real changes made, 137 to missing)
(137 missing values generated)
(311 missing values generated)
(87 real changes made)
(87 real changes made)
(87 real changes made)
(87 real changes made)
(105 real changes made)
(311 missing values generated)
(87 real changes made)
(87 real changes made)
(174 real changes made)
(206 real changes made)
(137 missing values generated)
(174 real changes made)
(87 real changes made)
(140 real changes made, 140 to missing)
(140 missing values generated)
(311 missing values generated)
(91 real changes made)
(80 real changes made)
(91 real changes made)
(80 real changes made)
(108 real changes made)
(311 missing values generated)
(91 real changes made)
(80 real changes made)
(171 real changes made)
(203 real changes made)
(140 missing values generated)
(171 real changes made)
(91 real changes made)
(124 real changes made, 124 to missing)
(124 missing values generated)
(311 missing values generated)
(96 real changes made)
(91 real changes made)
(96 real changes made)
(91 real changes made)
(117 real changes made)
(311 missing values generated)
(96 real changes made)
(91 real changes made)
(187 real changes made)
(194 real changes made)
(124 missing values generated)
(187 real changes made)
(96 real changes made)
(139 real changes made, 139 to missing)
(139 missing values generated)
(311 missing values generated)
(88 real changes made)
(84 real changes made)
(88 real changes made)
(84 real changes made)
(99 real changes made)
(311 missing values generated)
(88 real changes made)
(84 real changes made)
(172 real changes made)
(212 real changes made)
(139 missing values generated)
(172 real changes made)
(88 real changes made)
(137 real changes made, 137 to missing)
(137 missing values generated)
(311 missing values generated)
(88 real changes made)
(86 real changes made)
(88 real changes made)
(86 real changes made)
(106 real changes made)
(311 missing values generated)
(88 real changes made)
(86 real changes made)
(174 real changes made)
(205 real changes made)
(137 missing values generated)
(174 real changes made)
(88 real changes made)
(146 real changes made, 146 to missing)
(146 missing values generated)
(311 missing values generated)
(85 real changes made)
(80 real changes made)
(85 real changes made)
(80 real changes made)
(104 real changes made)
(311 missing values generated)
(85 real changes made)
(80 real changes made)
(165 real changes made)
(207 real changes made)
(146 missing values generated)
(165 real changes made)
(85 real changes made)
(129 real changes made, 129 to missing)
(129 missing values generated)
(311 missing values generated)
(97 real changes made)
(85 real changes made)
(97 real changes made)
(85 real changes made)
(109 real changes made)
(311 missing values generated)
(97 real changes made)
(85 real changes made)
(182 real changes made)
(202 real changes made)
(129 missing values generated)
(182 real changes made)
(97 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(311 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. drop if baseline_egfr <15
  4. drop egfr_baseline_creatinine_`x'
  5. }
(7 real changes made)
(0 observations deleted)
(9 real changes made)
(0 observations deleted)
(10 real changes made)
(0 observations deleted)
(5 real changes made)
(0 observations deleted)
(12 real changes made)
(0 observations deleted)
(4 real changes made)
(0 observations deleted)
(7 real changes made)
(0 observations deleted)
(8 real changes made)
(0 observations deleted)
(12 real changes made)
(0 observations deleted)
(9 real changes made)
(0 observations deleted)
(9 real changes made)
(0 observations deleted)
(8 real changes made)
(0 observations deleted)
(10 real changes made)
(0 observations deleted)
(8 real changes made)
(0 observations deleted)
(5 real changes made)
(0 observations deleted)
(9 real changes made)
(0 observations deleted)
(5 real changes made)
(0 observations deleted)
(7 real changes made)
(0 observations deleted)
(2 real changes made)
(0 observations deleted)
(5 real changes made)
(0 observations deleted)
(6 real changes made)
(0 observations deleted)
(7 real changes made)
(0 observations deleted)
(3 real changes made)
(0 observations deleted)
(5 real changes made)
(0 observations deleted)

. label var baseline_egfr "Baseline eGFR at COVID diagnosis"

. 
. * COVID-19 death
. drop if covid_death==1
(27 observations deleted)

. drop covid_death

. 
. **Exposure stratification
. * COVID-19 severity
. gen covid_severity = covid_hospitalised

. replace covid_severity = 2 if covid_critical_care==1
(10 real changes made)

. replace covid_severity = 2 if covid_critical_days!=0
(244 real changes made)

. label define covid_severity_label       0 "SARS-CoV-2 without hospitalisation
> "                                                          ///
>                                                                         1 "CO
> VID-19 with hospitalisation" 2 "COVID-19 with critical care"

. label values covid_severity covid_severity_label

. label var covid_severity "SARS-CoV-2 severity"

. drop covid_hospitalised

. drop covid_critical_care

. drop covid_critical_days

. 
. * COVID-19 acute kidney injury
. label define covid_acute_kidney_injury_label    0 "COVID-19 without acute kid
> ney injury"                                ///
>                                                                              
>                    1 "COVID-19 with acute kidney injury"

. label values covid_acute_kidney_injury covid_acute_kidney_injury_label

. label var covid_acute_kidney_injury "COVID-19 acute kidney injury"

. 
. * COVID-19 kidney replacement therapy
. gen covid_krt = covid_krt_icd_10

. replace covid_krt = covid_krt_opcs_4 if covid_krt_icd_10==0
(11 real changes made)

. label define covid_krt_label    0 "COVID-19 without kidney replacement therap
> y"                                                 ///
>                                                                 1 "COVID-19 w
> ith kidney replacement therapy"

. label values covid_krt covid_krt_label

. label var covid_krt "COVID-19 kidney replacement therapy"

. drop covid_krt_icd_10

. drop covid_krt_opcs_4

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(86 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(82 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(85 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(88 missing values generated)

. format covidvax4date %td

. gen covid_vax_status = .
(284 missing values generated)

. replace covid_vax_status = 4 if covidvax4date!=.
(196 real changes made)

. replace covid_vax_status = 3 if covid_vax_status==. &covidvax3date!=.
(64 real changes made)

. replace covid_vax_status = 2 if covid_vax_status==. &covidvax2date!=.
(16 real changes made)

. replace covid_vax_status = 1 if covid_vax_status==. &covidvax1date!=.
(8 real changes made)

. replace covid_vax_status = 0 if covid_vax_status==.
(0 real changes made)

. 
. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax_label    0 "SARS-CoV-2 pre-vaccination"               
>    ///
>                                                                 1 "SARS-CoV-2
>  after 1 vaccine dose"             ///
>                                                                 2 "SARS-CoV-2
>  after 2 vaccine doses"    ///
>                                                                 3 "SARS-CoV-2
>  after 3 vaccine doses"    ///
>                                                                 4 "SARS-CoV-2
>  after 4 vaccine doses"

. label values covid_vax_status covid_vax_label

. label var covid_vax_status "Vaccination status"

. 
. * Calendar period
. gen calendar_period = 1 if covid_month=="feb2020"
(273 missing values generated)

. replace calendar_period = 1 if covid_month=="mar2020"
(14 real changes made)

. replace calendar_period = 1 if covid_month=="apr2020"
(17 real changes made)

. replace calendar_period = 1 if covid_month=="may2020"
(14 real changes made)

. replace calendar_period = 1 if covid_month=="jun2020"
(15 real changes made)

. replace calendar_period = 2 if covid_month=="jul2020"
(9 real changes made)

. replace calendar_period = 2 if covid_month=="aug2020"
(15 real changes made)

. replace calendar_period = 3 if covid_month=="sep2020"
(14 real changes made)

. replace calendar_period = 3 if covid_month=="oct2020"
(18 real changes made)

. replace calendar_period = 3 if covid_month=="nov2020"
(11 real changes made)

. replace calendar_period = 4 if covid_month=="dec2020"
(19 real changes made)

. replace calendar_period = 4 if covid_month=="jan2021"
(12 real changes made)

. replace calendar_period = 4 if covid_month=="feb2021"
(15 real changes made)

. replace calendar_period = 5 if covid_month=="mar2021"
(17 real changes made)

. replace calendar_period = 5 if covid_month=="apr2021"
(9 real changes made)

. replace calendar_period = 5 if covid_month=="may2021"
(9 real changes made)

. replace calendar_period = 5 if covid_month=="jun2021"
(10 real changes made)

. replace calendar_period = 5 if covid_month=="jul2021"
(8 real changes made)

. replace calendar_period = 5 if covid_month=="aug2021"
(2 real changes made)

. replace calendar_period = 5 if covid_month=="sep2021"
(9 real changes made)

. replace calendar_period = 5 if covid_month=="oct2021"
(6 real changes made)

. replace calendar_period = 5 if covid_month=="nov2021"
(9 real changes made)

. replace calendar_period = 6 if covid_month=="dec2021"
(10 real changes made)

. replace calendar_period = 6 if covid_month=="jan2022"
(11 real changes made)

. label define calendar_period_label      1 "February 2020 to June 2020"       
>    ///
>                                                                         2 "Ju
> ly 2020 to August 2020"            ///
>                                                                         3 "Se
> ptember 2020 to November 2020"     ///
>                                                                         4 "De
> cember 2020 to February 2021"      ///
>                                                                         5 "Ma
> rch 2021 to November 2021"         ///
>                                                                         6 "De
> cember 2021 to January 2022"

. label values calendar_period calendar_period_label

. label var calendar_period "Calendar period"

. 
. **Covariates
. * Age
. recode  age                     min/49.9999=1   ///
>                                                 50/59.9999=2    ///
>                                                 60/69.9999=3    ///
>                                                 70/79.9999=4    ///
>                                                 80/max=5,               ///
>                                                 gen(agegroup) 
(284 differences between age and agegroup)

. 
. label define agegroup   1 "18-<50"              ///
>                                                 2 "50-<60"              ///
>                                                 3 "60-<70"              ///
>                                                 4 "70-<80"              ///
>                                                 5 "80+"

. label values agegroup agegroup

. label var agegroup "Age group"

. 
. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. 
. * Create restricted cubic splines fir age
. mkspline age = age, cubic nknots(4)

. 
. * IMD
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. replace imd = imd + 1
(284 real changes made)

. drop imd_o

. recode imd 5=1 4=2 3=3 2=4 1=5 .=.
(imd: 229 changes made)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" 

. label values imd imd

. label var imd "Index of Multiple Deprivation"

. noi di "DROPPING IF NO IMD" 
DROPPING IF NO IMD

. drop if imd>=.
(0 observations deleted)

. 
. * Smoking
. label define smoking_label 1 "Current/former smoker" 0 "Non-smoker"

. label values smoking smoking_label

. label var smoking "Smoking status"

. 
. * Ethnicity (5 category)
. replace ethnicity = 6 if ethnicity==.
(61 real changes made)

. label define ethnicity_label    1 "White"                                    
>                            ///
>                                                                 2 "Mixed"    
>                                                            ///
>                                                                 3 "Asian or A
> sian British"                              ///
>                                                                 4 "Black"    
>                                                            ///
>                                                                 5 "Other"    
>                                                            ///
>                                                                 6 "Unknown"

. label values ethnicity ethnicity_label

. label var ethnicity "Ethnicity"

. 
. 
. /*  Geographical location  */
. * Region
. rename region region_string

. assert inlist(region_string,                                                 
>            ///
>                                         "East Midlands",                     
>                            ///
>                                         "East",                              
>                                    ///
>                                         "London",                            
>                                    ///
>                                         "North East",                        
>                            ///
>                                         "North West",                        
>                            ///
>                                         "South East",                        
>                            ///
>                                         "South West",                        
>                            ///
>                                         "West Midlands",                     
>                            ///
>                                         "Yorkshire and The Humber") 

. * Nine regions
. gen     region_9 = 1 if region_string=="East Midlands"
(253 missing values generated)

. replace region_9 = 2 if region_string=="East"
(28 real changes made)

. replace region_9 = 3 if region_string=="London"
(60 real changes made)

. replace region_9 = 4 if region_string=="North East"
(24 real changes made)

. replace region_9 = 5 if region_string=="North West"
(25 real changes made)

. replace region_9 = 6 if region_string=="South East"
(31 real changes made)

. replace region_9 = 7 if region_string=="South West"
(25 real changes made)

. replace region_9 = 8 if region_string=="West Midlands"
(34 real changes made)

. replace region_9 = 9 if region_string=="Yorkshire and The Humber"
(26 real changes made)

. 
. label define region_9   1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber"

. label values region_9 region_9

. label var region_9 "Region of England (9 regions)"

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(274 missing values generated)

. replace stp = sum(stp)
(283 real changes made)

. drop stp_old

. 
. * Baseline eGFR groups
. egen baseline_egfr_cat = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 10
> 5, 5000)
(126 missing values generated)

. recode baseline_egfr_cat 0=1 15=2 30=3 45=4 60=5 75=6 90=7 105=8
(baseline_egfr_cat: 158 changes made)

. label define egfr_group 1 "<15" 2 "15-29" 3 "30-44" 4 "45-59" 5 "60-74" 6 "75
> -89" 7 "90-104" 8 "â‰¥105"

. label values baseline_egfr_cat egfr_group

. label var baseline_egfr_cat "Baseline eGFR"

. * NB - only baseline eGFR >15 should be included
. 
. * Baseline CKD stage
. gen ckd_stage = baseline_egfr_cat
(126 missing values generated)

. recode ckd_stage 6/8=5 .=6
(ckd_stage: 224 changes made)

. label define ckd_stage 1 "CKD 5" 2 "CKD 4" 3 "CKD 3B" 4 "CKD 3A" 5 "No CKD" 6
>  "No eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "CKD stage"

. 
. 
. /*  Body Mass Index  */
. * BMI (NB: watch for missingness)
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(26 real changes made, 26 to missing)

. gen     bmicat = .
(284 missing values generated)

. recode  bmicat . = 1 if body_mass_index<18.5
(bmicat: 16 changes made)

. recode  bmicat . = 2 if body_mass_index<25
(bmicat: 74 changes made)

. recode  bmicat . = 3 if body_mass_index<30
(bmicat: 67 changes made)

. recode  bmicat . = 4 if body_mass_index<35
(bmicat: 53 changes made)

. recode  bmicat . = 5 if body_mass_index<40
(bmicat: 32 changes made)

. recode  bmicat . = 6 if body_mass_index<.
(bmicat: 16 changes made)

. replace bmicat = . if body_mass_index>=.
(0 real changes made)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    

.                                         
. label values bmicat bmicat

. label var bmicat "BMI category"

. 
. **Outcomes
. * Index date (COVID-19 diagnosis + 28 days)
. gen index_date = covid_date + 28

. format index_date %td

. label var index_date "Index date"

. 
. * Monthly eGFR follow-up
. foreach followup_creatinine_monthly of varlist  followup_creatinine_feb2020 /
> //
>                                                                              
>                    followup_creatinine_mar2020 ///
>                                                                              
>                    followup_creatinine_apr2020 ///
>                                                                              
>                    followup_creatinine_may2020 ///
>                                                                              
>                    followup_creatinine_jun2020 ///
>                                                                              
>                    followup_creatinine_jul2020 ///
>                                                                              
>                    followup_creatinine_aug2020 ///
>                                                                              
>                    followup_creatinine_sep2020 ///
>                                                                              
>                    followup_creatinine_oct2020 ///
>                                                                              
>                    followup_creatinine_nov2020 ///
>                                                                              
>                    followup_creatinine_dec2020 ///
>                                                                              
>                    followup_creatinine_jan2021 ///
>                                                                              
>                    followup_creatinine_feb2021 ///
>                                                                              
>                    followup_creatinine_mar2021 ///
>                                                                              
>                    followup_creatinine_apr2021 ///
>                                                                              
>                    followup_creatinine_may2021 ///
>                                                                              
>                    followup_creatinine_jun2021 ///
>                                                                              
>                    followup_creatinine_jul2021 ///
>                                                                              
>                    followup_creatinine_aug2021 ///
>                                                                              
>                    followup_creatinine_sep2021 ///
>                                                                              
>                    followup_creatinine_oct2021 ///
>                                                                              
>                    followup_creatinine_nov2021 ///
>                                                                              
>                    followup_creatinine_dec2021 ///
>                                                                              
>                    followup_creatinine_jan2022 {
  2. replace `followup_creatinine_monthly' = . if !inrange(`followup_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`followup_creatinine_monthly' = `followup_creatinine_monthly'/88.
> 4
  4. gen min_`followup_creatinine_monthly'=.
  5. replace min_`followup_creatinine_monthly' = mgdl_`followup_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`followup_creatinine_monthly' = mgdl_`followup_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`followup_creatinine_monthly' = min_`followup_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`followup_creatinine_monthly' = min_`followup_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`followup_creatinine_monthly' = 1 if min_`followup_creatinine_
> monthly'<1
 10. gen max_`followup_creatinine_monthly'=.
 11. replace max_`followup_creatinine_monthly' = mgdl_`followup_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`followup_creatinine_monthly' = mgdl_`followup_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`followup_creatinine_monthly' = max_`followup_creatinine_month
> ly'^-1.209
 14. replace max_`followup_creatinine_monthly' = 1 if max_`followup_creatinine_
> monthly'>1
 15. gen egfr_`followup_creatinine_monthly' = min_`followup_creatinine_monthly'
> *max_`followup_creatinine_monthly'*141
 16. replace egfr_`followup_creatinine_monthly' = egfr_`followup_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`followup_creatinine_monthly' = egfr_`followup_creatinine_mon
> thly'*1.018 if male==0
 18. drop `followup_creatinine_monthly'
 19. drop mgdl_`followup_creatinine_monthly'
 20. drop min_`followup_creatinine_monthly'
 21. drop max_`followup_creatinine_monthly'
 22. }
(128 real changes made, 128 to missing)
(128 missing values generated)
(284 missing values generated)
(83 real changes made)
(73 real changes made)
(83 real changes made)
(73 real changes made)
(90 real changes made)
(284 missing values generated)
(83 real changes made)
(73 real changes made)
(156 real changes made)
(194 real changes made)
(128 missing values generated)
(156 real changes made)
(83 real changes made)
(130 real changes made, 130 to missing)
(130 missing values generated)
(284 missing values generated)
(73 real changes made)
(81 real changes made)
(73 real changes made)
(81 real changes made)
(99 real changes made)
(284 missing values generated)
(73 real changes made)
(81 real changes made)
(154 real changes made)
(185 real changes made)
(130 missing values generated)
(154 real changes made)
(73 real changes made)
(118 real changes made, 118 to missing)
(118 missing values generated)
(284 missing values generated)
(81 real changes made)
(85 real changes made)
(81 real changes made)
(85 real changes made)
(93 real changes made)
(284 missing values generated)
(81 real changes made)
(85 real changes made)
(166 real changes made)
(191 real changes made)
(118 missing values generated)
(166 real changes made)
(81 real changes made)
(149 real changes made, 149 to missing)
(149 missing values generated)
(284 missing values generated)
(70 real changes made)
(65 real changes made)
(70 real changes made)
(65 real changes made)
(83 real changes made)
(284 missing values generated)
(70 real changes made)
(65 real changes made)
(135 real changes made)
(201 real changes made)
(149 missing values generated)
(135 real changes made)
(70 real changes made)
(128 real changes made, 128 to missing)
(128 missing values generated)
(284 missing values generated)
(82 real changes made)
(74 real changes made)
(82 real changes made)
(74 real changes made)
(94 real changes made)
(284 missing values generated)
(82 real changes made)
(74 real changes made)
(156 real changes made)
(190 real changes made)
(128 missing values generated)
(156 real changes made)
(82 real changes made)
(127 real changes made, 127 to missing)
(127 missing values generated)
(284 missing values generated)
(81 real changes made)
(76 real changes made)
(81 real changes made)
(76 real changes made)
(94 real changes made)
(284 missing values generated)
(81 real changes made)
(76 real changes made)
(157 real changes made)
(190 real changes made)
(127 missing values generated)
(157 real changes made)
(81 real changes made)
(133 real changes made, 133 to missing)
(133 missing values generated)
(284 missing values generated)
(81 real changes made)
(70 real changes made)
(81 real changes made)
(70 real changes made)
(97 real changes made)
(284 missing values generated)
(81 real changes made)
(70 real changes made)
(151 real changes made)
(187 real changes made)
(133 missing values generated)
(151 real changes made)
(81 real changes made)
(123 real changes made, 123 to missing)
(123 missing values generated)
(284 missing values generated)
(86 real changes made)
(75 real changes made)
(86 real changes made)
(75 real changes made)
(106 real changes made)
(284 missing values generated)
(86 real changes made)
(75 real changes made)
(161 real changes made)
(178 real changes made)
(123 missing values generated)
(161 real changes made)
(86 real changes made)
(119 real changes made, 119 to missing)
(119 missing values generated)
(284 missing values generated)
(84 real changes made)
(81 real changes made)
(84 real changes made)
(81 real changes made)
(112 real changes made)
(284 missing values generated)
(84 real changes made)
(81 real changes made)
(165 real changes made)
(172 real changes made)
(119 missing values generated)
(165 real changes made)
(84 real changes made)
(118 real changes made, 118 to missing)
(118 missing values generated)
(284 missing values generated)
(86 real changes made)
(80 real changes made)
(86 real changes made)
(80 real changes made)
(114 real changes made)
(284 missing values generated)
(86 real changes made)
(80 real changes made)
(166 real changes made)
(170 real changes made)
(118 missing values generated)
(166 real changes made)
(86 real changes made)
(111 real changes made, 111 to missing)
(111 missing values generated)
(284 missing values generated)
(88 real changes made)
(85 real changes made)
(88 real changes made)
(85 real changes made)
(114 real changes made)
(284 missing values generated)
(88 real changes made)
(85 real changes made)
(173 real changes made)
(170 real changes made)
(111 missing values generated)
(173 real changes made)
(88 real changes made)
(120 real changes made, 120 to missing)
(120 missing values generated)
(284 missing values generated)
(87 real changes made)
(77 real changes made)
(87 real changes made)
(77 real changes made)
(101 real changes made)
(284 missing values generated)
(87 real changes made)
(77 real changes made)
(164 real changes made)
(183 real changes made)
(120 missing values generated)
(164 real changes made)
(87 real changes made)
(137 real changes made, 137 to missing)
(137 missing values generated)
(284 missing values generated)
(86 real changes made)
(61 real changes made)
(86 real changes made)
(61 real changes made)
(102 real changes made)
(284 missing values generated)
(86 real changes made)
(61 real changes made)
(147 real changes made)
(182 real changes made)
(137 missing values generated)
(147 real changes made)
(86 real changes made)
(117 real changes made, 117 to missing)
(117 missing values generated)
(284 missing values generated)
(82 real changes made)
(85 real changes made)
(82 real changes made)
(85 real changes made)
(107 real changes made)
(284 missing values generated)
(82 real changes made)
(85 real changes made)
(167 real changes made)
(177 real changes made)
(117 missing values generated)
(167 real changes made)
(82 real changes made)
(121 real changes made, 121 to missing)
(121 missing values generated)
(284 missing values generated)
(87 real changes made)
(76 real changes made)
(87 real changes made)
(76 real changes made)
(106 real changes made)
(284 missing values generated)
(87 real changes made)
(76 real changes made)
(163 real changes made)
(178 real changes made)
(121 missing values generated)
(163 real changes made)
(87 real changes made)
(123 real changes made, 123 to missing)
(123 missing values generated)
(284 missing values generated)
(90 real changes made)
(71 real changes made)
(90 real changes made)
(71 real changes made)
(106 real changes made)
(284 missing values generated)
(90 real changes made)
(71 real changes made)
(161 real changes made)
(178 real changes made)
(123 missing values generated)
(161 real changes made)
(90 real changes made)
(121 real changes made, 121 to missing)
(121 missing values generated)
(284 missing values generated)
(79 real changes made)
(84 real changes made)
(79 real changes made)
(84 real changes made)
(93 real changes made)
(284 missing values generated)
(79 real changes made)
(84 real changes made)
(163 real changes made)
(191 real changes made)
(121 missing values generated)
(163 real changes made)
(79 real changes made)
(139 real changes made, 139 to missing)
(139 missing values generated)
(284 missing values generated)
(65 real changes made)
(80 real changes made)
(65 real changes made)
(80 real changes made)
(82 real changes made)
(284 missing values generated)
(65 real changes made)
(80 real changes made)
(145 real changes made)
(202 real changes made)
(139 missing values generated)
(145 real changes made)
(65 real changes made)
(130 real changes made, 130 to missing)
(130 missing values generated)
(284 missing values generated)
(79 real changes made)
(75 real changes made)
(79 real changes made)
(75 real changes made)
(101 real changes made)
(284 missing values generated)
(79 real changes made)
(75 real changes made)
(154 real changes made)
(183 real changes made)
(130 missing values generated)
(154 real changes made)
(79 real changes made)
(130 real changes made, 130 to missing)
(130 missing values generated)
(284 missing values generated)
(85 real changes made)
(69 real changes made)
(85 real changes made)
(69 real changes made)
(101 real changes made)
(284 missing values generated)
(85 real changes made)
(69 real changes made)
(154 real changes made)
(183 real changes made)
(130 missing values generated)
(154 real changes made)
(85 real changes made)
(132 real changes made, 132 to missing)
(132 missing values generated)
(284 missing values generated)
(81 real changes made)
(71 real changes made)
(81 real changes made)
(71 real changes made)
(96 real changes made)
(284 missing values generated)
(81 real changes made)
(71 real changes made)
(152 real changes made)
(188 real changes made)
(132 missing values generated)
(152 real changes made)
(81 real changes made)
(135 real changes made, 135 to missing)
(135 missing values generated)
(284 missing values generated)
(85 real changes made)
(64 real changes made)
(85 real changes made)
(64 real changes made)
(104 real changes made)
(284 missing values generated)
(85 real changes made)
(64 real changes made)
(149 real changes made)
(180 real changes made)
(135 missing values generated)
(149 real changes made)
(85 real changes made)
(123 real changes made, 123 to missing)
(123 missing values generated)
(284 missing values generated)
(83 real changes made)
(78 real changes made)
(83 real changes made)
(78 real changes made)
(102 real changes made)
(284 missing values generated)
(83 real changes made)
(78 real changes made)
(161 real changes made)
(182 real changes made)
(123 missing values generated)
(161 real changes made)
(83 real changes made)
(125 real changes made, 125 to missing)
(125 missing values generated)
(284 missing values generated)
(84 real changes made)
(75 real changes made)
(84 real changes made)
(75 real changes made)
(108 real changes made)
(284 missing values generated)
(84 real changes made)
(75 real changes made)
(159 real changes made)
(176 real changes made)
(125 missing values generated)
(159 real changes made)
(84 real changes made)

. 
. * eGFR <15 (earliest month)
. gen egfr_below15_outcome_date=.
(284 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"

. foreach x of  local month_year  {
  2.   replace egfr_below15_outcome_date=date("15`x'", "DMY") if egfr_below15_o
> utcome_date==.& egfr_followup_creatinine_`x'<15 & date("01`x'", "DMY")>=index
> _date
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr_below15_outcome_date %td

. 
. * ESRD date
. gen esrd_date = egfr_below15_outcome_date
(284 missing values generated)

. format esrd_date %td

. gen krt_outcome = date(krt_outcome_date, "YMD")
(246 missing values generated)

. replace esrd_date = krt_outcome if esrd_date==.
(38 real changes made)

. 
. * Exit date
. gen death_date = date(death_date_gp, "YMD")
(260 missing values generated)

. format death_date %td

. drop death_date_gp

. gen exit_date = esrd_date
(246 missing values generated)

. format exit_date %td

. gen deregistered_date = date(deregistered, "YMD")
(274 missing values generated)

. format deregistered_date %td

. drop deregistered

. gen deregistered_days = (deregistered_date - index_date)
(274 missing values generated)

. drop if deregistered_days<0
(8 observations deleted)

. gen end_date = date("2022-01-31", "YMD")

. format end_date %td

. replace exit_date = min(deregistered_date, death_date, end_date) if esrd_date
> ==.
(239 real changes made)

. gen follow_up_time = (exit_date - index_date)

. label var follow_up_time "Follow-up time (Days)"

. 
. * 50% reduction in eGFR (earliest month) (or ESRD)
. gen egfr_reduction50_outcome_date=.
(276 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"

. foreach x of  local month_year  {
  2.   replace egfr_reduction50_outcome_date=date("15`x'", "DMY") if baseline_e
> gfr!=. & egfr_reduction50_outcome_date==.& egfr_followup_creatinine_`x'<0.5*b
> aseline_egfr & date("01`x'", "DMY")>=index_date
  3.   format egfr_reduction50_outcome_date %td
  4. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(3 real changes made)
(2 real changes made)
(2 real changes made)
(4 real changes made)
(2 real changes made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(4 real changes made)
(3 real changes made)
(4 real changes made)
(6 real changes made)
(2 real changes made)
(5 real changes made)
(5 real changes made)
(2 real changes made)
(4 real changes made)

. replace egfr_reduction50_outcome_date=esrd_date if egfr_reduction50_outcome_d
> ate==.
(27 real changes made)

. 
. * Index date (50% reduction in eGFR)
. gen index_date_egfr_reduction = index_date

. replace index_date_egfr_reduction =. if baseline_egfr==.
(124 real changes made, 124 to missing)

. 
. * Exit date (50% reduction in eGFR)
. gen exit_date_egfr_reduction = egfr_reduction50_outcome_date
(191 missing values generated)

. format exit_date_egfr_reduction %td

. replace exit_date_egfr_reduction = min(deregistered_date,death_date,end_date)
>   if egfr_reduction50_outcome_date==.
(191 real changes made)

. gen follow_up_time_egfr_outcome = (exit_date_egfr_reduction - index_date)

. label var follow_up_time_egfr_outcome "Follow-up time (50% eGFR reduction) (D
> ays)"

. 
. * AKI date
. gen aki_outcome_date = date(acute_kidney_injury_outcome, "YMD")
(244 missing values generated)

. format aki_outcome_date %td

. 
. * Exit date (AKI)
. gen exit_date_aki = aki_outcome_date
(244 missing values generated)

. format exit_date_aki %td

. replace exit_date_aki = min(deregistered_date,esrd_date,death_date,end_date) 
>  if aki_outcome_date==.
(244 real changes made)

. gen follow_up_time_aki = (exit_date_aki - index_date)

. label var follow_up_time_aki "Follow-up time (AKI) (Days)"

. 
. * Exit date (death)
. gen exit_date_death = death_date
(253 missing values generated)

. format exit_date_death %td

. replace exit_date_death = min(deregistered_date,end_date)  if death_date==.
(253 real changes made)

. gen follow_up_time_death = (exit_date_death - index_date)

. label var follow_up_time_death "Follow-up time (death) (Days)"

.         
. save ./output/covid_england.dta, replace 
(note: file ./output/covid_england.dta not found)
file ./output/covid_england.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_england.log
  log type:  text
 closed on:  11 Jul 2022, 21:14:02
-------------------------------------------------------------------------------
