------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/covid_matching.log
  log type:  text
 opened on:  11 Oct 2022, 23:07:59

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames(1) case(preserve) 
(encoding automatically selected: ISO-8859-9)
(46 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,639 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosis
. drop if has_follow_up==0
(1,959 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,855 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,769 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,634 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb2020, 20, 3000)
(14,093 real changes made, 14,093 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,093 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,144 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.7 if male==0
(9,213 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.9 if male==1
(8,838 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.329  if male==0
(9,213 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.411  if male==1
(8,838 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb2020<1
(11,442 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,144 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.7 if male==0
(9,213 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.9 if male==1
(8,838 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.209
(18,051 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb2020>1
(20,702 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_baseline_creatinine_feb2020*141
(14,093 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(0.993^age)
(18,051 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1.018 if male==0
(9,213 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine updated monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(17,788 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(17,788 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(6,325 real changes made, 6,325 to missing)
(6,325 missing values generated)
(14,356 missing values generated)
(4,140 real changes made)
(3,891 real changes made)
(4,140 real changes made)
(3,891 real changes made)
(5,077 real changes made)
(14,356 missing values generated)
(4,140 real changes made)
(3,891 real changes made)
(8,031 real changes made)
(9,279 real changes made)
(6,325 missing values generated)
(8,031 real changes made)
(4,140 real changes made)
(6,300 real changes made, 6,300 to missing)
(6,300 missing values generated)
(14,356 missing values generated)
(4,126 real changes made)
(3,930 real changes made)
(4,126 real changes made)
(3,930 real changes made)
(5,142 real changes made)
(14,356 missing values generated)
(4,126 real changes made)
(3,930 real changes made)
(8,056 real changes made)
(9,214 real changes made)
(6,300 missing values generated)
(8,056 real changes made)
(4,126 real changes made)
(6,372 real changes made, 6,372 to missing)
(6,372 missing values generated)
(14,356 missing values generated)
(4,113 real changes made)
(3,871 real changes made)
(4,113 real changes made)
(3,871 real changes made)
(5,072 real changes made)
(14,356 missing values generated)
(4,113 real changes made)
(3,871 real changes made)
(7,984 real changes made)
(9,284 real changes made)
(6,372 missing values generated)
(7,984 real changes made)
(4,113 real changes made)
(6,286 real changes made, 6,286 to missing)
(6,286 missing values generated)
(14,356 missing values generated)
(4,157 real changes made)
(3,913 real changes made)
(4,157 real changes made)
(3,913 real changes made)
(5,161 real changes made)
(14,356 missing values generated)
(4,157 real changes made)
(3,913 real changes made)
(8,070 real changes made)
(9,195 real changes made)
(6,286 missing values generated)
(8,070 real changes made)
(4,157 real changes made)
(6,305 real changes made, 6,305 to missing)
(6,305 missing values generated)
(14,356 missing values generated)
(4,156 real changes made)
(3,895 real changes made)
(4,156 real changes made)
(3,895 real changes made)
(5,030 real changes made)
(14,356 missing values generated)
(4,156 real changes made)
(3,895 real changes made)
(8,051 real changes made)
(9,326 real changes made)
(6,305 missing values generated)
(8,051 real changes made)
(4,156 real changes made)
(6,291 real changes made, 6,291 to missing)
(6,291 missing values generated)
(14,356 missing values generated)
(4,157 real changes made)
(3,908 real changes made)
(4,157 real changes made)
(3,908 real changes made)
(5,143 real changes made)
(14,356 missing values generated)
(4,157 real changes made)
(3,908 real changes made)
(8,065 real changes made)
(9,213 real changes made)
(6,291 missing values generated)
(8,065 real changes made)
(4,157 real changes made)
(6,369 real changes made, 6,369 to missing)
(6,369 missing values generated)
(14,356 missing values generated)
(4,106 real changes made)
(3,881 real changes made)
(4,106 real changes made)
(3,881 real changes made)
(5,120 real changes made)
(14,356 missing values generated)
(4,106 real changes made)
(3,881 real changes made)
(7,987 real changes made)
(9,236 real changes made)
(6,369 missing values generated)
(7,987 real changes made)
(4,106 real changes made)
(6,365 real changes made, 6,365 to missing)
(6,365 missing values generated)
(14,356 missing values generated)
(4,165 real changes made)
(3,826 real changes made)
(4,165 real changes made)
(3,826 real changes made)
(5,029 real changes made)
(14,356 missing values generated)
(4,165 real changes made)
(3,826 real changes made)
(7,991 real changes made)
(9,327 real changes made)
(6,365 missing values generated)
(7,991 real changes made)
(4,165 real changes made)
(6,332 real changes made, 6,332 to missing)
(6,332 missing values generated)
(14,356 missing values generated)
(4,135 real changes made)
(3,889 real changes made)
(4,135 real changes made)
(3,889 real changes made)
(5,102 real changes made)
(14,356 missing values generated)
(4,135 real changes made)
(3,889 real changes made)
(8,024 real changes made)
(9,254 real changes made)
(6,332 missing values generated)
(8,024 real changes made)
(4,135 real changes made)
(6,324 real changes made, 6,324 to missing)
(6,324 missing values generated)
(14,356 missing values generated)
(4,152 real changes made)
(3,880 real changes made)
(4,152 real changes made)
(3,880 real changes made)
(5,126 real changes made)
(14,356 missing values generated)
(4,152 real changes made)
(3,880 real changes made)
(8,032 real changes made)
(9,230 real changes made)
(6,324 missing values generated)
(8,032 real changes made)
(4,152 real changes made)
(6,255 real changes made, 6,255 to missing)
(6,255 missing values generated)
(14,356 missing values generated)
(4,195 real changes made)
(3,906 real changes made)
(4,195 real changes made)
(3,906 real changes made)
(5,127 real changes made)
(14,356 missing values generated)
(4,195 real changes made)
(3,906 real changes made)
(8,101 real changes made)
(9,229 real changes made)
(6,255 missing values generated)
(8,101 real changes made)
(4,195 real changes made)
(6,256 real changes made, 6,256 to missing)
(6,256 missing values generated)
(14,356 missing values generated)
(4,157 real changes made)
(3,943 real changes made)
(4,157 real changes made)
(3,943 real changes made)
(5,128 real changes made)
(14,356 missing values generated)
(4,157 real changes made)
(3,943 real changes made)
(8,100 real changes made)
(9,228 real changes made)
(6,256 missing values generated)
(8,100 real changes made)
(4,157 real changes made)
(6,374 real changes made, 6,374 to missing)
(6,374 missing values generated)
(14,356 missing values generated)
(4,094 real changes made)
(3,888 real changes made)
(4,094 real changes made)
(3,888 real changes made)
(5,042 real changes made)
(14,356 missing values generated)
(4,094 real changes made)
(3,888 real changes made)
(7,982 real changes made)
(9,314 real changes made)
(6,374 missing values generated)
(7,982 real changes made)
(4,094 real changes made)
(6,311 real changes made, 6,311 to missing)
(6,311 missing values generated)
(14,356 missing values generated)
(4,132 real changes made)
(3,913 real changes made)
(4,132 real changes made)
(3,913 real changes made)
(5,106 real changes made)
(14,356 missing values generated)
(4,132 real changes made)
(3,913 real changes made)
(8,045 real changes made)
(9,250 real changes made)
(6,311 missing values generated)
(8,045 real changes made)
(4,132 real changes made)
(6,266 real changes made, 6,266 to missing)
(6,266 missing values generated)
(14,356 missing values generated)
(4,202 real changes made)
(3,888 real changes made)
(4,202 real changes made)
(3,888 real changes made)
(5,179 real changes made)
(14,356 missing values generated)
(4,202 real changes made)
(3,888 real changes made)
(8,090 real changes made)
(9,177 real changes made)
(6,266 missing values generated)
(8,090 real changes made)
(4,202 real changes made)
(6,272 real changes made, 6,272 to missing)
(6,272 missing values generated)
(14,356 missing values generated)
(4,158 real changes made)
(3,926 real changes made)
(4,158 real changes made)
(3,926 real changes made)
(5,080 real changes made)
(14,356 missing values generated)
(4,158 real changes made)
(3,926 real changes made)
(8,084 real changes made)
(9,276 real changes made)
(6,272 missing values generated)
(8,084 real changes made)
(4,158 real changes made)
(6,321 real changes made, 6,321 to missing)
(6,321 missing values generated)
(14,356 missing values generated)
(4,109 real changes made)
(3,926 real changes made)
(4,109 real changes made)
(3,926 real changes made)
(5,065 real changes made)
(14,356 missing values generated)
(4,109 real changes made)
(3,926 real changes made)
(8,035 real changes made)
(9,291 real changes made)
(6,321 missing values generated)
(8,035 real changes made)
(4,109 real changes made)
(6,333 real changes made, 6,333 to missing)
(6,333 missing values generated)
(14,356 missing values generated)
(4,144 real changes made)
(3,879 real changes made)
(4,144 real changes made)
(3,879 real changes made)
(5,116 real changes made)
(14,356 missing values generated)
(4,144 real changes made)
(3,879 real changes made)
(8,023 real changes made)
(9,240 real changes made)
(6,333 missing values generated)
(8,023 real changes made)
(4,144 real changes made)
(6,269 real changes made, 6,269 to missing)
(6,269 missing values generated)
(14,356 missing values generated)
(4,138 real changes made)
(3,949 real changes made)
(4,138 real changes made)
(3,949 real changes made)
(5,105 real changes made)
(14,356 missing values generated)
(4,138 real changes made)
(3,949 real changes made)
(8,087 real changes made)
(9,251 real changes made)
(6,269 missing values generated)
(8,087 real changes made)
(4,138 real changes made)
(6,284 real changes made, 6,284 to missing)
(6,284 missing values generated)
(14,356 missing values generated)
(4,161 real changes made)
(3,911 real changes made)
(4,161 real changes made)
(3,911 real changes made)
(5,098 real changes made)
(14,356 missing values generated)
(4,161 real changes made)
(3,911 real changes made)
(8,072 real changes made)
(9,258 real changes made)
(6,284 missing values generated)
(8,072 real changes made)
(4,161 real changes made)
(6,359 real changes made, 6,359 to missing)
(6,359 missing values generated)
(14,356 missing values generated)
(4,133 real changes made)
(3,864 real changes made)
(4,133 real changes made)
(3,864 real changes made)
(5,097 real changes made)
(14,356 missing values generated)
(4,133 real changes made)
(3,864 real changes made)
(7,997 real changes made)
(9,259 real changes made)
(6,359 missing values generated)
(7,997 real changes made)
(4,133 real changes made)
(6,339 real changes made, 6,339 to missing)
(6,339 missing values generated)
(14,356 missing values generated)
(4,166 real changes made)
(3,851 real changes made)
(4,166 real changes made)
(3,851 real changes made)
(5,115 real changes made)
(14,356 missing values generated)
(4,166 real changes made)
(3,851 real changes made)
(8,017 real changes made)
(9,241 real changes made)
(6,339 missing values generated)
(8,017 real changes made)
(4,166 real changes made)
(6,403 real changes made, 6,403 to missing)
(6,403 missing values generated)
(14,356 missing values generated)
(4,049 real changes made)
(3,904 real changes made)
(4,049 real changes made)
(3,904 real changes made)
(5,047 real changes made)
(14,356 missing values generated)
(4,049 real changes made)
(3,904 real changes made)
(7,953 real changes made)
(9,309 real changes made)
(6,403 missing values generated)
(7,953 real changes made)
(4,049 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(14,356 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. drop if baseline_egfr <15
  4. drop egfr_baseline_creatinine_`x'
  5. }
(379 real changes made)
(0 observations deleted)
(424 real changes made)
(0 observations deleted)
(373 real changes made)
(0 observations deleted)
(392 real changes made)
(0 observations deleted)
(358 real changes made)
(0 observations deleted)
(339 real changes made)
(0 observations deleted)
(396 real changes made)
(0 observations deleted)
(364 real changes made)
(0 observations deleted)
(330 real changes made)
(0 observations deleted)
(345 real changes made)
(0 observations deleted)
(356 real changes made)
(0 observations deleted)
(343 real changes made)
(0 observations deleted)
(297 real changes made)
(0 observations deleted)
(377 real changes made)
(0 observations deleted)
(322 real changes made)
(0 observations deleted)
(334 real changes made)
(0 observations deleted)
(305 real changes made)
(0 observations deleted)
(319 real changes made)
(0 observations deleted)
(316 real changes made)
(0 observations deleted)
(300 real changes made)
(0 observations deleted)
(314 real changes made)
(0 observations deleted)
(314 real changes made)
(0 observations deleted)
(295 real changes made)
(0 observations deleted)
(283 real changes made)
(0 observations deleted)

. drop baseline_egfr

. drop covid_month

. drop covid_date_string

. drop age

. 
. * COVID-19 death
. drop if deceased==1
(1,471 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. replace imd = imd + 1
(12,885 real changes made)

. drop imd_o

. recode imd 5=1 4=2 3=3 2=4 1=5 .=.
(10407 changes made to imd)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" 

. label values imd imd

. label var imd "Index of Multiple Deprivation"

. noi di "DROPPING IF NO IMD" 
DROPPING IF NO IMD

. drop if imd>=.
(0 observations deleted)

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. export delimited using "./output/covid_matching.csv", replace
file ./output/covid_matching.csv saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/covid_matching.log
  log type:  text
 closed on:  11 Oct 2022, 23:08:01
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
