-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_matching.log
  log type:  text
 opened on:  15 Sep 2022, 00:41:50

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames
> (1) case(preserve) 
(40 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,737 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,980 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,885 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,762 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,669 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,077 real changes made, 14,077 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,077 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(31,967 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,250 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,640 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,250 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,640 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,300 real changes made)

. gen max_baseline_creatinine_feb2020=.
(31,967 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,250 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,640 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(17,890 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,667 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,077 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(17,890 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,250 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(17,501 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(17,501 observations deleted)

. drop covid_diagnosis_date

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(6,356 real changes made, 6,356 to missing)
(6,356 missing values generated)
(14,466 missing values generated)
(4,221 real changes made)
(3,889 real changes made)
(4,221 real changes made)
(3,889 real changes made)
(5,116 real changes made)
(14,466 missing values generated)
(4,221 real changes made)
(3,889 real changes made)
(8,110 real changes made)
(9,350 real changes made)
(6,356 missing values generated)
(8,110 real changes made)
(4,221 real changes made)
(6,418 real changes made, 6,418 to missing)
(6,418 missing values generated)
(14,466 missing values generated)
(4,139 real changes made)
(3,909 real changes made)
(4,139 real changes made)
(3,909 real changes made)
(5,114 real changes made)
(14,466 missing values generated)
(4,139 real changes made)
(3,909 real changes made)
(8,048 real changes made)
(9,352 real changes made)
(6,418 missing values generated)
(8,048 real changes made)
(4,139 real changes made)
(6,381 real changes made, 6,381 to missing)
(6,381 missing values generated)
(14,466 missing values generated)
(4,167 real changes made)
(3,918 real changes made)
(4,167 real changes made)
(3,918 real changes made)
(5,046 real changes made)
(14,466 missing values generated)
(4,167 real changes made)
(3,918 real changes made)
(8,085 real changes made)
(9,420 real changes made)
(6,381 missing values generated)
(8,085 real changes made)
(4,167 real changes made)
(6,390 real changes made, 6,390 to missing)
(6,390 missing values generated)
(14,466 missing values generated)
(4,183 real changes made)
(3,893 real changes made)
(4,183 real changes made)
(3,893 real changes made)
(5,147 real changes made)
(14,466 missing values generated)
(4,183 real changes made)
(3,893 real changes made)
(8,076 real changes made)
(9,319 real changes made)
(6,390 missing values generated)
(8,076 real changes made)
(4,183 real changes made)
(6,447 real changes made, 6,447 to missing)
(6,447 missing values generated)
(14,466 missing values generated)
(4,167 real changes made)
(3,852 real changes made)
(4,167 real changes made)
(3,852 real changes made)
(5,096 real changes made)
(14,466 missing values generated)
(4,167 real changes made)
(3,852 real changes made)
(8,019 real changes made)
(9,370 real changes made)
(6,447 missing values generated)
(8,019 real changes made)
(4,167 real changes made)
(6,321 real changes made, 6,321 to missing)
(6,321 missing values generated)
(14,466 missing values generated)
(4,168 real changes made)
(3,977 real changes made)
(4,168 real changes made)
(3,977 real changes made)
(5,145 real changes made)
(14,466 missing values generated)
(4,168 real changes made)
(3,977 real changes made)
(8,145 real changes made)
(9,321 real changes made)
(6,321 missing values generated)
(8,145 real changes made)
(4,168 real changes made)
(6,400 real changes made, 6,400 to missing)
(6,400 missing values generated)
(14,466 missing values generated)
(4,146 real changes made)
(3,920 real changes made)
(4,146 real changes made)
(3,920 real changes made)
(5,079 real changes made)
(14,466 missing values generated)
(4,146 real changes made)
(3,920 real changes made)
(8,066 real changes made)
(9,387 real changes made)
(6,400 missing values generated)
(8,066 real changes made)
(4,146 real changes made)
(6,432 real changes made, 6,432 to missing)
(6,432 missing values generated)
(14,466 missing values generated)
(4,111 real changes made)
(3,923 real changes made)
(4,111 real changes made)
(3,923 real changes made)
(5,075 real changes made)
(14,466 missing values generated)
(4,111 real changes made)
(3,923 real changes made)
(8,034 real changes made)
(9,391 real changes made)
(6,432 missing values generated)
(8,034 real changes made)
(4,111 real changes made)
(6,443 real changes made, 6,443 to missing)
(6,443 missing values generated)
(14,466 missing values generated)
(4,132 real changes made)
(3,891 real changes made)
(4,132 real changes made)
(3,891 real changes made)
(5,070 real changes made)
(14,466 missing values generated)
(4,132 real changes made)
(3,891 real changes made)
(8,023 real changes made)
(9,396 real changes made)
(6,443 missing values generated)
(8,023 real changes made)
(4,132 real changes made)
(6,405 real changes made, 6,405 to missing)
(6,405 missing values generated)
(14,466 missing values generated)
(4,166 real changes made)
(3,895 real changes made)
(4,166 real changes made)
(3,895 real changes made)
(5,219 real changes made)
(14,466 missing values generated)
(4,166 real changes made)
(3,895 real changes made)
(8,061 real changes made)
(9,247 real changes made)
(6,405 missing values generated)
(8,061 real changes made)
(4,166 real changes made)
(6,377 real changes made, 6,377 to missing)
(6,377 missing values generated)
(14,466 missing values generated)
(4,159 real changes made)
(3,930 real changes made)
(4,159 real changes made)
(3,930 real changes made)
(5,128 real changes made)
(14,466 missing values generated)
(4,159 real changes made)
(3,930 real changes made)
(8,089 real changes made)
(9,338 real changes made)
(6,377 missing values generated)
(8,089 real changes made)
(4,159 real changes made)
(6,344 real changes made, 6,344 to missing)
(6,344 missing values generated)
(14,466 missing values generated)
(4,196 real changes made)
(3,926 real changes made)
(4,196 real changes made)
(3,926 real changes made)
(5,137 real changes made)
(14,466 missing values generated)
(4,196 real changes made)
(3,926 real changes made)
(8,122 real changes made)
(9,329 real changes made)
(6,344 missing values generated)
(8,122 real changes made)
(4,196 real changes made)
(6,368 real changes made, 6,368 to missing)
(6,368 missing values generated)
(14,466 missing values generated)
(4,191 real changes made)
(3,907 real changes made)
(4,191 real changes made)
(3,907 real changes made)
(5,166 real changes made)
(14,466 missing values generated)
(4,191 real changes made)
(3,907 real changes made)
(8,098 real changes made)
(9,300 real changes made)
(6,368 missing values generated)
(8,098 real changes made)
(4,191 real changes made)
(6,367 real changes made, 6,367 to missing)
(6,367 missing values generated)
(14,466 missing values generated)
(4,211 real changes made)
(3,888 real changes made)
(4,211 real changes made)
(3,888 real changes made)
(5,182 real changes made)
(14,466 missing values generated)
(4,211 real changes made)
(3,888 real changes made)
(8,099 real changes made)
(9,284 real changes made)
(6,367 missing values generated)
(8,099 real changes made)
(4,211 real changes made)
(6,293 real changes made, 6,293 to missing)
(6,293 missing values generated)
(14,466 missing values generated)
(4,220 real changes made)
(3,953 real changes made)
(4,220 real changes made)
(3,953 real changes made)
(5,162 real changes made)
(14,466 missing values generated)
(4,220 real changes made)
(3,953 real changes made)
(8,173 real changes made)
(9,304 real changes made)
(6,293 missing values generated)
(8,173 real changes made)
(4,220 real changes made)
(6,381 real changes made, 6,381 to missing)
(6,381 missing values generated)
(14,466 missing values generated)
(4,249 real changes made)
(3,836 real changes made)
(4,249 real changes made)
(3,836 real changes made)
(5,163 real changes made)
(14,466 missing values generated)
(4,249 real changes made)
(3,836 real changes made)
(8,085 real changes made)
(9,303 real changes made)
(6,381 missing values generated)
(8,085 real changes made)
(4,249 real changes made)
(6,486 real changes made, 6,486 to missing)
(6,486 missing values generated)
(14,466 missing values generated)
(4,105 real changes made)
(3,875 real changes made)
(4,105 real changes made)
(3,875 real changes made)
(5,060 real changes made)
(14,466 missing values generated)
(4,105 real changes made)
(3,875 real changes made)
(7,980 real changes made)
(9,406 real changes made)
(6,486 missing values generated)
(7,980 real changes made)
(4,105 real changes made)
(6,338 real changes made, 6,338 to missing)
(6,338 missing values generated)
(14,466 missing values generated)
(4,160 real changes made)
(3,968 real changes made)
(4,160 real changes made)
(3,968 real changes made)
(5,143 real changes made)
(14,466 missing values generated)
(4,160 real changes made)
(3,968 real changes made)
(8,128 real changes made)
(9,323 real changes made)
(6,338 missing values generated)
(8,128 real changes made)
(4,160 real changes made)
(6,396 real changes made, 6,396 to missing)
(6,396 missing values generated)
(14,466 missing values generated)
(4,183 real changes made)
(3,887 real changes made)
(4,183 real changes made)
(3,887 real changes made)
(5,150 real changes made)
(14,466 missing values generated)
(4,183 real changes made)
(3,887 real changes made)
(8,070 real changes made)
(9,316 real changes made)
(6,396 missing values generated)
(8,070 real changes made)
(4,183 real changes made)
(6,389 real changes made, 6,389 to missing)
(6,389 missing values generated)
(14,466 missing values generated)
(4,164 real changes made)
(3,913 real changes made)
(4,164 real changes made)
(3,913 real changes made)
(5,078 real changes made)
(14,466 missing values generated)
(4,164 real changes made)
(3,913 real changes made)
(8,077 real changes made)
(9,388 real changes made)
(6,389 missing values generated)
(8,077 real changes made)
(4,164 real changes made)
(6,338 real changes made, 6,338 to missing)
(6,338 missing values generated)
(14,466 missing values generated)
(4,172 real changes made)
(3,956 real changes made)
(4,172 real changes made)
(3,956 real changes made)
(5,107 real changes made)
(14,466 missing values generated)
(4,172 real changes made)
(3,956 real changes made)
(8,128 real changes made)
(9,359 real changes made)
(6,338 missing values generated)
(8,128 real changes made)
(4,172 real changes made)
(6,321 real changes made, 6,321 to missing)
(6,321 missing values generated)
(14,466 missing values generated)
(4,166 real changes made)
(3,979 real changes made)
(4,166 real changes made)
(3,979 real changes made)
(5,218 real changes made)
(14,466 missing values generated)
(4,166 real changes made)
(3,979 real changes made)
(8,145 real changes made)
(9,248 real changes made)
(6,321 missing values generated)
(8,145 real changes made)
(4,166 real changes made)
(6,335 real changes made, 6,335 to missing)
(6,335 missing values generated)
(14,466 missing values generated)
(4,193 real changes made)
(3,938 real changes made)
(4,193 real changes made)
(3,938 real changes made)
(5,089 real changes made)
(14,466 missing values generated)
(4,193 real changes made)
(3,938 real changes made)
(8,131 real changes made)
(9,377 real changes made)
(6,335 missing values generated)
(8,131 real changes made)
(4,193 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(14,466 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. drop if baseline_egfr <15
  4. drop egfr_baseline_creatinine_`x'
  5. }
(357 real changes made)
(0 observations deleted)
(406 real changes made)
(0 observations deleted)
(388 real changes made)
(0 observations deleted)
(383 real changes made)
(0 observations deleted)
(362 real changes made)
(0 observations deleted)
(386 real changes made)
(0 observations deleted)
(350 real changes made)
(0 observations deleted)
(362 real changes made)
(0 observations deleted)
(371 real changes made)
(0 observations deleted)
(334 real changes made)
(0 observations deleted)
(340 real changes made)
(0 observations deleted)
(353 real changes made)
(0 observations deleted)
(305 real changes made)
(0 observations deleted)
(343 real changes made)
(0 observations deleted)
(318 real changes made)
(0 observations deleted)
(326 real changes made)
(0 observations deleted)
(314 real changes made)
(0 observations deleted)
(334 real changes made)
(0 observations deleted)
(311 real changes made)
(0 observations deleted)
(300 real changes made)
(0 observations deleted)
(311 real changes made)
(0 observations deleted)
(275 real changes made)
(0 observations deleted)
(285 real changes made)
(0 observations deleted)
(284 real changes made)
(0 observations deleted)

. drop baseline_egfr

. drop covid_month

. drop covid_date_string

. drop age

. 
. * COVID-19 death
. drop if deceased==1
(1,385 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. replace imd = imd + 1
(13,081 real changes made)

. drop imd_o

. recode imd 5=1 4=2 3=3 2=4 1=5 .=.
(imd: 10497 changes made)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" 

. label values imd imd

. label var imd "Index of Multiple Deprivation"

. noi di "DROPPING IF NO IMD" 
DROPPING IF NO IMD

. drop if imd>=.
(0 observations deleted)

. 
. export delimited using "./output/covid_matching.csv", replace
(note: file ./output/covid_matching.csv not found)
file ./output/covid_matching.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_matching.log
  log type:  text
 closed on:  15 Sep 2022, 00:41:52
-------------------------------------------------------------------------------
