-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2017.log
  log type:  text
 opened on:  31 Mar 2023, 20:50:21

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames
> (1) case(preserve) 
(53 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,668 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,959 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,869 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,784 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,671 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,057 real changes made, 14,057 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,057 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,049 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,065 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,927 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,065 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,927 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,377 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,049 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,065 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,927 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(17,992 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,672 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,057 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(17,992 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,065 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(15,790 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(15,790 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///                           
>                                       
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 ///
>                                                                              
>                    baseline_creatinine_oct2022     {                         
>                                                                       
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(7,094 real changes made, 7,094 to missing)
(7,094 missing values generated)
(16,259 missing values generated)
(4,691 real changes made)
(4,474 real changes made)
(4,691 real changes made)
(4,474 real changes made)
(5,842 real changes made)
(16,259 missing values generated)
(4,691 real changes made)
(4,474 real changes made)
(9,165 real changes made)
(10,417 real changes made)
(7,094 missing values generated)
(9,165 real changes made)
(4,691 real changes made)
(7,221 real changes made, 7,221 to missing)
(7,221 missing values generated)
(16,259 missing values generated)
(4,526 real changes made)
(4,512 real changes made)
(4,526 real changes made)
(4,512 real changes made)
(5,700 real changes made)
(16,259 missing values generated)
(4,526 real changes made)
(4,512 real changes made)
(9,038 real changes made)
(10,559 real changes made)
(7,221 missing values generated)
(9,038 real changes made)
(4,526 real changes made)
(7,110 real changes made, 7,110 to missing)
(7,110 missing values generated)
(16,259 missing values generated)
(4,647 real changes made)
(4,502 real changes made)
(4,647 real changes made)
(4,502 real changes made)
(5,840 real changes made)
(16,259 missing values generated)
(4,647 real changes made)
(4,502 real changes made)
(9,149 real changes made)
(10,419 real changes made)
(7,110 missing values generated)
(9,149 real changes made)
(4,647 real changes made)
(7,211 real changes made, 7,211 to missing)
(7,211 missing values generated)
(16,259 missing values generated)
(4,629 real changes made)
(4,419 real changes made)
(4,629 real changes made)
(4,419 real changes made)
(5,757 real changes made)
(16,259 missing values generated)
(4,629 real changes made)
(4,419 real changes made)
(9,048 real changes made)
(10,502 real changes made)
(7,211 missing values generated)
(9,048 real changes made)
(4,629 real changes made)
(7,139 real changes made, 7,139 to missing)
(7,139 missing values generated)
(16,259 missing values generated)
(4,622 real changes made)
(4,498 real changes made)
(4,622 real changes made)
(4,498 real changes made)
(5,839 real changes made)
(16,259 missing values generated)
(4,622 real changes made)
(4,498 real changes made)
(9,120 real changes made)
(10,420 real changes made)
(7,139 missing values generated)
(9,120 real changes made)
(4,622 real changes made)
(7,148 real changes made, 7,148 to missing)
(7,148 missing values generated)
(16,259 missing values generated)
(4,635 real changes made)
(4,476 real changes made)
(4,635 real changes made)
(4,476 real changes made)
(5,747 real changes made)
(16,259 missing values generated)
(4,635 real changes made)
(4,476 real changes made)
(9,111 real changes made)
(10,512 real changes made)
(7,148 missing values generated)
(9,111 real changes made)
(4,635 real changes made)
(7,206 real changes made, 7,206 to missing)
(7,206 missing values generated)
(16,259 missing values generated)
(4,581 real changes made)
(4,472 real changes made)
(4,581 real changes made)
(4,472 real changes made)
(5,761 real changes made)
(16,259 missing values generated)
(4,581 real changes made)
(4,472 real changes made)
(9,053 real changes made)
(10,498 real changes made)
(7,206 missing values generated)
(9,053 real changes made)
(4,581 real changes made)
(7,252 real changes made, 7,252 to missing)
(7,252 missing values generated)
(16,259 missing values generated)
(4,475 real changes made)
(4,532 real changes made)
(4,475 real changes made)
(4,532 real changes made)
(5,642 real changes made)
(16,259 missing values generated)
(4,475 real changes made)
(4,532 real changes made)
(9,007 real changes made)
(10,617 real changes made)
(7,252 missing values generated)
(9,007 real changes made)
(4,475 real changes made)
(7,141 real changes made, 7,141 to missing)
(7,141 missing values generated)
(16,259 missing values generated)
(4,619 real changes made)
(4,499 real changes made)
(4,619 real changes made)
(4,499 real changes made)
(5,726 real changes made)
(16,259 missing values generated)
(4,619 real changes made)
(4,499 real changes made)
(9,118 real changes made)
(10,533 real changes made)
(7,141 missing values generated)
(9,118 real changes made)
(4,619 real changes made)
(7,197 real changes made, 7,197 to missing)
(7,197 missing values generated)
(16,259 missing values generated)
(4,545 real changes made)
(4,517 real changes made)
(4,545 real changes made)
(4,517 real changes made)
(5,686 real changes made)
(16,259 missing values generated)
(4,545 real changes made)
(4,517 real changes made)
(9,062 real changes made)
(10,573 real changes made)
(7,197 missing values generated)
(9,062 real changes made)
(4,545 real changes made)
(7,145 real changes made, 7,145 to missing)
(7,145 missing values generated)
(16,259 missing values generated)
(4,600 real changes made)
(4,514 real changes made)
(4,600 real changes made)
(4,514 real changes made)
(5,725 real changes made)
(16,259 missing values generated)
(4,600 real changes made)
(4,514 real changes made)
(9,114 real changes made)
(10,534 real changes made)
(7,145 missing values generated)
(9,114 real changes made)
(4,600 real changes made)
(7,200 real changes made, 7,200 to missing)
(7,200 missing values generated)
(16,259 missing values generated)
(4,485 real changes made)
(4,574 real changes made)
(4,485 real changes made)
(4,574 real changes made)
(5,697 real changes made)
(16,259 missing values generated)
(4,485 real changes made)
(4,574 real changes made)
(9,059 real changes made)
(10,562 real changes made)
(7,200 missing values generated)
(9,059 real changes made)
(4,485 real changes made)
(7,311 real changes made, 7,311 to missing)
(7,311 missing values generated)
(16,259 missing values generated)
(4,515 real changes made)
(4,433 real changes made)
(4,515 real changes made)
(4,433 real changes made)
(5,664 real changes made)
(16,259 missing values generated)
(4,515 real changes made)
(4,433 real changes made)
(8,948 real changes made)
(10,595 real changes made)
(7,311 missing values generated)
(8,948 real changes made)
(4,515 real changes made)
(7,081 real changes made, 7,081 to missing)
(7,081 missing values generated)
(16,259 missing values generated)
(4,614 real changes made)
(4,564 real changes made)
(4,614 real changes made)
(4,564 real changes made)
(5,889 real changes made)
(16,259 missing values generated)
(4,614 real changes made)
(4,564 real changes made)
(9,178 real changes made)
(10,370 real changes made)
(7,081 missing values generated)
(9,178 real changes made)
(4,614 real changes made)
(7,102 real changes made, 7,102 to missing)
(7,102 missing values generated)
(16,259 missing values generated)
(4,655 real changes made)
(4,502 real changes made)
(4,655 real changes made)
(4,502 real changes made)
(5,847 real changes made)
(16,259 missing values generated)
(4,655 real changes made)
(4,502 real changes made)
(9,157 real changes made)
(10,412 real changes made)
(7,102 missing values generated)
(9,157 real changes made)
(4,655 real changes made)
(7,218 real changes made, 7,218 to missing)
(7,218 missing values generated)
(16,259 missing values generated)
(4,528 real changes made)
(4,513 real changes made)
(4,528 real changes made)
(4,513 real changes made)
(5,720 real changes made)
(16,259 missing values generated)
(4,528 real changes made)
(4,513 real changes made)
(9,041 real changes made)
(10,539 real changes made)
(7,218 missing values generated)
(9,041 real changes made)
(4,528 real changes made)
(7,215 real changes made, 7,215 to missing)
(7,215 missing values generated)
(16,259 missing values generated)
(4,618 real changes made)
(4,426 real changes made)
(4,618 real changes made)
(4,426 real changes made)
(5,681 real changes made)
(16,259 missing values generated)
(4,618 real changes made)
(4,426 real changes made)
(9,044 real changes made)
(10,578 real changes made)
(7,215 missing values generated)
(9,044 real changes made)
(4,618 real changes made)
(7,183 real changes made, 7,183 to missing)
(7,183 missing values generated)
(16,259 missing values generated)
(4,581 real changes made)
(4,495 real changes made)
(4,581 real changes made)
(4,495 real changes made)
(5,753 real changes made)
(16,259 missing values generated)
(4,581 real changes made)
(4,495 real changes made)
(9,076 real changes made)
(10,506 real changes made)
(7,183 missing values generated)
(9,076 real changes made)
(4,581 real changes made)
(7,196 real changes made, 7,196 to missing)
(7,196 missing values generated)
(16,259 missing values generated)
(4,516 real changes made)
(4,547 real changes made)
(4,516 real changes made)
(4,547 real changes made)
(5,730 real changes made)
(16,259 missing values generated)
(4,516 real changes made)
(4,547 real changes made)
(9,063 real changes made)
(10,529 real changes made)
(7,196 missing values generated)
(9,063 real changes made)
(4,516 real changes made)
(7,157 real changes made, 7,157 to missing)
(7,157 missing values generated)
(16,259 missing values generated)
(4,568 real changes made)
(4,534 real changes made)
(4,568 real changes made)
(4,534 real changes made)
(5,758 real changes made)
(16,259 missing values generated)
(4,568 real changes made)
(4,534 real changes made)
(9,102 real changes made)
(10,501 real changes made)
(7,157 missing values generated)
(9,102 real changes made)
(4,568 real changes made)
(7,176 real changes made, 7,176 to missing)
(7,176 missing values generated)
(16,259 missing values generated)
(4,595 real changes made)
(4,488 real changes made)
(4,595 real changes made)
(4,488 real changes made)
(5,761 real changes made)
(16,259 missing values generated)
(4,595 real changes made)
(4,488 real changes made)
(9,083 real changes made)
(10,498 real changes made)
(7,176 missing values generated)
(9,083 real changes made)
(4,595 real changes made)
(7,166 real changes made, 7,166 to missing)
(7,166 missing values generated)
(16,259 missing values generated)
(4,577 real changes made)
(4,516 real changes made)
(4,577 real changes made)
(4,516 real changes made)
(5,758 real changes made)
(16,259 missing values generated)
(4,577 real changes made)
(4,516 real changes made)
(9,093 real changes made)
(10,501 real changes made)
(7,166 missing values generated)
(9,093 real changes made)
(4,577 real changes made)
(7,038 real changes made, 7,038 to missing)
(7,038 missing values generated)
(16,259 missing values generated)
(4,632 real changes made)
(4,589 real changes made)
(4,632 real changes made)
(4,589 real changes made)
(5,871 real changes made)
(16,259 missing values generated)
(4,632 real changes made)
(4,589 real changes made)
(9,221 real changes made)
(10,388 real changes made)
(7,038 missing values generated)
(9,221 real changes made)
(4,632 real changes made)
(7,063 real changes made, 7,063 to missing)
(7,063 missing values generated)
(16,259 missing values generated)
(4,683 real changes made)
(4,513 real changes made)
(4,683 real changes made)
(4,513 real changes made)
(5,873 real changes made)
(16,259 missing values generated)
(4,683 real changes made)
(4,513 real changes made)
(9,196 real changes made)
(10,386 real changes made)
(7,063 missing values generated)
(9,196 real changes made)
(4,683 real changes made)
(7,182 real changes made, 7,182 to missing)
(7,182 missing values generated)
(16,259 missing values generated)
(4,575 real changes made)
(4,502 real changes made)
(4,575 real changes made)
(4,502 real changes made)
(5,736 real changes made)
(16,259 missing values generated)
(4,575 real changes made)
(4,502 real changes made)
(9,077 real changes made)
(10,523 real changes made)
(7,182 missing values generated)
(9,077 real changes made)
(4,575 real changes made)
(7,118 real changes made, 7,118 to missing)
(7,118 missing values generated)
(16,259 missing values generated)
(4,656 real changes made)
(4,485 real changes made)
(4,656 real changes made)
(4,485 real changes made)
(5,816 real changes made)
(16,259 missing values generated)
(4,656 real changes made)
(4,485 real changes made)
(9,141 real changes made)
(10,443 real changes made)
(7,118 missing values generated)
(9,141 real changes made)
(4,656 real changes made)
(7,170 real changes made, 7,170 to missing)
(7,170 missing values generated)
(16,259 missing values generated)
(4,613 real changes made)
(4,476 real changes made)
(4,613 real changes made)
(4,476 real changes made)
(5,795 real changes made)
(16,259 missing values generated)
(4,613 real changes made)
(4,476 real changes made)
(9,089 real changes made)
(10,464 real changes made)
(7,170 missing values generated)
(9,089 real changes made)
(4,613 real changes made)
(7,152 real changes made, 7,152 to missing)
(7,152 missing values generated)
(16,259 missing values generated)
(4,603 real changes made)
(4,504 real changes made)
(4,603 real changes made)
(4,504 real changes made)
(5,817 real changes made)
(16,259 missing values generated)
(4,603 real changes made)
(4,504 real changes made)
(9,107 real changes made)
(10,442 real changes made)
(7,152 missing values generated)
(9,107 real changes made)
(4,603 real changes made)
(7,279 real changes made, 7,279 to missing)
(7,279 missing values generated)
(16,259 missing values generated)
(4,567 real changes made)
(4,413 real changes made)
(4,567 real changes made)
(4,413 real changes made)
(5,711 real changes made)
(16,259 missing values generated)
(4,567 real changes made)
(4,413 real changes made)
(8,980 real changes made)
(10,548 real changes made)
(7,279 missing values generated)
(8,980 real changes made)
(4,567 real changes made)
(7,215 real changes made, 7,215 to missing)
(7,215 missing values generated)
(16,259 missing values generated)
(4,599 real changes made)
(4,445 real changes made)
(4,599 real changes made)
(4,445 real changes made)
(5,764 real changes made)
(16,259 missing values generated)
(4,599 real changes made)
(4,445 real changes made)
(9,044 real changes made)
(10,495 real changes made)
(7,215 missing values generated)
(9,044 real changes made)
(4,599 real changes made)
(7,206 real changes made, 7,206 to missing)
(7,206 missing values generated)
(16,259 missing values generated)
(4,587 real changes made)
(4,466 real changes made)
(4,587 real changes made)
(4,466 real changes made)
(5,651 real changes made)
(16,259 missing values generated)
(4,587 real changes made)
(4,466 real changes made)
(9,053 real changes made)
(10,608 real changes made)
(7,206 missing values generated)
(9,053 real changes made)
(4,587 real changes made)
(7,135 real changes made, 7,135 to missing)
(7,135 missing values generated)
(16,259 missing values generated)
(4,658 real changes made)
(4,466 real changes made)
(4,658 real changes made)
(4,466 real changes made)
(5,810 real changes made)
(16,259 missing values generated)
(4,658 real changes made)
(4,466 real changes made)
(9,124 real changes made)
(10,449 real changes made)
(7,135 missing values generated)
(9,124 real changes made)
(4,658 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(16,259 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr20
> 22 may2022 jun2022 jul2022 aug2022 sep2022 oct2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if covid_month=="`x'"
  3. drop egfr_baseline_creatinine_`x'
  4. }
(293 real changes made)
(340 real changes made)
(312 real changes made)
(330 real changes made)
(319 real changes made)
(332 real changes made)
(322 real changes made)
(307 real changes made)
(322 real changes made)
(282 real changes made)
(283 real changes made)
(287 real changes made)
(265 real changes made)
(286 real changes made)
(271 real changes made)
(294 real changes made)
(274 real changes made)
(252 real changes made)
(254 real changes made)
(285 real changes made)
(291 real changes made)
(255 real changes made)
(264 real changes made)
(222 real changes made)
(209 real changes made)
(263 real changes made)
(266 real changes made)
(251 real changes made)
(253 real changes made)
(254 real changes made)
(243 real changes made)
(210 real changes made)
(219 real changes made)

. drop if baseline_egfr <15
(0 observations deleted)

. drop baseline_egfr

. drop covid_date_string

. 
. * COVID-19 death
. drop if deceased==1
(1,622 observations deleted)

. drop deceased

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. export delimited using "./output/covid_matching_2017.csv", replace
(note: file ./output/covid_matching_2017.csv not found)
file ./output/covid_matching_2017.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2017.log
  log type:  text
 closed on:  31 Mar 2023, 20:50:23
-------------------------------------------------------------------------------
