------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/covid_matching.log
  log type:  text
 opened on:  24 Oct 2022, 00:22:11

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames(1) case(preserve) 
(encoding automatically selected: ISO-8859-9)
(53 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,640 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosis
. drop if has_follow_up==0
(1,970 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,877 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,737 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,655 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb2020, 20, 3000)
(14,100 real changes made, 14,100 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,100 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,121 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.7 if male==0
(9,125 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.9 if male==1
(8,896 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.329  if male==0
(9,125 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.411  if male==1
(8,896 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb2020<1
(11,444 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,121 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.7 if male==0
(9,125 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.9 if male==1
(8,896 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.209
(18,021 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb2020>1
(20,677 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_baseline_creatinine_feb2020*141
(14,100 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(0.993^age)
(18,021 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1.018 if male==0
(9,125 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine updated monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(14,313 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(14,313 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 ///
>                                                                                                 baseline_creatinine_feb2022 ///
>                                                                                                 baseline_creatinine_mar2022 ///
>                                                                                                 baseline_creatinine_apr2022 ///
>                                                                                                 baseline_creatinine_may2022 ///
>                                                                                                 baseline_creatinine_jun2022 ///
>                                                                                                 baseline_creatinine_jul2022 ///
>                                                                                                 baseline_creatinine_aug2022 ///
>                                                                                                 baseline_creatinine_sep2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(7,801 real changes made, 7,801 to missing)
(7,801 missing values generated)
(17,808 missing values generated)
(5,125 real changes made)
(4,882 real changes made)
(5,125 real changes made)
(4,882 real changes made)
(6,375 real changes made)
(17,808 missing values generated)
(5,125 real changes made)
(4,882 real changes made)
(10,007 real changes made)
(11,433 real changes made)
(7,801 missing values generated)
(10,007 real changes made)
(5,125 real changes made)
(7,808 real changes made, 7,808 to missing)
(7,808 missing values generated)
(17,808 missing values generated)
(5,059 real changes made)
(4,941 real changes made)
(5,059 real changes made)
(4,941 real changes made)
(6,336 real changes made)
(17,808 missing values generated)
(5,059 real changes made)
(4,941 real changes made)
(10,000 real changes made)
(11,472 real changes made)
(7,808 missing values generated)
(10,000 real changes made)
(5,059 real changes made)
(7,884 real changes made, 7,884 to missing)
(7,884 missing values generated)
(17,808 missing values generated)
(5,059 real changes made)
(4,865 real changes made)
(5,059 real changes made)
(4,865 real changes made)
(6,262 real changes made)
(17,808 missing values generated)
(5,059 real changes made)
(4,865 real changes made)
(9,924 real changes made)
(11,546 real changes made)
(7,884 missing values generated)
(9,924 real changes made)
(5,059 real changes made)
(7,619 real changes made, 7,619 to missing)
(7,619 missing values generated)
(17,808 missing values generated)
(5,228 real changes made)
(4,961 real changes made)
(5,228 real changes made)
(4,961 real changes made)
(6,462 real changes made)
(17,808 missing values generated)
(5,228 real changes made)
(4,961 real changes made)
(10,189 real changes made)
(11,346 real changes made)
(7,619 missing values generated)
(10,189 real changes made)
(5,228 real changes made)
(7,820 real changes made, 7,820 to missing)
(7,820 missing values generated)
(17,808 missing values generated)
(4,969 real changes made)
(5,019 real changes made)
(4,969 real changes made)
(5,019 real changes made)
(6,283 real changes made)
(17,808 missing values generated)
(4,969 real changes made)
(5,019 real changes made)
(9,988 real changes made)
(11,525 real changes made)
(7,820 missing values generated)
(9,988 real changes made)
(4,969 real changes made)
(7,870 real changes made, 7,870 to missing)
(7,870 missing values generated)
(17,808 missing values generated)
(5,036 real changes made)
(4,902 real changes made)
(5,036 real changes made)
(4,902 real changes made)
(6,284 real changes made)
(17,808 missing values generated)
(5,036 real changes made)
(4,902 real changes made)
(9,938 real changes made)
(11,524 real changes made)
(7,870 missing values generated)
(9,938 real changes made)
(5,036 real changes made)
(7,854 real changes made, 7,854 to missing)
(7,854 missing values generated)
(17,808 missing values generated)
(5,047 real changes made)
(4,907 real changes made)
(5,047 real changes made)
(4,907 real changes made)
(6,242 real changes made)
(17,808 missing values generated)
(5,047 real changes made)
(4,907 real changes made)
(9,954 real changes made)
(11,566 real changes made)
(7,854 missing values generated)
(9,954 real changes made)
(5,047 real changes made)
(7,799 real changes made, 7,799 to missing)
(7,799 missing values generated)
(17,808 missing values generated)
(5,057 real changes made)
(4,952 real changes made)
(5,057 real changes made)
(4,952 real changes made)
(6,296 real changes made)
(17,808 missing values generated)
(5,057 real changes made)
(4,952 real changes made)
(10,009 real changes made)
(11,512 real changes made)
(7,799 missing values generated)
(10,009 real changes made)
(5,057 real changes made)
(7,829 real changes made, 7,829 to missing)
(7,829 missing values generated)
(17,808 missing values generated)
(5,049 real changes made)
(4,930 real changes made)
(5,049 real changes made)
(4,930 real changes made)
(6,322 real changes made)
(17,808 missing values generated)
(5,049 real changes made)
(4,930 real changes made)
(9,979 real changes made)
(11,486 real changes made)
(7,829 missing values generated)
(9,979 real changes made)
(5,049 real changes made)
(7,768 real changes made, 7,768 to missing)
(7,768 missing values generated)
(17,808 missing values generated)
(5,064 real changes made)
(4,976 real changes made)
(5,064 real changes made)
(4,976 real changes made)
(6,299 real changes made)
(17,808 missing values generated)
(5,064 real changes made)
(4,976 real changes made)
(10,040 real changes made)
(11,509 real changes made)
(7,768 missing values generated)
(10,040 real changes made)
(5,064 real changes made)
(7,888 real changes made, 7,888 to missing)
(7,888 missing values generated)
(17,808 missing values generated)
(4,993 real changes made)
(4,927 real changes made)
(4,993 real changes made)
(4,927 real changes made)
(6,178 real changes made)
(17,808 missing values generated)
(4,993 real changes made)
(4,927 real changes made)
(9,920 real changes made)
(11,630 real changes made)
(7,888 missing values generated)
(9,920 real changes made)
(4,993 real changes made)
(7,888 real changes made, 7,888 to missing)
(7,888 missing values generated)
(17,808 missing values generated)
(5,020 real changes made)
(4,900 real changes made)
(5,020 real changes made)
(4,900 real changes made)
(6,252 real changes made)
(17,808 missing values generated)
(5,020 real changes made)
(4,900 real changes made)
(9,920 real changes made)
(11,556 real changes made)
(7,888 missing values generated)
(9,920 real changes made)
(5,020 real changes made)
(7,909 real changes made, 7,909 to missing)
(7,909 missing values generated)
(17,808 missing values generated)
(4,994 real changes made)
(4,905 real changes made)
(4,994 real changes made)
(4,905 real changes made)
(6,278 real changes made)
(17,808 missing values generated)
(4,994 real changes made)
(4,905 real changes made)
(9,899 real changes made)
(11,530 real changes made)
(7,909 missing values generated)
(9,899 real changes made)
(4,994 real changes made)
(7,837 real changes made, 7,837 to missing)
(7,837 missing values generated)
(17,808 missing values generated)
(5,016 real changes made)
(4,955 real changes made)
(5,016 real changes made)
(4,955 real changes made)
(6,387 real changes made)
(17,808 missing values generated)
(5,016 real changes made)
(4,955 real changes made)
(9,971 real changes made)
(11,421 real changes made)
(7,837 missing values generated)
(9,971 real changes made)
(5,016 real changes made)
(7,811 real changes made, 7,811 to missing)
(7,811 missing values generated)
(17,808 missing values generated)
(5,065 real changes made)
(4,932 real changes made)
(5,065 real changes made)
(4,932 real changes made)
(6,311 real changes made)
(17,808 missing values generated)
(5,065 real changes made)
(4,932 real changes made)
(9,997 real changes made)
(11,497 real changes made)
(7,811 missing values generated)
(9,997 real changes made)
(5,065 real changes made)
(7,821 real changes made, 7,821 to missing)
(7,821 missing values generated)
(17,808 missing values generated)
(5,111 real changes made)
(4,876 real changes made)
(5,111 real changes made)
(4,876 real changes made)
(6,232 real changes made)
(17,808 missing values generated)
(5,111 real changes made)
(4,876 real changes made)
(9,987 real changes made)
(11,576 real changes made)
(7,821 missing values generated)
(9,987 real changes made)
(5,111 real changes made)
(7,863 real changes made, 7,863 to missing)
(7,863 missing values generated)
(17,808 missing values generated)
(5,046 real changes made)
(4,899 real changes made)
(5,046 real changes made)
(4,899 real changes made)
(6,245 real changes made)
(17,808 missing values generated)
(5,046 real changes made)
(4,899 real changes made)
(9,945 real changes made)
(11,563 real changes made)
(7,863 missing values generated)
(9,945 real changes made)
(5,046 real changes made)
(7,796 real changes made, 7,796 to missing)
(7,796 missing values generated)
(17,808 missing values generated)
(5,092 real changes made)
(4,920 real changes made)
(5,092 real changes made)
(4,920 real changes made)
(6,287 real changes made)
(17,808 missing values generated)
(5,092 real changes made)
(4,920 real changes made)
(10,012 real changes made)
(11,521 real changes made)
(7,796 missing values generated)
(10,012 real changes made)
(5,092 real changes made)
(7,765 real changes made, 7,765 to missing)
(7,765 missing values generated)
(17,808 missing values generated)
(5,080 real changes made)
(4,963 real changes made)
(5,080 real changes made)
(4,963 real changes made)
(6,346 real changes made)
(17,808 missing values generated)
(5,080 real changes made)
(4,963 real changes made)
(10,043 real changes made)
(11,462 real changes made)
(7,765 missing values generated)
(10,043 real changes made)
(5,080 real changes made)
(7,885 real changes made, 7,885 to missing)
(7,885 missing values generated)
(17,808 missing values generated)
(5,038 real changes made)
(4,885 real changes made)
(5,038 real changes made)
(4,885 real changes made)
(6,310 real changes made)
(17,808 missing values generated)
(5,038 real changes made)
(4,885 real changes made)
(9,923 real changes made)
(11,498 real changes made)
(7,885 missing values generated)
(9,923 real changes made)
(5,038 real changes made)
(7,840 real changes made, 7,840 to missing)
(7,840 missing values generated)
(17,808 missing values generated)
(5,032 real changes made)
(4,936 real changes made)
(5,032 real changes made)
(4,936 real changes made)
(6,273 real changes made)
(17,808 missing values generated)
(5,032 real changes made)
(4,936 real changes made)
(9,968 real changes made)
(11,535 real changes made)
(7,840 missing values generated)
(9,968 real changes made)
(5,032 real changes made)
(7,832 real changes made, 7,832 to missing)
(7,832 missing values generated)
(17,808 missing values generated)
(5,097 real changes made)
(4,879 real changes made)
(5,097 real changes made)
(4,879 real changes made)
(6,352 real changes made)
(17,808 missing values generated)
(5,097 real changes made)
(4,879 real changes made)
(9,976 real changes made)
(11,456 real changes made)
(7,832 missing values generated)
(9,976 real changes made)
(5,097 real changes made)
(7,900 real changes made, 7,900 to missing)
(7,900 missing values generated)
(17,808 missing values generated)
(5,019 real changes made)
(4,889 real changes made)
(5,019 real changes made)
(4,889 real changes made)
(6,340 real changes made)
(17,808 missing values generated)
(5,019 real changes made)
(4,889 real changes made)
(9,908 real changes made)
(11,468 real changes made)
(7,900 missing values generated)
(9,908 real changes made)
(5,019 real changes made)
(7,851 real changes made, 7,851 to missing)
(7,851 missing values generated)
(17,808 missing values generated)
(5,080 real changes made)
(4,877 real changes made)
(5,080 real changes made)
(4,877 real changes made)
(6,356 real changes made)
(17,808 missing values generated)
(5,080 real changes made)
(4,877 real changes made)
(9,957 real changes made)
(11,452 real changes made)
(7,851 missing values generated)
(9,957 real changes made)
(5,080 real changes made)
(7,731 real changes made, 7,731 to missing)
(7,731 missing values generated)
(17,808 missing values generated)
(5,073 real changes made)
(5,004 real changes made)
(5,073 real changes made)
(5,004 real changes made)
(6,448 real changes made)
(17,808 missing values generated)
(5,073 real changes made)
(5,004 real changes made)
(10,077 real changes made)
(11,360 real changes made)
(7,731 missing values generated)
(10,077 real changes made)
(5,073 real changes made)
(7,857 real changes made, 7,857 to missing)
(7,857 missing values generated)
(17,808 missing values generated)
(4,962 real changes made)
(4,989 real changes made)
(4,962 real changes made)
(4,989 real changes made)
(6,250 real changes made)
(17,808 missing values generated)
(4,962 real changes made)
(4,989 real changes made)
(9,951 real changes made)
(11,558 real changes made)
(7,857 missing values generated)
(9,951 real changes made)
(4,962 real changes made)
(7,801 real changes made, 7,801 to missing)
(7,801 missing values generated)
(17,808 missing values generated)
(5,044 real changes made)
(4,963 real changes made)
(5,044 real changes made)
(4,963 real changes made)
(6,355 real changes made)
(17,808 missing values generated)
(5,044 real changes made)
(4,963 real changes made)
(10,007 real changes made)
(11,453 real changes made)
(7,801 missing values generated)
(10,007 real changes made)
(5,044 real changes made)
(7,803 real changes made, 7,803 to missing)
(7,803 missing values generated)
(17,808 missing values generated)
(5,073 real changes made)
(4,932 real changes made)
(5,073 real changes made)
(4,932 real changes made)
(6,349 real changes made)
(17,808 missing values generated)
(5,073 real changes made)
(4,932 real changes made)
(10,005 real changes made)
(11,459 real changes made)
(7,803 missing values generated)
(10,005 real changes made)
(5,073 real changes made)
(7,738 real changes made, 7,738 to missing)
(7,738 missing values generated)
(17,808 missing values generated)
(5,089 real changes made)
(4,981 real changes made)
(5,089 real changes made)
(4,981 real changes made)
(6,417 real changes made)
(17,808 missing values generated)
(5,089 real changes made)
(4,981 real changes made)
(10,070 real changes made)
(11,391 real changes made)
(7,738 missing values generated)
(10,070 real changes made)
(5,089 real changes made)
(7,898 real changes made, 7,898 to missing)
(7,898 missing values generated)
(17,808 missing values generated)
(5,056 real changes made)
(4,854 real changes made)
(5,056 real changes made)
(4,854 real changes made)
(6,251 real changes made)
(17,808 missing values generated)
(5,056 real changes made)
(4,854 real changes made)
(9,910 real changes made)
(11,557 real changes made)
(7,898 missing values generated)
(9,910 real changes made)
(5,056 real changes made)
(7,881 real changes made, 7,881 to missing)
(7,881 missing values generated)
(17,808 missing values generated)
(5,060 real changes made)
(4,867 real changes made)
(5,060 real changes made)
(4,867 real changes made)
(6,279 real changes made)
(17,808 missing values generated)
(5,060 real changes made)
(4,867 real changes made)
(9,927 real changes made)
(11,529 real changes made)
(7,881 missing values generated)
(9,927 real changes made)
(5,060 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(17,808 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 
> jul2022 aug2022 sep2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. drop if baseline_egfr <15
  4. drop egfr_baseline_creatinine_`x'
  5. }
(347 real changes made)
(0 observations deleted)
(363 real changes made)
(0 observations deleted)
(370 real changes made)
(0 observations deleted)
(363 real changes made)
(0 observations deleted)
(388 real changes made)
(0 observations deleted)
(341 real changes made)
(0 observations deleted)
(324 real changes made)
(0 observations deleted)
(352 real changes made)
(0 observations deleted)
(375 real changes made)
(0 observations deleted)
(335 real changes made)
(0 observations deleted)
(355 real changes made)
(0 observations deleted)
(375 real changes made)
(0 observations deleted)
(313 real changes made)
(0 observations deleted)
(352 real changes made)
(0 observations deleted)
(341 real changes made)
(0 observations deleted)
(321 real changes made)
(0 observations deleted)
(294 real changes made)
(0 observations deleted)
(313 real changes made)
(0 observations deleted)
(331 real changes made)
(0 observations deleted)
(301 real changes made)
(0 observations deleted)
(268 real changes made)
(0 observations deleted)
(288 real changes made)
(0 observations deleted)
(310 real changes made)
(0 observations deleted)
(259 real changes made)
(0 observations deleted)
(235 real changes made)
(0 observations deleted)
(285 real changes made)
(0 observations deleted)
(278 real changes made)
(0 observations deleted)
(282 real changes made)
(0 observations deleted)
(263 real changes made)
(0 observations deleted)
(264 real changes made)
(0 observations deleted)
(240 real changes made)
(0 observations deleted)
(222 real changes made)
(0 observations deleted)

. drop baseline_egfr

. drop covid_date_string

. 
. * COVID-19 death
. drop if deceased==1
(1,777 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        221        1.38        1.38
         19 |        223        1.39        2.77
         20 |        246        1.53        4.30
         21 |        267        1.67        5.97
         22 |        261        1.63        7.60
         23 |        253        1.58        9.18
         24 |        254        1.58       10.76
         25 |        304        1.90       12.66
         26 |        275        1.72       14.37
         27 |        293        1.83       16.20
         28 |        274        1.71       17.91
         29 |        298        1.86       19.77
         30 |        279        1.74       21.51
         31 |        287        1.79       23.30
         32 |        261        1.63       24.93
         33 |        270        1.68       26.61
         34 |        244        1.52       28.13
         35 |        265        1.65       29.79
         36 |        245        1.53       31.31
         37 |        280        1.75       33.06
         38 |        252        1.57       34.63
         39 |        294        1.83       36.47
         40 |        216        1.35       37.81
         41 |        250        1.56       39.37
         42 |        261        1.63       41.00
         43 |        248        1.55       42.55
         44 |        225        1.40       43.95
         45 |        273        1.70       45.66
         46 |        254        1.58       47.24
         47 |        331        2.06       49.30
         48 |        296        1.85       51.15
         49 |        250        1.56       52.71
         50 |        275        1.72       54.43
         51 |        270        1.68       56.11
         52 |        299        1.87       57.98
         53 |        275        1.72       59.69
         54 |        298        1.86       61.55
         55 |        276        1.72       63.27
         56 |        243        1.52       64.79
         57 |        274        1.71       66.50
         58 |        274        1.71       68.21
         59 |        259        1.62       69.82
         60 |        197        1.23       71.05
         61 |        240        1.50       72.55
         62 |        227        1.42       73.96
         63 |        229        1.43       75.39
         64 |        227        1.42       76.81
         65 |        207        1.29       78.10
         66 |        175        1.09       79.19
         67 |        205        1.28       80.47
         68 |        217        1.35       81.82
         69 |        222        1.38       83.21
         70 |        185        1.15       84.36
         71 |        206        1.29       85.65
         72 |        201        1.25       86.90
         73 |        212        1.32       88.22
         74 |        208        1.30       89.52
         75 |        133        0.83       90.35
         76 |        157        0.98       91.33
         77 |        136        0.85       92.18
         78 |        122        0.76       92.94
         79 |        139        0.87       93.81
         80 |         97        0.61       94.41
         81 |        109        0.68       95.09
         82 |        103        0.64       95.73
         83 |         98        0.61       96.34
         84 |         84        0.52       96.87
         85 |         68        0.42       97.29
         86 |         51        0.32       97.61
         87 |         64        0.40       98.01
         88 |         63        0.39       98.40
         89 |         72        0.45       98.85
         90 |         31        0.19       99.05
         91 |         26        0.16       99.21
         92 |         26        0.16       99.37
         93 |         30        0.19       99.56
         94 |         29        0.18       99.74
         95 |          7        0.04       99.78
         96 |         10        0.06       99.84
         97 |          6        0.04       99.88
         98 |          7        0.04       99.93
         99 |          7        0.04       99.97
        101 |          1        0.01       99.98
        102 |          1        0.01       99.98
        104 |          2        0.01       99.99
        109 |          1        0.01      100.00
------------+-----------------------------------
      Total |     16,031      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        870        5.43        5.43
          1 |      3,026       18.88       24.30
          2 |      3,067       19.13       43.43
          3 |      3,026       18.88       62.31
          4 |      3,016       18.81       81.12
          5 |      3,026       18.88      100.00
------------+-----------------------------------
      Total |     16,031      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      8,109       50.58       50.58
       Male |      7,922       49.42      100.00
------------+-----------------------------------
      Total |     16,031      100.00

. tab covid_month

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |        577        3.60        3.60
    apr2021 |        531        3.31        6.91
    apr2022 |        418        2.61        9.52
    aug2020 |        544        3.39       12.91
    aug2021 |        492        3.07       15.98
    aug2022 |        412        2.57       18.55
    dec2020 |        546        3.41       21.96
    dec2021 |        474        2.96       24.91
    feb2020 |        567        3.54       28.45
    feb2021 |        496        3.09       31.55
    feb2022 |        391        2.44       33.98
    jan2021 |        586        3.66       37.64
    jan2022 |        441        2.75       40.39
    jul2020 |        559        3.49       43.88
    jul2021 |        516        3.22       47.10
    jul2022 |        415        2.59       49.68
    jun2020 |        602        3.76       53.44
    jun2021 |        497        3.10       56.54
    jun2022 |        406        2.53       59.07
    mar2020 |        599        3.74       62.81
    mar2021 |        573        3.57       66.38
    mar2022 |        464        2.89       69.28
    may2020 |        575        3.59       72.87
    may2021 |        505        3.15       76.02
    may2022 |        439        2.74       78.75
    nov2020 |        528        3.29       82.05
    nov2021 |        432        2.69       84.74
    oct2020 |        547        3.41       88.15
    oct2021 |        445        2.78       90.93
    sep2020 |        568        3.54       94.47
    sep2021 |        483        3.01       97.49
    sep2022 |        403        2.51      100.00
------------+-----------------------------------
      Total |     16,031      100.00

. 
. export delimited using "./output/covid_matching.csv", replace
file ./output/covid_matching.csv saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/covid_matching.log
  log type:  text
 closed on:  24 Oct 2022, 00:22:15
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
