-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_matching.log
  log type:  text
 opened on:  15 Sep 2022, 14:46:26

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames
> (1) case(preserve) 
(40 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,543 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,999 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,882 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,791 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,710 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,036 real changes made, 14,036 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,036 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,075 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,302 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,737 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,302 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,737 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,441 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,075 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,302 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,737 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(18,039 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,634 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,036 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(18,039 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,302 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(17,350 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(17,350 observations deleted)

. drop covid_diagnosis_date

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(6,502 real changes made, 6,502 to missing)
(6,502 missing values generated)
(14,725 missing values generated)
(4,282 real changes made)
(3,941 real changes made)
(4,282 real changes made)
(3,941 real changes made)
(5,274 real changes made)
(14,725 missing values generated)
(4,282 real changes made)
(3,941 real changes made)
(8,223 real changes made)
(9,451 real changes made)
(6,502 missing values generated)
(8,223 real changes made)
(4,282 real changes made)
(6,476 real changes made, 6,476 to missing)
(6,476 missing values generated)
(14,725 missing values generated)
(4,294 real changes made)
(3,955 real changes made)
(4,294 real changes made)
(3,955 real changes made)
(5,274 real changes made)
(14,725 missing values generated)
(4,294 real changes made)
(3,955 real changes made)
(8,249 real changes made)
(9,451 real changes made)
(6,476 missing values generated)
(8,249 real changes made)
(4,294 real changes made)
(6,470 real changes made, 6,470 to missing)
(6,470 missing values generated)
(14,725 missing values generated)
(4,252 real changes made)
(4,003 real changes made)
(4,252 real changes made)
(4,003 real changes made)
(5,176 real changes made)
(14,725 missing values generated)
(4,252 real changes made)
(4,003 real changes made)
(8,255 real changes made)
(9,549 real changes made)
(6,470 missing values generated)
(8,255 real changes made)
(4,252 real changes made)
(6,454 real changes made, 6,454 to missing)
(6,454 missing values generated)
(14,725 missing values generated)
(4,273 real changes made)
(3,998 real changes made)
(4,273 real changes made)
(3,998 real changes made)
(5,210 real changes made)
(14,725 missing values generated)
(4,273 real changes made)
(3,998 real changes made)
(8,271 real changes made)
(9,515 real changes made)
(6,454 missing values generated)
(8,271 real changes made)
(4,273 real changes made)
(6,559 real changes made, 6,559 to missing)
(6,559 missing values generated)
(14,725 missing values generated)
(4,210 real changes made)
(3,956 real changes made)
(4,210 real changes made)
(3,956 real changes made)
(5,272 real changes made)
(14,725 missing values generated)
(4,210 real changes made)
(3,956 real changes made)
(8,166 real changes made)
(9,453 real changes made)
(6,559 missing values generated)
(8,166 real changes made)
(4,210 real changes made)
(6,460 real changes made, 6,460 to missing)
(6,460 missing values generated)
(14,725 missing values generated)
(4,287 real changes made)
(3,978 real changes made)
(4,287 real changes made)
(3,978 real changes made)
(5,256 real changes made)
(14,725 missing values generated)
(4,287 real changes made)
(3,978 real changes made)
(8,265 real changes made)
(9,469 real changes made)
(6,460 missing values generated)
(8,265 real changes made)
(4,287 real changes made)
(6,433 real changes made, 6,433 to missing)
(6,433 missing values generated)
(14,725 missing values generated)
(4,270 real changes made)
(4,022 real changes made)
(4,270 real changes made)
(4,022 real changes made)
(5,304 real changes made)
(14,725 missing values generated)
(4,270 real changes made)
(4,022 real changes made)
(8,292 real changes made)
(9,421 real changes made)
(6,433 missing values generated)
(8,292 real changes made)
(4,270 real changes made)
(6,355 real changes made, 6,355 to missing)
(6,355 missing values generated)
(14,725 missing values generated)
(4,352 real changes made)
(4,018 real changes made)
(4,352 real changes made)
(4,018 real changes made)
(5,291 real changes made)
(14,725 missing values generated)
(4,352 real changes made)
(4,018 real changes made)
(8,370 real changes made)
(9,434 real changes made)
(6,355 missing values generated)
(8,370 real changes made)
(4,352 real changes made)
(6,478 real changes made, 6,478 to missing)
(6,478 missing values generated)
(14,725 missing values generated)
(4,232 real changes made)
(4,015 real changes made)
(4,232 real changes made)
(4,015 real changes made)
(5,205 real changes made)
(14,725 missing values generated)
(4,232 real changes made)
(4,015 real changes made)
(8,247 real changes made)
(9,520 real changes made)
(6,478 missing values generated)
(8,247 real changes made)
(4,232 real changes made)
(6,518 real changes made, 6,518 to missing)
(6,518 missing values generated)
(14,725 missing values generated)
(4,230 real changes made)
(3,977 real changes made)
(4,230 real changes made)
(3,977 real changes made)
(5,193 real changes made)
(14,725 missing values generated)
(4,230 real changes made)
(3,977 real changes made)
(8,207 real changes made)
(9,532 real changes made)
(6,518 missing values generated)
(8,207 real changes made)
(4,230 real changes made)
(6,464 real changes made, 6,464 to missing)
(6,464 missing values generated)
(14,725 missing values generated)
(4,275 real changes made)
(3,986 real changes made)
(4,275 real changes made)
(3,986 real changes made)
(5,136 real changes made)
(14,725 missing values generated)
(4,275 real changes made)
(3,986 real changes made)
(8,261 real changes made)
(9,589 real changes made)
(6,464 missing values generated)
(8,261 real changes made)
(4,275 real changes made)
(6,524 real changes made, 6,524 to missing)
(6,524 missing values generated)
(14,725 missing values generated)
(4,228 real changes made)
(3,973 real changes made)
(4,228 real changes made)
(3,973 real changes made)
(5,193 real changes made)
(14,725 missing values generated)
(4,228 real changes made)
(3,973 real changes made)
(8,201 real changes made)
(9,532 real changes made)
(6,524 missing values generated)
(8,201 real changes made)
(4,228 real changes made)
(6,512 real changes made, 6,512 to missing)
(6,512 missing values generated)
(14,725 missing values generated)
(4,182 real changes made)
(4,031 real changes made)
(4,182 real changes made)
(4,031 real changes made)
(5,189 real changes made)
(14,725 missing values generated)
(4,182 real changes made)
(4,031 real changes made)
(8,213 real changes made)
(9,536 real changes made)
(6,512 missing values generated)
(8,213 real changes made)
(4,182 real changes made)
(6,421 real changes made, 6,421 to missing)
(6,421 missing values generated)
(14,725 missing values generated)
(4,278 real changes made)
(4,026 real changes made)
(4,278 real changes made)
(4,026 real changes made)
(5,272 real changes made)
(14,725 missing values generated)
(4,278 real changes made)
(4,026 real changes made)
(8,304 real changes made)
(9,453 real changes made)
(6,421 missing values generated)
(8,304 real changes made)
(4,278 real changes made)
(6,544 real changes made, 6,544 to missing)
(6,544 missing values generated)
(14,725 missing values generated)
(4,196 real changes made)
(3,985 real changes made)
(4,196 real changes made)
(3,985 real changes made)
(5,222 real changes made)
(14,725 missing values generated)
(4,196 real changes made)
(3,985 real changes made)
(8,181 real changes made)
(9,503 real changes made)
(6,544 missing values generated)
(8,181 real changes made)
(4,196 real changes made)
(6,428 real changes made, 6,428 to missing)
(6,428 missing values generated)
(14,725 missing values generated)
(4,280 real changes made)
(4,017 real changes made)
(4,280 real changes made)
(4,017 real changes made)
(5,257 real changes made)
(14,725 missing values generated)
(4,280 real changes made)
(4,017 real changes made)
(8,297 real changes made)
(9,468 real changes made)
(6,428 missing values generated)
(8,297 real changes made)
(4,280 real changes made)
(6,409 real changes made, 6,409 to missing)
(6,409 missing values generated)
(14,725 missing values generated)
(4,303 real changes made)
(4,013 real changes made)
(4,303 real changes made)
(4,013 real changes made)
(5,334 real changes made)
(14,725 missing values generated)
(4,303 real changes made)
(4,013 real changes made)
(8,316 real changes made)
(9,391 real changes made)
(6,409 missing values generated)
(8,316 real changes made)
(4,303 real changes made)
(6,578 real changes made, 6,578 to missing)
(6,578 missing values generated)
(14,725 missing values generated)
(4,237 real changes made)
(3,910 real changes made)
(4,237 real changes made)
(3,910 real changes made)
(5,223 real changes made)
(14,725 missing values generated)
(4,237 real changes made)
(3,910 real changes made)
(8,147 real changes made)
(9,502 real changes made)
(6,578 missing values generated)
(8,147 real changes made)
(4,237 real changes made)
(6,380 real changes made, 6,380 to missing)
(6,380 missing values generated)
(14,725 missing values generated)
(4,306 real changes made)
(4,039 real changes made)
(4,306 real changes made)
(4,039 real changes made)
(5,311 real changes made)
(14,725 missing values generated)
(4,306 real changes made)
(4,039 real changes made)
(8,345 real changes made)
(9,414 real changes made)
(6,380 missing values generated)
(8,345 real changes made)
(4,306 real changes made)
(6,453 real changes made, 6,453 to missing)
(6,453 missing values generated)
(14,725 missing values generated)
(4,246 real changes made)
(4,026 real changes made)
(4,246 real changes made)
(4,026 real changes made)
(5,222 real changes made)
(14,725 missing values generated)
(4,246 real changes made)
(4,026 real changes made)
(8,272 real changes made)
(9,503 real changes made)
(6,453 missing values generated)
(8,272 real changes made)
(4,246 real changes made)
(6,492 real changes made, 6,492 to missing)
(6,492 missing values generated)
(14,725 missing values generated)
(4,253 real changes made)
(3,980 real changes made)
(4,253 real changes made)
(3,980 real changes made)
(5,254 real changes made)
(14,725 missing values generated)
(4,253 real changes made)
(3,980 real changes made)
(8,233 real changes made)
(9,471 real changes made)
(6,492 missing values generated)
(8,233 real changes made)
(4,253 real changes made)
(6,427 real changes made, 6,427 to missing)
(6,427 missing values generated)
(14,725 missing values generated)
(4,287 real changes made)
(4,011 real changes made)
(4,287 real changes made)
(4,011 real changes made)
(5,273 real changes made)
(14,725 missing values generated)
(4,287 real changes made)
(4,011 real changes made)
(8,298 real changes made)
(9,452 real changes made)
(6,427 missing values generated)
(8,298 real changes made)
(4,287 real changes made)
(6,422 real changes made, 6,422 to missing)
(6,422 missing values generated)
(14,725 missing values generated)
(4,274 real changes made)
(4,029 real changes made)
(4,274 real changes made)
(4,029 real changes made)
(5,235 real changes made)
(14,725 missing values generated)
(4,274 real changes made)
(4,029 real changes made)
(8,303 real changes made)
(9,490 real changes made)
(6,422 missing values generated)
(8,303 real changes made)
(4,274 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(14,725 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. drop if baseline_egfr <15
  4. drop egfr_baseline_creatinine_`x'
  5. }
(363 real changes made)
(0 observations deleted)
(402 real changes made)
(0 observations deleted)
(369 real changes made)
(0 observations deleted)
(391 real changes made)
(0 observations deleted)
(356 real changes made)
(0 observations deleted)
(361 real changes made)
(0 observations deleted)
(361 real changes made)
(0 observations deleted)
(349 real changes made)
(0 observations deleted)
(377 real changes made)
(0 observations deleted)
(379 real changes made)
(0 observations deleted)
(388 real changes made)
(0 observations deleted)
(326 real changes made)
(0 observations deleted)
(300 real changes made)
(0 observations deleted)
(350 real changes made)
(0 observations deleted)
(315 real changes made)
(0 observations deleted)
(356 real changes made)
(0 observations deleted)
(320 real changes made)
(0 observations deleted)
(333 real changes made)
(0 observations deleted)
(329 real changes made)
(0 observations deleted)
(325 real changes made)
(0 observations deleted)
(303 real changes made)
(0 observations deleted)
(283 real changes made)
(0 observations deleted)
(346 real changes made)
(0 observations deleted)
(300 real changes made)
(0 observations deleted)

. drop baseline_egfr

. drop covid_month

. drop covid_date_string

. drop age

. 
. * COVID-19 death
. drop if deceased==1
(1,501 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. replace imd = imd + 1
(13,224 real changes made)

. drop imd_o

. recode imd 5=1 4=2 3=3 2=4 1=5 .=.
(imd: 10617 changes made)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" 

. label values imd imd

. label var imd "Index of Multiple Deprivation"

. noi di "DROPPING IF NO IMD" 
DROPPING IF NO IMD

. drop if imd>=.
(0 observations deleted)

. 
. export delimited using "./output/covid_matching.csv", replace
(note: file ./output/covid_matching.csv not found)
file ./output/covid_matching.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_matching.log
  log type:  text
 closed on:  15 Sep 2022, 14:46:28
-------------------------------------------------------------------------------
