-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_matching.log
  log type:  text
 opened on:  25 Oct 2022, 21:49:40

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames
> (1) case(preserve) 
(53 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,684 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,938 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,913 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,790 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,669 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,035 real changes made, 14,035 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,035 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,006 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,169 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,802 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,169 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,802 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,411 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,006 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,169 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,802 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(17,971 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,595 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,035 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(17,971 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,169 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(14,223 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(14,223 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(7,675 real changes made, 7,675 to missing)
(7,675 missing values generated)
(17,783 missing values generated)
(5,197 real changes made)
(4,911 real changes made)
(5,197 real changes made)
(4,911 real changes made)
(6,382 real changes made)
(17,783 missing values generated)
(5,197 real changes made)
(4,911 real changes made)
(10,108 real changes made)
(11,401 real changes made)
(7,675 missing values generated)
(10,108 real changes made)
(5,197 real changes made)
(7,816 real changes made, 7,816 to missing)
(7,816 missing values generated)
(17,783 missing values generated)
(5,100 real changes made)
(4,867 real changes made)
(5,100 real changes made)
(4,867 real changes made)
(6,365 real changes made)
(17,783 missing values generated)
(5,100 real changes made)
(4,867 real changes made)
(9,967 real changes made)
(11,418 real changes made)
(7,816 missing values generated)
(9,967 real changes made)
(5,100 real changes made)
(7,940 real changes made, 7,940 to missing)
(7,940 missing values generated)
(17,783 missing values generated)
(4,986 real changes made)
(4,857 real changes made)
(4,986 real changes made)
(4,857 real changes made)
(6,287 real changes made)
(17,783 missing values generated)
(4,986 real changes made)
(4,857 real changes made)
(9,843 real changes made)
(11,496 real changes made)
(7,940 missing values generated)
(9,843 real changes made)
(4,986 real changes made)
(7,874 real changes made, 7,874 to missing)
(7,874 missing values generated)
(17,783 missing values generated)
(5,074 real changes made)
(4,835 real changes made)
(5,074 real changes made)
(4,835 real changes made)
(6,242 real changes made)
(17,783 missing values generated)
(5,074 real changes made)
(4,835 real changes made)
(9,909 real changes made)
(11,541 real changes made)
(7,874 missing values generated)
(9,909 real changes made)
(5,074 real changes made)
(7,809 real changes made, 7,809 to missing)
(7,809 missing values generated)
(17,783 missing values generated)
(5,100 real changes made)
(4,874 real changes made)
(5,100 real changes made)
(4,874 real changes made)
(6,365 real changes made)
(17,783 missing values generated)
(5,100 real changes made)
(4,874 real changes made)
(9,974 real changes made)
(11,418 real changes made)
(7,809 missing values generated)
(9,974 real changes made)
(5,100 real changes made)
(7,825 real changes made, 7,825 to missing)
(7,825 missing values generated)
(17,783 missing values generated)
(5,112 real changes made)
(4,846 real changes made)
(5,112 real changes made)
(4,846 real changes made)
(6,263 real changes made)
(17,783 missing values generated)
(5,112 real changes made)
(4,846 real changes made)
(9,958 real changes made)
(11,520 real changes made)
(7,825 missing values generated)
(9,958 real changes made)
(5,112 real changes made)
(7,925 real changes made, 7,925 to missing)
(7,925 missing values generated)
(17,783 missing values generated)
(5,027 real changes made)
(4,831 real changes made)
(5,027 real changes made)
(4,831 real changes made)
(6,249 real changes made)
(17,783 missing values generated)
(5,027 real changes made)
(4,831 real changes made)
(9,858 real changes made)
(11,534 real changes made)
(7,925 missing values generated)
(9,858 real changes made)
(5,027 real changes made)
(7,839 real changes made, 7,839 to missing)
(7,839 missing values generated)
(17,783 missing values generated)
(5,080 real changes made)
(4,864 real changes made)
(5,080 real changes made)
(4,864 real changes made)
(6,331 real changes made)
(17,783 missing values generated)
(5,080 real changes made)
(4,864 real changes made)
(9,944 real changes made)
(11,452 real changes made)
(7,839 missing values generated)
(9,944 real changes made)
(5,080 real changes made)
(7,853 real changes made, 7,853 to missing)
(7,853 missing values generated)
(17,783 missing values generated)
(5,060 real changes made)
(4,870 real changes made)
(5,060 real changes made)
(4,870 real changes made)
(6,267 real changes made)
(17,783 missing values generated)
(5,060 real changes made)
(4,870 real changes made)
(9,930 real changes made)
(11,516 real changes made)
(7,853 missing values generated)
(9,930 real changes made)
(5,060 real changes made)
(7,827 real changes made, 7,827 to missing)
(7,827 missing values generated)
(17,783 missing values generated)
(5,080 real changes made)
(4,876 real changes made)
(5,080 real changes made)
(4,876 real changes made)
(6,312 real changes made)
(17,783 missing values generated)
(5,080 real changes made)
(4,876 real changes made)
(9,956 real changes made)
(11,471 real changes made)
(7,827 missing values generated)
(9,956 real changes made)
(5,080 real changes made)
(7,765 real changes made, 7,765 to missing)
(7,765 missing values generated)
(17,783 missing values generated)
(5,144 real changes made)
(4,874 real changes made)
(5,144 real changes made)
(4,874 real changes made)
(6,323 real changes made)
(17,783 missing values generated)
(5,144 real changes made)
(4,874 real changes made)
(10,018 real changes made)
(11,460 real changes made)
(7,765 missing values generated)
(10,018 real changes made)
(5,144 real changes made)
(7,790 real changes made, 7,790 to missing)
(7,790 missing values generated)
(17,783 missing values generated)
(5,147 real changes made)
(4,846 real changes made)
(5,147 real changes made)
(4,846 real changes made)
(6,375 real changes made)
(17,783 missing values generated)
(5,147 real changes made)
(4,846 real changes made)
(9,993 real changes made)
(11,408 real changes made)
(7,790 missing values generated)
(9,993 real changes made)
(5,147 real changes made)
(7,747 real changes made, 7,747 to missing)
(7,747 missing values generated)
(17,783 missing values generated)
(5,176 real changes made)
(4,860 real changes made)
(5,176 real changes made)
(4,860 real changes made)
(6,358 real changes made)
(17,783 missing values generated)
(5,176 real changes made)
(4,860 real changes made)
(10,036 real changes made)
(11,425 real changes made)
(7,747 missing values generated)
(10,036 real changes made)
(5,176 real changes made)
(7,838 real changes made, 7,838 to missing)
(7,838 missing values generated)
(17,783 missing values generated)
(5,045 real changes made)
(4,900 real changes made)
(5,045 real changes made)
(4,900 real changes made)
(6,308 real changes made)
(17,783 missing values generated)
(5,045 real changes made)
(4,900 real changes made)
(9,945 real changes made)
(11,475 real changes made)
(7,838 missing values generated)
(9,945 real changes made)
(5,045 real changes made)
(7,917 real changes made, 7,917 to missing)
(7,917 missing values generated)
(17,783 missing values generated)
(5,067 real changes made)
(4,799 real changes made)
(5,067 real changes made)
(4,799 real changes made)
(6,286 real changes made)
(17,783 missing values generated)
(5,067 real changes made)
(4,799 real changes made)
(9,866 real changes made)
(11,497 real changes made)
(7,917 missing values generated)
(9,866 real changes made)
(5,067 real changes made)
(7,868 real changes made, 7,868 to missing)
(7,868 missing values generated)
(17,783 missing values generated)
(5,115 real changes made)
(4,800 real changes made)
(5,115 real changes made)
(4,800 real changes made)
(6,258 real changes made)
(17,783 missing values generated)
(5,115 real changes made)
(4,800 real changes made)
(9,915 real changes made)
(11,525 real changes made)
(7,868 missing values generated)
(9,915 real changes made)
(5,115 real changes made)
(7,854 real changes made, 7,854 to missing)
(7,854 missing values generated)
(17,783 missing values generated)
(5,098 real changes made)
(4,831 real changes made)
(5,098 real changes made)
(4,831 real changes made)
(6,339 real changes made)
(17,783 missing values generated)
(5,098 real changes made)
(4,831 real changes made)
(9,929 real changes made)
(11,444 real changes made)
(7,854 missing values generated)
(9,929 real changes made)
(5,098 real changes made)
(7,857 real changes made, 7,857 to missing)
(7,857 missing values generated)
(17,783 missing values generated)
(5,051 real changes made)
(4,875 real changes made)
(5,051 real changes made)
(4,875 real changes made)
(6,345 real changes made)
(17,783 missing values generated)
(5,051 real changes made)
(4,875 real changes made)
(9,926 real changes made)
(11,438 real changes made)
(7,857 missing values generated)
(9,926 real changes made)
(5,051 real changes made)
(7,850 real changes made, 7,850 to missing)
(7,850 missing values generated)
(17,783 missing values generated)
(5,062 real changes made)
(4,871 real changes made)
(5,062 real changes made)
(4,871 real changes made)
(6,267 real changes made)
(17,783 missing values generated)
(5,062 real changes made)
(4,871 real changes made)
(9,933 real changes made)
(11,516 real changes made)
(7,850 missing values generated)
(9,933 real changes made)
(5,062 real changes made)
(7,898 real changes made, 7,898 to missing)
(7,898 missing values generated)
(17,783 missing values generated)
(5,116 real changes made)
(4,769 real changes made)
(5,116 real changes made)
(4,769 real changes made)
(6,184 real changes made)
(17,783 missing values generated)
(5,116 real changes made)
(4,769 real changes made)
(9,885 real changes made)
(11,599 real changes made)
(7,898 missing values generated)
(9,885 real changes made)
(5,116 real changes made)
(7,862 real changes made, 7,862 to missing)
(7,862 missing values generated)
(17,783 missing values generated)
(5,104 real changes made)
(4,817 real changes made)
(5,104 real changes made)
(4,817 real changes made)
(6,249 real changes made)
(17,783 missing values generated)
(5,104 real changes made)
(4,817 real changes made)
(9,921 real changes made)
(11,534 real changes made)
(7,862 missing values generated)
(9,921 real changes made)
(5,104 real changes made)
(7,738 real changes made, 7,738 to missing)
(7,738 missing values generated)
(17,783 missing values generated)
(5,191 real changes made)
(4,854 real changes made)
(5,191 real changes made)
(4,854 real changes made)
(6,420 real changes made)
(17,783 missing values generated)
(5,191 real changes made)
(4,854 real changes made)
(10,045 real changes made)
(11,363 real changes made)
(7,738 missing values generated)
(10,045 real changes made)
(5,191 real changes made)
(7,835 real changes made, 7,835 to missing)
(7,835 missing values generated)
(17,783 missing values generated)
(5,100 real changes made)
(4,848 real changes made)
(5,100 real changes made)
(4,848 real changes made)
(6,297 real changes made)
(17,783 missing values generated)
(5,100 real changes made)
(4,848 real changes made)
(9,948 real changes made)
(11,486 real changes made)
(7,835 missing values generated)
(9,948 real changes made)
(5,100 real changes made)
(7,680 real changes made, 7,680 to missing)
(7,680 missing values generated)
(17,783 missing values generated)
(5,180 real changes made)
(4,923 real changes made)
(5,180 real changes made)
(4,923 real changes made)
(6,447 real changes made)
(17,783 missing values generated)
(5,180 real changes made)
(4,923 real changes made)
(10,103 real changes made)
(11,336 real changes made)
(7,680 missing values generated)
(10,103 real changes made)
(5,180 real changes made)
(7,789 real changes made, 7,789 to missing)
(7,789 missing values generated)
(17,783 missing values generated)
(5,181 real changes made)
(4,813 real changes made)
(5,181 real changes made)
(4,813 real changes made)
(6,342 real changes made)
(17,783 missing values generated)
(5,181 real changes made)
(4,813 real changes made)
(9,994 real changes made)
(11,441 real changes made)
(7,789 missing values generated)
(9,994 real changes made)
(5,181 real changes made)
(7,813 real changes made, 7,813 to missing)
(7,813 missing values generated)
(17,783 missing values generated)
(5,135 real changes made)
(4,835 real changes made)
(5,135 real changes made)
(4,835 real changes made)
(6,304 real changes made)
(17,783 missing values generated)
(5,135 real changes made)
(4,835 real changes made)
(9,970 real changes made)
(11,479 real changes made)
(7,813 missing values generated)
(9,970 real changes made)
(5,135 real changes made)
(7,822 real changes made, 7,822 to missing)
(7,822 missing values generated)
(17,783 missing values generated)
(5,080 real changes made)
(4,881 real changes made)
(5,080 real changes made)
(4,881 real changes made)
(6,319 real changes made)
(17,783 missing values generated)
(5,080 real changes made)
(4,881 real changes made)
(9,961 real changes made)
(11,464 real changes made)
(7,822 missing values generated)
(9,961 real changes made)
(5,080 real changes made)
(7,801 real changes made, 7,801 to missing)
(7,801 missing values generated)
(17,783 missing values generated)
(5,160 real changes made)
(4,822 real changes made)
(5,160 real changes made)
(4,822 real changes made)
(6,262 real changes made)
(17,783 missing values generated)
(5,160 real changes made)
(4,822 real changes made)
(9,982 real changes made)
(11,521 real changes made)
(7,801 missing values generated)
(9,982 real changes made)
(5,160 real changes made)
(7,851 real changes made, 7,851 to missing)
(7,851 missing values generated)
(17,783 missing values generated)
(5,045 real changes made)
(4,887 real changes made)
(5,045 real changes made)
(4,887 real changes made)
(6,213 real changes made)
(17,783 missing values generated)
(5,045 real changes made)
(4,887 real changes made)
(9,932 real changes made)
(11,570 real changes made)
(7,851 missing values generated)
(9,932 real changes made)
(5,045 real changes made)
(7,803 real changes made, 7,803 to missing)
(7,803 missing values generated)
(17,783 missing values generated)
(5,120 real changes made)
(4,860 real changes made)
(5,120 real changes made)
(4,860 real changes made)
(6,343 real changes made)
(17,783 missing values generated)
(5,120 real changes made)
(4,860 real changes made)
(9,980 real changes made)
(11,440 real changes made)
(7,803 missing values generated)
(9,980 real changes made)
(5,120 real changes made)
(7,819 real changes made, 7,819 to missing)
(7,819 missing values generated)
(17,783 missing values generated)
(5,064 real changes made)
(4,900 real changes made)
(5,064 real changes made)
(4,900 real changes made)
(6,359 real changes made)
(17,783 missing values generated)
(5,064 real changes made)
(4,900 real changes made)
(9,964 real changes made)
(11,424 real changes made)
(7,819 missing values generated)
(9,964 real changes made)
(5,064 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(17,783 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr20
> 22 may2022 jun2022 jul2022 aug2022 sep2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. drop if baseline_egfr <15
  4. drop egfr_baseline_creatinine_`x'
  5. }
(372 real changes made)
(0 observations deleted)
(363 real changes made)
(0 observations deleted)
(371 real changes made)
(0 observations deleted)
(390 real changes made)
(0 observations deleted)
(351 real changes made)
(0 observations deleted)
(342 real changes made)
(0 observations deleted)
(351 real changes made)
(0 observations deleted)
(364 real changes made)
(0 observations deleted)
(317 real changes made)
(0 observations deleted)
(342 real changes made)
(0 observations deleted)
(352 real changes made)
(0 observations deleted)
(292 real changes made)
(0 observations deleted)
(322 real changes made)
(0 observations deleted)
(339 real changes made)
(0 observations deleted)
(320 real changes made)
(0 observations deleted)
(291 real changes made)
(0 observations deleted)
(322 real changes made)
(0 observations deleted)
(312 real changes made)
(0 observations deleted)
(297 real changes made)
(0 observations deleted)
(301 real changes made)
(0 observations deleted)
(267 real changes made)
(0 observations deleted)
(286 real changes made)
(0 observations deleted)
(313 real changes made)
(0 observations deleted)
(266 real changes made)
(0 observations deleted)
(289 real changes made)
(0 observations deleted)
(284 real changes made)
(0 observations deleted)
(270 real changes made)
(0 observations deleted)
(259 real changes made)
(0 observations deleted)
(255 real changes made)
(0 observations deleted)
(256 real changes made)
(0 observations deleted)
(248 real changes made)
(0 observations deleted)
(242 real changes made)
(0 observations deleted)

. drop baseline_egfr

. drop covid_date_string

. 
. * COVID-19 death
. drop if deceased==1
(1,810 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        212        1.33        1.33
         19 |        196        1.23        2.55
         20 |        266        1.67        4.22
         21 |        246        1.54        5.76
         22 |        276        1.73        7.49
         23 |        241        1.51        9.00
         24 |        263        1.65       10.64
         25 |        269        1.68       12.33
         26 |        273        1.71       14.04
         27 |        261        1.63       15.67
         28 |        285        1.78       17.45
         29 |        251        1.57       19.03
         30 |        256        1.60       20.63
         31 |        279        1.75       22.38
         32 |        284        1.78       24.15
         33 |        241        1.51       25.66
         34 |        284        1.78       27.44
         35 |        278        1.74       29.18
         36 |        238        1.49       30.67
         37 |        269        1.68       32.35
         38 |        252        1.58       33.93
         39 |        238        1.49       35.42
         40 |        240        1.50       36.92
         41 |        240        1.50       38.43
         42 |        270        1.69       40.12
         43 |        235        1.47       41.59
         44 |        258        1.62       43.20
         45 |        243        1.52       44.73
         46 |        260        1.63       46.35
         47 |        266        1.67       48.02
         48 |        282        1.77       49.78
         49 |        285        1.78       51.57
         50 |        276        1.73       53.30
         51 |        306        1.92       55.21
         52 |        273        1.71       56.92
         53 |        296        1.85       58.77
         54 |        291        1.82       60.60
         55 |        276        1.73       62.32
         56 |        280        1.75       64.08
         57 |        261        1.63       65.71
         58 |        249        1.56       67.27
         59 |        285        1.78       69.05
         60 |        236        1.48       70.53
         61 |        249        1.56       72.09
         62 |        219        1.37       73.46
         63 |        241        1.51       74.97
         64 |        231        1.45       76.42
         65 |        205        1.28       77.70
         66 |        210        1.31       79.01
         67 |        224        1.40       80.42
         68 |        211        1.32       81.74
         69 |        186        1.16       82.90
         70 |        200        1.25       84.15
         71 |        189        1.18       85.34
         72 |        219        1.37       86.71
         73 |        196        1.23       87.94
         74 |        190        1.19       89.13
         75 |        141        0.88       90.01
         76 |        152        0.95       90.96
         77 |        136        0.85       91.81
         78 |        143        0.90       92.71
         79 |        120        0.75       93.46
         80 |        109        0.68       94.14
         81 |        108        0.68       94.82
         82 |        113        0.71       95.52
         83 |        107        0.67       96.19
         84 |        113        0.71       96.90
         85 |         63        0.39       97.30
         86 |         61        0.38       97.68
         87 |         57        0.36       98.03
         88 |         70        0.44       98.47
         89 |         55        0.34       98.82
         90 |         24        0.15       98.97
         91 |         28        0.18       99.14
         92 |         31        0.19       99.34
         93 |         28        0.18       99.51
         94 |         26        0.16       99.67
         95 |         13        0.08       99.76
         96 |          6        0.04       99.79
         97 |          7        0.04       99.84
         98 |          7        0.04       99.88
         99 |         12        0.08       99.96
        100 |          2        0.01       99.97
        101 |          1        0.01       99.97
        105 |          1        0.01       99.98
        106 |          1        0.01       99.99
        107 |          1        0.01       99.99
        109 |          1        0.01      100.00
------------+-----------------------------------
      Total |     15,973      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        794        4.97        4.97
          1 |      3,020       18.91       23.88
          2 |      2,984       18.68       42.56
          3 |      3,131       19.60       62.16
          4 |      3,012       18.86       81.02
          5 |      3,032       18.98      100.00
------------+-----------------------------------
      Total |     15,973      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      8,191       51.28       51.28
       Male |      7,782       48.72      100.00
------------+-----------------------------------
      Total |     15,973      100.00

. tab covid_month

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |        604        3.78        3.78
    apr2021 |        506        3.17        6.95
    apr2022 |        448        2.80        9.75
    aug2020 |        586        3.67       13.42
    aug2021 |        475        2.97       16.40
    aug2022 |        396        2.48       18.88
    dec2020 |        550        3.44       22.32
    dec2021 |        470        2.94       25.26
    feb2020 |        588        3.68       28.94
    feb2021 |        499        3.12       32.07
    feb2022 |        431        2.70       34.76
    jan2021 |        473        2.96       37.73
    jan2022 |        435        2.72       40.45
    jul2020 |        568        3.56       44.01
    jul2021 |        534        3.34       47.35
    jul2022 |        393        2.46       49.81
    jun2020 |        568        3.56       53.37
    jun2021 |        524        3.28       56.65
    jun2022 |        427        2.67       59.32
    mar2020 |        565        3.54       62.86
    mar2021 |        539        3.37       66.23
    mar2022 |        419        2.62       68.85
    may2020 |        624        3.91       72.76
    may2021 |        497        3.11       75.87
    may2022 |        416        2.60       78.48
    nov2020 |        550        3.44       81.92
    nov2021 |        482        3.02       84.94
    oct2020 |        552        3.46       88.39
    oct2021 |        454        2.84       91.24
    sep2020 |        567        3.55       94.78
    sep2021 |        476        2.98       97.76
    sep2022 |        357        2.24      100.00
------------+-----------------------------------
      Total |     15,973      100.00

. 
. export delimited using "./output/covid_matching.csv", replace
(note: file ./output/covid_matching.csv not found)
file ./output/covid_matching.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_matching.log
  log type:  text
 closed on:  25 Oct 2022, 21:49:43
-------------------------------------------------------------------------------
