-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_matching.log
  log type:  text
 opened on:  23 Sep 2022, 20:31:10

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames
> (1) case(preserve) 
(46 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,618 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,954 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,849 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,761 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,728 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,022 real changes made, 14,022 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,022 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,090 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,174 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,894 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,174 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,894 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,369 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,090 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,174 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,894 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(18,068 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,721 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,022 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(18,068 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,174 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(17,678 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(17,678 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(6,390 real changes made, 6,390 to missing)
(6,390 missing values generated)
(14,412 missing values generated)
(4,072 real changes made)
(3,950 real changes made)
(4,072 real changes made)
(3,950 real changes made)
(5,103 real changes made)
(14,412 missing values generated)
(4,072 real changes made)
(3,950 real changes made)
(8,022 real changes made)
(9,309 real changes made)
(6,390 missing values generated)
(8,022 real changes made)
(4,072 real changes made)
(6,313 real changes made, 6,313 to missing)
(6,313 missing values generated)
(14,412 missing values generated)
(4,090 real changes made)
(4,009 real changes made)
(4,090 real changes made)
(4,009 real changes made)
(5,187 real changes made)
(14,412 missing values generated)
(4,090 real changes made)
(4,009 real changes made)
(8,099 real changes made)
(9,225 real changes made)
(6,313 missing values generated)
(8,099 real changes made)
(4,090 real changes made)
(6,303 real changes made, 6,303 to missing)
(6,303 missing values generated)
(14,412 missing values generated)
(4,107 real changes made)
(4,002 real changes made)
(4,107 real changes made)
(4,002 real changes made)
(5,153 real changes made)
(14,412 missing values generated)
(4,107 real changes made)
(4,002 real changes made)
(8,109 real changes made)
(9,259 real changes made)
(6,303 missing values generated)
(8,109 real changes made)
(4,107 real changes made)
(6,339 real changes made, 6,339 to missing)
(6,339 missing values generated)
(14,412 missing values generated)
(4,122 real changes made)
(3,951 real changes made)
(4,122 real changes made)
(3,951 real changes made)
(5,130 real changes made)
(14,412 missing values generated)
(4,122 real changes made)
(3,951 real changes made)
(8,073 real changes made)
(9,282 real changes made)
(6,339 missing values generated)
(8,073 real changes made)
(4,122 real changes made)
(6,308 real changes made, 6,308 to missing)
(6,308 missing values generated)
(14,412 missing values generated)
(4,125 real changes made)
(3,979 real changes made)
(4,125 real changes made)
(3,979 real changes made)
(5,139 real changes made)
(14,412 missing values generated)
(4,125 real changes made)
(3,979 real changes made)
(8,104 real changes made)
(9,273 real changes made)
(6,308 missing values generated)
(8,104 real changes made)
(4,125 real changes made)
(6,366 real changes made, 6,366 to missing)
(6,366 missing values generated)
(14,412 missing values generated)
(4,122 real changes made)
(3,924 real changes made)
(4,122 real changes made)
(3,924 real changes made)
(5,147 real changes made)
(14,412 missing values generated)
(4,122 real changes made)
(3,924 real changes made)
(8,046 real changes made)
(9,265 real changes made)
(6,366 missing values generated)
(8,046 real changes made)
(4,122 real changes made)
(6,373 real changes made, 6,373 to missing)
(6,373 missing values generated)
(14,412 missing values generated)
(4,116 real changes made)
(3,923 real changes made)
(4,116 real changes made)
(3,923 real changes made)
(5,110 real changes made)
(14,412 missing values generated)
(4,116 real changes made)
(3,923 real changes made)
(8,039 real changes made)
(9,302 real changes made)
(6,373 missing values generated)
(8,039 real changes made)
(4,116 real changes made)
(6,376 real changes made, 6,376 to missing)
(6,376 missing values generated)
(14,412 missing values generated)
(4,160 real changes made)
(3,876 real changes made)
(4,160 real changes made)
(3,876 real changes made)
(5,081 real changes made)
(14,412 missing values generated)
(4,160 real changes made)
(3,876 real changes made)
(8,036 real changes made)
(9,331 real changes made)
(6,376 missing values generated)
(8,036 real changes made)
(4,160 real changes made)
(6,282 real changes made, 6,282 to missing)
(6,282 missing values generated)
(14,412 missing values generated)
(4,141 real changes made)
(3,989 real changes made)
(4,141 real changes made)
(3,989 real changes made)
(5,129 real changes made)
(14,412 missing values generated)
(4,141 real changes made)
(3,989 real changes made)
(8,130 real changes made)
(9,283 real changes made)
(6,282 missing values generated)
(8,130 real changes made)
(4,141 real changes made)
(6,463 real changes made, 6,463 to missing)
(6,463 missing values generated)
(14,412 missing values generated)
(3,994 real changes made)
(3,955 real changes made)
(3,994 real changes made)
(3,955 real changes made)
(4,993 real changes made)
(14,412 missing values generated)
(3,994 real changes made)
(3,955 real changes made)
(7,949 real changes made)
(9,419 real changes made)
(6,463 missing values generated)
(7,949 real changes made)
(3,994 real changes made)
(6,315 real changes made, 6,315 to missing)
(6,315 missing values generated)
(14,412 missing values generated)
(4,119 real changes made)
(3,978 real changes made)
(4,119 real changes made)
(3,978 real changes made)
(5,082 real changes made)
(14,412 missing values generated)
(4,119 real changes made)
(3,978 real changes made)
(8,097 real changes made)
(9,330 real changes made)
(6,315 missing values generated)
(8,097 real changes made)
(4,119 real changes made)
(6,335 real changes made, 6,335 to missing)
(6,335 missing values generated)
(14,412 missing values generated)
(4,091 real changes made)
(3,986 real changes made)
(4,091 real changes made)
(3,986 real changes made)
(5,161 real changes made)
(14,412 missing values generated)
(4,091 real changes made)
(3,986 real changes made)
(8,077 real changes made)
(9,251 real changes made)
(6,335 missing values generated)
(8,077 real changes made)
(4,091 real changes made)
(6,326 real changes made, 6,326 to missing)
(6,326 missing values generated)
(14,412 missing values generated)
(4,097 real changes made)
(3,989 real changes made)
(4,097 real changes made)
(3,989 real changes made)
(5,123 real changes made)
(14,412 missing values generated)
(4,097 real changes made)
(3,989 real changes made)
(8,086 real changes made)
(9,289 real changes made)
(6,326 missing values generated)
(8,086 real changes made)
(4,097 real changes made)
(6,417 real changes made, 6,417 to missing)
(6,417 missing values generated)
(14,412 missing values generated)
(4,103 real changes made)
(3,892 real changes made)
(4,103 real changes made)
(3,892 real changes made)
(5,120 real changes made)
(14,412 missing values generated)
(4,103 real changes made)
(3,892 real changes made)
(7,995 real changes made)
(9,292 real changes made)
(6,417 missing values generated)
(7,995 real changes made)
(4,103 real changes made)
(6,321 real changes made, 6,321 to missing)
(6,321 missing values generated)
(14,412 missing values generated)
(4,180 real changes made)
(3,911 real changes made)
(4,180 real changes made)
(3,911 real changes made)
(5,113 real changes made)
(14,412 missing values generated)
(4,180 real changes made)
(3,911 real changes made)
(8,091 real changes made)
(9,299 real changes made)
(6,321 missing values generated)
(8,091 real changes made)
(4,180 real changes made)
(6,390 real changes made, 6,390 to missing)
(6,390 missing values generated)
(14,412 missing values generated)
(4,071 real changes made)
(3,951 real changes made)
(4,071 real changes made)
(3,951 real changes made)
(5,020 real changes made)
(14,412 missing values generated)
(4,071 real changes made)
(3,951 real changes made)
(8,022 real changes made)
(9,392 real changes made)
(6,390 missing values generated)
(8,022 real changes made)
(4,071 real changes made)
(6,279 real changes made, 6,279 to missing)
(6,279 missing values generated)
(14,412 missing values generated)
(4,152 real changes made)
(3,981 real changes made)
(4,152 real changes made)
(3,981 real changes made)
(5,099 real changes made)
(14,412 missing values generated)
(4,152 real changes made)
(3,981 real changes made)
(8,133 real changes made)
(9,313 real changes made)
(6,279 missing values generated)
(8,133 real changes made)
(4,152 real changes made)
(6,325 real changes made, 6,325 to missing)
(6,325 missing values generated)
(14,412 missing values generated)
(4,151 real changes made)
(3,936 real changes made)
(4,151 real changes made)
(3,936 real changes made)
(5,114 real changes made)
(14,412 missing values generated)
(4,151 real changes made)
(3,936 real changes made)
(8,087 real changes made)
(9,298 real changes made)
(6,325 missing values generated)
(8,087 real changes made)
(4,151 real changes made)
(6,358 real changes made, 6,358 to missing)
(6,358 missing values generated)
(14,412 missing values generated)
(4,097 real changes made)
(3,957 real changes made)
(4,097 real changes made)
(3,957 real changes made)
(5,065 real changes made)
(14,412 missing values generated)
(4,097 real changes made)
(3,957 real changes made)
(8,054 real changes made)
(9,347 real changes made)
(6,358 missing values generated)
(8,054 real changes made)
(4,097 real changes made)
(6,375 real changes made, 6,375 to missing)
(6,375 missing values generated)
(14,412 missing values generated)
(4,077 real changes made)
(3,960 real changes made)
(4,077 real changes made)
(3,960 real changes made)
(5,078 real changes made)
(14,412 missing values generated)
(4,077 real changes made)
(3,960 real changes made)
(8,037 real changes made)
(9,334 real changes made)
(6,375 missing values generated)
(8,037 real changes made)
(4,077 real changes made)
(6,326 real changes made, 6,326 to missing)
(6,326 missing values generated)
(14,412 missing values generated)
(4,145 real changes made)
(3,941 real changes made)
(4,145 real changes made)
(3,941 real changes made)
(5,189 real changes made)
(14,412 missing values generated)
(4,145 real changes made)
(3,941 real changes made)
(8,086 real changes made)
(9,223 real changes made)
(6,326 missing values generated)
(8,086 real changes made)
(4,145 real changes made)
(6,377 real changes made, 6,377 to missing)
(6,377 missing values generated)
(14,412 missing values generated)
(4,062 real changes made)
(3,973 real changes made)
(4,062 real changes made)
(3,973 real changes made)
(5,105 real changes made)
(14,412 missing values generated)
(4,062 real changes made)
(3,973 real changes made)
(8,035 real changes made)
(9,307 real changes made)
(6,377 missing values generated)
(8,035 real changes made)
(4,062 real changes made)
(6,326 real changes made, 6,326 to missing)
(6,326 missing values generated)
(14,412 missing values generated)
(4,116 real changes made)
(3,970 real changes made)
(4,116 real changes made)
(3,970 real changes made)
(5,100 real changes made)
(14,412 missing values generated)
(4,116 real changes made)
(3,970 real changes made)
(8,086 real changes made)
(9,312 real changes made)
(6,326 missing values generated)
(8,086 real changes made)
(4,116 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(14,412 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. drop if baseline_egfr <15
  4. drop egfr_baseline_creatinine_`x'
  5. }
(353 real changes made)
(0 observations deleted)
(409 real changes made)
(0 observations deleted)
(404 real changes made)
(0 observations deleted)
(438 real changes made)
(0 observations deleted)
(378 real changes made)
(0 observations deleted)
(413 real changes made)
(0 observations deleted)
(365 real changes made)
(0 observations deleted)
(365 real changes made)
(0 observations deleted)
(366 real changes made)
(0 observations deleted)
(344 real changes made)
(0 observations deleted)
(358 real changes made)
(0 observations deleted)
(332 real changes made)
(0 observations deleted)
(292 real changes made)
(0 observations deleted)
(317 real changes made)
(0 observations deleted)
(332 real changes made)
(0 observations deleted)
(351 real changes made)
(0 observations deleted)
(295 real changes made)
(0 observations deleted)
(333 real changes made)
(0 observations deleted)
(296 real changes made)
(0 observations deleted)
(299 real changes made)
(0 observations deleted)
(309 real changes made)
(0 observations deleted)
(263 real changes made)
(0 observations deleted)
(268 real changes made)
(0 observations deleted)
(290 real changes made)
(0 observations deleted)

. drop baseline_egfr

. drop covid_month

. drop covid_date_string

. drop age

. 
. * COVID-19 death
. drop if deceased==1
(1,460 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. replace imd = imd + 1
(12,952 real changes made)

. drop imd_o

. recode imd 5=1 4=2 3=3 2=4 1=5 .=.
(imd: 11601 changes made)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" 

. label values imd imd

. label var imd "Index of Multiple Deprivation"

. noi di "DROPPING IF NO IMD" 
DROPPING IF NO IMD

. drop if imd>=.
(0 observations deleted)

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. export delimited using "./output/covid_matching.csv", replace
(note: file ./output/covid_matching.csv not found)
file ./output/covid_matching.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_matching.log
  log type:  text
 closed on:  23 Sep 2022, 20:31:12
-------------------------------------------------------------------------------
