-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2020.log
  log type:  text
 opened on:  27 Oct 2022, 12:11:04

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames
> (1) case(preserve) 
(53 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,624 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosi
> s
. drop if has_follow_up==0
(1,951 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,861 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,751 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,687 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb20
> 20, 20, 3000)
(14,099 real changes made, 14,099 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,099 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,126 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,264 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,763 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 329  if male==0
(9,264 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.
> 411  if male==1
(8,763 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb202
> 0<1
(11,551 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,126 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 7 if male==0
(9,264 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.
> 9 if male==1
(8,763 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.
> 209
(18,027 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb202
> 0>1
(20,575 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_ba
> seline_creatinine_feb2020*141
(14,099 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(
> 0.993^age)
(18,027 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1
> .018 if male==0
(9,264 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine upda
> ted monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(14,206 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(14,206 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 /
> //
>                                                                              
>                    baseline_creatinine_apr2020 ///
>                                                                              
>                    baseline_creatinine_may2020 ///
>                                                                              
>                    baseline_creatinine_jun2020 ///
>                                                                              
>                    baseline_creatinine_jul2020 ///
>                                                                              
>                    baseline_creatinine_aug2020 ///
>                                                                              
>                    baseline_creatinine_sep2020 ///
>                                                                              
>                    baseline_creatinine_oct2020 ///
>                                                                              
>                    baseline_creatinine_nov2020 ///
>                                                                              
>                    baseline_creatinine_dec2020 ///
>                                                                              
>                    baseline_creatinine_jan2021 ///
>                                                                              
>                    baseline_creatinine_feb2021 ///
>                                                                              
>                    baseline_creatinine_mar2021 ///
>                                                                              
>                    baseline_creatinine_apr2021 ///
>                                                                              
>                    baseline_creatinine_may2021 ///
>                                                                              
>                    baseline_creatinine_jun2021 ///
>                                                                              
>                    baseline_creatinine_jul2021 ///
>                                                                              
>                    baseline_creatinine_aug2021 ///
>                                                                              
>                    baseline_creatinine_sep2021 ///
>                                                                              
>                    baseline_creatinine_oct2021 ///
>                                                                              
>                    baseline_creatinine_nov2021 ///
>                                                                              
>                    baseline_creatinine_dec2021 ///
>                                                                              
>                    baseline_creatinine_jan2022 ///
>                                                                              
>                    baseline_creatinine_feb2022 ///
>                                                                              
>                    baseline_creatinine_mar2022 ///
>                                                                              
>                    baseline_creatinine_apr2022 ///
>                                                                              
>                    baseline_creatinine_may2022 ///
>                                                                              
>                    baseline_creatinine_jun2022 ///
>                                                                              
>                    baseline_creatinine_jul2022 ///
>                                                                              
>                    baseline_creatinine_aug2022 ///
>                                                                              
>                    baseline_creatinine_sep2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine
> _monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.
> 4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_month
> ly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_
> monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_mont
> hly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_month
> ly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_
> monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'
> *max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_mon
> thly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(7,906 real changes made, 7,906 to missing)
(7,906 missing values generated)
(17,920 missing values generated)
(5,259 real changes made)
(4,755 real changes made)
(5,259 real changes made)
(4,755 real changes made)
(6,321 real changes made)
(17,920 missing values generated)
(5,259 real changes made)
(4,755 real changes made)
(10,014 real changes made)
(11,599 real changes made)
(7,906 missing values generated)
(10,014 real changes made)
(5,259 real changes made)
(7,925 real changes made, 7,925 to missing)
(7,925 missing values generated)
(17,920 missing values generated)
(5,177 real changes made)
(4,818 real changes made)
(5,177 real changes made)
(4,818 real changes made)
(6,328 real changes made)
(17,920 missing values generated)
(5,177 real changes made)
(4,818 real changes made)
(9,995 real changes made)
(11,592 real changes made)
(7,925 missing values generated)
(9,995 real changes made)
(5,177 real changes made)
(7,845 real changes made, 7,845 to missing)
(7,845 missing values generated)
(17,920 missing values generated)
(5,267 real changes made)
(4,808 real changes made)
(5,267 real changes made)
(4,808 real changes made)
(6,331 real changes made)
(17,920 missing values generated)
(5,267 real changes made)
(4,808 real changes made)
(10,075 real changes made)
(11,589 real changes made)
(7,845 missing values generated)
(10,075 real changes made)
(5,267 real changes made)
(7,885 real changes made, 7,885 to missing)
(7,885 missing values generated)
(17,920 missing values generated)
(5,229 real changes made)
(4,806 real changes made)
(5,229 real changes made)
(4,806 real changes made)
(6,432 real changes made)
(17,920 missing values generated)
(5,229 real changes made)
(4,806 real changes made)
(10,035 real changes made)
(11,488 real changes made)
(7,885 missing values generated)
(10,035 real changes made)
(5,229 real changes made)
(7,936 real changes made, 7,936 to missing)
(7,936 missing values generated)
(17,920 missing values generated)
(5,218 real changes made)
(4,766 real changes made)
(5,218 real changes made)
(4,766 real changes made)
(6,338 real changes made)
(17,920 missing values generated)
(5,218 real changes made)
(4,766 real changes made)
(9,984 real changes made)
(11,582 real changes made)
(7,936 missing values generated)
(9,984 real changes made)
(5,218 real changes made)
(7,946 real changes made, 7,946 to missing)
(7,946 missing values generated)
(17,920 missing values generated)
(5,155 real changes made)
(4,819 real changes made)
(5,155 real changes made)
(4,819 real changes made)
(6,389 real changes made)
(17,920 missing values generated)
(5,155 real changes made)
(4,819 real changes made)
(9,974 real changes made)
(11,531 real changes made)
(7,946 missing values generated)
(9,974 real changes made)
(5,155 real changes made)
(7,840 real changes made, 7,840 to missing)
(7,840 missing values generated)
(17,920 missing values generated)
(5,271 real changes made)
(4,809 real changes made)
(5,271 real changes made)
(4,809 real changes made)
(6,392 real changes made)
(17,920 missing values generated)
(5,271 real changes made)
(4,809 real changes made)
(10,080 real changes made)
(11,528 real changes made)
(7,840 missing values generated)
(10,080 real changes made)
(5,271 real changes made)
(7,898 real changes made, 7,898 to missing)
(7,898 missing values generated)
(17,920 missing values generated)
(5,191 real changes made)
(4,831 real changes made)
(5,191 real changes made)
(4,831 real changes made)
(6,413 real changes made)
(17,920 missing values generated)
(5,191 real changes made)
(4,831 real changes made)
(10,022 real changes made)
(11,507 real changes made)
(7,898 missing values generated)
(10,022 real changes made)
(5,191 real changes made)
(7,787 real changes made, 7,787 to missing)
(7,787 missing values generated)
(17,920 missing values generated)
(5,314 real changes made)
(4,819 real changes made)
(5,314 real changes made)
(4,819 real changes made)
(6,442 real changes made)
(17,920 missing values generated)
(5,314 real changes made)
(4,819 real changes made)
(10,133 real changes made)
(11,478 real changes made)
(7,787 missing values generated)
(10,133 real changes made)
(5,314 real changes made)
(7,906 real changes made, 7,906 to missing)
(7,906 missing values generated)
(17,920 missing values generated)
(5,238 real changes made)
(4,776 real changes made)
(5,238 real changes made)
(4,776 real changes made)
(6,312 real changes made)
(17,920 missing values generated)
(5,238 real changes made)
(4,776 real changes made)
(10,014 real changes made)
(11,608 real changes made)
(7,906 missing values generated)
(10,014 real changes made)
(5,238 real changes made)
(7,890 real changes made, 7,890 to missing)
(7,890 missing values generated)
(17,920 missing values generated)
(5,269 real changes made)
(4,761 real changes made)
(5,269 real changes made)
(4,761 real changes made)
(6,446 real changes made)
(17,920 missing values generated)
(5,269 real changes made)
(4,761 real changes made)
(10,030 real changes made)
(11,474 real changes made)
(7,890 missing values generated)
(10,030 real changes made)
(5,269 real changes made)
(7,922 real changes made, 7,922 to missing)
(7,922 missing values generated)
(17,920 missing values generated)
(5,193 real changes made)
(4,805 real changes made)
(5,193 real changes made)
(4,805 real changes made)
(6,388 real changes made)
(17,920 missing values generated)
(5,193 real changes made)
(4,805 real changes made)
(9,998 real changes made)
(11,532 real changes made)
(7,922 missing values generated)
(9,998 real changes made)
(5,193 real changes made)
(7,858 real changes made, 7,858 to missing)
(7,858 missing values generated)
(17,920 missing values generated)
(5,198 real changes made)
(4,864 real changes made)
(5,198 real changes made)
(4,864 real changes made)
(6,404 real changes made)
(17,920 missing values generated)
(5,198 real changes made)
(4,864 real changes made)
(10,062 real changes made)
(11,516 real changes made)
(7,858 missing values generated)
(10,062 real changes made)
(5,198 real changes made)
(7,814 real changes made, 7,814 to missing)
(7,814 missing values generated)
(17,920 missing values generated)
(5,246 real changes made)
(4,860 real changes made)
(5,246 real changes made)
(4,860 real changes made)
(6,430 real changes made)
(17,920 missing values generated)
(5,246 real changes made)
(4,860 real changes made)
(10,106 real changes made)
(11,490 real changes made)
(7,814 missing values generated)
(10,106 real changes made)
(5,246 real changes made)
(7,891 real changes made, 7,891 to missing)
(7,891 missing values generated)
(17,920 missing values generated)
(5,145 real changes made)
(4,884 real changes made)
(5,145 real changes made)
(4,884 real changes made)
(6,345 real changes made)
(17,920 missing values generated)
(5,145 real changes made)
(4,884 real changes made)
(10,029 real changes made)
(11,575 real changes made)
(7,891 missing values generated)
(10,029 real changes made)
(5,145 real changes made)
(7,887 real changes made, 7,887 to missing)
(7,887 missing values generated)
(17,920 missing values generated)
(5,210 real changes made)
(4,823 real changes made)
(5,210 real changes made)
(4,823 real changes made)
(6,435 real changes made)
(17,920 missing values generated)
(5,210 real changes made)
(4,823 real changes made)
(10,033 real changes made)
(11,485 real changes made)
(7,887 missing values generated)
(10,033 real changes made)
(5,210 real changes made)
(7,800 real changes made, 7,800 to missing)
(7,800 missing values generated)
(17,920 missing values generated)
(5,261 real changes made)
(4,859 real changes made)
(5,261 real changes made)
(4,859 real changes made)
(6,505 real changes made)
(17,920 missing values generated)
(5,261 real changes made)
(4,859 real changes made)
(10,120 real changes made)
(11,415 real changes made)
(7,800 missing values generated)
(10,120 real changes made)
(5,261 real changes made)
(7,799 real changes made, 7,799 to missing)
(7,799 missing values generated)
(17,920 missing values generated)
(5,223 real changes made)
(4,898 real changes made)
(5,223 real changes made)
(4,898 real changes made)
(6,462 real changes made)
(17,920 missing values generated)
(5,223 real changes made)
(4,898 real changes made)
(10,121 real changes made)
(11,458 real changes made)
(7,799 missing values generated)
(10,121 real changes made)
(5,223 real changes made)
(7,853 real changes made, 7,853 to missing)
(7,853 missing values generated)
(17,920 missing values generated)
(5,238 real changes made)
(4,829 real changes made)
(5,238 real changes made)
(4,829 real changes made)
(6,469 real changes made)
(17,920 missing values generated)
(5,238 real changes made)
(4,829 real changes made)
(10,067 real changes made)
(11,451 real changes made)
(7,853 missing values generated)
(10,067 real changes made)
(5,238 real changes made)
(7,881 real changes made, 7,881 to missing)
(7,881 missing values generated)
(17,920 missing values generated)
(5,194 real changes made)
(4,845 real changes made)
(5,194 real changes made)
(4,845 real changes made)
(6,384 real changes made)
(17,920 missing values generated)
(5,194 real changes made)
(4,845 real changes made)
(10,039 real changes made)
(11,536 real changes made)
(7,881 missing values generated)
(10,039 real changes made)
(5,194 real changes made)
(7,907 real changes made, 7,907 to missing)
(7,907 missing values generated)
(17,920 missing values generated)
(5,205 real changes made)
(4,808 real changes made)
(5,205 real changes made)
(4,808 real changes made)
(6,297 real changes made)
(17,920 missing values generated)
(5,205 real changes made)
(4,808 real changes made)
(10,013 real changes made)
(11,623 real changes made)
(7,907 missing values generated)
(10,013 real changes made)
(5,205 real changes made)
(7,914 real changes made, 7,914 to missing)
(7,914 missing values generated)
(17,920 missing values generated)
(5,163 real changes made)
(4,843 real changes made)
(5,163 real changes made)
(4,843 real changes made)
(6,353 real changes made)
(17,920 missing values generated)
(5,163 real changes made)
(4,843 real changes made)
(10,006 real changes made)
(11,567 real changes made)
(7,914 missing values generated)
(10,006 real changes made)
(5,163 real changes made)
(7,871 real changes made, 7,871 to missing)
(7,871 missing values generated)
(17,920 missing values generated)
(5,227 real changes made)
(4,822 real changes made)
(5,227 real changes made)
(4,822 real changes made)
(6,470 real changes made)
(17,920 missing values generated)
(5,227 real changes made)
(4,822 real changes made)
(10,049 real changes made)
(11,450 real changes made)
(7,871 missing values generated)
(10,049 real changes made)
(5,227 real changes made)
(7,979 real changes made, 7,979 to missing)
(7,979 missing values generated)
(17,920 missing values generated)
(5,196 real changes made)
(4,745 real changes made)
(5,196 real changes made)
(4,745 real changes made)
(6,305 real changes made)
(17,920 missing values generated)
(5,196 real changes made)
(4,745 real changes made)
(9,941 real changes made)
(11,615 real changes made)
(7,979 missing values generated)
(9,941 real changes made)
(5,196 real changes made)
(7,941 real changes made, 7,941 to missing)
(7,941 missing values generated)
(17,920 missing values generated)
(5,197 real changes made)
(4,782 real changes made)
(5,197 real changes made)
(4,782 real changes made)
(6,453 real changes made)
(17,920 missing values generated)
(5,197 real changes made)
(4,782 real changes made)
(9,979 real changes made)
(11,467 real changes made)
(7,941 missing values generated)
(9,979 real changes made)
(5,197 real changes made)
(7,809 real changes made, 7,809 to missing)
(7,809 missing values generated)
(17,920 missing values generated)
(5,254 real changes made)
(4,857 real changes made)
(5,254 real changes made)
(4,857 real changes made)
(6,483 real changes made)
(17,920 missing values generated)
(5,254 real changes made)
(4,857 real changes made)
(10,111 real changes made)
(11,437 real changes made)
(7,809 missing values generated)
(10,111 real changes made)
(5,254 real changes made)
(7,952 real changes made, 7,952 to missing)
(7,952 missing values generated)
(17,920 missing values generated)
(5,293 real changes made)
(4,675 real changes made)
(5,293 real changes made)
(4,675 real changes made)
(6,393 real changes made)
(17,920 missing values generated)
(5,293 real changes made)
(4,675 real changes made)
(9,968 real changes made)
(11,527 real changes made)
(7,952 missing values generated)
(9,968 real changes made)
(5,293 real changes made)
(7,971 real changes made, 7,971 to missing)
(7,971 missing values generated)
(17,920 missing values generated)
(5,145 real changes made)
(4,804 real changes made)
(5,145 real changes made)
(4,804 real changes made)
(6,321 real changes made)
(17,920 missing values generated)
(5,145 real changes made)
(4,804 real changes made)
(9,949 real changes made)
(11,599 real changes made)
(7,971 missing values generated)
(9,949 real changes made)
(5,145 real changes made)
(7,884 real changes made, 7,884 to missing)
(7,884 missing values generated)
(17,920 missing values generated)
(5,210 real changes made)
(4,826 real changes made)
(5,210 real changes made)
(4,826 real changes made)
(6,309 real changes made)
(17,920 missing values generated)
(5,210 real changes made)
(4,826 real changes made)
(10,036 real changes made)
(11,611 real changes made)
(7,884 missing values generated)
(10,036 real changes made)
(5,210 real changes made)
(7,897 real changes made, 7,897 to missing)
(7,897 missing values generated)
(17,920 missing values generated)
(5,173 real changes made)
(4,850 real changes made)
(5,173 real changes made)
(4,850 real changes made)
(6,429 real changes made)
(17,920 missing values generated)
(5,173 real changes made)
(4,850 real changes made)
(10,023 real changes made)
(11,491 real changes made)
(7,897 missing values generated)
(10,023 real changes made)
(5,173 real changes made)
(7,959 real changes made, 7,959 to missing)
(7,959 missing values generated)
(17,920 missing values generated)
(5,235 real changes made)
(4,726 real changes made)
(5,235 real changes made)
(4,726 real changes made)
(6,303 real changes made)
(17,920 missing values generated)
(5,235 real changes made)
(4,726 real changes made)
(9,961 real changes made)
(11,617 real changes made)
(7,959 missing values generated)
(9,961 real changes made)
(5,235 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(17,920 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep
> 2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 
> jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr20
> 22 may2022 jun2022 jul2022 aug2022 sep2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. drop if baseline_egfr <15
  4. drop egfr_baseline_creatinine_`x'
  5. }
(356 real changes made)
(0 observations deleted)
(408 real changes made)
(0 observations deleted)
(373 real changes made)
(0 observations deleted)
(340 real changes made)
(0 observations deleted)
(375 real changes made)
(0 observations deleted)
(377 real changes made)
(0 observations deleted)
(354 real changes made)
(0 observations deleted)
(333 real changes made)
(0 observations deleted)
(361 real changes made)
(0 observations deleted)
(338 real changes made)
(0 observations deleted)
(336 real changes made)
(0 observations deleted)
(354 real changes made)
(0 observations deleted)
(315 real changes made)
(0 observations deleted)
(330 real changes made)
(0 observations deleted)
(324 real changes made)
(0 observations deleted)
(286 real changes made)
(0 observations deleted)
(286 real changes made)
(0 observations deleted)
(343 real changes made)
(0 observations deleted)
(315 real changes made)
(0 observations deleted)
(285 real changes made)
(0 observations deleted)
(291 real changes made)
(0 observations deleted)
(290 real changes made)
(0 observations deleted)
(277 real changes made)
(0 observations deleted)
(280 real changes made)
(0 observations deleted)
(217 real changes made)
(0 observations deleted)
(270 real changes made)
(0 observations deleted)
(260 real changes made)
(0 observations deleted)
(261 real changes made)
(0 observations deleted)
(246 real changes made)
(0 observations deleted)
(251 real changes made)
(0 observations deleted)
(265 real changes made)
(0 observations deleted)
(254 real changes made)
(0 observations deleted)

. drop baseline_egfr

. drop covid_date_string

. 
. * COVID-19 death
. drop if deceased==1
(1,823 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab age

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        224        1.39        1.39
         19 |        212        1.32        2.71
         20 |        256        1.59        4.30
         21 |        249        1.55        5.85
         22 |        252        1.57        7.41
         23 |        280        1.74        9.15
         24 |        248        1.54       10.69
         25 |        295        1.83       12.52
         26 |        286        1.78       14.30
         27 |        290        1.80       16.10
         28 |        310        1.93       18.03
         29 |        269        1.67       19.70
         30 |        277        1.72       21.42
         31 |        264        1.64       23.06
         32 |        266        1.65       24.71
         33 |        269        1.67       26.38
         34 |        224        1.39       27.78
         35 |        277        1.72       29.50
         36 |        277        1.72       31.22
         37 |        255        1.58       32.80
         38 |        281        1.75       34.55
         39 |        285        1.77       36.32
         40 |        236        1.47       37.78
         41 |        232        1.44       39.22
         42 |        238        1.48       40.70
         43 |        245        1.52       42.23
         44 |        241        1.50       43.72
         45 |        295        1.83       45.56
         46 |        299        1.86       47.41
         47 |        273        1.70       49.11
         48 |        278        1.73       50.84
         49 |        262        1.63       52.46
         50 |        303        1.88       54.35
         51 |        313        1.94       56.29
         52 |        278        1.73       58.02
         53 |        325        2.02       60.04
         54 |        290        1.80       61.84
         55 |        282        1.75       63.59
         56 |        253        1.57       65.16
         57 |        249        1.55       66.71
         58 |        285        1.77       68.48
         59 |        274        1.70       70.18
         60 |        245        1.52       71.70
         61 |        225        1.40       73.10
         62 |        213        1.32       74.42
         63 |        225        1.40       75.82
         64 |        217        1.35       77.17
         65 |        200        1.24       78.41
         66 |        208        1.29       79.70
         67 |        180        1.12       80.82
         68 |        208        1.29       82.11
         69 |        183        1.14       83.25
         70 |        183        1.14       84.39
         71 |        214        1.33       85.72
         72 |        183        1.14       86.85
         73 |        199        1.24       88.09
         74 |        208        1.29       89.38
         75 |        148        0.92       90.30
         76 |        134        0.83       91.13
         77 |        146        0.91       92.04
         78 |        126        0.78       92.82
         79 |        139        0.86       93.69
         80 |        101        0.63       94.32
         81 |        109        0.68       94.99
         82 |        101        0.63       95.62
         83 |        103        0.64       96.26
         84 |         96        0.60       96.86
         85 |         65        0.40       97.26
         86 |         72        0.45       97.71
         87 |         58        0.36       98.07
         88 |         70        0.43       98.50
         89 |         69        0.43       98.93
         90 |         23        0.14       99.07
         91 |         20        0.12       99.20
         92 |         21        0.13       99.33
         93 |         29        0.18       99.51
         94 |         30        0.19       99.70
         95 |         13        0.08       99.78
         96 |          9        0.06       99.83
         97 |          9        0.06       99.89
         98 |          7        0.04       99.93
         99 |         10        0.06       99.99
        108 |          1        0.01      100.00
------------+-----------------------------------
      Total |     16,097      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        826        5.13        5.13
          1 |      3,057       18.99       24.12
          2 |      3,029       18.82       42.94
          3 |      3,060       19.01       61.95
          4 |      2,979       18.51       80.46
          5 |      3,146       19.54      100.00
------------+-----------------------------------
      Total |     16,097      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      8,392       52.13       52.13
       Male |      7,705       47.87      100.00
------------+-----------------------------------
      Total |     16,097      100.00

. tab covid_month

covid_month |      Freq.     Percent        Cum.
------------+-----------------------------------
    apr2020 |        574        3.57        3.57
    apr2021 |        537        3.34        6.90
    apr2022 |        413        2.57        9.47
    aug2020 |        570        3.54       13.01
    aug2021 |        496        3.08       16.09
    aug2022 |        418        2.60       18.69
    dec2020 |        569        3.53       22.22
    dec2021 |        442        2.75       24.97
    feb2020 |        563        3.50       28.46
    feb2021 |        489        3.04       31.50
    feb2022 |        374        2.32       33.83
    jan2021 |        557        3.46       37.29
    jan2022 |        485        3.01       40.30
    jul2020 |        574        3.57       43.87
    jul2021 |        536        3.33       47.20
    jul2022 |        416        2.58       49.78
    jun2020 |        637        3.96       53.74
    jun2021 |        466        2.89       56.63
    jun2022 |        413        2.57       59.20
    mar2020 |        656        4.08       63.27
    mar2021 |        539        3.35       66.62
    mar2022 |        427        2.65       69.27
    may2020 |        554        3.44       72.72
    may2021 |        476        2.96       75.67
    may2022 |        410        2.55       78.22
    nov2020 |        543        3.37       81.59
    nov2021 |        481        2.99       84.58
    oct2020 |        563        3.50       88.08
    oct2021 |        485        3.01       91.09
    sep2020 |        535        3.32       94.42
    sep2021 |        497        3.09       97.50
    sep2022 |        402        2.50      100.00
------------+-----------------------------------
      Total |     16,097      100.00

. 
. export delimited using "./output/covid_matching_2020.csv", replace
(note: file ./output/covid_matching_2020.csv not found)
file ./output/covid_matching_2020.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/covid_matching_2020.log
  log type:  text
 closed on:  27 Oct 2022, 12:11:06
-------------------------------------------------------------------------------
