------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/covid_matching.log
  log type:  text
 opened on:  19 Oct 2022, 00:08:13

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames(1) case(preserve) 
(encoding automatically selected: ISO-8859-2)
(46 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,647 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosis
. drop if has_follow_up==0
(1,981 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,882 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,744 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,703 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb2020, 20, 3000)
(14,278 real changes made, 14,278 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,278 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(32,043 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.7 if male==0
(9,079 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.9 if male==1
(8,686 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.329  if male==0
(9,079 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.411  if male==1
(8,686 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb2020<1
(11,145 real changes made)

. gen max_baseline_creatinine_feb2020=.
(32,043 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.7 if male==0
(9,079 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.9 if male==1
(8,686 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.209
(17,765 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb2020>1
(20,898 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_baseline_creatinine_feb2020*141
(14,278 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(0.993^age)
(17,765 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1.018 if male==0
(9,079 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine updated monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(17,747 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(17,747 observations deleted)

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(6,209 real changes made, 6,209 to missing)
(6,209 missing values generated)
(14,296 missing values generated)
(4,114 real changes made)
(3,973 real changes made)
(4,114 real changes made)
(3,973 real changes made)
(5,139 real changes made)
(14,296 missing values generated)
(4,114 real changes made)
(3,973 real changes made)
(8,087 real changes made)
(9,157 real changes made)
(6,209 missing values generated)
(8,087 real changes made)
(4,114 real changes made)
(6,335 real changes made, 6,335 to missing)
(6,335 missing values generated)
(14,296 missing values generated)
(4,088 real changes made)
(3,873 real changes made)
(4,088 real changes made)
(3,873 real changes made)
(4,983 real changes made)
(14,296 missing values generated)
(4,088 real changes made)
(3,873 real changes made)
(7,961 real changes made)
(9,313 real changes made)
(6,335 missing values generated)
(7,961 real changes made)
(4,088 real changes made)
(6,198 real changes made, 6,198 to missing)
(6,198 missing values generated)
(14,296 missing values generated)
(4,100 real changes made)
(3,998 real changes made)
(4,100 real changes made)
(3,998 real changes made)
(5,155 real changes made)
(14,296 missing values generated)
(4,100 real changes made)
(3,998 real changes made)
(8,098 real changes made)
(9,141 real changes made)
(6,198 missing values generated)
(8,098 real changes made)
(4,100 real changes made)
(6,240 real changes made, 6,240 to missing)
(6,240 missing values generated)
(14,296 missing values generated)
(4,108 real changes made)
(3,948 real changes made)
(4,108 real changes made)
(3,948 real changes made)
(5,157 real changes made)
(14,296 missing values generated)
(4,108 real changes made)
(3,948 real changes made)
(8,056 real changes made)
(9,139 real changes made)
(6,240 missing values generated)
(8,056 real changes made)
(4,108 real changes made)
(6,396 real changes made, 6,396 to missing)
(6,396 missing values generated)
(14,296 missing values generated)
(4,035 real changes made)
(3,865 real changes made)
(4,035 real changes made)
(3,865 real changes made)
(4,948 real changes made)
(14,296 missing values generated)
(4,035 real changes made)
(3,865 real changes made)
(7,900 real changes made)
(9,348 real changes made)
(6,396 missing values generated)
(7,900 real changes made)
(4,035 real changes made)
(6,218 real changes made, 6,218 to missing)
(6,218 missing values generated)
(14,296 missing values generated)
(4,056 real changes made)
(4,022 real changes made)
(4,056 real changes made)
(4,022 real changes made)
(5,046 real changes made)
(14,296 missing values generated)
(4,056 real changes made)
(4,022 real changes made)
(8,078 real changes made)
(9,250 real changes made)
(6,218 missing values generated)
(8,078 real changes made)
(4,056 real changes made)
(6,244 real changes made, 6,244 to missing)
(6,244 missing values generated)
(14,296 missing values generated)
(4,093 real changes made)
(3,959 real changes made)
(4,093 real changes made)
(3,959 real changes made)
(5,178 real changes made)
(14,296 missing values generated)
(4,093 real changes made)
(3,959 real changes made)
(8,052 real changes made)
(9,118 real changes made)
(6,244 missing values generated)
(8,052 real changes made)
(4,093 real changes made)
(6,322 real changes made, 6,322 to missing)
(6,322 missing values generated)
(14,296 missing values generated)
(4,032 real changes made)
(3,942 real changes made)
(4,032 real changes made)
(3,942 real changes made)
(5,048 real changes made)
(14,296 missing values generated)
(4,032 real changes made)
(3,942 real changes made)
(7,974 real changes made)
(9,248 real changes made)
(6,322 missing values generated)
(7,974 real changes made)
(4,032 real changes made)
(6,395 real changes made, 6,395 to missing)
(6,395 missing values generated)
(14,296 missing values generated)
(4,049 real changes made)
(3,852 real changes made)
(4,049 real changes made)
(3,852 real changes made)
(5,023 real changes made)
(14,296 missing values generated)
(4,049 real changes made)
(3,852 real changes made)
(7,901 real changes made)
(9,273 real changes made)
(6,395 missing values generated)
(7,901 real changes made)
(4,049 real changes made)
(6,270 real changes made, 6,270 to missing)
(6,270 missing values generated)
(14,296 missing values generated)
(4,066 real changes made)
(3,960 real changes made)
(4,066 real changes made)
(3,960 real changes made)
(5,045 real changes made)
(14,296 missing values generated)
(4,066 real changes made)
(3,960 real changes made)
(8,026 real changes made)
(9,251 real changes made)
(6,270 missing values generated)
(8,026 real changes made)
(4,066 real changes made)
(6,313 real changes made, 6,313 to missing)
(6,313 missing values generated)
(14,296 missing values generated)
(4,013 real changes made)
(3,970 real changes made)
(4,013 real changes made)
(3,970 real changes made)
(5,015 real changes made)
(14,296 missing values generated)
(4,013 real changes made)
(3,970 real changes made)
(7,983 real changes made)
(9,281 real changes made)
(6,313 missing values generated)
(7,983 real changes made)
(4,013 real changes made)
(6,167 real changes made, 6,167 to missing)
(6,167 missing values generated)
(14,296 missing values generated)
(4,127 real changes made)
(4,002 real changes made)
(4,127 real changes made)
(4,002 real changes made)
(5,128 real changes made)
(14,296 missing values generated)
(4,127 real changes made)
(4,002 real changes made)
(8,129 real changes made)
(9,168 real changes made)
(6,167 missing values generated)
(8,129 real changes made)
(4,127 real changes made)
(6,387 real changes made, 6,387 to missing)
(6,387 missing values generated)
(14,296 missing values generated)
(3,997 real changes made)
(3,912 real changes made)
(3,997 real changes made)
(3,912 real changes made)
(5,036 real changes made)
(14,296 missing values generated)
(3,997 real changes made)
(3,912 real changes made)
(7,909 real changes made)
(9,260 real changes made)
(6,387 missing values generated)
(7,909 real changes made)
(3,997 real changes made)
(6,350 real changes made, 6,350 to missing)
(6,350 missing values generated)
(14,296 missing values generated)
(4,066 real changes made)
(3,880 real changes made)
(4,066 real changes made)
(3,880 real changes made)
(5,011 real changes made)
(14,296 missing values generated)
(4,066 real changes made)
(3,880 real changes made)
(7,946 real changes made)
(9,285 real changes made)
(6,350 missing values generated)
(7,946 real changes made)
(4,066 real changes made)
(6,315 real changes made, 6,315 to missing)
(6,315 missing values generated)
(14,296 missing values generated)
(4,051 real changes made)
(3,930 real changes made)
(4,051 real changes made)
(3,930 real changes made)
(5,055 real changes made)
(14,296 missing values generated)
(4,051 real changes made)
(3,930 real changes made)
(7,981 real changes made)
(9,241 real changes made)
(6,315 missing values generated)
(7,981 real changes made)
(4,051 real changes made)
(6,274 real changes made, 6,274 to missing)
(6,274 missing values generated)
(14,296 missing values generated)
(4,146 real changes made)
(3,876 real changes made)
(4,146 real changes made)
(3,876 real changes made)
(5,092 real changes made)
(14,296 missing values generated)
(4,146 real changes made)
(3,876 real changes made)
(8,022 real changes made)
(9,204 real changes made)
(6,274 missing values generated)
(8,022 real changes made)
(4,146 real changes made)
(6,298 real changes made, 6,298 to missing)
(6,298 missing values generated)
(14,296 missing values generated)
(4,102 real changes made)
(3,896 real changes made)
(4,102 real changes made)
(3,896 real changes made)
(5,064 real changes made)
(14,296 missing values generated)
(4,102 real changes made)
(3,896 real changes made)
(7,998 real changes made)
(9,232 real changes made)
(6,298 missing values generated)
(7,998 real changes made)
(4,102 real changes made)
(6,368 real changes made, 6,368 to missing)
(6,368 missing values generated)
(14,296 missing values generated)
(4,061 real changes made)
(3,867 real changes made)
(4,061 real changes made)
(3,867 real changes made)
(5,036 real changes made)
(14,296 missing values generated)
(4,061 real changes made)
(3,867 real changes made)
(7,928 real changes made)
(9,260 real changes made)
(6,368 missing values generated)
(7,928 real changes made)
(4,061 real changes made)
(6,262 real changes made, 6,262 to missing)
(6,262 missing values generated)
(14,296 missing values generated)
(4,102 real changes made)
(3,932 real changes made)
(4,102 real changes made)
(3,932 real changes made)
(5,109 real changes made)
(14,296 missing values generated)
(4,102 real changes made)
(3,932 real changes made)
(8,034 real changes made)
(9,187 real changes made)
(6,262 missing values generated)
(8,034 real changes made)
(4,102 real changes made)
(6,269 real changes made, 6,269 to missing)
(6,269 missing values generated)
(14,296 missing values generated)
(4,083 real changes made)
(3,944 real changes made)
(4,083 real changes made)
(3,944 real changes made)
(5,174 real changes made)
(14,296 missing values generated)
(4,083 real changes made)
(3,944 real changes made)
(8,027 real changes made)
(9,122 real changes made)
(6,269 missing values generated)
(8,027 real changes made)
(4,083 real changes made)
(6,378 real changes made, 6,378 to missing)
(6,378 missing values generated)
(14,296 missing values generated)
(4,051 real changes made)
(3,867 real changes made)
(4,051 real changes made)
(3,867 real changes made)
(5,070 real changes made)
(14,296 missing values generated)
(4,051 real changes made)
(3,867 real changes made)
(7,918 real changes made)
(9,226 real changes made)
(6,378 missing values generated)
(7,918 real changes made)
(4,051 real changes made)
(6,268 real changes made, 6,268 to missing)
(6,268 missing values generated)
(14,296 missing values generated)
(4,063 real changes made)
(3,965 real changes made)
(4,063 real changes made)
(3,965 real changes made)
(5,104 real changes made)
(14,296 missing values generated)
(4,063 real changes made)
(3,965 real changes made)
(8,028 real changes made)
(9,192 real changes made)
(6,268 missing values generated)
(8,028 real changes made)
(4,063 real changes made)
(6,301 real changes made, 6,301 to missing)
(6,301 missing values generated)
(14,296 missing values generated)
(4,061 real changes made)
(3,934 real changes made)
(4,061 real changes made)
(3,934 real changes made)
(5,100 real changes made)
(14,296 missing values generated)
(4,061 real changes made)
(3,934 real changes made)
(7,995 real changes made)
(9,196 real changes made)
(6,301 missing values generated)
(7,995 real changes made)
(4,061 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(14,296 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. drop if baseline_egfr <15
  4. drop egfr_baseline_creatinine_`x'
  5. }
(345 real changes made)
(0 observations deleted)
(360 real changes made)
(0 observations deleted)
(361 real changes made)
(0 observations deleted)
(389 real changes made)
(0 observations deleted)
(334 real changes made)
(0 observations deleted)
(375 real changes made)
(0 observations deleted)
(375 real changes made)
(0 observations deleted)
(357 real changes made)
(0 observations deleted)
(372 real changes made)
(0 observations deleted)
(312 real changes made)
(0 observations deleted)
(357 real changes made)
(0 observations deleted)
(324 real changes made)
(0 observations deleted)
(307 real changes made)
(0 observations deleted)
(342 real changes made)
(0 observations deleted)
(329 real changes made)
(0 observations deleted)
(313 real changes made)
(0 observations deleted)
(307 real changes made)
(0 observations deleted)
(342 real changes made)
(0 observations deleted)
(294 real changes made)
(0 observations deleted)
(297 real changes made)
(0 observations deleted)
(303 real changes made)
(0 observations deleted)
(287 real changes made)
(0 observations deleted)
(299 real changes made)
(0 observations deleted)
(322 real changes made)
(0 observations deleted)

. drop baseline_egfr

. drop covid_month

. drop covid_date_string

. drop age

. 
. * COVID-19 death
. drop if deceased==1
(1,472 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. drop if imd>=.
(0 observations deleted)

. 
. **Drop disaggregated krt_outcome variables
. drop krt_outcome_primary_care

. drop krt_outcome_icd_10

. drop krt_outcome_opcs_4

. 
. *Tabulate variables
. tab year_of_birth

year_of_bir |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
       1950 |        253        1.97        1.97
       1951 |        251        1.96        3.93
       1952 |        273        2.13        6.06
       1953 |        276        2.15        8.21
       1954 |        255        1.99       10.20
       1955 |        232        1.81       12.01
       1956 |        258        2.01       14.02
       1957 |        256        2.00       16.02
       1958 |        255        1.99       18.01
       1959 |        253        1.97       19.98
       1960 |        256        2.00       21.97
       1961 |        252        1.97       23.94
       1962 |        276        2.15       26.09
       1963 |        239        1.86       27.96
       1964 |        258        2.01       29.97
       1965 |        251        1.96       31.92
       1966 |        248        1.93       33.86
       1967 |        270        2.11       35.96
       1968 |        225        1.75       37.72
       1969 |        224        1.75       39.47
       1970 |        281        2.19       41.66
       1971 |        239        1.86       43.52
       1972 |        258        2.01       45.53
       1973 |        258        2.01       47.54
       1974 |        233        1.82       49.36
       1975 |        242        1.89       51.25
       1976 |        249        1.94       53.19
       1977 |        251        1.96       55.15
       1978 |        219        1.71       56.85
       1979 |        257        2.00       58.86
       1980 |        251        1.96       60.82
       1981 |        263        2.05       62.87
       1982 |        245        1.91       64.78
       1983 |        258        2.01       66.79
       1984 |        297        2.32       69.10
       1985 |        261        2.04       71.14
       1986 |        241        1.88       73.02
       1987 |        293        2.28       75.30
       1988 |        258        2.01       77.32
       1989 |        255        1.99       79.30
       1990 |        245        1.91       81.21
       1991 |        246        1.92       83.13
       1992 |        282        2.20       85.33
       1993 |        264        2.06       87.39
       1994 |        276        2.15       89.54
       1995 |        270        2.11       91.65
       1996 |        253        1.97       93.62
       1997 |        256        2.00       95.62
       1998 |        290        2.26       97.88
       1999 |        270        2.11       99.98
       2000 |          2        0.02      100.00
------------+-----------------------------------
      Total |     12,824      100.00

. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        634        4.94        4.94
          1 |      2,406       18.76       23.71
          2 |      2,444       19.06       42.76
          3 |      2,517       19.63       62.39
          4 |      2,511       19.58       81.97
          5 |      2,312       18.03      100.00
------------+-----------------------------------
      Total |     12,824      100.00

. tab male

   Sex (0=F |
       1=M) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      6,570       51.23       51.23
       Male |      6,254       48.77      100.00
------------+-----------------------------------
      Total |     12,824      100.00

. 
. export delimited using "./output/covid_matching.csv", replace
file ./output/covid_matching.csv saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/covid_matching.log
  log type:  text
 closed on:  19 Oct 2022, 00:08:15
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
