-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/cox_2017_case.log
  log type:  text
 opened on:  27 Jan 2023, 14:59:25

. 
. cap file close tablecontent

. file open tablecontent using ./output/cox_2017_case.txt, write text replace
(note: file ./output/cox_2017_case.txt not found)

. file write tablecontent ("Kidney outcomes after SARS-CoV-2 infection compared
>  to matched historical general population") _n

. file write tablecontent _n

. file write tablecontent ("Historical general population matched on age, sex a
> nd STP") _n

. file write tablecontent ("Restricted to those who survived 28 days after firs
> t recorded SARS-CoV-2 or equivalent date of matching") _n

. file write tablecontent ("All models stratified by matched set and clustering
>  by general practice accounted for using robust standard errors") _n

. file write tablecontent _n

. file write tablecontent ("Cox regression models:") _n

. file write tablecontent ("1. Crude") _n

. file write tablecontent ("2. Minimally adjusted: adjusted for age (using spli
> ne functions) and sex") _n

. file write tablecontent ("3. Additionally adjusted: additionally adjusted for
>  ethnicity, socioeconomic deprivation, region, rural/urban, body mass index a
> nd smoking") _n

. file write tablecontent ("4. Fully adjusted: additionally adjusted for cardio
> vascular diseases, diabetes, hypertension, immunocompromise and cancer") _n

. file write tablecontent _n

. file write tablecontent _tab _tab _tab _tab _tab ("Number") _tab _tab ("Event
> ") _tab ("Total person-years") _tab ("Rate per 100,000") _tab ("Crude") _tab 
> _tab _tab ("Minimally adjusted") _tab ("Additionally adjusted") _tab ("Fully 
> adjusted") _tab _tab _n

. file write tablecontent _tab _tab _tab _tab _tab _tab _tab _tab _tab _tab _ta
> b _tab _tab _tab ("HR") _tab ("95% CI") _tab _tab ("HR") _tab ("95% CI") _tab
>  _tab ("HR") _tab ("95% CI") _tab _tab ("HR") _tab ("95% CI") _tab _tab _n

. file write tablecontent ("By SARS-CoV-2 infection") _n

. 
. use ./output/analysis_2017.dta, clear

. foreach outcome of varlist esrd egfr_half aki death {
  2. stset exit_date_`outcome', fail(`outcome'_date) origin(index_date_`outcome
> ') id(patient_id) scale(365.25)
  3. bysort case: egen total_follow_up_`outcome' = total(_t)
  4. 
. stcox i.case, vce(cluster set_id) strata(practice_id)
  5. matrix table = r(table)
  6. local crude_`outcome'_b: display %4.2f table[1,2]
  7. local crude_`outcome'_ll: display %4.2f table[5,2]
  8. local crude_`outcome'_ul: display %4.2f table[6,2]
  9. 
. stcox i.case i.sex age1 age2 age3, vce(cluster set_id) strata(practice_id)
 10. matrix table = r(table)
 11. local minimal_`outcome'_b: display %4.2f table[1,2]
 12. local minimal_`outcome'_ll: display %4.2f table[5,2]
 13. local minimal_`outcome'_ul: display %4.2f table[6,2]
 14. 
. stcox i.case i.sex i.ethnicity i.imd i.urban i.region i.bmi i.smoking age1 ag
> e2 age3, vce(cluster set_id) strata(practice_id)
 15. matrix table = r(table)
 16. local additional_`outcome'_b: display %4.2f table[1,2]
 17. local additional_`outcome'_ll: display %4.2f table[5,2]
 18. local additional_`outcome'_ul: display %4.2f table[6,2]
 19. 
. stcox i.case i.sex i.ethnicity i.imd i.urban i.region i.bmi i.cardiovascular 
> i.diabetes i.hypertension i.immunosuppressed i.non_haem_cancer i.smoking age1
>  age2 age3, vce(cluster set_id) strata(practice_id)           
 20. matrix table = r(table)
 21. local full_`outcome'_b: display %4.2f table[1,2]
 22. local full_`outcome'_ll: display %4.2f table[5,2]
 23. local full_`outcome'_ul: display %4.2f table[6,2]                       
 24.                                                                 
. local lab0: label case 0
 25. local lab1: label case 1
 26. 
.         qui safecount if case==0 & `outcome'_denominator==1 & _st==1
 27.         local denominator = round(r(N),5)
 28.         qui safecount if case== 0 & `outcome'==1 & _st==1
 29.         local event = round(r(N),5)
 30.         qui su total_follow_up_`outcome' if case==0
 31.         local person_year = r(mean)
 32.         local rate = 100000*(`event'/`person_year')
 33.         
.         file write tablecontent _n
 34.         file write tablecontent ("`outcome'") _n
 35.         file write tablecontent _tab ("`lab0'") _tab _tab (`denominator') 
> _tab _tab (`event') _tab %10.0f (`person_year') _tab _tab %3.2f (`rate') _tab
>  _tab _tab ("1.00") _tab _tab _tab ("1.00") _tab _tab _tab ("1.00") _tab _tab
>  _tab ("1.00") _n
 36.         
.         qui safecount if case==1  & `outcome'_denominator==1 & _st==1
 37.         local denominator = round(r(N),5)
 38.         qui safecount if case == 1 & `outcome'==1 &  _st==1
 39.         local event = round(r(N),5)
 40.         qui su total_follow_up_`outcome' if case==1
 41.         local person_year = r(mean)
 42.         local rate = 100000*(`event'/`person_year')
 43.         file write tablecontent _tab ("`lab1'") _tab _tab _tab (`denominat
> or') _tab _tab (`event') _tab %10.0f (`person_year') _tab _tab %3.2f (`rate')
>  _tab _tab  
 44.         file write tablecontent  _tab %4.2f (`crude_`outcome'_b') _tab ("(
> ") %4.2f (`crude_`outcome'_ll') (" - ") %4.2f (`crude_`outcome'_ul') (")")
 45.         file write tablecontent  _tab %4.2f (`minimal_`outcome'_b') _tab (
> "(") %4.2f (`minimal_`outcome'_ll') (" - ") %4.2f (`minimal_`outcome'_ul') ("
> )")
 46.         file write tablecontent  _tab %4.2f (`additional_`outcome'_b') _ta
> b ("(") %4.2f (`additional_`outcome'_ll') (" - ") %4.2f (`additional_`outcome
> '_ul') (")")
 47.         file write tablecontent  _tab %4.2f (`full_`outcome'_b') _tab ("("
> ) %4.2f (`full_`outcome'_ll') (" - ") %4.2f (`full_`outcome'_ul') (")") _tab 
> _n
 48. }

                id:  patient_id
     failure event:  esrd_date != 0 & esrd_date < .
obs. time interval:  (exit_date_esrd[_n-1], exit_date_esrd]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_esrd

------------------------------------------------------------------------------
     27,845  total observations
         37  observations begin on or after (first) failure
------------------------------------------------------------------------------
     27,808  observations remaining, representing
     27,534  subjects
      2,778  failures in single-failure-per-subject data
 47,368.413  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  5.744011

         failure _d:  esrd_date
   analysis time _t:  (exit_date_esrd-origin)/365.25
             origin:  time index_date_esrd
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -21282.738
Iteration 1:   log pseudolikelihood = -21282.703
Iteration 2:   log pseudolikelihood = -21282.703
Refining estimates:
Iteration 0:   log pseudolikelihood = -21282.703

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       27,534             Number of obs    =      27,808
No. of failures      =        2,778
Time at risk         =  47368.41342
                                                Wald chi2(1)     =        0.07
Log pseudolikelihood =   -21282.703             Prob > chi2      =      0.7918

                             (Std. Err. adjusted for 7,981 clusters in set_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   .9889043   .0418014    -0.26   0.792     .9102772    1.074323
------------------------------------------------------------------------------
                                                     Stratified by practice_id

         failure _d:  esrd_date
   analysis time _t:  (exit_date_esrd-origin)/365.25
             origin:  time index_date_esrd
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -21282.738
Iteration 1:   log pseudolikelihood = -21282.548
Iteration 2:   log pseudolikelihood = -21282.548
Refining estimates:
Iteration 0:   log pseudolikelihood = -21282.548

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       27,534             Number of obs    =      27,808
No. of failures      =        2,778
Time at risk         =  47368.41342
                                                Wald chi2(5)     =        0.37
Log pseudolikelihood =   -21282.548             Prob > chi2      =      0.9961

                             (Std. Err. adjusted for 7,981 clusters in set_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   .9870808   .0421446    -0.30   0.761     .9078406    1.073237
             |
         sex |
       Male  |    1.00929   .0383944     0.24   0.808     .9367751    1.087418
        age1 |   1.000723   .0065644     0.11   0.912     .9879392    1.013672
        age2 |   .9952742   .0201117    -0.23   0.815     .9566262    1.035483
        age3 |   1.018006   .0597384     0.30   0.761     .9074037     1.14209
------------------------------------------------------------------------------
                                                     Stratified by practice_id

         failure _d:  esrd_date
   analysis time _t:  (exit_date_esrd-origin)/365.25
             origin:  time index_date_esrd
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -1922.6102
Iteration 1:   log pseudolikelihood = -1912.2511
Iteration 2:   log pseudolikelihood = -1912.1808
Iteration 3:   log pseudolikelihood = -1912.1808
Refining estimates:
Iteration 0:   log pseudolikelihood = -1912.1808

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,321             Number of obs    =       3,323
No. of failures      =          344
Time at risk         =  5619.786448
                                                Wald chi2(28)    =       21.29
Log pseudolikelihood =   -1912.1808             Prob > chi2      =      0.8129

                             (Std. Err. adjusted for 2,808 clusters in set_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   .9950411   .1229878    -0.04   0.968     .7809655    1.267798
             |
         sex |
       Male  |   1.106481   .1201854     0.93   0.352     .8943074    1.368992
             |
   ethnicity |
South Asian  |   .8285778   .2229625    -0.70   0.485     .4889708    1.404054
      Black  |   .7362525   .2113035    -1.07   0.286     .4195011    1.292172
      Mixed  |    .793106   .2173395    -0.85   0.398     .4635232    1.357035
      Other  |    1.38976   .3219414     1.42   0.155     .8825858     2.18838
             |
         imd |
          2  |   .9243711   .1574654    -0.46   0.644     .6619807    1.290766
          3  |   .8798883   .1525796    -0.74   0.461     .6263577     1.23604
          4  |   .9962731   .1738879    -0.02   0.983     .7076379    1.402638
5 Least d..  |   1.050722   .1757119     0.30   0.767     .7570799    1.458257
             |
       urban |
      Urban  |   .8481316   .0956889    -1.46   0.144     .6798733    1.058031
             |
      region |
       East  |    1.02442   .2577196     0.10   0.924     .6256569    1.677336
     London  |   1.045622   .2290933     0.20   0.839      .680579    1.606464
 North East  |   1.327515   .3169864     1.19   0.235     .8313576     2.11978
 North West  |    .950208   .2444306    -0.20   0.843     .5739267    1.573189
 South East  |   1.041551   .2629351     0.16   0.872     .6350359    1.708295
 South West  |   1.371879   .3321248     1.31   0.192     .8535798    2.204892
West Midl..  |   1.196902   .2968845     0.72   0.469     .7360769     1.94623
Yorkshire..  |   1.092673    .287301     0.34   0.736     .6526498    1.829364
             |
         bmi |
Normal (..)  |   .7496281   .1660202    -1.30   0.193     .4856576    1.157075
Overweig..)  |   .8561388   .1883113    -0.71   0.480     .5563126    1.317557
Obese I ..)  |   .7856525   .1741598    -1.09   0.276     .5087918    1.213168
Obese II..)  |   .8120284   .1985102    -0.85   0.394     .5029035    1.311166
Obese II..)  |   .7878289   .2259726    -0.83   0.406     .4490371    1.382234
             |
     smoking |
Current/f..  |   .8256454   .1043662    -1.52   0.130     .6444615    1.057767
        age1 |   1.028162   .0216025     1.32   0.186     .9866814    1.071386
        age2 |    .935686   .0573647    -1.08   0.278     .8297456    1.055153
        age3 |   1.194065   .2077064     1.02   0.308     .8491064    1.679166
------------------------------------------------------------------------------
                                                     Stratified by practice_id

         failure _d:  esrd_date
   analysis time _t:  (exit_date_esrd-origin)/365.25
             origin:  time index_date_esrd
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -1922.6102
Iteration 1:   log pseudolikelihood = -1907.5844
Iteration 2:   log pseudolikelihood = -1906.9592
Iteration 3:   log pseudolikelihood = -1906.9242
Iteration 4:   log pseudolikelihood =  -1906.924
Refining estimates:
Iteration 0:   log pseudolikelihood =  -1906.924

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,321             Number of obs    =       3,323
No. of failures      =          344
Time at risk         =  5619.786448
                                                Wald chi2(33)    =       29.71
Log pseudolikelihood =    -1906.924             Prob > chi2      =      0.6317

                             (Std. Err. adjusted for 2,808 clusters in set_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   .9985358   .1235345    -0.01   0.991     .7835319    1.272537
             |
         sex |
       Male  |   1.104494   .1199214     0.92   0.360     .8927781    1.366417
             |
   ethnicity |
South Asian  |   .8423802   .2282208    -0.63   0.527     .4953332     1.43258
      Black  |   .7201071   .2073445    -1.14   0.254     .4095489    1.266159
      Mixed  |   .7863623   .2160596    -0.87   0.382     .4589316    1.347403
      Other  |   1.375217   .3175489     1.38   0.168     .8746251    2.162324
             |
         imd |
          2  |   .9242721   .1578851    -0.46   0.645     .6612973    1.291823
          3  |   .8806236   .1528169    -0.73   0.464      .626728    1.237376
          4  |   1.006414   .1765492     0.04   0.971     .7136012    1.419378
5 Least d..  |   1.064499   .1795626     0.37   0.711     .7648252    1.481591
             |
       urban |
      Urban  |   .8471092   .0959442    -1.46   0.143     .6784716    1.057662
             |
      region |
       East  |   1.022547   .2574398     0.09   0.929     .6242837    1.674884
     London  |   1.039375   .2274226     0.18   0.860      .676898    1.595957
 North East  |   1.310727   .3147605     1.13   0.260     .8186594     2.09856
 North West  |   .9328138   .2404779    -0.27   0.787     .5628032    1.546085
 South East  |   1.049083   .2639387     0.19   0.849     .6407024    1.717765
 South West  |   1.369154   .3310301     1.30   0.194      .852415    2.199142
West Midl..  |   1.203608    .298337     0.75   0.455     .7404552    1.956462
Yorkshire..  |   1.089713   .2879023     0.33   0.745     .6492685    1.828941
             |
         bmi |
Normal (..)  |   .7476867   .1664514    -1.31   0.192     .4833076    1.156687
Overweig..)  |   .8538933   .1895538    -0.71   0.477     .5526464    1.319349
Obese I ..)  |    .777655   .1735686    -1.13   0.260      .502115      1.2044
Obese II..)  |   .8078527   .1989923    -0.87   0.386     .4984965    1.309189
Obese II..)  |   .7885429   .2286327    -0.82   0.413     .4467095    1.391956
             |
1.cardiova~r |   .8012849   .1160537    -1.53   0.126     .6032587    1.064315
  1.diabetes |   .9480972   .1304926    -0.39   0.699     .7239301    1.241678
1.hyperten~n |   1.095523   .1451822     0.69   0.491     .8449242    1.420449
1.immunosu~d |   .9664803    .173453    -0.19   0.849     .6798747    1.373906
1.non_haem~r |   .2265217   .1592084    -2.11   0.035     .0571284    .8981896
             |
     smoking |
Current/f..  |   .8261931   .1044812    -1.51   0.131     .6448189    1.058584
        age1 |   1.028336   .0215326     1.33   0.182     .9869874    1.071417
        age2 |   .9346558   .0571709    -1.10   0.269     .8290591    1.053702
        age3 |   1.196673   .2077383     1.03   0.301     .8515492    1.681671
------------------------------------------------------------------------------
                                                     Stratified by practice_id

                id:  patient_id
     failure event:  egfr_half_date != 0 & egfr_half_date < .
obs. time interval:  (exit_date_egfr_half[_n-1], exit_date_egfr_half]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_egfr_half

------------------------------------------------------------------------------
     27,845  total observations
     11,134  event time missing (exit_date_egfr_half>=.)        PROBABLE ERROR
      1,208  ignored because never entered
         13  observations end on or before enter()
         61  observations begin on or after (first) failure
------------------------------------------------------------------------------
     15,429  observations remaining, representing
     15,366  subjects
      7,539  failures in single-failure-per-subject data
 18,265.892  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  5.741273

         failure _d:  egfr_half_date
   analysis time _t:  (exit_date_egfr_half-origin)/365.25
             origin:  time index_date_egfr_half
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -52496.099
Iteration 1:   log pseudolikelihood = -52496.018
Iteration 2:   log pseudolikelihood = -52496.018
Refining estimates:
Iteration 0:   log pseudolikelihood = -52496.018

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       15,366             Number of obs    =      15,429
No. of failures      =        7,539
Time at risk         =  18265.89185
                                                Wald chi2(1)     =        0.16
Log pseudolikelihood =   -52496.018             Prob > chi2      =      0.6853

                             (Std. Err. adjusted for 7,390 clusters in set_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   .9896511   .0254074    -0.41   0.685     .9410856    1.040723
------------------------------------------------------------------------------
                                                     Stratified by practice_id

         failure _d:  egfr_half_date
   analysis time _t:  (exit_date_egfr_half-origin)/365.25
             origin:  time index_date_egfr_half
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -52496.099
Iteration 1:   log pseudolikelihood = -52457.929
Iteration 2:   log pseudolikelihood = -52457.928
Refining estimates:
Iteration 0:   log pseudolikelihood = -52457.928

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       15,366             Number of obs    =      15,429
No. of failures      =        7,539
Time at risk         =  18265.89185
                                                Wald chi2(5)     =       76.93
Log pseudolikelihood =   -52457.928             Prob > chi2      =      0.0000

                             (Std. Err. adjusted for 7,390 clusters in set_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   .9865403   .0256897    -0.52   0.603     .9374526    1.038198
             |
         sex |
       Male  |   .8221403   .0189304    -8.51   0.000     .7858622    .8600931
        age1 |    1.00671   .0040662     1.66   0.098     .9987723    1.014712
        age2 |   .9860226   .0120697    -1.15   0.250     .9626479    1.009965
        age3 |   1.034073   .0364371     0.95   0.342     .9650678    1.108012
------------------------------------------------------------------------------
                                                     Stratified by practice_id

         failure _d:  egfr_half_date
   analysis time _t:  (exit_date_egfr_half-origin)/365.25
             origin:  time index_date_egfr_half
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -4387.9485
Iteration 1:   log pseudolikelihood = -4371.2635
Iteration 2:   log pseudolikelihood =  -4371.195
Iteration 3:   log pseudolikelihood =  -4371.195
Refining estimates:
Iteration 0:   log pseudolikelihood =  -4371.195

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,842             Number of obs    =       1,843
No. of failures      =          896
Time at risk         =  2163.937029
                                                Wald chi2(28)    =       34.27
Log pseudolikelihood =    -4371.195             Prob > chi2      =      0.1922

                             (Std. Err. adjusted for 1,689 clusters in set_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   1.120341   .0867891     1.47   0.142     .9625218    1.304038
             |
         sex |
       Male  |   .8956841   .0602342    -1.64   0.101     .7850767    1.021875
             |
   ethnicity |
South Asian  |    .857501   .1425615    -0.92   0.355     .6190425    1.187815
      Black  |   1.169882    .174189     1.05   0.292     .8737818    1.566323
      Mixed  |   1.044655   .1547597     0.29   0.768     .7813983    1.396605
      Other  |   .9589404   .1484397    -0.27   0.787     .7079938    1.298835
             |
         imd |
          2  |   .8079691   .0836329    -2.06   0.039     .6596094     .989698
          3  |   .9084575   .0958158    -0.91   0.363     .7388013    1.117073
          4  |   .9449432    .103198    -0.52   0.604     .7628608    1.170486
5 Least d..  |   .8757471   .0928342    -1.25   0.211     .7114535    1.077981
             |
       urban |
      Urban  |   .9020035   .0623212    -1.49   0.136     .7877656    1.032808
             |
      region |
       East  |   1.560532   .2566422     2.71   0.007     1.130539    2.154069
     London  |   1.557635   .2341668     2.95   0.003     1.160114    2.091371
 North East  |   1.357725   .2194178     1.89   0.058     .9891263    1.863682
 North West  |   1.207897   .2054876     1.11   0.267      .865413    1.685918
 South East  |   1.619866   .2591569     3.01   0.003     1.183854     2.21646
 South West  |   1.263304   .2177831     1.36   0.175     .9010891     1.77112
West Midl..  |   1.378134   .2347811     1.88   0.060     .9869138    1.924436
Yorkshire..  |    1.38686   .2434054     1.86   0.062     .9831956    1.956256
             |
         bmi |
Normal (..)  |   .9924823   .1472039    -0.05   0.959     .7421189    1.327309
Overweig..)  |   .9564511   .1437933    -0.30   0.767     .7123489      1.2842
Obese I ..)  |   .9340604   .1428384    -0.45   0.656     .6921617    1.260499
Obese II..)  |   .8946384   .1462871    -0.68   0.496     .6493263    1.232628
Obese II..)  |   .9422077   .1723579    -0.33   0.745     .6583191    1.348518
             |
     smoking |
Current/f..  |   .9174415   .0753352    -1.05   0.294     .7810565    1.077642
        age1 |   1.004607   .0120995     0.38   0.703     .9811704    1.028604
        age2 |   1.005637   .0364798     0.15   0.877     .9366206    1.079739
        age3 |   .9631201   .1003956    -0.36   0.718     .7851475    1.181434
------------------------------------------------------------------------------
                                                     Stratified by practice_id

         failure _d:  egfr_half_date
   analysis time _t:  (exit_date_egfr_half-origin)/365.25
             origin:  time index_date_egfr_half
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -4387.9485
Iteration 1:   log pseudolikelihood = -4366.9247
Iteration 2:   log pseudolikelihood = -4366.8362
Iteration 3:   log pseudolikelihood = -4366.8362
Refining estimates:
Iteration 0:   log pseudolikelihood = -4366.8362

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,842             Number of obs    =       1,843
No. of failures      =          896
Time at risk         =  2163.937029
                                                Wald chi2(33)    =       44.28
Log pseudolikelihood =   -4366.8362             Prob > chi2      =      0.0909

                             (Std. Err. adjusted for 1,689 clusters in set_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   1.121599   .0870901     1.48   0.139     .9632593    1.305965
             |
         sex |
       Male  |     .89949   .0604457    -1.58   0.115      .788489    1.026117
             |
   ethnicity |
South Asian  |   .8613861    .143311    -0.90   0.370     .6217006    1.193478
      Black  |    1.15908   .1735563     0.99   0.324     .8642862    1.554423
      Mixed  |   1.030759   .1532247     0.20   0.839     .7702363      1.3794
      Other  |   .9575537   .1473426    -0.28   0.778     .7082481    1.294616
             |
         imd |
          2  |   .7946323   .0825503    -2.21   0.027     .6482451    .9740768
          3  |   .9128505   .0964456    -0.86   0.388     .7421086    1.122876
          4  |   .9512882   .1040319    -0.46   0.648     .7677602    1.178687
5 Least d..  |   .8695534   .0922651    -1.32   0.188     .7062823    1.070568
             |
       urban |
      Urban  |   .9007499   .0625223    -1.51   0.132     .7861784    1.032018
             |
      region |
       East  |   1.556109   .2558593     2.69   0.007     1.127414    2.147814
     London  |   1.557404    .233857     2.95   0.003     1.160343    2.090337
 North East  |   1.343076   .2178944     1.82   0.069       .97725    1.845847
 North West  |   1.197967   .2051722     1.05   0.292     .8563714    1.675821
 South East  |   1.620366   .2594745     3.01   0.003     1.183879    2.217781
 South West  |   1.260202   .2177684     1.34   0.181     .8981498      1.7682
West Midl..  |   1.365188   .2315792     1.84   0.066     .9790426    1.903633
Yorkshire..  |   1.355643   .2385223     1.73   0.084     .9602368    1.913869
             |
         bmi |
Normal (..)  |   .9922473   .1475089    -0.05   0.958     .7414453    1.327886
Overweig..)  |   .9486401   .1430077    -0.35   0.727     .7059642    1.274736
Obese I ..)  |   .9325534    .142871    -0.46   0.649     .6906629    1.259161
Obese II..)  |   .8897785    .146046    -0.71   0.477      .645012    1.227428
Obese II..)  |   .9424748   .1719509    -0.32   0.745     .6591304    1.347622
             |
1.cardiova~r |   .9089256   .0775592    -1.12   0.263     .7689441     1.07439
  1.diabetes |   .8700786   .0775745    -1.56   0.119     .7305787    1.036215
1.hyperten~n |   1.148419   .0933456     1.70   0.089     .9792942    1.346752
1.immunosu~d |   .9445429   .1041445    -0.52   0.605     .7609723    1.172396
1.non_haem~r |   1.282839   .2750457     1.16   0.245     .8426967    1.952869
             |
     smoking |
Current/f..  |   .9241413   .0762419    -0.96   0.339     .7861655    1.086332
        age1 |   1.003569   .0120711     0.30   0.767     .9801868    1.027509
        age2 |   1.009941   .0366443     0.27   0.785     .9406139    1.084378
        age3 |   .9509882    .099255    -0.48   0.630     .7750592    1.166851
------------------------------------------------------------------------------
                                                     Stratified by practice_id

                id:  patient_id
     failure event:  aki_date != 0 & aki_date < .
obs. time interval:  (exit_date_aki[_n-1], exit_date_aki]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_aki

------------------------------------------------------------------------------
     27,845  total observations
        971  observations end on or before enter()
         65  observations begin on or after (first) failure
------------------------------------------------------------------------------
     26,809  observations remaining, representing
     26,563  subjects
      4,324  failures in single-failure-per-subject data
 44,454.261  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  5.744011

         failure _d:  aki_date
   analysis time _t:  (exit_date_aki-origin)/365.25
             origin:  time index_date_aki
                 id:  patient_id

Iteration 0:   log pseudolikelihood =  -32805.13
Iteration 1:   log pseudolikelihood = -32804.883
Iteration 2:   log pseudolikelihood = -32804.883
Refining estimates:
Iteration 0:   log pseudolikelihood = -32804.883

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       26,563             Number of obs    =      26,809
No. of failures      =        4,324
Time at risk         =  44454.26146
                                                Wald chi2(1)     =        0.50
Log pseudolikelihood =   -32804.883             Prob > chi2      =      0.4797

                             (Std. Err. adjusted for 7,980 clusters in set_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   1.024158   .0345877     0.71   0.480      .958562    1.094242
------------------------------------------------------------------------------
                                                     Stratified by practice_id

         failure _d:  aki_date
   analysis time _t:  (exit_date_aki-origin)/365.25
             origin:  time index_date_aki
                 id:  patient_id

Iteration 0:   log pseudolikelihood =  -32805.13
Iteration 1:   log pseudolikelihood = -32801.986
Iteration 2:   log pseudolikelihood = -32801.985
Refining estimates:
Iteration 0:   log pseudolikelihood = -32801.985

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       26,563             Number of obs    =      26,809
No. of failures      =        4,324
Time at risk         =  44454.26146
                                                Wald chi2(5)     =        6.14
Log pseudolikelihood =   -32801.985             Prob > chi2      =      0.2933

                             (Std. Err. adjusted for 7,980 clusters in set_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   1.014825    .034587     0.43   0.666     .9492497    1.084929
             |
         sex |
       Male  |    .979554   .0297657    -0.68   0.497     .9229176    1.039666
        age1 |   1.003897   .0053156     0.73   0.463     .9935324     1.01437
        age2 |   .9920594   .0161312    -0.49   0.624     .9609413    1.024185
        age3 |    1.02717   .0483596     0.57   0.569      .936629    1.126464
------------------------------------------------------------------------------
                                                     Stratified by practice_id

         failure _d:  aki_date
   analysis time _t:  (exit_date_aki-origin)/365.25
             origin:  time index_date_aki
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -2782.5324
Iteration 1:   log pseudolikelihood = -2766.1707
Iteration 2:   log pseudolikelihood =  -2766.091
Iteration 3:   log pseudolikelihood =  -2766.091
Refining estimates:
Iteration 0:   log pseudolikelihood =  -2766.091

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,202             Number of obs    =       3,204
No. of failures      =          506
Time at risk         =  5305.207392
                                                Wald chi2(28)    =       31.57
Log pseudolikelihood =    -2766.091             Prob > chi2      =      0.2924

                             (Std. Err. adjusted for 2,722 clusters in set_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   .9700602   .1000304    -0.29   0.768     .7925465    1.187333
             |
         sex |
       Male  |   1.085219   .0968754     0.92   0.360     .9110288    1.292714
             |
   ethnicity |
South Asian  |   .7420538   .1761377    -1.26   0.209     .4660042    1.181629
      Black  |   .9644745   .1945351    -0.18   0.858     .6495354    1.432118
      Mixed  |   .7229879    .164843    -1.42   0.155     .4624396    1.130335
      Other  |   1.077793   .2266283     0.36   0.722     .7137606    1.627489
             |
         imd |
          2  |   .8867622   .1285707    -0.83   0.407     .6674095    1.178208
          3  |   .9868932   .1396082    -0.09   0.926     .7479235    1.302216
          4  |   1.075627   .1521446     0.52   0.606     .8151954     1.41926
5 Least d..  |   .9659107   .1358178    -0.25   0.805     .7332441    1.272405
             |
       urban |
      Urban  |   .7968676   .0749716    -2.41   0.016     .6626782    .9582297
             |
      region |
       East  |    .982942   .2033225    -0.08   0.934     .6553239    1.474347
     London  |   1.162904   .2036033     0.86   0.389     .8251143     1.63898
 North East  |   1.282031   .2531393     1.26   0.208     .8706176     1.88786
 North West  |   .9627684   .2000597    -0.18   0.855     .6406861    1.446766
 South East  |   .9517229   .1971426    -0.24   0.811     .6341473    1.428338
 South West  |   1.215472   .2431898     0.98   0.329     .8211785    1.799086
West Midl..  |   1.002876   .2089852     0.01   0.989     .6666055    1.508779
Yorkshire..  |   .9035622   .2022992    -0.45   0.651     .5826153     1.40131
             |
         bmi |
Normal (..)  |    .866756   .1612865    -0.77   0.442     .6018729    1.248214
Overweig..)  |   .9032003    .168252    -0.55   0.585     .6269293    1.301217
Obese I ..)  |   .8425416   .1579604    -0.91   0.361      .583455    1.216677
Obese II..)  |   .7234059   .1535874    -1.53   0.127      .477158    1.096735
Obese II..)  |   .9010004    .211971    -0.44   0.658     .5681588    1.428829
             |
     smoking |
Current/f..  |   .9124463   .0987908    -0.85   0.397      .737985    1.128151
        age1 |   1.024579   .0172935     1.44   0.150     .9912384     1.05904
        age2 |    .959491   .0477358    -0.83   0.406     .8703473    1.057765
        age3 |   1.110998   .1569912     0.74   0.456     .8422348    1.465526
------------------------------------------------------------------------------
                                                     Stratified by practice_id

         failure _d:  aki_date
   analysis time _t:  (exit_date_aki-origin)/365.25
             origin:  time index_date_aki
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -2782.5324
Iteration 1:   log pseudolikelihood = -2761.5769
Iteration 2:   log pseudolikelihood = -2761.3992
Iteration 3:   log pseudolikelihood = -2761.3989
Refining estimates:
Iteration 0:   log pseudolikelihood = -2761.3989

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,202             Number of obs    =       3,204
No. of failures      =          506
Time at risk         =  5305.207392
                                                Wald chi2(33)    =       42.13
Log pseudolikelihood =   -2761.3989             Prob > chi2      =      0.1324

                             (Std. Err. adjusted for 2,722 clusters in set_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   .9733916   .1004945    -0.26   0.794     .7950751      1.1917
             |
         sex |
       Male  |   1.084292   .0970411     0.90   0.366     .9098417     1.29219
             |
   ethnicity |
South Asian  |   .7451329   .1775509    -1.23   0.217     .4670988    1.188663
      Black  |   .9504418    .192751    -0.25   0.802     .6387054    1.414329
      Mixed  |   .7218607   .1645502    -1.43   0.153     .4617635    1.128463
      Other  |   1.077143    .225949     0.35   0.723     .7140351    1.624903
             |
         imd |
          2  |   .8899528   .1289516    -0.80   0.421     .6699313    1.182235
          3  |   .9942926   .1404753    -0.04   0.968      .753798    1.311515
          4  |   1.081902   .1540171     0.55   0.580     .8184888    1.430089
5 Least d..  |   .9674238   .1366008    -0.23   0.815     .7335448    1.275872
             |
       urban |
      Urban  |   .7950266   .0748786    -2.44   0.015     .6610165    .9562051
             |
      region |
       East  |   .9801178   .2029017    -0.10   0.923     .6532276    1.470592
     London  |   1.149823   .2012755     0.80   0.425     .8158848     1.62044
 North East  |   1.260559   .2507568     1.16   0.244     .8535676    1.861609
 North West  |   .9640343   .2007496    -0.18   0.860      .640972    1.449926
 South East  |   .9533562   .1976599    -0.23   0.818      .635002    1.431315
 South West  |   1.211866    .241748     0.96   0.335     .8196968     1.79166
West Midl..  |   1.004021   .2091378     0.02   0.985     .6674781    1.510248
Yorkshire..  |   .8963756   .2016436    -0.49   0.627     .5767777    1.393066
             |
         bmi |
Normal (..)  |   .8774508   .1647351    -0.70   0.486     .6073174    1.267739
Overweig..)  |   .9066316   .1707609    -0.52   0.603     .6267725     1.31145
Obese I ..)  |   .8509201   .1613264    -0.85   0.394     .5868256    1.233868
Obese II..)  |   .7277176   .1557827    -1.48   0.138     .4783501    1.107082
Obese II..)  |   .9123856   .2173527    -0.38   0.700     .5720069     1.45531
             |
1.cardiova~r |   .7410142   .0905458    -2.45   0.014      .583199    .9415346
  1.diabetes |   .9389915   .1067094    -0.55   0.580     .7514999     1.17326
1.hyperten~n |   .9311894   .1060159    -0.63   0.531     .7449528    1.163985
1.immunosu~d |   .9494997   .1450745    -0.34   0.734     .7037839    1.281004
1.non_haem~r |   .5944516   .2293458    -1.35   0.178     .2790704    1.266249
             |
     smoking |
Current/f..  |   .9101953   .0985505    -0.87   0.385     .7361589    1.125376
        age1 |   1.023825   .0172446     1.40   0.162      .990578    1.058188
        age2 |   .9617086   .0478176    -0.79   0.432     .8724096    1.060148
        age3 |   1.103219   .1559877     0.69   0.487      .836195    1.455512
------------------------------------------------------------------------------
                                                     Stratified by practice_id

                id:  patient_id
     failure event:  death_date != 0 & death_date < .
obs. time interval:  (exit_date_death[_n-1], exit_date_death]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_death

------------------------------------------------------------------------------
     27,845  total observations
         12  observations begin on or after (first) failure
------------------------------------------------------------------------------
     27,833  observations remaining, representing
     27,534  subjects
      1,667  failures in single-failure-per-subject data
 50,214.486  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  5.744011

         failure _d:  death_date
   analysis time _t:  (exit_date_death-origin)/365.25
             origin:  time index_date_death
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -12721.337
Iteration 1:   log pseudolikelihood = -12676.174
Iteration 2:   log pseudolikelihood = -12675.436
Iteration 3:   log pseudolikelihood = -12675.436
Refining estimates:
Iteration 0:   log pseudolikelihood = -12675.436

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       27,534             Number of obs    =      27,833
No. of failures      =        1,667
Time at risk         =  50214.48597
                                                Wald chi2(1)     =       81.56
Log pseudolikelihood =   -12675.436             Prob > chi2      =      0.0000

                             (Std. Err. adjusted for 7,981 clusters in set_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   .5606899   .0359214    -9.03   0.000     .4945261    .6357058
------------------------------------------------------------------------------
                                                     Stratified by practice_id

         failure _d:  death_date
   analysis time _t:  (exit_date_death-origin)/365.25
             origin:  time index_date_death
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -12721.337
Iteration 1:   log pseudolikelihood = -12670.833
Iteration 2:   log pseudolikelihood =  -12670.08
Iteration 3:   log pseudolikelihood = -12670.079
Refining estimates:
Iteration 0:   log pseudolikelihood = -12670.079

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       27,534             Number of obs    =      27,833
No. of failures      =        1,667
Time at risk         =  50214.48597
                                                Wald chi2(5)     =       92.43
Log pseudolikelihood =   -12670.079             Prob > chi2      =      0.0000

                             (Std. Err. adjusted for 7,981 clusters in set_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   .5489761   .0354426    -9.29   0.000     .4837253    .6230288
             |
         sex |
       Male  |   .9316256   .0455888    -1.45   0.148     .8464243    1.025403
        age1 |   1.014846   .0083829     1.78   0.074     .9985485     1.03141
        age2 |   .9536573   .0242653    -1.86   0.062     .9072645    1.002422
        age3 |    1.16192   .0855662     2.04   0.042     1.005754    1.342333
------------------------------------------------------------------------------
                                                     Stratified by practice_id

         failure _d:  death_date
   analysis time _t:  (exit_date_death-origin)/365.25
             origin:  time index_date_death
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -1240.0913
Iteration 1:   log pseudolikelihood = -1219.3809
Iteration 2:   log pseudolikelihood = -1218.8097
Iteration 3:   log pseudolikelihood = -1218.8086
Refining estimates:
Iteration 0:   log pseudolikelihood = -1218.8086

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,323             Number of obs    =       3,325
No. of failures      =          228
Time at risk         =   5981.61807
                                                Wald chi2(28)    =       40.87
Log pseudolikelihood =   -1218.8086             Prob > chi2      =      0.0552

                             (Std. Err. adjusted for 2,810 clusters in set_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   .4865303   .0932156    -3.76   0.000     .3342151    .7082617
             |
         sex |
       Male  |   .8423051   .1142367    -1.27   0.206     .6456931    1.098785
             |
   ethnicity |
South Asian  |   .9349885   .3002482    -0.21   0.834     .4982694     1.75448
      Black  |   1.606042   .3986316     1.91   0.056      .987375     2.61235
      Mixed  |   .8584371    .281732    -0.47   0.642     .4511813      1.6333
      Other  |   .4550479   .2114217    -1.69   0.090      .183053    1.131195
             |
         imd |
          2  |   1.128674   .2372831     0.58   0.565     .7475133     1.70419
          3  |   1.019933   .2215573     0.09   0.928     .6662968    1.561263
          4  |   .9376865    .211659    -0.29   0.776     .6024492    1.459469
5 Least d..  |   1.140756   .2463371     0.61   0.542     .7471062    1.741818
             |
       urban |
      Urban  |   .8834711   .1216106    -0.90   0.368     .6745647    1.157074
             |
      region |
       East  |   .9875079   .3084423    -0.04   0.968     .5353931    1.821413
     London  |   .9568568   .2485238    -0.17   0.865     .5751285    1.591948
 North East  |   1.093649   .3150127     0.31   0.756     .6218695    1.923342
 North West  |   1.007794   .3071165     0.03   0.980     .5545939    1.831336
 South East  |   1.160748   .3418102     0.51   0.613       .65175    2.067258
 South West  |   1.084719    .323423     0.27   0.785     .6046733    1.945871
West Midl..  |    1.33838   .3828048     1.02   0.308     .7640436     2.34445
Yorkshire..  |   .8925941   .2920869    -0.35   0.728     .4700155    1.695102
             |
         bmi |
Normal (..)  |   .6031329   .1536705    -1.98   0.047     .3660479    .9937753
Overweig..)  |   .5941915   .1511868    -2.05   0.041     .3608658    .9783791
Obese I ..)  |   .4293025   .1172114    -3.10   0.002     .2513981    .7331028
Obese II..)  |   .5658606   .1641973    -1.96   0.050     .3204159    .9993206
Obese II..)  |   .5465476    .183264    -1.80   0.072      .283276    1.054499
             |
     smoking |
Current/f..  |   1.055064    .173004     0.33   0.744     .7650735    1.454972
        age1 |   1.023145   .0249095     0.94   0.347     .9754694     1.07315
        age2 |   .9633042   .0702971    -0.51   0.608     .8349242    1.111424
        age3 |    1.10617   .2305542     0.48   0.628     .7352073     1.66431
------------------------------------------------------------------------------
                                                     Stratified by practice_id

         failure _d:  death_date
   analysis time _t:  (exit_date_death-origin)/365.25
             origin:  time index_date_death
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -1240.0913
Iteration 1:   log pseudolikelihood = -1217.7533
Iteration 2:   log pseudolikelihood = -1217.1442
Iteration 3:   log pseudolikelihood = -1217.1431
Refining estimates:
Iteration 0:   log pseudolikelihood = -1217.1431

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        3,323             Number of obs    =       3,325
No. of failures      =          228
Time at risk         =   5981.61807
                                                Wald chi2(33)    =       44.30
Log pseudolikelihood =   -1217.1431             Prob > chi2      =      0.0905

                             (Std. Err. adjusted for 2,810 clusters in set_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   .4865465   .0932242    -3.76   0.000     .3342188    .7083009
             |
         sex |
       Male  |   .8528368   .1161092    -1.17   0.242     .6530996     1.11366
             |
   ethnicity |
South Asian  |   .9254637   .2959975    -0.24   0.809     .4944401    1.732228
      Black  |   1.605444   .4003887     1.90   0.058     .9847148     2.61746
      Mixed  |   .8630715    .283967    -0.45   0.654     .4528821    1.644782
      Other  |   .4519163   .2112357    -1.70   0.089     .1807954     1.12961
             |
         imd |
          2  |   1.134518   .2396591     0.60   0.550     .7498955    1.716413
          3  |   1.019156   .2209828     0.09   0.930     .6663084    1.558856
          4  |   .9368163   .2113976    -0.29   0.772      .601972    1.457916
5 Least d..  |   1.128945   .2447017     0.56   0.576     .7381981    1.726525
             |
       urban |
      Urban  |   .8774919   .1212968    -0.95   0.344     .6692378    1.150551
             |
      region |
       East  |   .9896616   .3101056    -0.03   0.974     .5355092     1.82897
     London  |    .966545   .2522891    -0.13   0.896     .5794822    1.612145
 North East  |   1.117695   .3240474     0.38   0.701     .6331971    1.972912
 North West  |   1.024452   .3144956     0.08   0.937     .5612831    1.869826
 South East  |   1.157121   .3422122     0.49   0.622      .648098    2.065936
 South West  |   1.082864   .3231359     0.27   0.790     .6033482    1.943478
West Midl..  |   1.328825   .3820384     0.99   0.323      .756391    2.334473
Yorkshire..  |   .8928105   .2925036    -0.35   0.729     .4697726    1.696801
             |
         bmi |
Normal (..)  |   .6080108    .154905    -1.95   0.051     .3690182    1.001786
Overweig..)  |   .6054781   .1539426    -1.97   0.048     .3678585     .996589
Obese I ..)  |   .4396395   .1199852    -3.01   0.003      .257507    .7505927
Obese II..)  |   .5755477   .1671813    -1.90   0.057     .3257091    1.017027
Obese II..)  |   .5578007   .1868238    -1.74   0.081     .2893255    1.075403
             |
1.cardiova~r |   1.037069   .1709268     0.22   0.825     .7507844    1.432519
  1.diabetes |   1.008202   .1725099     0.05   0.962     .7209439    1.409917
1.hyperten~n |    .908264   .1594504    -0.55   0.584      .643842    1.281282
1.immunosu~d |   .6722892   .1788558    -1.49   0.136     .3991191    1.132426
1.non_haem~r |   1.346488   .4948452     0.81   0.418     .6552074    2.767107
             |
     smoking |
Current/f..  |   1.061823   .1748263     0.36   0.716     .7689603    1.466223
        age1 |   1.023335   .0249791     0.94   0.345     .9755291    1.073483
        age2 |   .9627317   .0705817    -0.52   0.604     .8338737    1.111502
        age3 |   1.109289   .2324315     0.50   0.621     .7356827    1.672625
------------------------------------------------------------------------------
                                                     Stratified by practice_id

. 
. file close tablecontent

. 
end of do-file

. . file open output using "/tmp/cox_2017_case.do.Zxag.out", write text replace

. . file write output "success" 

. . file close output

. 
end of do-file


