-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/cox_2017_covid_aki.log
  log type:  text
 opened on:  27 Jan 2023, 15:00:40

. 
. cap file close tablecontent

. file open tablecontent using ./output/cox_2017_covid_aki.txt, write text repl
> ace
(note: file ./output/cox_2017_covid_aki.txt not found)

. file write tablecontent ("Kidney outcomes by COVID-19 AKI compared to matched
>  historical general population") _n

. file write tablecontent _n

. file write tablecontent ("Historical general population matched on age, sex a
> nd STP") _n

. file write tablecontent ("Restricted to those who survived 28 days after firs
> t recorded SARS-CoV-2 or equivalent date of matching") _n

. file write tablecontent ("All models stratified by matched set and clustering
>  by general practice accounted for using robust standard errors") _n

. file write tablecontent _n

. file write tablecontent ("Cox regression models:") _n

. file write tablecontent ("1. Crude") _n

. file write tablecontent ("2. Minimally adjusted: adjusted for age (using spli
> ne functions) and sex") _n

. file write tablecontent ("3. Additionally adjusted: additionally adjusted for
>  ethnicity, socioeconomic deprivation, region, rural/urban, body mass index a
> nd smoking") _n

. file write tablecontent ("4. Fully adjusted: additionally adjusted for cardio
> vascular diseases, diabetes, hypertension, immunocompromise and cancer") _n

. file write tablecontent _n

. file write tablecontent _tab _tab _tab _tab _tab ("Number") _tab _tab ("Event
> ") _tab ("Total person-years") _tab ("Rate per 100,000") _tab ("Crude") _tab 
> _tab _tab ("Minimally adjusted") _tab ("Additionally adjusted") _tab ("Fully 
> adjusted") _tab _tab _n

. file write tablecontent _tab _tab _tab _tab _tab _tab _tab _tab _tab _tab _ta
> b _tab _tab _tab ("HR") _tab ("95% CI") _tab _tab ("HR") _tab ("95% CI") _tab
>  _tab ("HR") _tab ("95% CI") _tab _tab ("HR") _tab ("95% CI") _tab _tab _n

. file write tablecontent ("By COVID-19 AKI") _n

. 
. use ./output/analysis_2017.dta, clear

. foreach outcome of varlist esrd egfr_half aki death {
  2. stset exit_date_`outcome', fail(`outcome'_date) origin(index_date_`outcome
> ') id(patient_id) scale(365.25)
  3. bysort covid_aki: egen total_follow_up_`outcome' = total(_t)
  4. 
. stcox i.covid_aki, vce(cluster practice_id) strata(set_id)
  5. matrix table = r(table)
  6. local crude_`outcome'_1b: display %4.2f table[1,2]
  7. local crude_`outcome'_1ll: display %4.2f table[5,2]
  8. local crude_`outcome'_1ul: display %4.2f table[6,2]
  9. local crude_`outcome'_2b: display %4.2f table[1,3]
 10. local crude_`outcome'_2ll: display %4.2f table[5,3]
 11. local crude_`outcome'_2ul: display %4.2f table[6,3]
 12. local crude_`outcome'_3b: display %4.2f table[1,4]
 13. local crude_`outcome'_3ll: display %4.2f table[5,4]
 14. local crude_`outcome'_3ul: display %4.2f table[6,4]
 15. 
. stcox i.covid_aki i.sex age1 age2 age3, vce(cluster practice_id) strata(set_i
> d)
 16. matrix table = r(table)
 17. local minimal_`outcome'_1b: display %4.2f table[1,2]
 18. local minimal_`outcome'_1ll: display %4.2f table[5,2]
 19. local minimal_`outcome'_1ul: display %4.2f table[6,2]
 20. local minimal_`outcome'_2b: display %4.2f table[1,3]
 21. local minimal_`outcome'_2ll: display %4.2f table[5,3]
 22. local minimal_`outcome'_2ul: display %4.2f table[6,3]
 23. local minimal_`outcome'_3b: display %4.2f table[1,4]
 24. local minimal_`outcome'_3ll: display %4.2f table[5,4]
 25. local minimal_`outcome'_3ul: display %4.2f table[6,4]
 26. 
. stcox i.covid_aki i.sex i.ethnicity i.imd i.urban i.region i.bmi i.smoking ag
> e1 age2 age3, vce(cluster practice_id) strata(set_id)
 27. matrix table = r(table)
 28. local additional_`outcome'_1b: display %4.2f table[1,2]
 29. local additional_`outcome'_1ll: display %4.2f table[5,2]
 30. local additional_`outcome'_1ul: display %4.2f table[6,2]
 31. local additional_`outcome'_2b: display %4.2f table[1,3]
 32. local additional_`outcome'_2ll: display %4.2f table[5,3]
 33. local additional_`outcome'_2ul: display %4.2f table[6,3]
 34. local additional_`outcome'_3b: display %4.2f table[1,4]
 35. local additional_`outcome'_3ll: display %4.2f table[5,4]
 36. local additional_`outcome'_3ul: display %4.2f table[6,4]
 37. 
. stcox i.covid_aki i.sex i.ethnicity i.imd i.urban i.region i.bmi i.cardiovasc
> ular i.diabetes i.hypertension i.immunosuppressed i.non_haem_cancer i.smoking
>  age1 age2 age3, vce(cluster practice_id) strata(set_id)              
 38. matrix table = r(table)
 39. local full_`outcome'_1b: display %4.2f table[1,2]
 40. local full_`outcome'_1ll: display %4.2f table[5,2]
 41. local full_`outcome'_1ul: display %4.2f table[6,2]
 42. local full_`outcome'_2b: display %4.2f table[1,3]
 43. local full_`outcome'_2ll: display %4.2f table[5,3]
 44. local full_`outcome'_2ul: display %4.2f table[6,3]
 45. local full_`outcome'_3b: display %4.2f table[1,4]
 46. local full_`outcome'_3ll: display %4.2f table[5,4]
 47. local full_`outcome'_3ul: display %4.2f table[6,4]
 48.                                                                           
>       
. local lab0: label covid_aki 0
 49. local lab1: label covid_aki 1
 50. local lab2: label covid_aki 2
 51. local lab3: label covid_aki 3
 52. 
.         qui safecount if covid_aki==0 & `outcome'_denominator==1 & _st==1
 53.         local denominator = round(r(N),5)
 54.         qui safecount if covid_aki== 0 & `outcome'==1 & _st==1
 55.         local event = round(r(N),5)
 56.         qui su total_follow_up_`outcome' if covid_aki==0
 57.         local person_year = r(mean)
 58.         local rate = 100000*(`event'/`person_year')
 59.         
.         file write tablecontent _n
 60.         file write tablecontent ("`outcome'") _n
 61.         file write tablecontent _tab ("`lab0'") _tab _tab (`denominator') 
> _tab _tab (`event') _tab %10.0f (`person_year') _tab _tab %3.2f (`rate') _tab
>  _tab _tab
 62.         file write tablecontent ("1.00") _tab _tab _tab ("1.00") _tab _tab
>  _tab ("1.00") _tab _tab _tab ("1.00") _n
 63.         
. forvalues severity=1/3 {
 64.         qui safecount if covid_aki==`severity'  & `outcome'_denominator==1
>  & _st==1
 65.         local denominator = round(r(N),5)
 66.         qui safecount if covid_aki==`severity' & `outcome'==1 &  _st==1
 67.         local event = round(r(N),5)
 68.         qui su total_follow_up_`outcome' if covid_aki==`severity'
 69.         local person_year = r(mean)
 70.         local rate = 100000*(`event'/`person_year')
 71.         file write tablecontent _tab ("`lab`severity''") _tab _tab (`denom
> inator') _tab _tab (`event') _tab %10.0f (`person_year') _tab _tab %3.2f (`ra
> te') _tab _tab
 72.         file write tablecontent  _tab %4.2f (`crude_`outcome'_`severity'b'
> ) _tab ("(") %4.2f (`crude_`outcome'_`severity'll') (" - ") %4.2f (`crude_`ou
> tcome'_`severity'ul') (")")
 73.         file write tablecontent  _tab %4.2f (`minimal_`outcome'_`severity'
> b') _tab ("(") %4.2f (`minimal_`outcome'_`severity'll') (" - ") %4.2f (`minim
> al_`outcome'_`severity'ul') (")")
 74.         file write tablecontent  _tab %4.2f (`additional_`outcome'_`severi
> ty'b') _tab ("(") %4.2f (`additional_`outcome'_`severity'll') (" - ") %4.2f (
> `additional_`outcome'_`severity'ul') (")")
 75.         file write tablecontent  _tab %4.2f (`full_`outcome'_`severity'b')
>  _tab ("(") %4.2f (`full_`outcome'_`severity'll') (" - ") %4.2f (`full_`outco
> me'_`severity'ul') (")") _tab _n
 76.         }
 77. }

                id:  patient_id
     failure event:  esrd_date != 0 & esrd_date < .
obs. time interval:  (exit_date_esrd[_n-1], exit_date_esrd]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_esrd

------------------------------------------------------------------------------
     27,845  total observations
         37  observations begin on or after (first) failure
------------------------------------------------------------------------------
     27,808  observations remaining, representing
     27,534  subjects
      2,778  failures in single-failure-per-subject data
 47,368.413  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  5.744011

         failure _d:  esrd_date
   analysis time _t:  (exit_date_esrd-origin)/365.25
             origin:  time index_date_esrd
                 id:  patient_id

Iteration 0:   log pseudolikelihood =  -3290.745
Iteration 1:   log pseudolikelihood = -3287.8647
Iteration 2:   log pseudolikelihood =  -3287.857
Iteration 3:   log pseudolikelihood =  -3287.857
Refining estimates:
Iteration 0:   log pseudolikelihood =  -3287.857

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       27,534             Number of obs    =      27,808
No. of failures      =        2,778
Time at risk         =  47368.41342
                                                Wald chi2(3)     =        7.95
Log pseudolikelihood =    -3287.857             Prob > chi2      =      0.0470

                           (Std. Err. adjusted for 38 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   covid_aki |
Non-hospi..  |    .967219   .0281927    -1.14   0.253     .9135111    1.024085
Hospitali..  |   1.363019   .1609832     2.62   0.009     1.081355    1.718049
Hospitali..  |   .9661793   .1301892    -0.26   0.798     .7419273    1.258213
------------------------------------------------------------------------------
                                                          Stratified by set_id

         failure _d:  esrd_date
   analysis time _t:  (exit_date_esrd-origin)/365.25
             origin:  time index_date_esrd
                 id:  patient_id

Iteration 0:   log pseudolikelihood =  -3290.745
Iteration 1:   log pseudolikelihood = -3287.6962
Iteration 2:   log pseudolikelihood = -3287.6885
Iteration 3:   log pseudolikelihood = -3287.6885
Refining estimates:
Iteration 0:   log pseudolikelihood = -3287.6885

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       27,534             Number of obs    =      27,808
No. of failures      =        2,778
Time at risk         =  47368.41342
                                                Wald chi2(6)     =       16.11
Log pseudolikelihood =   -3287.6885             Prob > chi2      =      0.0132

                           (Std. Err. adjusted for 38 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   covid_aki |
Non-hospi..  |   .9633817   .0293184    -1.23   0.220     .9075989    1.022593
Hospitali..  |   1.359618   .1632412     2.56   0.011     1.074529    1.720345
Hospitali..  |   .9614412   .1307936    -0.29   0.773     .7364208    1.255219
             |
         sex |
       Male  |          1  (omitted)
        age1 |   1.004155   .0042868     0.97   0.331     .9957879    1.012592
        age2 |   .9888962     .01369    -0.81   0.420     .9624251    1.016095
        age3 |   1.030965   .0435762     0.72   0.471     .9489988     1.12001
------------------------------------------------------------------------------
                                                          Stratified by set_id

         failure _d:  esrd_date
   analysis time _t:  (exit_date_esrd-origin)/365.25
             origin:  time index_date_esrd
                 id:  patient_id

Iteration 0:   log pseudolikelihood =  -72.38854
Iteration 1:   log pseudolikelihood = -58.627992
Iteration 2:   log pseudolikelihood = -57.994561
Iteration 3:   log pseudolikelihood = -57.977142
Iteration 4:   log pseudolikelihood = -57.977114
Refining estimates:
Iteration 0:   log pseudolikelihood = -57.977114

Stratified Cox regr. -- no ties

No. of subjects      =        3,321             Number of obs    =       3,323
No. of failures      =          344
Time at risk         =  5619.786448
                                                Wald chi2(22)    =    10723.38
Log pseudolikelihood =   -57.977114             Prob > chi2      =      0.0000

                           (Std. Err. adjusted for 35 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   covid_aki |
Non-hospi..  |   .4449426   .1491672    -2.42   0.016      .230642    .8583603
Hospitali..  |   .1677058   .0794949    -3.77   0.000     .0662318    .4246486
Hospitali..  |   .4210924   .3294507    -1.11   0.269     .0908702    1.951341
             |
         sex |
       Male  |          1  (omitted)
             |
   ethnicity |
South Asian  |    .845183   .2861151    -0.50   0.619     .4353096     1.64098
      Black  |   1.359608   .8470552     0.49   0.622     .4009619     4.61025
      Mixed  |   .8433809    .657856    -0.22   0.827     .1828384    3.890273
      Other  |   .9182945    .555219    -0.14   0.888     .2807558    3.003553
             |
         imd |
          2  |   .4223583   .1151046    -3.16   0.002     .2475737     .720539
          3  |   .7224355   .2233986    -1.05   0.293      .394078     1.32439
          4  |   .6367066     .25234    -1.14   0.255     .2928131    1.384485
5 Least d..  |   1.089207   .4025331     0.23   0.817     .5278812    2.247424
             |
       urban |
      Urban  |    1.14316   .2990427     0.51   0.609     .6846026    1.908866
             |
      region |
       East  |   1.331958   .5147898     0.74   0.458     .6244658    2.841007
     London  |   1.352784   .4146839     0.99   0.324     .7418226    2.466929
 North East  |   .6986213   .1966849    -1.27   0.203     .4023468    1.213062
 North West  |   .9288466   .3086634    -0.22   0.824     .4842646     1.78158
 South East  |   .7790684   .3379567    -0.58   0.565     .3329107    1.823154
 South West  |   .8290838   .5140269    -0.30   0.762     .2459567    2.794719
West Midl..  |   1.386949   .5699885     0.80   0.426     .6197918    3.103667
Yorkshire..  |   1.869684   1.096633     1.07   0.286     .5922565    5.902371
             |
         bmi |
Normal (..)  |   .0701792   .0412312    -4.52   0.000     .0221879    .2219734
Overweig..)  |   .1187613   .0546375    -4.63   0.000     .0482026    .2926036
Obese I ..)  |     .07619   .0322659    -6.08   0.000     .0332216    .1747334
Obese II..)  |   .1239061   .0665756    -3.89   0.000     .0432252    .3551804
Obese II..)  |   .1504388   .1281861    -2.22   0.026     .0283183    .7991952
             |
     smoking |
Current/f..  |   1.879146   .4353407     2.72   0.006     1.193337    2.959088
        age1 |   1.119065   .1000668     1.26   0.208      .939163    1.333429
        age2 |   .7899977   .2297472    -0.81   0.418     .4467652    1.396923
        age3 |   1.859749   1.569787     0.74   0.462     .3556048     9.72615
------------------------------------------------------------------------------
                                                          Stratified by set_id

         failure _d:  esrd_date
   analysis time _t:  (exit_date_esrd-origin)/365.25
             origin:  time index_date_esrd
                 id:  patient_id

Iteration 0:   log pseudolikelihood =  -72.38854
Iteration 1:   log pseudolikelihood = -54.283108
Iteration 2:   log pseudolikelihood = -52.713228
Iteration 3:   log pseudolikelihood = -52.551135
Iteration 4:   log pseudolikelihood = -52.529772
Iteration 5:   log pseudolikelihood = -52.522436
Iteration 6:   log pseudolikelihood = -52.519755
Iteration 7:   log pseudolikelihood = -52.518771
Iteration 8:   log pseudolikelihood =  -52.51841
Iteration 9:   log pseudolikelihood = -52.518277
Iteration 10:  log pseudolikelihood = -52.518228
Iteration 11:  log pseudolikelihood =  -52.51821
Iteration 12:  log pseudolikelihood = -52.518203
Iteration 13:  log pseudolikelihood = -52.518201
Iteration 14:  log pseudolikelihood =   -52.5182
Iteration 15:  log pseudolikelihood =   -52.5182
Iteration 16:  log pseudolikelihood =   -52.5182
Iteration 17:  log pseudolikelihood =   -52.5182
Iteration 18:  log pseudolikelihood =   -52.5182
Iteration 19:  log pseudolikelihood =   -52.5182
Iteration 20:  log pseudolikelihood =   -52.5182
Iteration 21:  log pseudolikelihood =   -52.5182
Iteration 22:  log pseudolikelihood =   -52.5182
Iteration 23:  log pseudolikelihood =   -52.5182
Iteration 24:  log pseudolikelihood =   -52.5182
Iteration 25:  log pseudolikelihood =   -52.5182
Iteration 26:  log pseudolikelihood =   -52.5182
Iteration 27:  log pseudolikelihood =   -52.5182
Iteration 28:  log pseudolikelihood =   -52.5182
Iteration 29:  log pseudolikelihood =   -52.5182
Iteration 30:  log pseudolikelihood =   -52.5182
Iteration 31:  log pseudolikelihood =   -52.5182
Iteration 32:  log pseudolikelihood =   -52.5182
Refining estimates:
Iteration 0:   log pseudolikelihood =   -52.5182
Iteration 1:   log pseudolikelihood =   -52.5182
Iteration 2:   log pseudolikelihood =   -52.5182
Iteration 3:   log pseudolikelihood =   -52.5182

Stratified Cox regr. -- no ties

No. of subjects      =        3,321             Number of obs    =       3,323
No. of failures      =          344
Time at risk         =  5619.786448
                                                Wald chi2(22)    =     8162.80
Log pseudolikelihood =     -52.5182             Prob > chi2      =      0.0000

                           (Std. Err. adjusted for 35 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   covid_aki |
Non-hospi..  |   .4146312   .1493156    -2.44   0.014     .2047058    .8398346
Hospitali..  |   .1313674    .050863    -5.24   0.000     .0615061    .2805803
Hospitali..  |   .1622789   .1712845    -1.72   0.085     .0205033    1.284402
             |
         sex |
       Male  |          1  (omitted)
             |
   ethnicity |
South Asian  |   .4113417   .2556857    -1.43   0.153     .1216479    1.390915
      Black  |      1.354   .8498873     0.48   0.629     .3956684    4.633468
      Mixed  |   .8324009    .746394    -0.20   0.838     .1435755     4.82597
      Other  |   1.322369   .8227182     0.45   0.653      .390637     4.47643
             |
         imd |
          2  |   .4911916   .1147275    -3.04   0.002     .3107678    .7763649
          3  |   .7517579    .198859    -1.08   0.281     .4476243    1.262532
          4  |   .7667591   .2787317    -0.73   0.465     .3760372    1.563461
5 Least d..  |   1.232734   .3955692     0.65   0.514     .6572476    2.312115
             |
       urban |
      Urban  |   .8806964   .2115157    -0.53   0.597       .55004    1.410127
             |
      region |
       East  |   1.460532    .870562     0.64   0.525      .454094    4.697607
     London  |   1.399427   .4740633     0.99   0.321     .7204461    2.718312
 North East  |   1.088448   .3831129     0.24   0.810     .5460102    2.169773
 North West  |   2.051298   .7297979     2.02   0.043     1.021395    4.119684
 South East  |   1.049316   .4325403     0.12   0.907     .4677689    2.353865
 South West  |   1.304021   1.094468     0.32   0.752     .2516917    6.756162
West Midl..  |    1.12979   .4405093     0.31   0.754     .5261514    2.425964
Yorkshire..  |   2.736037   2.087649     1.32   0.187     .6132519    12.20689
             |
         bmi |
Normal (..)  |   .1070193    .057394    -4.17   0.000     .0374081    .3061669
Overweig..)  |   .1849155   .0671448    -4.65   0.000     .0907597    .3767503
Obese I ..)  |   .1119328   .0444474    -5.51   0.000     .0513988    .2437594
Obese II..)  |   .2103834    .110305    -2.97   0.003     .0752875    .5878958
Obese II..)  |   .2158806   .2259127    -1.46   0.143     .0277624    1.678691
             |
1.cardiova~r |   .2242556   .1267032    -2.65   0.008     .0741001    .6786842
  1.diabetes |   .8302294   .2525433    -0.61   0.541     .4573782    1.507026
1.hyperten~n |   .8358989   .2825566    -0.53   0.596     .4309477    1.621373
1.immunosu~d |   1.422768   .6677875     0.75   0.453      .567043     3.56987
1.non_haem~r |   1.36e-16   1.34e-16   -36.87   0.000     1.94e-17    9.45e-16
             |
     smoking |
Current/f..  |   2.166648   .6127054     2.73   0.006     1.244736    3.771371
        age1 |   1.145792   .1036548     1.50   0.132     .9596242    1.368076
        age2 |   .7459945   .2033211    -1.08   0.282     .4372606    1.272714
        age3 |   2.181734   1.663808     1.02   0.306     .4894052    9.726017
------------------------------------------------------------------------------
                                                          Stratified by set_id

                id:  patient_id
     failure event:  egfr_half_date != 0 & egfr_half_date < .
obs. time interval:  (exit_date_egfr_half[_n-1], exit_date_egfr_half]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_egfr_half

------------------------------------------------------------------------------
     27,845  total observations
     11,134  event time missing (exit_date_egfr_half>=.)        PROBABLE ERROR
      1,208  ignored because never entered
         13  observations end on or before enter()
         61  observations begin on or after (first) failure
------------------------------------------------------------------------------
     15,429  observations remaining, representing
     15,366  subjects
      7,539  failures in single-failure-per-subject data
 18,265.892  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  5.741273

         failure _d:  egfr_half_date
   analysis time _t:  (exit_date_egfr_half-origin)/365.25
             origin:  time index_date_egfr_half
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -4864.0839
Iteration 1:   log pseudolikelihood = -4863.3797
Iteration 2:   log pseudolikelihood = -4863.3797
Refining estimates:
Iteration 0:   log pseudolikelihood = -4863.3797

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       15,366             Number of obs    =      15,429
No. of failures      =        7,539
Time at risk         =  18265.89185
                                                Wald chi2(3)     =        3.45
Log pseudolikelihood =   -4863.3797             Prob > chi2      =      0.3279

                           (Std. Err. adjusted for 35 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   covid_aki |
Non-hospi..  |   1.041789   .0277495     1.54   0.124     .9887963    1.097622
Hospitali..  |   1.047628   .0664031     0.73   0.463     .9252403    1.186206
Hospitali..  |   .9837868   .0795569    -0.20   0.840     .8395875    1.152752
------------------------------------------------------------------------------
                                                          Stratified by set_id

         failure _d:  egfr_half_date
   analysis time _t:  (exit_date_egfr_half-origin)/365.25
             origin:  time index_date_egfr_half
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -4864.0839
Iteration 1:   log pseudolikelihood = -4862.3443
Iteration 2:   log pseudolikelihood = -4862.3442
Refining estimates:
Iteration 0:   log pseudolikelihood = -4862.3442

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       15,366             Number of obs    =      15,429
No. of failures      =        7,539
Time at risk         =  18265.89185
                                                Wald chi2(6)     =       15.32
Log pseudolikelihood =   -4862.3442             Prob > chi2      =      0.0179

                           (Std. Err. adjusted for 35 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   covid_aki |
Non-hospi..  |   1.034614    .028756     1.22   0.221      .979761    1.092538
Hospitali..  |   1.043002   .0668591     0.66   0.511     .9198579    1.182631
Hospitali..  |   .9753683   .0792739    -0.31   0.759     .8317379    1.143802
             |
         sex |
       Male  |          1  (omitted)
        age1 |    1.00526   .0037191     1.42   0.156     .9979966    1.012575
        age2 |   .9899289   .0113357    -0.88   0.377     .9679588    1.012398
        age3 |   1.026325   .0339663     0.79   0.432     .9618653    1.095104
------------------------------------------------------------------------------
                                                          Stratified by set_id

         failure _d:  egfr_half_date
   analysis time _t:  (exit_date_egfr_half-origin)/365.25
             origin:  time index_date_egfr_half
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -83.125546
Iteration 1:   log pseudolikelihood = -67.889095
Iteration 2:   log pseudolikelihood = -66.897904
Iteration 3:   log pseudolikelihood = -66.835702
Iteration 4:   log pseudolikelihood = -66.825954
Iteration 5:   log pseudolikelihood = -66.822449
Iteration 6:   log pseudolikelihood = -66.821166
Iteration 7:   log pseudolikelihood = -66.820695
Iteration 8:   log pseudolikelihood = -66.820521
Iteration 9:   log pseudolikelihood = -66.820458
Iteration 10:  log pseudolikelihood = -66.820434
Iteration 11:  log pseudolikelihood = -66.820426
Iteration 12:  log pseudolikelihood = -66.820423
Iteration 13:  log pseudolikelihood = -66.820421
Iteration 14:  log pseudolikelihood = -66.820421
Iteration 15:  log pseudolikelihood = -66.820421
Iteration 16:  log pseudolikelihood = -66.820421
Iteration 17:  log pseudolikelihood = -66.820421
Iteration 18:  log pseudolikelihood = -66.820421
Iteration 19:  log pseudolikelihood = -66.820421
Refining estimates:
Iteration 0:   log pseudolikelihood = -66.820421
Iteration 1:   log pseudolikelihood = -66.820421
Iteration 2:   log pseudolikelihood = -66.820421
Iteration 3:   log pseudolikelihood = -66.820421
Iteration 4:   log pseudolikelihood = -66.820421
Iteration 5:   log pseudolikelihood = -66.820421
Iteration 6:   log pseudolikelihood = -66.820421
Iteration 7:   log pseudolikelihood = -66.820421
Iteration 8:   log pseudolikelihood = -66.820421
Iteration 9:   log pseudolikelihood = -66.820421
Iteration 10:  log pseudolikelihood = -66.820421
Iteration 11:  log pseudolikelihood = -66.820421
Iteration 12:  log pseudolikelihood = -66.820421
Iteration 13:  log pseudolikelihood = -66.820421
Iteration 14:  log pseudolikelihood = -66.820421
Iteration 15:  log pseudolikelihood = -66.820421
Iteration 16:  log pseudolikelihood = -66.820421
Iteration 17:  log pseudolikelihood = -66.820421
Iteration 18:  log pseudolikelihood = -66.820421
Iteration 19:  log pseudolikelihood = -66.820421

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,842             Number of obs    =       1,843
No. of failures      =          896
Time at risk         =  2163.937029
                                                Wald chi2(22)    =    82849.72
Log pseudolikelihood =   -66.820421             Prob > chi2      =      0.0000

                           (Std. Err. adjusted for 32 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   covid_aki |
Non-hospi..  |   1.160765   .2437163     0.71   0.478     .7691735    1.751717
Hospitali..  |   8.69e-17   5.83e-17   -55.12   0.000     2.33e-17    3.24e-16
Hospitali..  |   1.186349   .7521772     0.27   0.788     .3423954    4.110523
             |
         sex |
       Male  |          1  (omitted)
             |
   ethnicity |
South Asian  |   .2623562   .2284804    -1.54   0.124      .047599    1.446054
      Black  |   1.374346   .4941238     0.88   0.376     .6792977    2.780557
      Mixed  |   .2155542   .1642782    -2.01   0.044     .0483992    .9600073
      Other  |   1.095708   .4032076     0.25   0.804     .5326757     2.25386
             |
         imd |
          2  |   .7064088   .1720164    -1.43   0.153     .4383101    1.138494
          3  |   1.347059   .3823106     1.05   0.294     .7723355    2.349456
          4  |   .6860108   .1860484    -1.39   0.165     .4031645    1.167292
5 Least d..  |   1.108758   .3584731     0.32   0.749     .5883478    2.089484
             |
       urban |
      Urban  |   .7181741   .1262059    -1.88   0.060     .5089166    1.013474
             |
      region |
       East  |    1.10833   .4988605     0.23   0.819     .4587142    2.677909
     London  |   1.362493   .5247896     0.80   0.422     .6404393    2.898614
 North East  |   1.208982   .7677533     0.30   0.765     .3482348    4.197279
 North West  |   .1564818   .1131565    -2.56   0.010     .0379258     .645643
 South East  |   .7324007   .3354552    -0.68   0.497     .2984559    1.797286
 South West  |   .6766356   .2830461    -0.93   0.350     .2980474    1.536117
West Midl..  |   1.332011   .5356521     0.71   0.476     .6056297    2.929599
Yorkshire..  |   1.105325   .5186704     0.21   0.831     .4406221    2.772769
             |
         bmi |
Normal (..)  |   1.040721   .3824361     0.11   0.914     .5064556    2.138589
Overweig..)  |   1.021747   .4712481     0.05   0.963     .4137653    2.523091
Obese I ..)  |   1.658689   .4928447     1.70   0.089     .9265057    2.969488
Obese II..)  |    .419038   .2432133    -1.50   0.134      .134341    1.307068
Obese II..)  |   .1206281   .0710175    -3.59   0.000      .038047     .382452
             |
     smoking |
Current/f..  |   .8881506   .2500989    -0.42   0.674     .5114373    1.542342
        age1 |   .9627567   .0364065    -1.00   0.316     .8939815    1.036823
        age2 |    1.31041   .1539965     2.30   0.021     1.040821    1.649827
        age3 |   .4139786   .1384654    -2.64   0.008     .2149178    .7974132
------------------------------------------------------------------------------
                                                          Stratified by set_id

         failure _d:  egfr_half_date
   analysis time _t:  (exit_date_egfr_half-origin)/365.25
             origin:  time index_date_egfr_half
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -83.125546
Iteration 1:   log pseudolikelihood =  -65.37669
Iteration 2:   log pseudolikelihood = -63.921466
Iteration 3:   log pseudolikelihood = -63.802653
Iteration 4:   log pseudolikelihood = -63.792344
Iteration 5:   log pseudolikelihood = -63.788839
Iteration 6:   log pseudolikelihood = -63.787556
Iteration 7:   log pseudolikelihood = -63.787084
Iteration 8:   log pseudolikelihood = -63.786911
Iteration 9:   log pseudolikelihood = -63.786848
Iteration 10:  log pseudolikelihood = -63.786824
Iteration 11:  log pseudolikelihood = -63.786816
Iteration 12:  log pseudolikelihood = -63.786812
Iteration 13:  log pseudolikelihood = -63.786811
Iteration 14:  log pseudolikelihood = -63.786811
Iteration 15:  log pseudolikelihood = -63.786811
Iteration 16:  log pseudolikelihood = -63.786811
Iteration 17:  log pseudolikelihood = -63.786811
Iteration 18:  log pseudolikelihood = -63.786811
Iteration 19:  log pseudolikelihood = -63.786811
Refining estimates:
Iteration 0:   log pseudolikelihood = -63.786811
Iteration 1:   log pseudolikelihood = -63.786811
Iteration 2:   log pseudolikelihood = -63.786811
Iteration 3:   log pseudolikelihood = -63.786811
Iteration 4:   log pseudolikelihood = -63.786811
Iteration 5:   log pseudolikelihood = -63.786811
Iteration 6:   log pseudolikelihood = -63.786811
Iteration 7:   log pseudolikelihood = -63.786811
Iteration 8:   log pseudolikelihood = -63.786811
Iteration 9:   log pseudolikelihood = -63.786811
Iteration 10:  log pseudolikelihood = -63.786811
Iteration 11:  log pseudolikelihood = -63.786811
Iteration 12:  log pseudolikelihood = -63.786811
Iteration 13:  log pseudolikelihood = -63.786811
Iteration 14:  log pseudolikelihood = -63.786811

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =        1,842             Number of obs    =       1,843
No. of failures      =          896
Time at risk         =  2163.937029
                                                Wald chi2(22)    =   642558.73
Log pseudolikelihood =   -63.786811             Prob > chi2      =      0.0000

                           (Std. Err. adjusted for 32 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   covid_aki |
Non-hospi..  |   1.379153   .3124229     1.42   0.156     .8846831    2.149994
Hospitali..  |   5.25e-15   5.07e-15   -34.04   0.000     7.91e-16    3.49e-14
Hospitali..  |   1.352481   1.376598     0.30   0.767      .183972     9.94285
             |
         sex |
       Male  |          1  (omitted)
             |
   ethnicity |
South Asian  |   .2621487   .2500695    -1.40   0.160     .0404173    1.700308
      Black  |   1.440416   .6021182     0.87   0.383     .6348504     3.26817
      Mixed  |   .2593867   .2036685    -1.72   0.086     .0556661    1.208662
      Other  |   1.252818   .5723691     0.49   0.622     .5116857    3.067414
             |
         imd |
          2  |   .4963602   .1522754    -2.28   0.022     .2720583    .9055907
          3  |   1.434965   .4741197     1.09   0.274     .7509306    2.742096
          4  |   .9342348   .3206502    -0.20   0.843     .4767654    1.830659
5 Least d..  |   .7337252   .2882829    -0.79   0.431     .3396986    1.584795
             |
       urban |
      Urban  |    .705641   .1256183    -1.96   0.050     .4977976    1.000265
             |
      region |
       East  |   1.113185    .546922     0.22   0.827     .4249726    2.915906
     London  |    1.93748   .8543047     1.50   0.134     .8164166    4.597933
 North East  |   1.531313   1.073338     0.61   0.543     .3876448    6.049142
 North West  |   .2709334   .1597212    -2.22   0.027     .0853219    .8603288
 South East  |   1.296195   .6123751     0.55   0.583     .5134854    3.271994
 South West  |   .8530405   .3176849    -0.43   0.670      .411121    1.769985
West Midl..  |    2.11121   1.396124     1.13   0.258     .5776164     7.71655
Yorkshire..  |   1.078459   .5086484     0.16   0.873     .4278977    2.718113
             |
         bmi |
Normal (..)  |   .7539847    .326572    -0.65   0.514     .3226139    1.762146
Overweig..)  |   .7490241   .3144607    -0.69   0.491     .3289563    1.705507
Obese I ..)  |   1.607666    .489495     1.56   0.119     .8851685    2.919886
Obese II..)  |   .4392138    .262377    -1.38   0.168     .1362028    1.416334
Obese II..)  |   .1067693   .0637305    -3.75   0.000      .033141    .3439758
             |
1.cardiova~r |   .6175216   .1412724    -2.11   0.035     .3943847     .966906
  1.diabetes |   .7311014   .1569402    -1.46   0.145     .4800168    1.113522
1.hyperten~n |   2.231233   .6043172     2.96   0.003     1.312205     3.79392
1.immunosu~d |   .6408797   .3364352    -0.85   0.397     .2290504    1.793172
1.non_haem~r |   3.810848   2.115958     2.41   0.016     1.283499    11.31483
             |
     smoking |
Current/f..  |    .939983   .2951331    -0.20   0.844     .5079982    1.739313
        age1 |   .9797933   .0350261    -0.57   0.568     .9134933    1.050905
        age2 |   1.200196   .1386104     1.58   0.114     .9570779    1.505072
        age3 |   .5598277    .185357    -1.75   0.080     .2925665    1.071234
------------------------------------------------------------------------------
                                                          Stratified by set_id

                id:  patient_id
     failure event:  aki_date != 0 & aki_date < .
obs. time interval:  (exit_date_aki[_n-1], exit_date_aki]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_aki

------------------------------------------------------------------------------
     27,845  total observations
        971  observations end on or before enter()
         65  observations begin on or after (first) failure
------------------------------------------------------------------------------
     26,809  observations remaining, representing
     26,563  subjects
      4,324  failures in single-failure-per-subject data
 44,454.261  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  5.744011

         failure _d:  aki_date
   analysis time _t:  (exit_date_aki-origin)/365.25
             origin:  time index_date_aki
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -4911.2845
Iteration 1:   log pseudolikelihood = -4907.6957
Iteration 2:   log pseudolikelihood = -4907.6878
Refining estimates:
Iteration 0:   log pseudolikelihood = -4907.6878

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       26,563             Number of obs    =      26,809
No. of failures      =        4,324
Time at risk         =  44454.26146
                                                Wald chi2(3)     =       10.77
Log pseudolikelihood =   -4907.6878             Prob > chi2      =      0.0130

                           (Std. Err. adjusted for 38 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   covid_aki |
Non-hospi..  |   .9845681   .0242414    -0.63   0.528     .9381841    1.033245
Hospitali..  |   1.335601   .1281672     3.02   0.003     1.106607    1.611981
Hospitali..  |   1.043261   .1188784     0.37   0.710     .8344483    1.304327
------------------------------------------------------------------------------
                                                          Stratified by set_id

         failure _d:  aki_date
   analysis time _t:  (exit_date_aki-origin)/365.25
             origin:  time index_date_aki
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -4911.2845
Iteration 1:   log pseudolikelihood = -4904.7521
Iteration 2:   log pseudolikelihood = -4904.7442
Refining estimates:
Iteration 0:   log pseudolikelihood = -4904.7442

Stratified Cox regr. -- Breslow method for ties

No. of subjects      =       26,563             Number of obs    =      26,809
No. of failures      =        4,324
Time at risk         =  44454.26146
                                                Wald chi2(6)     =       44.87
Log pseudolikelihood =   -4904.7442             Prob > chi2      =      0.0000

                           (Std. Err. adjusted for 38 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   covid_aki |
Non-hospi..  |   .9715352   .0265002    -1.06   0.290     .9209598    1.024888
Hospitali..  |   1.324216    .127711     2.91   0.004     1.096141    1.599746
Hospitali..  |   1.026549   .1174199     0.23   0.819     .8203833    1.284526
             |
         sex |
       Male  |          1  (omitted)
        age1 |   1.006443   .0052464     1.23   0.218     .9962125    1.016778
        age2 |   .9848344   .0151497    -0.99   0.321     .9555846    1.014979
        age3 |   1.050114   .0461785     1.11   0.266     .9633971    1.144638
------------------------------------------------------------------------------
                                                          Stratified by set_id

         failure _d:  aki_date
   analysis time _t:  (exit_date_aki-origin)/365.25
             origin:  time index_date_aki
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -98.558234
Iteration 1:   log pseudolikelihood = -81.377812
Iteration 2:   log pseudolikelihood = -80.233512
Iteration 3:   log pseudolikelihood = -80.086338
Iteration 4:   log pseudolikelihood = -80.044362
Iteration 5:   log pseudolikelihood = -80.029261
Iteration 6:   log pseudolikelihood = -80.023746
Iteration 7:   log pseudolikelihood = -80.021723
Iteration 8:   log pseudolikelihood = -80.020979
Iteration 9:   log pseudolikelihood = -80.020706
Iteration 10:  log pseudolikelihood = -80.020605
Iteration 11:  log pseudolikelihood = -80.020568
Iteration 12:  log pseudolikelihood = -80.020555
Iteration 13:  log pseudolikelihood =  -80.02055
Iteration 14:  log pseudolikelihood = -80.020548
Iteration 15:  log pseudolikelihood = -80.020547
Iteration 16:  log pseudolikelihood = -80.020547
Iteration 17:  log pseudolikelihood = -80.020547
Iteration 18:  log pseudolikelihood = -80.020547
Iteration 19:  log pseudolikelihood = -80.020547
Iteration 20:  log pseudolikelihood = -80.020547
Iteration 21:  log pseudolikelihood = -80.020547
Iteration 22:  log pseudolikelihood = -80.020547
Iteration 23:  log pseudolikelihood = -80.020546
Iteration 24:  log pseudolikelihood = -80.020546
Iteration 25:  log pseudolikelihood = -80.020546
Iteration 26:  log pseudolikelihood = -80.020541
Iteration 27:  log pseudolikelihood = -80.020541  (backed up)
Refining estimates:
Iteration 0:   log pseudolikelihood = -80.020547
Iteration 1:   log pseudolikelihood = -80.020547
Iteration 2:   log pseudolikelihood = -80.020547
Iteration 3:   log pseudolikelihood = -80.020547
Iteration 4:   log pseudolikelihood = -80.020547
Iteration 5:   log pseudolikelihood = -80.020547
Iteration 6:   log pseudolikelihood = -80.020547
Iteration 7:   log pseudolikelihood = -80.020547
Iteration 8:   log pseudolikelihood = -80.020547
Iteration 9:   log pseudolikelihood = -80.020547
Iteration 10:  log pseudolikelihood = -80.020547

Stratified Cox regr. -- no ties

No. of subjects      =        3,202             Number of obs    =       3,204
No. of failures      =          506
Time at risk         =  5305.207392
                                                Wald chi2(26)    =    33448.37
Log pseudolikelihood =   -80.020547             Prob > chi2      =      0.0000

                           (Std. Err. adjusted for 35 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   covid_aki |
Non-hospi..  |   .5062813    .115744    -2.98   0.003     .3234399    .7924834
Hospitali..  |    .123585   .0447062    -5.78   0.000     .0608202    .2511212
Hospitali..  |   1.99e+15   1.48e+15    47.64   0.000     4.68e+14    8.50e+15
             |
         sex |
       Male  |          1  (omitted)
             |
   ethnicity |
South Asian  |   .5013912   .1674565    -2.07   0.039     .2605489    .9648597
      Black  |   2.225792    1.33831     1.33   0.183     .6849827    7.232518
      Mixed  |   1.264716   .5951555     0.50   0.618     .5028415    3.180937
      Other  |   1.181534   .9891561     0.20   0.842      .229001    6.096139
             |
         imd |
          2  |   .7622937   .1662588    -1.24   0.213     .4971328    1.168886
          3  |   1.286006   .2107495     1.53   0.125     .9327145    1.773116
          4  |   1.298921   .3616636     0.94   0.348     .7526263    2.241744
5 Least d..  |   1.875583   .2653095     4.45   0.000     1.421445    2.474814
             |
       urban |
      Urban  |   .8620381   .2780806    -0.46   0.645     .4580802    1.622226
             |
      region |
       East  |   .8927347   .2690931    -0.38   0.707     .4944797    1.611745
     London  |   1.425439   .4182286     1.21   0.227     .8020534    2.533343
 North East  |   1.435724   .3361373     1.54   0.122     .9073701    2.271735
 North West  |   2.369461   .7203574     2.84   0.005     1.305778    4.299616
 South East  |   .9611539   .2668021    -0.14   0.887     .5578429    1.656052
 South West  |   1.029242     .60488     0.05   0.961     .3252903    3.256597
West Midl..  |   2.562513   .6940119     3.47   0.001     1.507069    4.357116
Yorkshire..  |   1.600805   .9282637     0.81   0.417     .5137477    4.988009
             |
         bmi |
Normal (..)  |    .142661   .0696723    -3.99   0.000      .054777    .3715457
Overweig..)  |    .237258   .1278111    -2.67   0.008     .0825426    .6819679
Obese I ..)  |   .1858067    .099796    -3.13   0.002     .0648462    .5324002
Obese II..)  |   .1487205   .0816519    -3.47   0.001     .0507033    .4362196
Obese II..)  |   .3722781   .1937572    -1.90   0.058     .1342296    1.032492
             |
     smoking |
Current/f..  |   1.801155   .4227304     2.51   0.012     1.137036    2.853171
        age1 |   1.150917   .0518113     3.12   0.002      1.05372     1.25708
        age2 |   .7250676   .1115662    -2.09   0.037     .5362954    .9802864
        age3 |   2.393499   1.069169     1.95   0.051     .9972502    5.744634
------------------------------------------------------------------------------
                                                          Stratified by set_id

         failure _d:  aki_date
   analysis time _t:  (exit_date_aki-origin)/365.25
             origin:  time index_date_aki
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -98.558234
Iteration 1:   log pseudolikelihood = -77.553268
Iteration 2:   log pseudolikelihood = -75.586051
Iteration 3:   log pseudolikelihood = -75.349971
Iteration 4:   log pseudolikelihood = -75.302928
Iteration 5:   log pseudolikelihood = -75.286295
Iteration 6:   log pseudolikelihood =  -75.28023
Iteration 7:   log pseudolikelihood = -75.278007
Iteration 8:   log pseudolikelihood =  -75.27719
Iteration 9:   log pseudolikelihood = -75.276889
Iteration 10:  log pseudolikelihood = -75.276779
Iteration 11:  log pseudolikelihood = -75.276738
Iteration 12:  log pseudolikelihood = -75.276723
Iteration 13:  log pseudolikelihood = -75.276718
Iteration 14:  log pseudolikelihood = -75.276716
Iteration 15:  log pseudolikelihood = -75.276715
Iteration 16:  log pseudolikelihood = -75.276715
Iteration 17:  log pseudolikelihood = -75.276715
Iteration 18:  log pseudolikelihood = -75.276714
Iteration 19:  log pseudolikelihood = -75.276714
Iteration 20:  log pseudolikelihood = -75.276714
Iteration 21:  log pseudolikelihood = -75.276714
Iteration 22:  log pseudolikelihood = -75.276714
Iteration 23:  log pseudolikelihood = -75.276714
Iteration 24:  log pseudolikelihood = -75.276714  (backed up)
Refining estimates:
Iteration 0:   log pseudolikelihood = -75.276714
Iteration 1:   log pseudolikelihood = -75.276714
Iteration 2:   log pseudolikelihood = -75.276714
Iteration 3:   log pseudolikelihood = -75.276714
Iteration 4:   log pseudolikelihood = -75.276714
Iteration 5:   log pseudolikelihood = -75.276714
Iteration 6:   log pseudolikelihood = -75.276714
Iteration 7:   log pseudolikelihood = -75.276714
Iteration 8:   log pseudolikelihood = -75.276714
Iteration 9:   log pseudolikelihood = -75.276714
Iteration 10:  log pseudolikelihood = -75.276714
Iteration 11:  log pseudolikelihood = -75.276714
Iteration 12:  log pseudolikelihood = -75.276714

Stratified Cox regr. -- no ties

No. of subjects      =        3,202             Number of obs    =       3,204
No. of failures      =          506
Time at risk         =  5305.207392
                                                Wald chi2(26)    =    33015.50
Log pseudolikelihood =   -75.276714             Prob > chi2      =      0.0000

                           (Std. Err. adjusted for 35 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   covid_aki |
Non-hospi..  |   .4745789   .1013657    -3.49   0.000     .3122479    .7213023
Hospitali..  |   .0852032   .0479782    -4.37   0.000      .028258    .2569039
Hospitali..  |   1.47e+15   1.84e+15    28.03   0.000     1.28e+14    1.70e+16
             |
         sex |
       Male  |          1  (omitted)
             |
   ethnicity |
South Asian  |   .4458742   .1734428    -2.08   0.038     .2080172    .9557083
      Black  |   2.899822   2.412961     1.28   0.201     .5676503    14.81364
      Mixed  |   .8928802   .4773056    -0.21   0.832     .3131611    2.545767
      Other  |   1.513517   1.156074     0.54   0.587     .3386972    6.763368
             |
         imd |
          2  |   .8369971    .177503    -0.84   0.401     .5523427     1.26835
          3  |   1.340275   .3175016     1.24   0.216     .8424616    2.132247
          4  |   1.255727    .411039     0.70   0.487     .6611048    2.385176
5 Least d..  |   1.981681   .3275858     4.14   0.000     1.433258    2.739955
             |
       urban |
      Urban  |   .7542358   .2542798    -0.84   0.403     .3895263    1.460419
             |
      region |
       East  |   .9891726   .2591496    -0.04   0.967     .5919281    1.653009
     London  |   1.713059   .4570591     2.02   0.044     1.015464    2.889883
 North East  |   2.185957   1.044178     1.64   0.102     .8571236    5.574932
 North West  |   3.983483   1.271982     4.33   0.000     2.130406    7.448412
 South East  |   1.269436   .4167439     0.73   0.467     .6670668    2.415751
 South West  |    1.09163   .7572427     0.13   0.899     .2802936    4.251455
West Midl..  |   2.753267   .8979143     3.11   0.002     1.452944    5.217327
Yorkshire..  |   2.104394   1.720067     0.91   0.363     .4240152    10.44415
             |
         bmi |
Normal (..)  |   .1533919   .0874328    -3.29   0.001     .0501904     .468796
Overweig..)  |   .2405636   .1370789    -2.50   0.012     .0787399    .7349623
Obese I ..)  |   .2177088   .1190476    -2.79   0.005     .0745456    .6358143
Obese II..)  |   .1635531   .1092279    -2.71   0.007     .0441763    .6055195
Obese II..)  |   .3993223   .2265838    -1.62   0.106      .131321    1.214264
             |
1.cardiova~r |    .385328   .1237508    -2.97   0.003     .2053342    .7231027
  1.diabetes |   1.038013   .4523242     0.09   0.932     .4418588    2.438496
1.hyperten~n |   .4569161   .1398435    -2.56   0.010     .2507946    .8324434
1.immunosu~d |   1.026362    .411541     0.06   0.948     .4677285    2.252202
1.non_haem~r |   .9900219   .5164558    -0.02   0.985     .3561281    2.752222
             |
     smoking |
Current/f..  |   2.065904   .4887071     3.07   0.002     1.299425    3.284499
        age1 |   1.138272    .066136     2.23   0.026     1.015756    1.275565
        age2 |    .751745   .1471834    -1.46   0.145     .5121706    1.103383
        age3 |    2.14384    1.21042     1.35   0.177     .7089258    6.483119
------------------------------------------------------------------------------
                                                          Stratified by set_id

                id:  patient_id
     failure event:  death_date != 0 & death_date < .
obs. time interval:  (exit_date_death[_n-1], exit_date_death]
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time index_date_death

------------------------------------------------------------------------------
     27,845  total observations
         12  observations begin on or after (first) failure
------------------------------------------------------------------------------
     27,833  observations remaining, representing
     27,534  subjects
      1,667  failures in single-failure-per-subject data
 50,214.486  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  5.744011

         failure _d:  death_date
   analysis time _t:  (exit_date_death-origin)/365.25
             origin:  time index_date_death
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -2067.0879
Iteration 1:   log pseudolikelihood = -2024.5857
Iteration 2:   log pseudolikelihood = -2023.5853
Iteration 3:   log pseudolikelihood = -2023.5806
Iteration 4:   log pseudolikelihood = -2023.5806
Refining estimates:
Iteration 0:   log pseudolikelihood = -2023.5806

Stratified Cox regr. -- no ties

No. of subjects      =       27,534             Number of obs    =      27,833
No. of failures      =        1,667
Time at risk         =  50214.48597
                                                Wald chi2(3)     =      174.50
Log pseudolikelihood =   -2023.5806             Prob > chi2      =      0.0000

                           (Std. Err. adjusted for 38 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   covid_aki |
Non-hospi..  |   .6123908   .0334002    -8.99   0.000     .5503052    .6814811
Hospitali..  |   .3384044   .0362414   -10.12   0.000      .274332    .4174413
Hospitali..  |   .4292675    .075959    -4.78   0.000     .3034643    .6072233
------------------------------------------------------------------------------
                                                          Stratified by set_id

         failure _d:  death_date
   analysis time _t:  (exit_date_death-origin)/365.25
             origin:  time index_date_death
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -2067.0879
Iteration 1:   log pseudolikelihood = -2020.6905
Iteration 2:   log pseudolikelihood = -2019.6509
Iteration 3:   log pseudolikelihood = -2019.6459
Iteration 4:   log pseudolikelihood = -2019.6459
Refining estimates:
Iteration 0:   log pseudolikelihood = -2019.6459

Stratified Cox regr. -- no ties

No. of subjects      =       27,534             Number of obs    =      27,833
No. of failures      =        1,667
Time at risk         =  50214.48597
                                                Wald chi2(6)     =      221.05
Log pseudolikelihood =   -2019.6459             Prob > chi2      =      0.0000

                           (Std. Err. adjusted for 38 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   covid_aki |
Non-hospi..  |   .5999366   .0332328    -9.22   0.000     .5382127    .6687391
Hospitali..  |   .3258655   .0352644   -10.36   0.000     .2635866    .4028594
Hospitali..  |   .4260465   .0741515    -4.90   0.000     .3029068    .5992457
             |
         sex |
       Male  |          1  (omitted)
        age1 |   1.005254    .005596     0.94   0.346     .9943459    1.016282
        age2 |   .9698824   .0163259    -1.82   0.069     .9384063    1.002414
        age3 |   1.130008    .057122     2.42   0.016     1.023418    1.247699
------------------------------------------------------------------------------
                                                          Stratified by set_id

         failure _d:  death_date
   analysis time _t:  (exit_date_death-origin)/365.25
             origin:  time index_date_death
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -55.111976
Iteration 1:   log pseudolikelihood = -36.054814
Iteration 2:   log pseudolikelihood = -33.694381
Iteration 3:   log pseudolikelihood = -33.312087
Iteration 4:   log pseudolikelihood = -33.287311
Iteration 5:   log pseudolikelihood = -33.283765
Iteration 6:   log pseudolikelihood = -33.282482
Iteration 7:   log pseudolikelihood = -33.282011
Iteration 8:   log pseudolikelihood = -33.281838
Iteration 9:   log pseudolikelihood = -33.281774
Iteration 10:  log pseudolikelihood = -33.281751
Iteration 11:  log pseudolikelihood = -33.281742
Iteration 12:  log pseudolikelihood = -33.281739
Iteration 13:  log pseudolikelihood = -33.281738
Iteration 14:  log pseudolikelihood = -33.281738
Iteration 15:  log pseudolikelihood = -33.281737
Iteration 16:  log pseudolikelihood = -33.281737
Iteration 17:  log pseudolikelihood = -33.281737
Iteration 18:  log pseudolikelihood = -33.281737
Iteration 19:  log pseudolikelihood = -33.281737
Iteration 20:  log pseudolikelihood = -33.281737
Iteration 21:  log pseudolikelihood = -33.281737
Iteration 22:  log pseudolikelihood = -33.281737
Iteration 23:  log pseudolikelihood = -33.281737
Iteration 24:  log pseudolikelihood = -33.281737
Iteration 25:  log pseudolikelihood = -33.281737
Iteration 26:  log pseudolikelihood = -33.281737
Iteration 27:  log pseudolikelihood = -33.281737
Iteration 28:  log pseudolikelihood = -33.281737
Iteration 29:  log pseudolikelihood = -33.281737
Iteration 30:  log pseudolikelihood = -33.281737
Iteration 31:  log pseudolikelihood = -33.281737
Iteration 32:  log pseudolikelihood = -33.281737
Iteration 33:  log pseudolikelihood = -33.281737
Iteration 34:  log pseudolikelihood = -33.281737
Iteration 35:  log pseudolikelihood = -33.281737
Iteration 36:  log pseudolikelihood = -33.281737
Iteration 37:  log pseudolikelihood = -33.281737
Refining estimates:
Iteration 0:   log pseudolikelihood = -33.281737

Stratified Cox regr. -- no ties

No. of subjects      =        3,323             Number of obs    =       3,325
No. of failures      =          228
Time at risk         =   5981.61807
                                                Wald chi2(21)    =   157476.35
Log pseudolikelihood =   -33.281737             Prob > chi2      =      0.0000

                           (Std. Err. adjusted for 35 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   covid_aki |
Non-hospi..  |   .1828429    .077582    -4.00   0.000     .0795985    .4200019
Hospitali..  |   .3593792   .2893584    -1.27   0.204     .0741648    1.741438
Hospitali..  |   1.82e+15          .        .       .            .           .
             |
         sex |
       Male  |          1  (omitted)
             |
   ethnicity |
South Asian  |   .0685988   .0766544    -2.40   0.016     .0076764    .6130197
      Black  |   3.304741   2.914169     1.36   0.175      .586861    18.60971
      Mixed  |   .7131113   .4123665    -0.58   0.559     .2295822    2.215014
      Other  |    1.65701   2.075445     0.40   0.687     .1422902    19.29636
             |
         imd |
          2  |    .350989   .2091635    -1.76   0.079     .1091542    1.128617
          3  |   .7849522    .246945    -0.77   0.442     .4236978     1.45422
          4  |   .4411725   .3533948    -1.02   0.307     .0917838    2.120562
5 Least d..  |   3.504579   1.773082     2.48   0.013     1.300124    9.446845
             |
       urban |
      Urban  |   .6227501   .2746571    -1.07   0.283     .2623619    1.478178
             |
      region |
       East  |   11.39486   11.04998     2.51   0.012     1.703218    76.23386
     London  |    1.90409   1.255672     0.98   0.329     .5228221    6.934594
 North East  |   2.450354   2.606764     0.84   0.400     .3045744    19.71352
 North West  |   10.70133   9.653439     2.63   0.009     1.826364    62.70299
 South East  |    10.2485   5.727371     4.16   0.000     3.427415     30.6446
 South West  |   1.893138   1.923332     0.63   0.530     .2584668    13.86627
West Midl..  |   2.603274   1.790024     1.39   0.164     .6764405    10.01868
Yorkshire..  |   6.551552   7.438926     1.66   0.098      .707704    60.65082
             |
         bmi |
Normal (..)  |   .4042326   .3353022    -1.09   0.275     .0795386    2.054399
Overweig..)  |   .0988616   .1077218    -2.12   0.034     .0116826    .8365954
Obese I ..)  |   .0631075   .0522461    -3.34   0.001      .012456    .3197295
Obese II..)  |   .0666619   .0845219    -2.14   0.033     .0055542    .8000765
Obese II..)  |   .7486795   .5121523    -0.42   0.672     .1958894    2.861415
             |
     smoking |
Current/f..  |   2.493434   .4087865     5.57   0.000     1.808205    3.438336
        age1 |   .9627518   .0528122    -0.69   0.489      .864612    1.072031
        age2 |   .9850783   .1907013    -0.08   0.938     .6740415    1.439643
        age3 |   1.341374   .8115164     0.49   0.627     .4098099    4.390534
------------------------------------------------------------------------------
                                                          Stratified by set_id

         failure _d:  death_date
   analysis time _t:  (exit_date_death-origin)/365.25
             origin:  time index_date_death
                 id:  patient_id

Iteration 0:   log pseudolikelihood = -55.111976
Iteration 1:   log pseudolikelihood = -32.152003
Iteration 2:   log pseudolikelihood = -27.937653
Iteration 3:   log pseudolikelihood = -26.419821
Iteration 4:   log pseudolikelihood = -26.026184
Iteration 5:   log pseudolikelihood = -25.987937
Iteration 6:   log pseudolikelihood = -25.986157
Iteration 7:   log pseudolikelihood = -25.985685
Iteration 8:   log pseudolikelihood = -25.985512
Iteration 9:   log pseudolikelihood = -25.985448
Iteration 10:  log pseudolikelihood = -25.985425
Iteration 11:  log pseudolikelihood = -25.985416
Iteration 12:  log pseudolikelihood = -25.985413
Iteration 13:  log pseudolikelihood = -25.985412
Iteration 14:  log pseudolikelihood = -25.985412
Iteration 15:  log pseudolikelihood = -25.985411
Iteration 16:  log pseudolikelihood = -25.985411
Iteration 17:  log pseudolikelihood = -25.985411
Iteration 18:  log pseudolikelihood = -25.985411
Iteration 19:  log pseudolikelihood = -25.985411
Iteration 20:  log pseudolikelihood = -25.985411
Iteration 21:  log pseudolikelihood = -25.985411
Iteration 22:  log pseudolikelihood = -25.985411
Iteration 23:  log pseudolikelihood = -25.985411
Iteration 24:  log pseudolikelihood = -25.985411
Iteration 25:  log pseudolikelihood = -25.985411
Iteration 26:  log pseudolikelihood = -25.985411
Iteration 27:  log pseudolikelihood = -25.985411
Iteration 28:  log pseudolikelihood = -25.985411
Iteration 29:  log pseudolikelihood = -25.985411
Iteration 30:  log pseudolikelihood = -25.985411
Iteration 31:  log pseudolikelihood = -25.985411
Refining estimates:
Iteration 0:   log pseudolikelihood = -25.985411
Iteration 1:   log pseudolikelihood = -25.985411
Iteration 2:   log pseudolikelihood = -25.985411
Iteration 3:   log pseudolikelihood = -25.985411

Stratified Cox regr. -- no ties

No. of subjects      =        3,323             Number of obs    =       3,325
No. of failures      =          228
Time at risk         =   5981.61807
                                                Wald chi2(22)    =  1925097.70
Log pseudolikelihood =   -25.985411             Prob > chi2      =      0.0000

                           (Std. Err. adjusted for 35 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   covid_aki |
Non-hospi..  |   .0885492    .045232    -4.75   0.000     .0325373     .240984
Hospitali..  |   .8583764   .7929541    -0.17   0.869      .140395    5.248121
Hospitali..  |   5.01e+13   1.18e+14    13.37   0.000     4.90e+11    5.11e+15
             |
         sex |
       Male  |          1  (omitted)
             |
   ethnicity |
South Asian  |   .2615561   .1961122    -1.79   0.074     .0601648    1.137071
      Black  |   44.27533   40.16503     4.18   0.000      7.48138    262.0245
      Mixed  |   .5390625   .3715002    -0.90   0.370     .1396449    2.080909
      Other  |   3.934375   9.643185     0.56   0.576     .0322533    479.9298
             |
         imd |
          2  |   .1587856   .2265791    -1.29   0.197      .009687    2.602753
          3  |   .3077874   .2944672    -1.23   0.218      .047194    2.007311
          4  |   .4305099   .5970544    -0.61   0.543     .0284113    6.523421
5 Least d..  |   2.619199   .7853316     3.21   0.001     1.455282    4.714003
             |
       urban |
      Urban  |   .3752051   .3204369    -1.15   0.251     .0703584    2.000882
             |
      region |
       East  |   15.52888   22.76483     1.87   0.061     .8776202    274.7728
     London  |   1.668588   1.418149     0.60   0.547     .3154311    8.826606
 North East  |   2.312743   3.782683     0.51   0.608     .0937383    57.06082
 North West  |   33.28686   56.48057     2.07   0.039     1.196654    925.9275
 South East  |   21.17852   29.17627     2.22   0.027      1.42315    315.1669
 South West  |   .6856841    1.21572    -0.21   0.831     .0212296     22.1466
West Midl..  |   3.295473   3.564151     1.10   0.270     .3956564    27.44842
Yorkshire..  |   24.96373    45.0359     1.78   0.075     .7272721    856.8843
             |
         bmi |
Normal (..)  |   .0057487   .0121699    -2.44   0.015     .0000907    .3643727
Overweig..)  |   .0046076   .0092288    -2.69   0.007     .0000909     .233557
Obese I ..)  |   .0003827   .0007028    -4.28   0.000     .0000105    .0139963
Obese II..)  |   .0009634   .0024926    -2.68   0.007     6.05e-06    .1534899
Obese II..)  |   .0262664   .0179234    -5.33   0.000     .0068955    .1000544
             |
1.cardiova~r |   .2358824   .1177313    -2.89   0.004     .0886855    .6273917
  1.diabetes |   1.103434   .4042309     0.27   0.788     .5381681    2.262427
1.hyperten~n |   1.142247   .8335024     0.18   0.855     .2732971    4.774032
1.immunosu~d |   .0023076   .0030142    -4.65   0.000     .0001784     .029854
1.non_haem~r |   12.81582   8.238566     3.97   0.000     3.635442    45.17891
             |
     smoking |
Current/f..  |   6.406819   3.878046     3.07   0.002     1.956187    20.98334
        age1 |   .9257038   .1246605    -0.57   0.566     .7109589    1.205312
        age2 |   1.077981   .4914622     0.16   0.869     .4411033    2.634404
        age3 |   1.178158   1.531838     0.13   0.900     .0921454    15.06376
------------------------------------------------------------------------------
                                                          Stratified by set_id

. 
. file close tablecontent

. 
end of do-file

. . file open output using "/tmp/cox_2017_covid_aki.do.gMZ2.out", write text re
> place

. . file write output "success" 

. . file close output

. 
end of do-file


