------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/cox_2017_case.log
  log type:  text
 opened on:  20 Jan 2023, 20:00:03

. 
. cap file close tablecontent

. file open tablecontent using ./output/cox_2017_case.txt, write text replace

. file write tablecontent ("Kidney outcomes after SARS-CoV-2 infection compared to matched historical general population") _n

. file write tablecontent _n

. file write tablecontent ("Historical general population matched on age, sex and STP") _n

. file write tablecontent ("Restricted to those who survived 28 days after first recorded SARS-CoV-2 or equivalent date of matching") _n

. file write tablecontent ("All models stratified by matched set and clustering by general practice accounted for using robust standard errors") _n

. file write tablecontent _n

. file write tablecontent ("Cox regression models:") _n

. file write tablecontent ("1. Crude") _n

. file write tablecontent ("2. Minimally adjusted: adjusted for age (using spline functions) and sex") _n

. file write tablecontent ("3. Additionally adjusted: additionally adjusted for ethnicity, socioeconomic deprivation, region, rural/urban, body mass index and smoking") _n

. file write tablecontent ("4. Fully adjusted: additionally adjusted for cardiovascular diseases, diabetes, hypertension, immunocompromise and cancer") _n

. file write tablecontent _n

. file write tablecontent _tab _tab _tab _tab _tab ("Number") _tab _tab ("Event") _tab ("Total person-years") _tab ("Rate per 100,000") _tab ("Crude") _tab _tab _tab ("Minimally adjusted") _tab ("Additionally adjusted") _tab ("Fully adjusted") _tab _ta
> b _n

. file write tablecontent _tab _tab _tab _tab _tab _tab _tab _tab _tab _tab _tab _tab _tab _tab ("HR") _tab ("95% CI") _tab _tab ("HR") _tab ("95% CI") _tab _tab ("HR") _tab ("95% CI") _tab _tab ("HR") _tab ("95% CI") _tab _tab _n

. file write tablecontent ("By SARS-CoV-2 infection") _n

. 
. use ./output/analysis_2017.dta, clear

. foreach outcome of varlist esrd egfr_half aki death {
  2. stset exit_date_`outcome', fail(`outcome'_date) origin(index_date_`outcome') id(patient_id) scale(365.25)
  3. 
. stcox i.case, vce(cluster practice_id) strata(set_id)
  4. estimates save "crude_case_`outcome'", replace 
  5. eststo model1
  6. parmest, label eform format(estimate p lb ub) saving("crude_case_`outcome'", replace) idstr("crude_case_`outcome'") 
  7. local hr "`hr' "crude_case_`outcome'" "
  8. 
. stcox i.case i.sex age1 age2 age3, vce(cluster practice_id) strata(set_id)
  9. estimates save "minimal_case_`outcome'", replace 
 10. eststo model2
 11. parmest, label eform format(estimate p lb ub) saving("minimal_case_`outcome'", replace) idstr("minimal_case_`outcome'")
 12. local hr "`hr' "minimal_case_`outcome'" "
 13. 
. stcox i.case i.sex i.ethnicity i.imd i.urban i.region i.bmi i.smoking age1 age2 age3, vce(cluster practice_id) strata(set_id)
 14. if _rc==0{
 15. estimates
 16. estimates save "additional_case_`outcome'", replace 
 17. eststo model3
 18. parmest, label eform format(estimate p lb ub) saving("additional_case_`outcome'", replace) idstr("additional_case_`outcome'") 
 19. local hr "`hr' "additional_case_`outcome'" "
 20. }
 21. else di "WARNING MODEL1 DID NOT FIT (`outcome')"
 22. 
. stcox i.case i.sex i.ethnicity i.imd i.urban i.region i.bmi i.cardiovascular i.diabetes i.hypertension i.immunosuppressed i.non_haem_cancer i.smoking age1 age2 age3, vce(cluster practice_id) strata(set_id)           
 23. if _rc==0{
 24. estimates
 25. estimates save "full_case_`outcome'", replace 
 26. eststo model4
 27. parmest, label eform format(estimate p lb ub) saving("full_case_`outcome'", replace) idstr("full_case_`outcome'") 
 28. local hr "`hr' "full_case_`outcome'" "
 29. }
 30. else di "WARNING MODEL2 DID NOT FIT (`outcome')"                                
 31.                                                                 
. local lab0: label case 0
 32. local lab1: label case 1
 33. 
.         qui safecount if case==0 & `outcome'_denominator==1
 34.         local denominator = r(N)
 35.         local r_denominator = round(`denominator',5)
 36.         qui safecount if case== 0 & `outcome'==1
 37.         local event = r(N)
 38.         local r_event = round(`event',5)
 39.     bysort case: egen total_follow_up_`outcome' = total(_t)
 40.         qui su total_follow_up_`outcome' if case==0
 41.         local person_year = r(mean)
 42.         local rate = 100000*(`r_event'/`person_year')
 43.         
.         file write tablecontent _n
 44.         file write tablecontent ("`outcome'") _n
 45.         file write tablecontent _tab ("`lab0'") _tab _tab (`r_denominator') _tab (`r_event') _tab %10.0f (`person_year') _tab _tab %3.2f (`rate') _tab _tab _tab ("1.00") _tab _tab _tab ("1.00") _tab _tab _tab ("1.00") _tab _tab _tab ("1.00") _n
 46.         
.         qui safecount if case==1  & `outcome'_denominator==1
 47.         local denominator = r(N)
 48.         local r_denominator = round(`denominator',5)
 49.         qui safecount if case == 1 & `outcome'==1
 50.         local event = r(N)
 51.         local r_event = round(`event',5)
 52.         qui su total_follow_up_`outcome' if case==1
 53.         local person_year = r(mean)
 54.         local rate = 100000*(`r_event'/`person_year')
 55.         file write tablecontent _tab ("`lab1'") _tab _tab _tab (`r_denominator') _tab _tab (`r_event') _tab %10.0f (`person_year') _tab _tab %3.2f (`rate ') _tab _tab  
 56.         cap estimates use "crude_case_`outcome'" 
 57.          cap lincom 1.case, eform
 58.         file write tablecontent  _tab %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) (" - ") %4.2f (r(ub)) (")") _tab 
 59.         cap estimates clear
 60.         cap estimates use "minimal_case_`outcome'" 
 61.          cap lincom 1.case, eform
 62.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) (" - ") %4.2f (r(ub)) (")") _tab 
 63.         cap estimates clear
 64.         cap estimates use "additional_case_`outcome'" 
 65.          cap lincom 1.case, eform
 66.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) (" - ") %4.2f (r(ub)) (")") _tab 
 67.         cap estimates clear
 68.         cap estimates use "full_case_`outcome'" 
 69.          cap lincom 1.case, eform
 70.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(lb)) (" - ") %4.2f (r(ub)) (")") _tab _n 
 71. }

Survival-time data settings

           ID variable: patient_id
         Failure event: esrd_date!=0 & esrd_date<.
Observed time interval: (exit_date_esrd[_n-1], exit_date_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_esrd

--------------------------------------------------------------------------
     27,786  total observations
        126  observations end on or before enter()
         36  observations begin on or after (first) failure
--------------------------------------------------------------------------
     27,624  observations remaining, representing
     27,350  subjects
      2,648  failures in single-failure-per-subject data
 47,153.317  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  5.744011

        Failure _d: esrd_date
  Analysis time _t: (exit_date_esrd-origin)/365.25
            Origin: time index_date_esrd
       ID variable: patient_id

Iteration 0:   log pseudolikelihood = -3128.9655
Iteration 1:   log pseudolikelihood = -3128.8642
Iteration 2:   log pseudolikelihood = -3128.8642
Refining estimates:
Iteration 0:   log pseudolikelihood = -3128.8642

Stratified Cox regression with Breslow method for ties
Strata variable: set_id

No. of subjects =      27,350                           Number of obs = 27,624
No. of failures =       2,648
Time at risk    = 47,153.3169
                                                        Wald chi2(1)  =   0.28
Log pseudolikelihood = -3128.8642                       Prob > chi2   = 0.5935

                           (Std. err. adjusted for 39 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   1.020595   .0389797     0.53   0.594     .9469858    1.099926
------------------------------------------------------------------------------
(note: file crude_case_esrd.ster not found)
file crude_case_esrd.ster saved
(file crude_case_esrd.dta not found)
file crude_case_esrd.dta saved

        Failure _d: esrd_date
  Analysis time _t: (exit_date_esrd-origin)/365.25
            Origin: time index_date_esrd
       ID variable: patient_id

Iteration 0:   log pseudolikelihood = -3128.9655
Iteration 1:   log pseudolikelihood = -3125.1956
Iteration 2:   log pseudolikelihood = -3125.1952
Refining estimates:
Iteration 0:   log pseudolikelihood = -3125.1952

Stratified Cox regression with Breslow method for ties
Strata variable: set_id

No. of subjects =      27,350                           Number of obs = 27,624
No. of failures =       2,648
Time at risk    = 47,153.3169
                                                        Wald chi2(4)  =  28.18
Log pseudolikelihood = -3125.1952                       Prob > chi2   = 0.0000

                           (Std. err. adjusted for 39 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   1.018997   .0407964     0.47   0.638     .9420946    1.102178
             |
         sex |
       Male  |          1  (omitted)
        age1 |   1.014764   .0045224     3.29   0.001     1.005939    1.023666
        age2 |   .9731566   .0134917    -1.96   0.050     .9470695    .9999623
        age3 |   1.046546   .0421301     1.13   0.258     .9671464    1.132465
------------------------------------------------------------------------------
(note: file minimal_case_esrd.ster not found)
file minimal_case_esrd.ster saved
(file minimal_case_esrd.dta not found)
file minimal_case_esrd.dta saved

        Failure _d: esrd_date
  Analysis time _t: (exit_date_esrd-origin)/365.25
            Origin: time index_date_esrd
       ID variable: patient_id

Iteration 0:   log pseudolikelihood =  -56.85162
Iteration 1:   log pseudolikelihood = -36.508334
Iteration 2:   log pseudolikelihood = -33.059758
Iteration 3:   log pseudolikelihood = -31.986127
Iteration 4:   log pseudolikelihood = -31.784718
Iteration 5:   log pseudolikelihood = -31.776477
Iteration 6:   log pseudolikelihood = -31.776464
Refining estimates:
Iteration 0:   log pseudolikelihood = -31.776464

Stratified Cox regression with no ties
Strata variable: set_id

No. of subjects =      3,390                        Number of obs =      3,397
No. of failures =        328
Time at risk    = 5,856.3696
                                                    Wald chi2(19) = 2305108.21
Log pseudolikelihood = -31.776464                   Prob > chi2   =     0.0000

                                        (Std. err. adjusted for 34 clusters in practice_id)
-------------------------------------------------------------------------------------------
                          |               Robust
                       _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------------------+----------------------------------------------------------------
                     case |
              SARS-CoV-2  |   1.237555   .3232276     0.82   0.414     .7417299    2.064826
                          |
                      sex |
                    Male  |          1  (omitted)
                          |
                ethnicity |
             South Asian  |   .6329331   .6600568    -0.44   0.661     .0819745    4.886937
                   Black  |   .4792744   .4026343    -0.88   0.381     .0923628    2.486975
                   Mixed  |   4.876477    3.00439     2.57   0.010     1.457747    16.31286
                   Other  |   2.116371   1.363465     1.16   0.245     .5986986    7.481273
                          |
                      imd |
                       2  |   2.358942   1.951743     1.04   0.300     .4660685    11.93947
                       3  |   .3101104   .3278901    -1.11   0.268     .0390402    2.463317
                       4  |   11.05472   16.40146     1.62   0.105     .6034674    202.5079
        5 Least deprived  |   .4172505   .3387429    -1.08   0.282     .0849871    2.048524
                          |
                    urban |
                   Urban  |   .4696224   .2794235    -1.27   0.204     .1463145    1.507337
                          |
                   region |
                    East  |   .6629026   1.395954    -0.20   0.845     .0106899    41.10811
                  London  |   .0325212    .027368    -4.07   0.000     .0062495    .1692351
              North East  |   .0080803   .0088306    -4.41   0.000     .0009488    .0688121
              North West  |   .2288454   .1815913    -1.86   0.063     .0483175    1.083877
              South East  |   2.322214   1.504232     1.30   0.193     .6524239    8.265605
              South West  |   .0809744   .0779734    -2.61   0.009     .0122657    .5345678
           West Midlands  |   .0151652   .0199662    -3.18   0.001     .0011486    .2002275
Yorkshire and The Humber  |   .0722331   .0760572    -2.50   0.013     .0091721    .5688552
                          |
                      bmi |
      Normal (18.5-24.9)  |   114.4178   542.8842     1.00   0.318     .0104653     1250940
    Overweight (25-29.9)  |   462.8175    2375.71     1.20   0.232     .0197727    1.08e+07
       Obese I (30-34.9)  |   168.4808   902.1137     0.96   0.338     .0046653     6084485
      Obese II (35-39.9)  |   42.04491   222.0948     0.71   0.479     .0013409     1318364
         Obese III (40+)  |   676.4161   3441.178     1.28   0.200      .031611    1.45e+07
                          |
                  smoking |
   Current/former smoker  |   1.064828   .7377294     0.09   0.928     .2738761    4.140045
                     age1 |   .8390805   .0277087    -5.31   0.000     .7864925    .8951847
                     age2 |   1.783013   .3263639     3.16   0.002     1.245518     2.55246
                     age3 |   .1571043   .1074282    -2.71   0.007     .0411278    .6001243
-------------------------------------------------------------------------------------------

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regression with no ties
Strata variable: set_id

No. of subjects =      3,390                        Number of obs =      3,397
No. of failures =        328
Time at risk    = 5,856.3696
                                                    Wald chi2(19) = 2305108.21
Log pseudolikelihood = -31.776464                   Prob > chi2   =     0.0000

                                        (Std. err. adjusted for 34 clusters in practice_id)
-------------------------------------------------------------------------------------------
                          |               Robust
                       _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
--------------------------+----------------------------------------------------------------
                     case |
              SARS-CoV-2  |   1.237555   .3232276     0.82   0.414     .7417299    2.064826
                          |
                      sex |
                    Male  |          1  (omitted)
                          |
                ethnicity |
             South Asian  |   .6329331   .6600568    -0.44   0.661     .0819745    4.886937
                   Black  |   .4792744   .4026343    -0.88   0.381     .0923628    2.486975
                   Mixed  |   4.876477    3.00439     2.57   0.010     1.457747    16.31286
                   Other  |   2.116371   1.363465     1.16   0.245     .5986986    7.481273
                          |
                      imd |
                       2  |   2.358942   1.951743     1.04   0.300     .4660685    11.93947
                       3  |   .3101104   .3278901    -1.11   0.268     .0390402    2.463317
                       4  |   11.05472   16.40146     1.62   0.105     .6034674    202.5079
        5 Least deprived  |   .4172505   .3387429    -1.08   0.282     .0849871    2.048524
                          |
                    urban |
                   Urban  |   .4696224   .2794235    -1.27   0.204     .1463145    1.507337
                          |
                   region |
                    East  |   .6629026   1.395954    -0.20   0.845     .0106899    41.10811
                  London  |   .0325212    .027368    -4.07   0.000     .0062495    .1692351
              North East  |   .0080803   .0088306    -4.41   0.000     .0009488    .0688121
              North West  |   .2288454   .1815913    -1.86   0.063     .0483175    1.083877
              South East  |   2.322214   1.504232     1.30   0.193     .6524239    8.265605
              South West  |   .0809744   .0779734    -2.61   0.009     .0122657    .5345678
           West Midlands  |   .0151652   .0199662    -3.18   0.001     .0011486    .2002275
Yorkshire and The Humber  |   .0722331   .0760572    -2.50   0.013     .0091721    .5688552
                          |
                      bmi |
      Normal (18.5-24.9)  |   114.4178   542.8842     1.00   0.318     .0104653     1250940
    Overweight (25-29.9)  |   462.8175    2375.71     1.20   0.232     .0197727    1.08e+07
       Obese I (30-34.9)  |   168.4808   902.1137     0.96   0.338     .0046653     6084485
      Obese II (35-39.9)  |   42.04491   222.0948     0.71   0.479     .0013409     1318364
         Obese III (40+)  |   676.4161   3441.178     1.28   0.200      .031611    1.45e+07
                          |
                  smoking |
   Current/former smoker  |   1.064828   .7377294     0.09   0.928     .2738761    4.140045
                     age1 |   .8390805   .0277087    -5.31   0.000     .7864925    .8951847
                     age2 |   1.783013   .3263639     3.16   0.002     1.245518     2.55246
                     age3 |   .1571043   .1074282    -2.71   0.007     .0411278    .6001243
-------------------------------------------------------------------------------------------
(note: file additional_case_esrd.ster not found)
file additional_case_esrd.ster saved
(file additional_case_esrd.dta not found)
file additional_case_esrd.dta saved

        Failure _d: esrd_date
  Analysis time _t: (exit_date_esrd-origin)/365.25
            Origin: time index_date_esrd
       ID variable: patient_id

Iteration 0:   log pseudolikelihood =  -56.85162
Iteration 1:   log pseudolikelihood = -30.886291
Iteration 2:   log pseudolikelihood = -23.124252
Iteration 3:   log pseudolikelihood = -17.440884
Iteration 4:   log pseudolikelihood = -12.840709
Iteration 5:   log pseudolikelihood =  -11.35283
Iteration 6:   log pseudolikelihood = -11.164529
Iteration 7:   log pseudolikelihood = -11.148104  (backed up)
Iteration 8:   log pseudolikelihood =  -11.14399  (backed up)
Iteration 9:   log pseudolikelihood = -11.141379  (backed up)
Iteration 10:  log pseudolikelihood =  -11.14104  (backed up)
Iteration 11:  log pseudolikelihood = -11.140871  (backed up)
flat region resulting in a missing likelihood
r(430);

end of do-file

r(430);

. stset exit_date_esrd, fail(esrd_date) origin(index_date_esrd) id(patient_id) scale(365.25)

Survival-time data settings

           ID variable: patient_id
         Failure event: esrd_date!=0 & esrd_date<.
Observed time interval: (exit_date_esrd[_n-1], exit_date_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_esrd

--------------------------------------------------------------------------
     27,786  total observations
        126  observations end on or before enter()
         36  observations begin on or after (first) failure
--------------------------------------------------------------------------
     27,624  observations remaining, representing
     27,350  subjects
      2,648  failures in single-failure-per-subject data
 47,153.317  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  5.744011

. matrix table = r(table)

. matrix list table

symmetric table[1,1]
    c1
r1   .

. stcox i.case, vce(cluster practice_id) strata(set_id)

        Failure _d: esrd_date
  Analysis time _t: (exit_date_esrd-origin)/365.25
            Origin: time index_date_esrd
       ID variable: patient_id

Iteration 0:   log pseudolikelihood = -3128.9655
Iteration 1:   log pseudolikelihood = -3128.8642
Iteration 2:   log pseudolikelihood = -3128.8642
Refining estimates:
Iteration 0:   log pseudolikelihood = -3128.8642

Stratified Cox regression with Breslow method for ties
Strata variable: set_id

No. of subjects =      27,350                           Number of obs = 27,624
No. of failures =       2,648
Time at risk    = 47,153.3169
                                                        Wald chi2(1)  =   0.28
Log pseudolikelihood = -3128.8642                       Prob > chi2   = 0.5935

                           (Std. err. adjusted for 39 clusters in practice_id)
------------------------------------------------------------------------------
             |               Robust
          _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        case |
 SARS-CoV-2  |   1.020595   .0389797     0.53   0.594     .9469858    1.099926
------------------------------------------------------------------------------

. matrix table = r(table)

. matrix list table

table[9,2]
               0b.         1.
             case       case
     b          1  1.0205952
    se          .  .03897975
     z          .  .53376088
pvalue          .  .59350698
    ll          .  .94698579
    ul          .  1.0999263
    df          .          .
  crit   1.959964   1.959964
 eform          1          1

. tab _d case

      1 if |
failure; 0 |
        if |         case
  censored | Historica  SARS-CoV- |     Total
-----------+----------------------+----------
         0 |    17,841      7,135 |    24,976 
         1 |     1,893        755 |     2,648 
-----------+----------------------+----------
     Total |    19,734      7,890 |    27,624 

. matrix table = r(table)

. matrix list tablble
matrix tablble not found
r(111);

. matrix list table

symmetric table[1,1]
    c1
r1   .

. tab _d case

      1 if |
failure; 0 |
        if |         case
  censored | Historica  SARS-CoV- |     Total
-----------+----------------------+----------
         0 |    17,841      7,135 |    24,976 
         1 |     1,893        755 |     2,648 
-----------+----------------------+----------
     Total |    19,734      7,890 |    27,624 

. matrix table = r(table)

. matrix list table

symmetric table[1,1]
    c1
r1   .

. count if _d==1 & case==1
  755

. sum (_t)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
          _t |     27,624    1.724344    .8161566   .0027379   5.744011

. sum _t if case==1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
          _t |      7,890    1.777212    .9452295   .0027379   5.744011

. cd ..
C:\Users\lsh1703468\Documents

. cd post-ckd-outcomes
unable to change to post-ckd-outcomes
r(170);

. cd ckd-post-covid-outcomes
C:\Users\lsh1703468\Documents\ckd-post-covid-outcomes

. do "C:\Users\lsh1703468\Documents\ckd-post-covid-outcomes\analysis\ckd_progression.do"

. sysdir set PLUS ./analysis/adofiles

. sysdir set PERSONAL ./analysis/adofiles

. pwd
C:\Users\lsh1703468\Documents\ckd-post-covid-outcomes

. cap log close
