------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2017.log
  log type:  text
 opened on:   2 Dec 2022, 11:36:12

. 
. *program for replacing stps that is called below
. program drop _all

. program replaceSTPs
  1.         local low=0
  2.         *divide total dataset by number of stps (=31)
.         local increase=int(_N/31)
  3.         *replace stps 5-9
.         foreach i of numlist 5/9 {
  4.                 local high=`low'+`increase'
  5.                 replace stp="E5400000`i'" if _n>`low'& _n<`high'
  6.                 local low=`low'+ `increase'
  7.         }
  8.         count
  9.         *replace all other stps
.         *reset lower limit to take account that 5/9 have been done already
.         local low=`increase'*5 
 10.         foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
 11.                 local high=`low'+`increase'
 12.                 replace stp="E540000`i'" if _n>`low'& _n<`high'
 13.                 local low=`low'+ `increase'
 14.         }
 15.         count
 16.         *tidy up remainder
.         replace stp="E54000005" if stp=="STP1"
 17. end

. 
. 
. *(1)=========Create separate stps for cases============
. import delimited ./output/covid_matching_2017.csv, clear
(encoding automatically selected: ISO-8859-2)
(11 vars, 16,020 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        570        3.56        3.56
  E54000006 |        515        3.21        6.77
  E54000007 |        515        3.21        9.99
  E54000008 |        515        3.21       13.20
  E54000009 |        515        3.21       16.42
  E54000010 |        515        3.21       19.63
  E54000012 |        515        3.21       22.85
  E54000013 |        515        3.21       26.06
  E54000014 |        515        3.21       29.28
  E54000015 |        515        3.21       32.49
  E54000016 |        515        3.21       35.71
  E54000017 |        515        3.21       38.92
  E54000020 |        515        3.21       42.13
  E54000021 |        515        3.21       45.35
  E54000022 |        515        3.21       48.56
  E54000023 |        515        3.21       51.78
  E54000024 |        515        3.21       54.99
  E54000025 |        515        3.21       58.21
  E54000026 |        515        3.21       61.42
  E54000027 |        515        3.21       64.64
  E54000029 |        515        3.21       67.85
  E54000033 |        515        3.21       71.07
  E54000035 |        515        3.21       74.28
  E54000036 |        515        3.21       77.50
  E54000037 |        515        3.21       80.71
  E54000040 |        515        3.21       83.93
  E54000041 |        515        3.21       87.14
  E54000042 |        515        3.21       90.36
  E54000043 |        515        3.21       93.57
  E54000044 |        515        3.21       96.79
  E54000049 |        515        3.21      100.00
------------+-----------------------------------
      Total |     16,020      100.00

. *call program
. replaceSTPs
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
  16,020
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
  16,020
(0 real changes made)

. *tabulate after changes
. tab stp, miss

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        570        3.56        3.56
  E54000006 |        515        3.21        6.77
  E54000007 |        515        3.21        9.99
  E54000008 |        515        3.21       13.20
  E54000009 |        515        3.21       16.42
  E54000010 |        515        3.21       19.63
  E54000012 |        515        3.21       22.85
  E54000013 |        515        3.21       26.06
  E54000014 |        515        3.21       29.28
  E54000015 |        515        3.21       32.49
  E54000016 |        515        3.21       35.71
  E54000017 |        515        3.21       38.92
  E54000020 |        515        3.21       42.13
  E54000021 |        515        3.21       45.35
  E54000022 |        515        3.21       48.56
  E54000023 |        515        3.21       51.78
  E54000024 |        515        3.21       54.99
  E54000025 |        515        3.21       58.21
  E54000026 |        515        3.21       61.42
  E54000027 |        515        3.21       64.64
  E54000029 |        515        3.21       67.85
  E54000033 |        515        3.21       71.07
  E54000035 |        515        3.21       74.28
  E54000036 |        515        3.21       77.50
  E54000037 |        515        3.21       80.71
  E54000040 |        515        3.21       83.93
  E54000041 |        515        3.21       87.14
  E54000042 |        515        3.21       90.36
  E54000043 |        515        3.21       93.57
  E54000044 |        515        3.21       96.79
  E54000049 |        515        3.21      100.00
------------+-----------------------------------
      Total |     16,020      100.00

. *export output
. export delimited using "./output/covid_matching_2017.csv", replace
file ./output/covid_matching_2017.csv saved

. 
. 
. 
. 
. *(2)=========Create separate stps for comparators============
. import delimited ./output/2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(7 vars, 28,967 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        977        3.37        3.37
  E54000006 |        933        3.22        6.59
  E54000007 |        933        3.22        9.81
  E54000008 |        933        3.22       13.04
  E54000009 |        933        3.22       16.26
  E54000010 |        933        3.22       19.48
  E54000012 |        933        3.22       22.70
  E54000013 |        933        3.22       25.92
  E54000014 |        933        3.22       29.14
  E54000015 |        933        3.22       32.36
  E54000016 |        933        3.22       35.58
  E54000017 |        933        3.22       38.80
  E54000020 |        933        3.22       42.02
  E54000021 |        933        3.22       45.24
  E54000022 |        933        3.22       48.47
  E54000023 |        933        3.22       51.69
  E54000024 |        933        3.22       54.91
  E54000025 |        933        3.22       58.13
  E54000026 |        933        3.22       61.35
  E54000027 |        933        3.22       64.57
  E54000029 |        933        3.22       67.79
  E54000033 |        933        3.22       71.01
  E54000035 |        933        3.22       74.23
  E54000036 |        933        3.22       77.45
  E54000037 |        933        3.22       80.67
  E54000040 |        933        3.22       83.90
  E54000041 |        933        3.22       87.12
  E54000042 |        933        3.22       90.34
  E54000043 |        933        3.22       93.56
  E54000044 |        933        3.22       96.78
  E54000049 |        933        3.22      100.00
------------+-----------------------------------
      Total |     28,967      100.00

. *call program
. replaceSTPs
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
  28,967
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
  28,967
(0 real changes made)

. *tabulate after changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        977        3.37        3.37
  E54000006 |        933        3.22        6.59
  E54000007 |        933        3.22        9.81
  E54000008 |        933        3.22       13.04
  E54000009 |        933        3.22       16.26
  E54000010 |        933        3.22       19.48
  E54000012 |        933        3.22       22.70
  E54000013 |        933        3.22       25.92
  E54000014 |        933        3.22       29.14
  E54000015 |        933        3.22       32.36
  E54000016 |        933        3.22       35.58
  E54000017 |        933        3.22       38.80
  E54000020 |        933        3.22       42.02
  E54000021 |        933        3.22       45.24
  E54000022 |        933        3.22       48.47
  E54000023 |        933        3.22       51.69
  E54000024 |        933        3.22       54.91
  E54000025 |        933        3.22       58.13
  E54000026 |        933        3.22       61.35
  E54000027 |        933        3.22       64.57
  E54000029 |        933        3.22       67.79
  E54000033 |        933        3.22       71.01
  E54000035 |        933        3.22       74.23
  E54000036 |        933        3.22       77.45
  E54000037 |        933        3.22       80.67
  E54000040 |        933        3.22       83.90
  E54000041 |        933        3.22       87.12
  E54000042 |        933        3.22       90.34
  E54000043 |        933        3.22       93.56
  E54000044 |        933        3.22       96.78
  E54000049 |        933        3.22      100.00
------------+-----------------------------------
      Total |     28,967      100.00

. *export output
. export delimited using "./output/2017_matching.csv", replace
file ./output/2017_matching.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2017.log
  log type:  text
 closed on:   2 Dec 2022, 11:36:14
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
