------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2020.log
  log type:  text
 opened on:  24 Apr 2024, 11:56:52

. 
. *program for replacing stps that is called below
. program drop _all

. program replaceSTPs
  1.         local low=0
  2.         *divide total dataset by number of stps (=31)
.         local increase=int(_N/31)
  3.         *replace stps 5-9
.         foreach i of numlist 5/9 {
  4.                 local high=`low'+`increase'
  5.                 replace stp="E5400000`i'" if _n>`low'& _n<`high'
  6.                 local low=`low'+ `increase'
  7.         }
  8.         count
  9.         *replace all other stps
.         *reset lower limit to take account that 5/9 have been done already
.         local low=`increase'*5 
 10.         foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
 11.                 local high=`low'+`increase'
 12.                 replace stp="E540000`i'" if _n>`low'& _n<`high'
 13.                 local low=`low'+ `increase'
 14.         }
 15.         count
 16.         *tidy up remainder
.         replace stp="E54000005" if stp=="STP1"
 17. end

. 
. 
. *(1)=========Create separate stps for cases============
. import delimited ./output/covid_matching_2020.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 2,020 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |      2,020      100.00      100.00
------------+-----------------------------------
      Total |      2,020      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
  2,020
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
(64 real changes made)
  2,020
(36 real changes made)

. *tabulate after changes
. tab stp, miss

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        100        4.95        4.95
  E54000006 |         64        3.17        8.12
  E54000007 |         64        3.17       11.29
  E54000008 |         64        3.17       14.46
  E54000009 |         64        3.17       17.62
  E54000010 |         64        3.17       20.79
  E54000012 |         64        3.17       23.96
  E54000013 |         64        3.17       27.13
  E54000014 |         64        3.17       30.30
  E54000015 |         64        3.17       33.47
  E54000016 |         64        3.17       36.63
  E54000017 |         64        3.17       39.80
  E54000020 |         64        3.17       42.97
  E54000021 |         64        3.17       46.14
  E54000022 |         64        3.17       49.31
  E54000023 |         64        3.17       52.48
  E54000024 |         64        3.17       55.64
  E54000025 |         64        3.17       58.81
  E54000026 |         64        3.17       61.98
  E54000027 |         64        3.17       65.15
  E54000029 |         64        3.17       68.32
  E54000033 |         64        3.17       71.49
  E54000035 |         64        3.17       74.65
  E54000036 |         64        3.17       77.82
  E54000037 |         64        3.17       80.99
  E54000040 |         64        3.17       84.16
  E54000041 |         64        3.17       87.33
  E54000042 |         64        3.17       90.50
  E54000043 |         64        3.17       93.66
  E54000044 |         64        3.17       96.83
  E54000049 |         64        3.17      100.00
------------+-----------------------------------
      Total |      2,020      100.00

. *export output
. export delimited using "./output/covid_matching_2020.csv", replace
file ./output/covid_matching_2020.csv saved

. 
. 
. 
. 
. *(2)=========Create separate stps for comparators============
. import delimited ./output/2020_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(9 vars, 28,657 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     28,657      100.00      100.00
------------+-----------------------------------
      Total |     28,657      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
  28,657
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
(923 real changes made)
  28,657
(44 real changes made)

. *tabulate after changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        967        3.37        3.37
  E54000006 |        923        3.22        6.60
  E54000007 |        923        3.22        9.82
  E54000008 |        923        3.22       13.04
  E54000009 |        923        3.22       16.26
  E54000010 |        923        3.22       19.48
  E54000012 |        923        3.22       22.70
  E54000013 |        923        3.22       25.92
  E54000014 |        923        3.22       29.14
  E54000015 |        923        3.22       32.36
  E54000016 |        923        3.22       35.58
  E54000017 |        923        3.22       38.80
  E54000020 |        923        3.22       42.02
  E54000021 |        923        3.22       45.25
  E54000022 |        923        3.22       48.47
  E54000023 |        923        3.22       51.69
  E54000024 |        923        3.22       54.91
  E54000025 |        923        3.22       58.13
  E54000026 |        923        3.22       61.35
  E54000027 |        923        3.22       64.57
  E54000029 |        923        3.22       67.79
  E54000033 |        923        3.22       71.01
  E54000035 |        923        3.22       74.23
  E54000036 |        923        3.22       77.45
  E54000037 |        923        3.22       80.67
  E54000040 |        923        3.22       83.90
  E54000041 |        923        3.22       87.12
  E54000042 |        923        3.22       90.34
  E54000043 |        923        3.22       93.56
  E54000044 |        923        3.22       96.78
  E54000049 |        923        3.22      100.00
------------+-----------------------------------
      Total |     28,657      100.00

. *export output
. export delimited using "./output/2020_matching.csv", replace
file ./output/2020_matching.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2020.log
  log type:  text
 closed on:  24 Apr 2024, 11:56:53
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
