------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2017.log
  log type:  text
 opened on:  27 Oct 2022, 13:19:14

. 
. *program for replacing stps that is called below
. program drop _all

. program replaceSTPs
  1.         local low=0
  2.         *divide total dataset by number of stps (=31)
.         local increase=int(_N/31)
  3.         *replace stps 5-9
.         foreach i of numlist 5/9 {
  4.                 local high=`low'+`increase'
  5.                 replace stp="E5400000`i'" if _n>`low'& _n<`high'
  6.                 local low=`low'+ `increase'
  7.         }
  8.         count
  9.         *replace all other stps
.         *reset lower limit to take account that 5/9 have been done already
.         local low=`increase'*5 
 10.         foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
 11.                 local high=`low'+`increase'
 12.                 replace stp="E540000`i'" if _n>`low'& _n<`high'
 13.                 local low=`low'+ `increase'
 14.         }
 15.         count
 16.         *tidy up remainder
.         replace stp="E54000005" if stp=="STP1"
 17. end

. 
. 
. *(1)=========Create separate stps for cases============
. import delimited ./output/covid_matching_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(11 vars, 16,097 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     16,097      100.00      100.00
------------+-----------------------------------
      Total |     16,097      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
  16,097
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
(518 real changes made)
  16,097
(39 real changes made)

. *tabulate after changes
. tab stp, miss

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        557        3.46        3.46
  E54000006 |        518        3.22        6.68
  E54000007 |        518        3.22        9.90
  E54000008 |        518        3.22       13.11
  E54000009 |        518        3.22       16.33
  E54000010 |        518        3.22       19.55
  E54000012 |        518        3.22       22.77
  E54000013 |        518        3.22       25.99
  E54000014 |        518        3.22       29.20
  E54000015 |        518        3.22       32.42
  E54000016 |        518        3.22       35.64
  E54000017 |        518        3.22       38.86
  E54000020 |        518        3.22       42.08
  E54000021 |        518        3.22       45.29
  E54000022 |        518        3.22       48.51
  E54000023 |        518        3.22       51.73
  E54000024 |        518        3.22       54.95
  E54000025 |        518        3.22       58.17
  E54000026 |        518        3.22       61.38
  E54000027 |        518        3.22       64.60
  E54000029 |        518        3.22       67.82
  E54000033 |        518        3.22       71.04
  E54000035 |        518        3.22       74.26
  E54000036 |        518        3.22       77.47
  E54000037 |        518        3.22       80.69
  E54000040 |        518        3.22       83.91
  E54000041 |        518        3.22       87.13
  E54000042 |        518        3.22       90.35
  E54000043 |        518        3.22       93.56
  E54000044 |        518        3.22       96.78
  E54000049 |        518        3.22      100.00
------------+-----------------------------------
      Total |     16,097      100.00

. *export output
. export delimited using "./output/covid_matching_2017.csv", replace
file ./output/covid_matching_2017.csv saved

. 
. 
. 
. 
. *(2)=========Create separate stps for comparators============
. import delimited ./output/2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(8 vars, 28,822 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     28,822      100.00      100.00
------------+-----------------------------------
      Total |     28,822      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
  28,822
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
  28,822
(54 real changes made)

. *tabulate after changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        982        3.41        3.41
  E54000006 |        928        3.22        6.63
  E54000007 |        928        3.22        9.85
  E54000008 |        928        3.22       13.07
  E54000009 |        928        3.22       16.29
  E54000010 |        928        3.22       19.51
  E54000012 |        928        3.22       22.73
  E54000013 |        928        3.22       25.95
  E54000014 |        928        3.22       29.17
  E54000015 |        928        3.22       32.38
  E54000016 |        928        3.22       35.60
  E54000017 |        928        3.22       38.82
  E54000020 |        928        3.22       42.04
  E54000021 |        928        3.22       45.26
  E54000022 |        928        3.22       48.48
  E54000023 |        928        3.22       51.70
  E54000024 |        928        3.22       54.92
  E54000025 |        928        3.22       58.14
  E54000026 |        928        3.22       61.36
  E54000027 |        928        3.22       64.58
  E54000029 |        928        3.22       67.80
  E54000033 |        928        3.22       71.02
  E54000035 |        928        3.22       74.24
  E54000036 |        928        3.22       77.46
  E54000037 |        928        3.22       80.68
  E54000040 |        928        3.22       83.90
  E54000041 |        928        3.22       87.12
  E54000042 |        928        3.22       90.34
  E54000043 |        928        3.22       93.56
  E54000044 |        928        3.22       96.78
  E54000049 |        928        3.22      100.00
------------+-----------------------------------
      Total |     28,822      100.00

. *export output
. export delimited using "./output/2017_matching.csv", replace
file ./output/2017_matching.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2017.log
  log type:  text
 closed on:  27 Oct 2022, 13:19:15
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
