-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2017.log
  log type:  text
 opened on:  21 Nov 2022, 22:01:42

. 
. *program for replacing stps that is called below
. program drop _all

. program replaceSTPs
  1.         local low=0
  2.         *divide total dataset by number of stps (=31)
.         local increase=int(_N/31)
  3.         *replace stps 5-9
.         foreach i of numlist 5/9 {
  4.                 local high=`low'+`increase'
  5.                 replace stp="E5400000`i'" if _n>`low'& _n<`high'
  6.                 local low=`low'+ `increase'
  7.         }
  8.         count
  9.         *replace all other stps
.         *reset lower limit to take account that 5/9 have been done already
.         local low=`increase'*5 
 10.         foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
 11.                 local high=`low'+`increase'
 12.                 replace stp="E540000`i'" if _n>`low'& _n<`high'
 13.                 local low=`low'+ `increase'
 14.         }
 15.         count
 16.         *tidy up remainder
.         replace stp="E54000005" if stp=="STP1"
 17. end

. 
. 
. *(1)=========Create separate stps for cases============
. import delimited ./output/covid_matching_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 15,673 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     15,673      100.00      100.00
------------+-----------------------------------
      Total |     15,673      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
  15,673
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
(504 real changes made)
  15,673
(49 real changes made)

. *tabulate after changes
. tab stp, miss

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        553        3.53        3.53
  E54000006 |        504        3.22        6.74
  E54000007 |        504        3.22        9.96
  E54000008 |        504        3.22       13.18
  E54000009 |        504        3.22       16.39
  E54000010 |        504        3.22       19.61
  E54000012 |        504        3.22       22.82
  E54000013 |        504        3.22       26.04
  E54000014 |        504        3.22       29.25
  E54000015 |        504        3.22       32.47
  E54000016 |        504        3.22       35.69
  E54000017 |        504        3.22       38.90
  E54000020 |        504        3.22       42.12
  E54000021 |        504        3.22       45.33
  E54000022 |        504        3.22       48.55
  E54000023 |        504        3.22       51.76
  E54000024 |        504        3.22       54.98
  E54000025 |        504        3.22       58.20
  E54000026 |        504        3.22       61.41
  E54000027 |        504        3.22       64.63
  E54000029 |        504        3.22       67.84
  E54000033 |        504        3.22       71.06
  E54000035 |        504        3.22       74.27
  E54000036 |        504        3.22       77.49
  E54000037 |        504        3.22       80.71
  E54000040 |        504        3.22       83.92
  E54000041 |        504        3.22       87.14
  E54000042 |        504        3.22       90.35
  E54000043 |        504        3.22       93.57
  E54000044 |        504        3.22       96.78
  E54000049 |        504        3.22      100.00
------------+-----------------------------------
      Total |     15,673      100.00

. *export output
. export delimited using "./output/covid_matching_2017.csv", replace
file ./output/covid_matching_2017.csv saved

. 
. 
. 
. 
. *(2)=========Create separate stps for comparators============
. import delimited ./output/2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(7 vars, 29,000 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     29,000      100.00      100.00
------------+-----------------------------------
      Total |     29,000      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
  29,000
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
  29,000
(46 real changes made)

. *tabulate after changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        980        3.38        3.38
  E54000006 |        934        3.22        6.60
  E54000007 |        934        3.22        9.82
  E54000008 |        934        3.22       13.04
  E54000009 |        934        3.22       16.26
  E54000010 |        934        3.22       19.48
  E54000012 |        934        3.22       22.70
  E54000013 |        934        3.22       25.92
  E54000014 |        934        3.22       29.14
  E54000015 |        934        3.22       32.37
  E54000016 |        934        3.22       35.59
  E54000017 |        934        3.22       38.81
  E54000020 |        934        3.22       42.03
  E54000021 |        934        3.22       45.25
  E54000022 |        934        3.22       48.47
  E54000023 |        934        3.22       51.69
  E54000024 |        934        3.22       54.91
  E54000025 |        934        3.22       58.13
  E54000026 |        934        3.22       61.35
  E54000027 |        934        3.22       64.57
  E54000029 |        934        3.22       67.79
  E54000033 |        934        3.22       71.01
  E54000035 |        934        3.22       74.23
  E54000036 |        934        3.22       77.46
  E54000037 |        934        3.22       80.68
  E54000040 |        934        3.22       83.90
  E54000041 |        934        3.22       87.12
  E54000042 |        934        3.22       90.34
  E54000043 |        934        3.22       93.56
  E54000044 |        934        3.22       96.78
  E54000049 |        934        3.22      100.00
------------+-----------------------------------
      Total |     29,000      100.00

. *export output
. export delimited using "./output/2017_matching.csv", replace
file ./output/2017_matching.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2017.log
  log type:  text
 closed on:  21 Nov 2022, 22:01:43
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
