---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2020.log
  log type:  text
 opened on:   1 Nov 2022, 15:23:59

. 
. *program for replacing stps that is called below
. program drop _all

. program replaceSTPs
  1.         local low=0
  2.         *divide total dataset by number of stps (=31)
.         local increase=int(_N/31)
  3.         *replace stps 5-9
.         foreach i of numlist 5/9 {
  4.                 local high=`low'+`increase'
  5.                 replace stp="E5400000`i'" if _n>`low'& _n<`high'
  6.                 local low=`low'+ `increase'
  7.         }
  8.         count
  9.         *replace all other stps
.         *reset lower limit to take account that 5/9 have been done already
.         local low=`increase'*5 
 10.         foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
 11.                 local high=`low'+`increase'
 12.                 replace stp="E540000`i'" if _n>`low'& _n<`high'
 13.                 local low=`low'+ `increase'
 14.         }
 15.         count
 16.         *tidy up remainder
.         replace stp="E54000005" if stp=="STP1"
 17. end

. 
. 
. *(1)=========Create separate stps for cases============
. import delimited ./output/covid_matching_2020.csv, clear
(encoding automatically selected: ISO-8859-1)
(11 vars, 16,005 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     16,005      100.00      100.00
------------+-----------------------------------
      Total |     16,005      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
  16,005
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
(515 real changes made)
  16,005
(40 real changes made)

. *tabulate after changes
. tab stp, miss

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        555        3.47        3.47
  E54000006 |        515        3.22        6.69
  E54000007 |        515        3.22        9.90
  E54000008 |        515        3.22       13.12
  E54000009 |        515        3.22       16.34
  E54000010 |        515        3.22       19.56
  E54000012 |        515        3.22       22.77
  E54000013 |        515        3.22       25.99
  E54000014 |        515        3.22       29.21
  E54000015 |        515        3.22       32.43
  E54000016 |        515        3.22       35.65
  E54000017 |        515        3.22       38.86
  E54000020 |        515        3.22       42.08
  E54000021 |        515        3.22       45.30
  E54000022 |        515        3.22       48.52
  E54000023 |        515        3.22       51.73
  E54000024 |        515        3.22       54.95
  E54000025 |        515        3.22       58.17
  E54000026 |        515        3.22       61.39
  E54000027 |        515        3.22       64.60
  E54000029 |        515        3.22       67.82
  E54000033 |        515        3.22       71.04
  E54000035 |        515        3.22       74.26
  E54000036 |        515        3.22       77.48
  E54000037 |        515        3.22       80.69
  E54000040 |        515        3.22       83.91
  E54000041 |        515        3.22       87.13
  E54000042 |        515        3.22       90.35
  E54000043 |        515        3.22       93.56
  E54000044 |        515        3.22       96.78
  E54000049 |        515        3.22      100.00
------------+-----------------------------------
      Total |     16,005      100.00

. *export output
. export delimited using "./output/covid_matching_2020.csv", replace
file ./output/covid_matching_2020.csv saved

. 
. 
. 
. 
. *(2)=========Create separate stps for comparators============
. import delimited ./output/2020_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(15 vars, 28,883 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     28,883      100.00      100.00
------------+-----------------------------------
      Total |     28,883      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
  28,883
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
(930 real changes made)
  28,883
(53 real changes made)

. *tabulate after changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        983        3.40        3.40
  E54000006 |        930        3.22        6.62
  E54000007 |        930        3.22        9.84
  E54000008 |        930        3.22       13.06
  E54000009 |        930        3.22       16.28
  E54000010 |        930        3.22       19.50
  E54000012 |        930        3.22       22.72
  E54000013 |        930        3.22       25.94
  E54000014 |        930        3.22       29.16
  E54000015 |        930        3.22       32.38
  E54000016 |        930        3.22       35.60
  E54000017 |        930        3.22       38.82
  E54000020 |        930        3.22       42.04
  E54000021 |        930        3.22       45.26
  E54000022 |        930        3.22       48.48
  E54000023 |        930        3.22       51.70
  E54000024 |        930        3.22       54.92
  E54000025 |        930        3.22       58.14
  E54000026 |        930        3.22       61.36
  E54000027 |        930        3.22       64.58
  E54000029 |        930        3.22       67.80
  E54000033 |        930        3.22       71.02
  E54000035 |        930        3.22       74.24
  E54000036 |        930        3.22       77.46
  E54000037 |        930        3.22       80.68
  E54000040 |        930        3.22       83.90
  E54000041 |        930        3.22       87.12
  E54000042 |        930        3.22       90.34
  E54000043 |        930        3.22       93.56
  E54000044 |        930        3.22       96.78
  E54000049 |        930        3.22      100.00
------------+-----------------------------------
      Total |     28,883      100.00

. *export output
. export delimited using "./output/2020_matching.csv", replace
file ./output/2020_matching.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2020.log
  log type:  text
 closed on:   1 Nov 2022, 15:24:01
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
