-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2017.log
  log type:  text
 opened on:  19 Jul 2023, 14:38:42

. 
. *program for replacing stps that is called below
. program drop _all

. program replaceSTPs
  1.         local low=0
  2.         *divide total dataset by number of stps (=31)
.         local increase=int(_N/31)
  3.         *replace stps 5-9
.         foreach i of numlist 5/9 {
  4.                 local high=`low'+`increase'
  5.                 replace stp="E5400000`i'" if _n>`low'& _n<`high'
  6.                 local low=`low'+ `increase'
  7.         }
  8.         count
  9.         *replace all other stps
.         *reset lower limit to take account that 5/9 have been done already
.         local low=`increase'*5 
 10.         foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
 11.                 local high=`low'+`increase'
 12.                 replace stp="E540000`i'" if _n>`low'& _n<`high'
 13.                 local low=`low'+ `increase'
 14.         }
 15.         count
 16.         *tidy up remainder
.         replace stp="E54000005" if stp=="STP1"
 17. end

. 
. 
. *(1)=========Create separate stps for cases============
. import delimited ./output/covid_matching_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 14,597 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     14,597      100.00      100.00
------------+-----------------------------------
      Total |     14,597      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
  14,597
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
(469 real changes made)
  14,597
(58 real changes made)

. *tabulate after changes
. tab stp, miss

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        527        3.61        3.61
  E54000006 |        469        3.21        6.82
  E54000007 |        469        3.21       10.04
  E54000008 |        469        3.21       13.25
  E54000009 |        469        3.21       16.46
  E54000010 |        469        3.21       19.68
  E54000012 |        469        3.21       22.89
  E54000013 |        469        3.21       26.10
  E54000014 |        469        3.21       29.31
  E54000015 |        469        3.21       32.53
  E54000016 |        469        3.21       35.74
  E54000017 |        469        3.21       38.95
  E54000020 |        469        3.21       42.17
  E54000021 |        469        3.21       45.38
  E54000022 |        469        3.21       48.59
  E54000023 |        469        3.21       51.81
  E54000024 |        469        3.21       55.02
  E54000025 |        469        3.21       58.23
  E54000026 |        469        3.21       61.44
  E54000027 |        469        3.21       64.66
  E54000029 |        469        3.21       67.87
  E54000033 |        469        3.21       71.08
  E54000035 |        469        3.21       74.30
  E54000036 |        469        3.21       77.51
  E54000037 |        469        3.21       80.72
  E54000040 |        469        3.21       83.94
  E54000041 |        469        3.21       87.15
  E54000042 |        469        3.21       90.36
  E54000043 |        469        3.21       93.57
  E54000044 |        469        3.21       96.79
  E54000049 |        469        3.21      100.00
------------+-----------------------------------
      Total |     14,597      100.00

. *export output
. export delimited using "./output/covid_matching_2017.csv", replace
file ./output/covid_matching_2017.csv saved

. 
. 
. 
. 
. *(2)=========Create separate stps for comparators============
. import delimited ./output/2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(7 vars, 28,792 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     28,792      100.00      100.00
------------+-----------------------------------
      Total |     28,792      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
  28,792
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
(927 real changes made)
  28,792
(55 real changes made)

. *tabulate after changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        982        3.41        3.41
  E54000006 |        927        3.22        6.63
  E54000007 |        927        3.22        9.85
  E54000008 |        927        3.22       13.07
  E54000009 |        927        3.22       16.29
  E54000010 |        927        3.22       19.51
  E54000012 |        927        3.22       22.73
  E54000013 |        927        3.22       25.95
  E54000014 |        927        3.22       29.17
  E54000015 |        927        3.22       32.39
  E54000016 |        927        3.22       35.61
  E54000017 |        927        3.22       38.83
  E54000020 |        927        3.22       42.05
  E54000021 |        927        3.22       45.27
  E54000022 |        927        3.22       48.49
  E54000023 |        927        3.22       51.71
  E54000024 |        927        3.22       54.92
  E54000025 |        927        3.22       58.14
  E54000026 |        927        3.22       61.36
  E54000027 |        927        3.22       64.58
  E54000029 |        927        3.22       67.80
  E54000033 |        927        3.22       71.02
  E54000035 |        927        3.22       74.24
  E54000036 |        927        3.22       77.46
  E54000037 |        927        3.22       80.68
  E54000040 |        927        3.22       83.90
  E54000041 |        927        3.22       87.12
  E54000042 |        927        3.22       90.34
  E54000043 |        927        3.22       93.56
  E54000044 |        927        3.22       96.78
  E54000049 |        927        3.22      100.00
------------+-----------------------------------
      Total |     28,792      100.00

. *export output
. export delimited using "./output/2017_matching.csv", replace
file ./output/2017_matching.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2017.log
  log type:  text
 closed on:  19 Jul 2023, 14:38:42
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
