------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2020.log
  log type:  text
 opened on:  26 Oct 2022, 13:24:43

. 
. *program for replacing stps that is called below
. program drop _all

. program replaceSTPs
  1.         local low=0
  2.         *divide total dataset by number of stps (=31)
.         local increase=int(_N/31)
  3.         *replace stps 5-9
.         foreach i of numlist 5/9 {
  4.                 local high=`low'+`increase'
  5.                 replace stp="E5400000`i'" if _n>`low'& _n<`high'
  6.                 local low=`low'+ `increase'
  7.         }
  8.         count
  9.         *replace all other stps
.         *reset lower limit to take account that 5/9 have been done already
.         local low=`increase'*5 
 10.         foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
 11.                 local high=`low'+`increase'
 12.                 replace stp="E540000`i'" if _n>`low'& _n<`high'
 13.                 local low=`low'+ `increase'
 14.         }
 15.         count
 16.         *tidy up remainder
.         replace stp="E54000005" if stp=="STP1"
 17. end

. 
. 
. *(1)=========Create separate stps for cases============
. import delimited ./output/covid_matching_2020.csv, clear
(encoding automatically selected: ISO-8859-1)
(11 vars, 16,032 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     16,032      100.00      100.00
------------+-----------------------------------
      Total |     16,032      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
  16,032
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
(516 real changes made)
  16,032
(36 real changes made)

. *tabulate after changes
. tab stp, miss

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        552        3.44        3.44
  E54000006 |        516        3.22        6.66
  E54000007 |        516        3.22        9.88
  E54000008 |        516        3.22       13.10
  E54000009 |        516        3.22       16.32
  E54000010 |        516        3.22       19.54
  E54000012 |        516        3.22       22.75
  E54000013 |        516        3.22       25.97
  E54000014 |        516        3.22       29.19
  E54000015 |        516        3.22       32.41
  E54000016 |        516        3.22       35.63
  E54000017 |        516        3.22       38.85
  E54000020 |        516        3.22       42.07
  E54000021 |        516        3.22       45.28
  E54000022 |        516        3.22       48.50
  E54000023 |        516        3.22       51.72
  E54000024 |        516        3.22       54.94
  E54000025 |        516        3.22       58.16
  E54000026 |        516        3.22       61.38
  E54000027 |        516        3.22       64.60
  E54000029 |        516        3.22       67.81
  E54000033 |        516        3.22       71.03
  E54000035 |        516        3.22       74.25
  E54000036 |        516        3.22       77.47
  E54000037 |        516        3.22       80.69
  E54000040 |        516        3.22       83.91
  E54000041 |        516        3.22       87.13
  E54000042 |        516        3.22       90.34
  E54000043 |        516        3.22       93.56
  E54000044 |        516        3.22       96.78
  E54000049 |        516        3.22      100.00
------------+-----------------------------------
      Total |     16,032      100.00

. *export output
. export delimited using "./output/covid_matching_2020.csv", replace
file ./output/covid_matching_2020.csv saved

. 
. 
. 
. 
. *(2)=========Create separate stps for comparators============
. import delimited ./output/2020_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(16 vars, 28,922 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     28,922      100.00      100.00
------------+-----------------------------------
      Total |     28,922      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
  28,922
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
(931 real changes made)
  28,922
(61 real changes made)

. *tabulate after changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        992        3.43        3.43
  E54000006 |        931        3.22        6.65
  E54000007 |        931        3.22        9.87
  E54000008 |        931        3.22       13.09
  E54000009 |        931        3.22       16.31
  E54000010 |        931        3.22       19.52
  E54000012 |        931        3.22       22.74
  E54000013 |        931        3.22       25.96
  E54000014 |        931        3.22       29.18
  E54000015 |        931        3.22       32.40
  E54000016 |        931        3.22       35.62
  E54000017 |        931        3.22       38.84
  E54000020 |        931        3.22       42.06
  E54000021 |        931        3.22       45.28
  E54000022 |        931        3.22       48.50
  E54000023 |        931        3.22       51.71
  E54000024 |        931        3.22       54.93
  E54000025 |        931        3.22       58.15
  E54000026 |        931        3.22       61.37
  E54000027 |        931        3.22       64.59
  E54000029 |        931        3.22       67.81
  E54000033 |        931        3.22       71.03
  E54000035 |        931        3.22       74.25
  E54000036 |        931        3.22       77.47
  E54000037 |        931        3.22       80.69
  E54000040 |        931        3.22       83.90
  E54000041 |        931        3.22       87.12
  E54000042 |        931        3.22       90.34
  E54000043 |        931        3.22       93.56
  E54000044 |        931        3.22       96.78
  E54000049 |        931        3.22      100.00
------------+-----------------------------------
      Total |     28,922      100.00

. *export output
. export delimited using "./output/2020_matching.csv", replace
file ./output/2020_matching.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2020.log
  log type:  text
 closed on:  26 Oct 2022, 13:24:43
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
