------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2017.log
  log type:  text
 opened on:  24 Dec 2022, 12:11:19

. 
. *program for replacing stps that is called below
. program drop _all

. program replaceSTPs
  1.         local low=0
  2.         *divide total dataset by number of stps (=31)
.         local increase=int(_N/31)
  3.         *replace stps 5-9
.         foreach i of numlist 5/9 {
  4.                 local high=`low'+`increase'
  5.                 replace stp="E5400000`i'" if _n>`low'& _n<`high'
  6.                 local low=`low'+ `increase'
  7.         }
  8.         count
  9.         *replace all other stps
.         *reset lower limit to take account that 5/9 have been done already
.         local low=`increase'*5 
 10.         foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
 11.                 local high=`low'+`increase'
 12.                 replace stp="E540000`i'" if _n>`low'& _n<`high'
 13.                 local low=`low'+ `increase'
 14.         }
 15.         count
 16.         *tidy up remainder
.         replace stp="E54000005" if stp=="STP1"
 17. end

. 
. 
. *(1)=========Create separate stps for cases============
. import delimited ./output/covid_matching_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 15,745 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     15,745      100.00      100.00
------------+-----------------------------------
      Total |     15,745      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
  15,745
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
(506 real changes made)
  15,745
(59 real changes made)

. *tabulate after changes
. tab stp, miss

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        565        3.59        3.59
  E54000006 |        506        3.21        6.80
  E54000007 |        506        3.21       10.02
  E54000008 |        506        3.21       13.23
  E54000009 |        506        3.21       16.44
  E54000010 |        506        3.21       19.66
  E54000012 |        506        3.21       22.87
  E54000013 |        506        3.21       26.08
  E54000014 |        506        3.21       29.30
  E54000015 |        506        3.21       32.51
  E54000016 |        506        3.21       35.73
  E54000017 |        506        3.21       38.94
  E54000020 |        506        3.21       42.15
  E54000021 |        506        3.21       45.37
  E54000022 |        506        3.21       48.58
  E54000023 |        506        3.21       51.79
  E54000024 |        506        3.21       55.01
  E54000025 |        506        3.21       58.22
  E54000026 |        506        3.21       61.44
  E54000027 |        506        3.21       64.65
  E54000029 |        506        3.21       67.86
  E54000033 |        506        3.21       71.08
  E54000035 |        506        3.21       74.29
  E54000036 |        506        3.21       77.50
  E54000037 |        506        3.21       80.72
  E54000040 |        506        3.21       83.93
  E54000041 |        506        3.21       87.15
  E54000042 |        506        3.21       90.36
  E54000043 |        506        3.21       93.57
  E54000044 |        506        3.21       96.79
  E54000049 |        506        3.21      100.00
------------+-----------------------------------
      Total |     15,745      100.00

. *export output
. export delimited using "./output/covid_matching_2017.csv", replace
file ./output/covid_matching_2017.csv saved

. 
. 
. 
. 
. *(2)=========Create separate stps for comparators============
. import delimited ./output/2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(7 vars, 28,825 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     28,825      100.00      100.00
------------+-----------------------------------
      Total |     28,825      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
  28,825
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
(928 real changes made)
  28,825
(57 real changes made)

. *tabulate after changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        985        3.42        3.42
  E54000006 |        928        3.22        6.64
  E54000007 |        928        3.22        9.86
  E54000008 |        928        3.22       13.08
  E54000009 |        928        3.22       16.29
  E54000010 |        928        3.22       19.51
  E54000012 |        928        3.22       22.73
  E54000013 |        928        3.22       25.95
  E54000014 |        928        3.22       29.17
  E54000015 |        928        3.22       32.39
  E54000016 |        928        3.22       35.61
  E54000017 |        928        3.22       38.83
  E54000020 |        928        3.22       42.05
  E54000021 |        928        3.22       45.27
  E54000022 |        928        3.22       48.49
  E54000023 |        928        3.22       51.71
  E54000024 |        928        3.22       54.93
  E54000025 |        928        3.22       58.15
  E54000026 |        928        3.22       61.37
  E54000027 |        928        3.22       64.59
  E54000029 |        928        3.22       67.81
  E54000033 |        928        3.22       71.03
  E54000035 |        928        3.22       74.24
  E54000036 |        928        3.22       77.46
  E54000037 |        928        3.22       80.68
  E54000040 |        928        3.22       83.90
  E54000041 |        928        3.22       87.12
  E54000042 |        928        3.22       90.34
  E54000043 |        928        3.22       93.56
  E54000044 |        928        3.22       96.78
  E54000049 |        928        3.22      100.00
------------+-----------------------------------
      Total |     28,825      100.00

. *export output
. export delimited using "./output/2017_matching.csv", replace
file ./output/2017_matching.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2017.log
  log type:  text
 closed on:  24 Dec 2022, 12:11:25
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
