------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2020.log
  log type:  text
 opened on:   1 Apr 2023, 02:06:02

. 
. *program for replacing stps that is called below
. program drop _all

. program replaceSTPs
  1.         local low=0
  2.         *divide total dataset by number of stps (=31)
.         local increase=int(_N/31)
  3.         *replace stps 5-9
.         foreach i of numlist 5/9 {
  4.                 local high=`low'+`increase'
  5.                 replace stp="E5400000`i'" if _n>`low'& _n<`high'
  6.                 local low=`low'+ `increase'
  7.         }
  8.         count
  9.         *replace all other stps
.         *reset lower limit to take account that 5/9 have been done already
.         local low=`increase'*5 
 10.         foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
 11.                 local high=`low'+`increase'
 12.                 replace stp="E540000`i'" if _n>`low'& _n<`high'
 13.                 local low=`low'+ `increase'
 14.         }
 15.         count
 16.         *tidy up remainder
.         replace stp="E54000005" if stp=="STP1"
 17. end

. 
. 
. *(1)=========Create separate stps for cases============
. import delimited ./output/covid_matching_2020.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 14,637 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     14,637      100.00      100.00
------------+-----------------------------------
      Total |     14,637      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
  14,637
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
(471 real changes made)
  14,637
(36 real changes made)

. *tabulate after changes
. tab stp, miss

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        507        3.46        3.46
  E54000006 |        471        3.22        6.68
  E54000007 |        471        3.22        9.90
  E54000008 |        471        3.22       13.12
  E54000009 |        471        3.22       16.34
  E54000010 |        471        3.22       19.55
  E54000012 |        471        3.22       22.77
  E54000013 |        471        3.22       25.99
  E54000014 |        471        3.22       29.21
  E54000015 |        471        3.22       32.42
  E54000016 |        471        3.22       35.64
  E54000017 |        471        3.22       38.86
  E54000020 |        471        3.22       42.08
  E54000021 |        471        3.22       45.30
  E54000022 |        471        3.22       48.51
  E54000023 |        471        3.22       51.73
  E54000024 |        471        3.22       54.95
  E54000025 |        471        3.22       58.17
  E54000026 |        471        3.22       61.39
  E54000027 |        471        3.22       64.60
  E54000029 |        471        3.22       67.82
  E54000033 |        471        3.22       71.04
  E54000035 |        471        3.22       74.26
  E54000036 |        471        3.22       77.47
  E54000037 |        471        3.22       80.69
  E54000040 |        471        3.22       83.91
  E54000041 |        471        3.22       87.13
  E54000042 |        471        3.22       90.35
  E54000043 |        471        3.22       93.56
  E54000044 |        471        3.22       96.78
  E54000049 |        471        3.22      100.00
------------+-----------------------------------
      Total |     14,637      100.00

. *export output
. export delimited using "./output/covid_matching_2020.csv", replace
file ./output/covid_matching_2020.csv saved

. 
. 
. 
. 
. *(2)=========Create separate stps for comparators============
. import delimited ./output/2020_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(8 vars, 28,725 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     28,725      100.00      100.00
------------+-----------------------------------
      Total |     28,725      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
  28,725
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
(925 real changes made)
  28,725
(50 real changes made)

. *tabulate after changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        975        3.39        3.39
  E54000006 |        925        3.22        6.61
  E54000007 |        925        3.22        9.83
  E54000008 |        925        3.22       13.05
  E54000009 |        925        3.22       16.28
  E54000010 |        925        3.22       19.50
  E54000012 |        925        3.22       22.72
  E54000013 |        925        3.22       25.94
  E54000014 |        925        3.22       29.16
  E54000015 |        925        3.22       32.38
  E54000016 |        925        3.22       35.60
  E54000017 |        925        3.22       38.82
  E54000020 |        925        3.22       42.04
  E54000021 |        925        3.22       45.26
  E54000022 |        925        3.22       48.48
  E54000023 |        925        3.22       51.70
  E54000024 |        925        3.22       54.92
  E54000025 |        925        3.22       58.14
  E54000026 |        925        3.22       61.36
  E54000027 |        925        3.22       64.58
  E54000029 |        925        3.22       67.80
  E54000033 |        925        3.22       71.02
  E54000035 |        925        3.22       74.24
  E54000036 |        925        3.22       77.46
  E54000037 |        925        3.22       80.68
  E54000040 |        925        3.22       83.90
  E54000041 |        925        3.22       87.12
  E54000042 |        925        3.22       90.34
  E54000043 |        925        3.22       93.56
  E54000044 |        925        3.22       96.78
  E54000049 |        925        3.22      100.00
------------+-----------------------------------
      Total |     28,725      100.00

. *export output
. export delimited using "./output/2020_matching.csv", replace
file ./output/2020_matching.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2020.log
  log type:  text
 closed on:   1 Apr 2023, 02:06:03
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
