------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2017.log
  log type:  text
 opened on:   5 Apr 2023, 11:43:18

. 
. *program for replacing stps that is called below
. program drop _all

. program replaceSTPs
  1.         local low=0
  2.         *divide total dataset by number of stps (=31)
.         local increase=int(_N/31)
  3.         *replace stps 5-9
.         foreach i of numlist 5/9 {
  4.                 local high=`low'+`increase'
  5.                 replace stp="E5400000`i'" if _n>`low'& _n<`high'
  6.                 local low=`low'+ `increase'
  7.         }
  8.         count
  9.         *replace all other stps
.         *reset lower limit to take account that 5/9 have been done already
.         local low=`increase'*5 
 10.         foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
 11.                 local high=`low'+`increase'
 12.                 replace stp="E540000`i'" if _n>`low'& _n<`high'
 13.                 local low=`low'+ `increase'
 14.         }
 15.         count
 16.         *tidy up remainder
.         replace stp="E54000005" if stp=="STP1"
 17. end

. 
. 
. *(1)=========Create separate stps for cases============
. import delimited ./output/covid_matching_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 14,759 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     14,759      100.00      100.00
------------+-----------------------------------
      Total |     14,759      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
  14,759
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
(475 real changes made)
  14,759
(34 real changes made)

. *tabulate after changes
. tab stp, miss

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        509        3.45        3.45
  E54000006 |        475        3.22        6.67
  E54000007 |        475        3.22        9.89
  E54000008 |        475        3.22       13.10
  E54000009 |        475        3.22       16.32
  E54000010 |        475        3.22       19.54
  E54000012 |        475        3.22       22.76
  E54000013 |        475        3.22       25.98
  E54000014 |        475        3.22       29.20
  E54000015 |        475        3.22       32.41
  E54000016 |        475        3.22       35.63
  E54000017 |        475        3.22       38.85
  E54000020 |        475        3.22       42.07
  E54000021 |        475        3.22       45.29
  E54000022 |        475        3.22       48.51
  E54000023 |        475        3.22       51.72
  E54000024 |        475        3.22       54.94
  E54000025 |        475        3.22       58.16
  E54000026 |        475        3.22       61.38
  E54000027 |        475        3.22       64.60
  E54000029 |        475        3.22       67.82
  E54000033 |        475        3.22       71.03
  E54000035 |        475        3.22       74.25
  E54000036 |        475        3.22       77.47
  E54000037 |        475        3.22       80.69
  E54000040 |        475        3.22       83.91
  E54000041 |        475        3.22       87.13
  E54000042 |        475        3.22       90.34
  E54000043 |        475        3.22       93.56
  E54000044 |        475        3.22       96.78
  E54000049 |        475        3.22      100.00
------------+-----------------------------------
      Total |     14,759      100.00

. *export output
. export delimited using "./output/covid_matching_2017.csv", replace
file ./output/covid_matching_2017.csv saved

. 
. 
. 
. 
. *(2)=========Create separate stps for comparators============
. import delimited ./output/2017_matching.csv, clear
(encoding automatically selected: ISO-8859-2)
(7 vars, 29,013 obs)

. *tabulate before changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     29,013      100.00      100.00
------------+-----------------------------------
      Total |     29,013      100.00

. *call program
. replaceSTPs
variable stp was str4 now str9
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
  29,013
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
(934 real changes made)
  29,013
(59 real changes made)

. *tabulate after changes
. tab stp

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
  E54000005 |        993        3.42        3.42
  E54000006 |        934        3.22        6.64
  E54000007 |        934        3.22        9.86
  E54000008 |        934        3.22       13.08
  E54000009 |        934        3.22       16.30
  E54000010 |        934        3.22       19.52
  E54000012 |        934        3.22       22.74
  E54000013 |        934        3.22       25.96
  E54000014 |        934        3.22       29.18
  E54000015 |        934        3.22       32.40
  E54000016 |        934        3.22       35.62
  E54000017 |        934        3.22       38.83
  E54000020 |        934        3.22       42.05
  E54000021 |        934        3.22       45.27
  E54000022 |        934        3.22       48.49
  E54000023 |        934        3.22       51.71
  E54000024 |        934        3.22       54.93
  E54000025 |        934        3.22       58.15
  E54000026 |        934        3.22       61.37
  E54000027 |        934        3.22       64.59
  E54000029 |        934        3.22       67.81
  E54000033 |        934        3.22       71.03
  E54000035 |        934        3.22       74.25
  E54000036 |        934        3.22       77.47
  E54000037 |        934        3.22       80.68
  E54000040 |        934        3.22       83.90
  E54000041 |        934        3.22       87.12
  E54000042 |        934        3.22       90.34
  E54000043 |        934        3.22       93.56
  E54000044 |        934        3.22       96.78
  E54000049 |        934        3.22      100.00
------------+-----------------------------------
      Total |     29,013      100.00

. *export output
. export delimited using "./output/2017_matching.csv", replace
file ./output/2017_matching.csv saved

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/dummy_only_create_multiple_stps_2017.log
  log type:  text
 closed on:   5 Apr 2023, 11:43:19
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
