------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/input_covid_matching.log
  log type:  text
 opened on:  15 Sep 2022, 13:24:15

. clear

. 
. import delimited ./output/input_covid_matching.csv, delimiter(comma) varnames(1) case(preserve) 
(encoding automatically selected: ISO-8859-9)
(40 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18
. drop if age <18
(10,854 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before COVID-19 diagnosis
. drop if has_follow_up==0
(1,970 observations deleted)

. drop has_follow_up

. 
. * Pre-existing kidney replacement therapy
. drop if baseline_krt_primary_care==1
(1,812 observations deleted)

. drop baseline_krt_primary_care

. drop if baseline_krt_icd_10==1
(1,801 observations deleted)

. drop baseline_krt_icd_10

. drop if baseline_krt_opcs_4==1
(1,695 observations deleted)

. drop baseline_krt_opcs_4

. 
. * Baseline eGFR <15 as at February 2020
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. replace baseline_creatinine_feb2020 = . if !inrange(baseline_creatinine_feb2020, 20, 3000)
(14,051 real changes made, 14,051 to missing)

. gen mgdl_baseline_creatinine_feb2020 = baseline_creatinine_feb2020/88.4
(14,051 missing values generated)

. gen min_baseline_creatinine_feb2020=.
(31,868 missing values generated)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.7 if male==0
(8,959 real changes made)

. replace min_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.9 if male==1
(8,858 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.329  if male==0
(8,959 real changes made)

. replace min_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020^-0.411  if male==1
(8,857 real changes made)

. replace min_baseline_creatinine_feb2020 = 1 if min_baseline_creatinine_feb2020<1
(11,359 real changes made)

. gen max_baseline_creatinine_feb2020=.
(31,868 missing values generated)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.7 if male==0
(8,959 real changes made)

. replace max_baseline_creatinine_feb2020 = mgdl_baseline_creatinine_feb2020/0.9 if male==1
(8,858 real changes made)

. replace max_baseline_creatinine_feb2020 = max_baseline_creatinine_feb2020^-1.209
(17,816 real changes made)

. replace max_baseline_creatinine_feb2020 = 1 if max_baseline_creatinine_feb2020>1
(20,508 real changes made)

. gen egfr_baseline_creatinine_feb2020 = min_baseline_creatinine_feb2020*max_baseline_creatinine_feb2020*141
(14,051 missing values generated)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*(0.993^age)
(17,817 real changes made)

. replace egfr_baseline_creatinine_feb2020 = egfr_baseline_creatinine_feb2020*1.018 if male==0
(8,959 real changes made)

. drop if egfr_baseline_creatinine_feb2020 <15
(0 observations deleted)

. drop baseline_creatinine_feb2020

. drop mgdl_baseline_creatinine_feb2020

. drop min_baseline_creatinine_feb2020

. drop max_baseline_creatinine_feb2020

. 
. * Baseline eGFR <15 at time of COVID diagnosis using baseline creatinine updated monthly
. gen covid_date = date(covid_diagnosis_date, "YMD")
(17,350 missing values generated)

. format covid_date %td

. drop if covid_date ==.
(17,350 observations deleted)

. drop covid_diagnosis_date

. drop sgss_positive_date

. drop primary_care_covid_date

. drop hospital_covid_date

. drop sars_cov_2

. 
. foreach baseline_creatinine_monthly of varlist  baseline_creatinine_mar2020 ///
>                                                                                                 baseline_creatinine_apr2020 ///
>                                                                                                 baseline_creatinine_may2020 ///
>                                                                                                 baseline_creatinine_jun2020 ///
>                                                                                                 baseline_creatinine_jul2020 ///
>                                                                                                 baseline_creatinine_aug2020 ///
>                                                                                                 baseline_creatinine_sep2020 ///
>                                                                                                 baseline_creatinine_oct2020 ///
>                                                                                                 baseline_creatinine_nov2020 ///
>                                                                                                 baseline_creatinine_dec2020 ///
>                                                                                                 baseline_creatinine_jan2021 ///
>                                                                                                 baseline_creatinine_feb2021 ///
>                                                                                                 baseline_creatinine_mar2021 ///
>                                                                                                 baseline_creatinine_apr2021 ///
>                                                                                                 baseline_creatinine_may2021 ///
>                                                                                                 baseline_creatinine_jun2021 ///
>                                                                                                 baseline_creatinine_jul2021 ///
>                                                                                                 baseline_creatinine_aug2021 ///
>                                                                                                 baseline_creatinine_sep2021 ///
>                                                                                                 baseline_creatinine_oct2021 ///
>                                                                                                 baseline_creatinine_nov2021 ///
>                                                                                                 baseline_creatinine_dec2021 ///
>                                                                                                 baseline_creatinine_jan2022 {
  2. replace `baseline_creatinine_monthly' = . if !inrange(`baseline_creatinine_monthly', 20, 3000)
  3. gen mgdl_`baseline_creatinine_monthly' = `baseline_creatinine_monthly'/88.4
  4. gen min_`baseline_creatinine_monthly'=.
  5. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if male==0
  6. replace min_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if male==1
  7. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.329 if male==0
  8. replace min_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'^-0.411 if male==1
  9. replace min_`baseline_creatinine_monthly' = 1 if min_`baseline_creatinine_monthly'<1
 10. gen max_`baseline_creatinine_monthly'=.
 11. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.7 if male==0
 12. replace max_`baseline_creatinine_monthly' = mgdl_`baseline_creatinine_monthly'/0.9 if male==1
 13. replace max_`baseline_creatinine_monthly' = max_`baseline_creatinine_monthly'^-1.209
 14. replace max_`baseline_creatinine_monthly' = 1 if max_`baseline_creatinine_monthly'>1
 15. gen egfr_`baseline_creatinine_monthly' = min_`baseline_creatinine_monthly'*max_`baseline_creatinine_monthly'*141
 16. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*(0.993^age)
 17. replace egfr_`baseline_creatinine_monthly' = egfr_`baseline_creatinine_monthly'*1.018 if male==0
 18. drop `baseline_creatinine_monthly'
 19. drop mgdl_`baseline_creatinine_monthly'
 20. drop min_`baseline_creatinine_monthly'
 21. drop max_`baseline_creatinine_monthly'
 22. }
(6,435 real changes made, 6,435 to missing)
(6,435 missing values generated)
(14,518 missing values generated)
(4,174 real changes made)
(3,909 real changes made)
(4,174 real changes made)
(3,909 real changes made)
(5,091 real changes made)
(14,518 missing values generated)
(4,174 real changes made)
(3,909 real changes made)
(8,083 real changes made)
(9,427 real changes made)
(6,435 missing values generated)
(8,083 real changes made)
(4,174 real changes made)
(6,339 real changes made, 6,339 to missing)
(6,339 missing values generated)
(14,518 missing values generated)
(4,185 real changes made)
(3,994 real changes made)
(4,185 real changes made)
(3,994 real changes made)
(5,160 real changes made)
(14,518 missing values generated)
(4,185 real changes made)
(3,994 real changes made)
(8,179 real changes made)
(9,358 real changes made)
(6,339 missing values generated)
(8,179 real changes made)
(4,185 real changes made)
(6,438 real changes made, 6,438 to missing)
(6,438 missing values generated)
(14,518 missing values generated)
(4,106 real changes made)
(3,974 real changes made)
(4,106 real changes made)
(3,974 real changes made)
(5,182 real changes made)
(14,518 missing values generated)
(4,106 real changes made)
(3,974 real changes made)
(8,080 real changes made)
(9,336 real changes made)
(6,438 missing values generated)
(8,080 real changes made)
(4,106 real changes made)
(6,312 real changes made, 6,312 to missing)
(6,312 missing values generated)
(14,518 missing values generated)
(4,186 real changes made)
(4,020 real changes made)
(4,186 real changes made)
(4,020 real changes made)
(5,107 real changes made)
(14,518 missing values generated)
(4,186 real changes made)
(4,020 real changes made)
(8,206 real changes made)
(9,411 real changes made)
(6,312 missing values generated)
(8,206 real changes made)
(4,186 real changes made)
(6,327 real changes made, 6,327 to missing)
(6,327 missing values generated)
(14,518 missing values generated)
(4,137 real changes made)
(4,054 real changes made)
(4,137 real changes made)
(4,054 real changes made)
(5,121 real changes made)
(14,518 missing values generated)
(4,137 real changes made)
(4,054 real changes made)
(8,191 real changes made)
(9,397 real changes made)
(6,327 missing values generated)
(8,191 real changes made)
(4,137 real changes made)
(6,456 real changes made, 6,456 to missing)
(6,456 missing values generated)
(14,518 missing values generated)
(4,125 real changes made)
(3,937 real changes made)
(4,125 real changes made)
(3,937 real changes made)
(5,083 real changes made)
(14,518 missing values generated)
(4,125 real changes made)
(3,937 real changes made)
(8,062 real changes made)
(9,435 real changes made)
(6,456 missing values generated)
(8,062 real changes made)
(4,125 real changes made)
(6,375 real changes made, 6,375 to missing)
(6,375 missing values generated)
(14,518 missing values generated)
(4,150 real changes made)
(3,993 real changes made)
(4,150 real changes made)
(3,993 real changes made)
(5,118 real changes made)
(14,518 missing values generated)
(4,150 real changes made)
(3,993 real changes made)
(8,143 real changes made)
(9,400 real changes made)
(6,375 missing values generated)
(8,143 real changes made)
(4,150 real changes made)
(6,344 real changes made, 6,344 to missing)
(6,344 missing values generated)
(14,518 missing values generated)
(4,157 real changes made)
(4,017 real changes made)
(4,157 real changes made)
(4,017 real changes made)
(5,210 real changes made)
(14,518 missing values generated)
(4,157 real changes made)
(4,017 real changes made)
(8,174 real changes made)
(9,308 real changes made)
(6,344 missing values generated)
(8,174 real changes made)
(4,157 real changes made)
(6,334 real changes made, 6,334 to missing)
(6,334 missing values generated)
(14,518 missing values generated)
(4,150 real changes made)
(4,034 real changes made)
(4,150 real changes made)
(4,034 real changes made)
(5,214 real changes made)
(14,518 missing values generated)
(4,150 real changes made)
(4,034 real changes made)
(8,184 real changes made)
(9,304 real changes made)
(6,334 missing values generated)
(8,184 real changes made)
(4,150 real changes made)
(6,367 real changes made, 6,367 to missing)
(6,367 missing values generated)
(14,518 missing values generated)
(4,128 real changes made)
(4,023 real changes made)
(4,128 real changes made)
(4,023 real changes made)
(5,246 real changes made)
(14,518 missing values generated)
(4,128 real changes made)
(4,023 real changes made)
(8,151 real changes made)
(9,272 real changes made)
(6,367 missing values generated)
(8,151 real changes made)
(4,128 real changes made)
(6,435 real changes made, 6,435 to missing)
(6,435 missing values generated)
(14,518 missing values generated)
(4,152 real changes made)
(3,931 real changes made)
(4,152 real changes made)
(3,931 real changes made)
(5,130 real changes made)
(14,518 missing values generated)
(4,152 real changes made)
(3,931 real changes made)
(8,083 real changes made)
(9,388 real changes made)
(6,435 missing values generated)
(8,083 real changes made)
(4,152 real changes made)
(6,481 real changes made, 6,481 to missing)
(6,481 missing values generated)
(14,518 missing values generated)
(4,132 real changes made)
(3,905 real changes made)
(4,132 real changes made)
(3,905 real changes made)
(5,164 real changes made)
(14,518 missing values generated)
(4,132 real changes made)
(3,905 real changes made)
(8,037 real changes made)
(9,354 real changes made)
(6,481 missing values generated)
(8,037 real changes made)
(4,132 real changes made)
(6,341 real changes made, 6,341 to missing)
(6,341 missing values generated)
(14,518 missing values generated)
(4,203 real changes made)
(3,974 real changes made)
(4,203 real changes made)
(3,974 real changes made)
(5,263 real changes made)
(14,518 missing values generated)
(4,203 real changes made)
(3,974 real changes made)
(8,177 real changes made)
(9,255 real changes made)
(6,341 missing values generated)
(8,177 real changes made)
(4,203 real changes made)
(6,437 real changes made, 6,437 to missing)
(6,437 missing values generated)
(14,518 missing values generated)
(4,172 real changes made)
(3,909 real changes made)
(4,172 real changes made)
(3,909 real changes made)
(5,021 real changes made)
(14,518 missing values generated)
(4,172 real changes made)
(3,909 real changes made)
(8,081 real changes made)
(9,497 real changes made)
(6,437 missing values generated)
(8,081 real changes made)
(4,172 real changes made)
(6,333 real changes made, 6,333 to missing)
(6,333 missing values generated)
(14,518 missing values generated)
(4,154 real changes made)
(4,031 real changes made)
(4,154 real changes made)
(4,031 real changes made)
(5,080 real changes made)
(14,518 missing values generated)
(4,154 real changes made)
(4,031 real changes made)
(8,185 real changes made)
(9,438 real changes made)
(6,333 missing values generated)
(8,185 real changes made)
(4,154 real changes made)
(6,387 real changes made, 6,387 to missing)
(6,387 missing values generated)
(14,518 missing values generated)
(4,192 real changes made)
(3,939 real changes made)
(4,192 real changes made)
(3,939 real changes made)
(5,122 real changes made)
(14,518 missing values generated)
(4,192 real changes made)
(3,939 real changes made)
(8,131 real changes made)
(9,396 real changes made)
(6,387 missing values generated)
(8,131 real changes made)
(4,192 real changes made)
(6,344 real changes made, 6,344 to missing)
(6,344 missing values generated)
(14,518 missing values generated)
(4,142 real changes made)
(4,032 real changes made)
(4,142 real changes made)
(4,032 real changes made)
(5,119 real changes made)
(14,518 missing values generated)
(4,142 real changes made)
(4,032 real changes made)
(8,174 real changes made)
(9,399 real changes made)
(6,344 missing values generated)
(8,174 real changes made)
(4,142 real changes made)
(6,369 real changes made, 6,369 to missing)
(6,369 missing values generated)
(14,518 missing values generated)
(4,177 real changes made)
(3,972 real changes made)
(4,177 real changes made)
(3,972 real changes made)
(5,138 real changes made)
(14,518 missing values generated)
(4,177 real changes made)
(3,972 real changes made)
(8,149 real changes made)
(9,380 real changes made)
(6,369 missing values generated)
(8,149 real changes made)
(4,177 real changes made)
(6,397 real changes made, 6,397 to missing)
(6,397 missing values generated)
(14,518 missing values generated)
(4,117 real changes made)
(4,004 real changes made)
(4,117 real changes made)
(4,004 real changes made)
(5,149 real changes made)
(14,518 missing values generated)
(4,117 real changes made)
(4,004 real changes made)
(8,121 real changes made)
(9,369 real changes made)
(6,397 missing values generated)
(8,121 real changes made)
(4,117 real changes made)
(6,397 real changes made, 6,397 to missing)
(6,397 missing values generated)
(14,518 missing values generated)
(4,131 real changes made)
(3,990 real changes made)
(4,131 real changes made)
(3,990 real changes made)
(5,174 real changes made)
(14,518 missing values generated)
(4,131 real changes made)
(3,990 real changes made)
(8,121 real changes made)
(9,344 real changes made)
(6,397 missing values generated)
(8,121 real changes made)
(4,131 real changes made)
(6,432 real changes made, 6,432 to missing)
(6,432 missing values generated)
(14,518 missing values generated)
(4,148 real changes made)
(3,938 real changes made)
(4,148 real changes made)
(3,938 real changes made)
(5,201 real changes made)
(14,518 missing values generated)
(4,148 real changes made)
(3,938 real changes made)
(8,086 real changes made)
(9,317 real changes made)
(6,432 missing values generated)
(8,086 real changes made)
(4,148 real changes made)
(6,402 real changes made, 6,402 to missing)
(6,402 missing values generated)
(14,518 missing values generated)
(4,143 real changes made)
(3,973 real changes made)
(4,143 real changes made)
(3,973 real changes made)
(5,114 real changes made)
(14,518 missing values generated)
(4,143 real changes made)
(3,973 real changes made)
(8,116 real changes made)
(9,404 real changes made)
(6,402 missing values generated)
(8,116 real changes made)
(4,143 real changes made)
(6,379 real changes made, 6,379 to missing)
(6,379 missing values generated)
(14,518 missing values generated)
(4,195 real changes made)
(3,944 real changes made)
(4,195 real changes made)
(3,944 real changes made)
(5,095 real changes made)
(14,518 missing values generated)
(4,195 real changes made)
(3,944 real changes made)
(8,139 real changes made)
(9,423 real changes made)
(6,379 missing values generated)
(8,139 real changes made)
(4,195 real changes made)

. 
. gen covid_date_string=string(covid_date, "%td") 

. gen covid_month=substr( covid_date_string ,3,7)

. 
. gen baseline_egfr=.
(14,518 missing values generated)

. local month_year "feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022"

. foreach x of  local month_year  {
  2. replace baseline_egfr=egfr_baseline_creatinine_`x' if  covid_month=="`x'"
  3. drop if baseline_egfr <15
  4. drop egfr_baseline_creatinine_`x'
  5. }
(370 real changes made)
(0 observations deleted)
(378 real changes made)
(0 observations deleted)
(394 real changes made)
(0 observations deleted)
(397 real changes made)
(0 observations deleted)
(390 real changes made)
(0 observations deleted)
(387 real changes made)
(0 observations deleted)
(396 real changes made)
(0 observations deleted)
(338 real changes made)
(0 observations deleted)
(363 real changes made)
(0 observations deleted)
(324 real changes made)
(0 observations deleted)
(383 real changes made)
(0 observations deleted)
(314 real changes made)
(0 observations deleted)
(332 real changes made)
(0 observations deleted)
(353 real changes made)
(0 observations deleted)
(346 real changes made)
(0 observations deleted)
(315 real changes made)
(0 observations deleted)
(307 real changes made)
(0 observations deleted)
(326 real changes made)
(0 observations deleted)
(288 real changes made)
(0 observations deleted)
(296 real changes made)
(0 observations deleted)
(307 real changes made)
(0 observations deleted)
(287 real changes made)
(0 observations deleted)
(277 real changes made)
(0 observations deleted)
(270 real changes made)
(0 observations deleted)

. drop baseline_egfr

. drop covid_month

. drop covid_date_string

. drop age

. 
. * COVID-19 death
. drop if deceased==1
(1,471 observations deleted)

. drop deceased

. 
. **Covariates
. * IMD
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. replace imd = imd + 1
(13,047 real changes made)

. drop imd_o

. recode imd 5=1 4=2 3=3 2=4 1=5 .=.
(10478 changes made to imd)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" 

. label values imd imd

. label var imd "Index of Multiple Deprivation"

. noi di "DROPPING IF NO IMD" 
DROPPING IF NO IMD

. drop if imd>=.
(0 observations deleted)

. 
. export delimited using "./output/covid_matching.csv", replace
file ./output/covid_matching.csv saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/input_covid_matching.log
  log type:  text
 closed on:  15 Sep 2022, 13:24:17
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
