------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/matching_stp5.log
  log type:  text
 opened on:  21 Sep 2022, 19:19:16

. clear

. 
. import delimited ./output/input_covid_matching_stp5.csv, delimiter(comma) varnames(1) case(preserve) 
(encoding automatically selected: ISO-8859-1)
(6 vars, 474 obs)

. 
. tab male, m

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |        245       51.69       51.69
       Male |        229       48.31      100.00
------------+-----------------------------------
      Total |        474      100.00

. tab year_of_birth, m

year_of_bir |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
       1950 |         13        2.74        2.74
       1951 |         10        2.11        4.85
       1952 |          6        1.27        6.12
       1953 |         10        2.11        8.23
       1954 |          4        0.84        9.07
       1955 |         12        2.53       11.60
       1956 |         12        2.53       14.14
       1957 |         11        2.32       16.46
       1958 |         12        2.53       18.99
       1959 |         10        2.11       21.10
       1960 |          9        1.90       23.00
       1961 |          8        1.69       24.68
       1962 |         15        3.16       27.85
       1963 |         10        2.11       29.96
       1964 |          9        1.90       31.86
       1965 |         13        2.74       34.60
       1966 |         10        2.11       36.71
       1967 |         11        2.32       39.03
       1968 |          8        1.69       40.72
       1969 |          8        1.69       42.41
       1970 |         10        2.11       44.51
       1971 |          3        0.63       45.15
       1972 |         11        2.32       47.47
       1973 |          8        1.69       49.16
       1974 |         11        2.32       51.48
       1975 |         14        2.95       54.43
       1976 |          8        1.69       56.12
       1977 |         14        2.95       59.07
       1978 |         11        2.32       61.39
       1979 |         11        2.32       63.71
       1980 |         10        2.11       65.82
       1981 |          9        1.90       67.72
       1982 |          7        1.48       69.20
       1983 |          9        1.90       71.10
       1984 |          4        0.84       71.94
       1985 |          6        1.27       73.21
       1986 |          7        1.48       74.68
       1987 |         10        2.11       76.79
       1988 |          7        1.48       78.27
       1989 |         12        2.53       80.80
       1990 |         14        2.95       83.76
       1991 |          8        1.69       85.44
       1992 |         12        2.53       87.97
       1993 |         14        2.95       90.93
       1994 |          7        1.48       92.41
       1995 |         12        2.53       94.94
       1996 |          8        1.69       96.62
       1997 |          6        1.27       97.89
       1998 |          4        0.84       98.73
       1999 |          6        1.27      100.00
------------+-----------------------------------
      Total |        474      100.00

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |         92       19.41       19.41
               2 |         97       20.46       39.87
               3 |         85       17.93       57.81
               4 |        159       33.54       91.35
 5 most deprived |         41        8.65      100.00
-----------------+-----------------------------------
           Total |        474      100.00

. 
. save ./output/covid_matching_stp5.dta, replace 
(file ./output/covid_matching_stp5.dta not found)
file ./output/covid_matching_stp5.dta saved

. 
. clear

. 
. import delimited ./output/input_contemporary_matching_stp5.csv, delimiter(comma) varnames(1) case(preserve)
(encoding automatically selected: ISO-8859-1)
(5 vars, 965 obs)

.  
. tab male, m

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |        466       48.29       48.29
       Male |        499       51.71      100.00
------------+-----------------------------------
      Total |        965      100.00

. tab year_of_birth, m

year_of_bir |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
       1950 |         25        2.59        2.59
       1951 |         21        2.18        4.77
       1952 |         26        2.69        7.46
       1953 |         21        2.18        9.64
       1954 |         21        2.18       11.81
       1955 |         15        1.55       13.37
       1956 |         14        1.45       14.82
       1957 |         17        1.76       16.58
       1958 |         19        1.97       18.55
       1959 |         17        1.76       20.31
       1960 |         24        2.49       22.80
       1961 |         18        1.87       24.66
       1962 |         12        1.24       25.91
       1963 |         16        1.66       27.56
       1964 |         22        2.28       29.84
       1965 |         25        2.59       32.44
       1966 |          9        0.93       33.37
       1967 |         19        1.97       35.34
       1968 |         16        1.66       36.99
       1969 |         18        1.87       38.86
       1970 |         23        2.38       41.24
       1971 |         15        1.55       42.80
       1972 |         25        2.59       45.39
       1973 |         14        1.45       46.84
       1974 |         20        2.07       48.91
       1975 |         16        1.66       50.57
       1976 |         23        2.38       52.95
       1977 |         25        2.59       55.54
       1978 |         23        2.38       57.93
       1979 |         17        1.76       59.69
       1980 |         16        1.66       61.35
       1981 |         24        2.49       63.83
       1982 |         14        1.45       65.28
       1983 |         16        1.66       66.94
       1984 |         18        1.87       68.81
       1985 |         20        2.07       70.88
       1986 |         33        3.42       74.30
       1987 |         26        2.69       76.99
       1988 |         20        2.07       79.07
       1989 |         19        1.97       81.04
       1990 |         15        1.55       82.59
       1991 |         18        1.87       84.46
       1992 |         19        1.97       86.42
       1993 |         17        1.76       88.19
       1994 |         24        2.49       90.67
       1995 |         18        1.87       92.54
       1996 |         19        1.97       94.51
       1997 |         19        1.97       96.48
       1998 |         18        1.87       98.34
       1999 |         15        1.55       99.90
       2000 |          1        0.10      100.00
------------+-----------------------------------
      Total |        965      100.00

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |        197       20.41       20.41
               2 |        244       25.28       45.70
               3 |        199       20.62       66.32
               4 |        216       22.38       88.70
 5 most deprived |        109       11.30      100.00
-----------------+-----------------------------------
           Total |        965      100.00

. 
. save ./output/contemporary_matching_stp5.dta, replace
(file ./output/contemporary_matching_stp5.dta not found)
file ./output/contemporary_matching_stp5.dta saved

. 
. save ./output/matching_stp5.dta, replace 
file ./output/matching_stp5.dta saved

. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/matching_stp5.log
  log type:  text
 closed on:  21 Sep 2022, 19:19:16
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
