------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/merge_2017.log
  log type:  text
 opened on:  30 Oct 2022, 22:17:36

. 
. 
. 
. 
. *(0)=========Get total cases and potential matches figure for flowchart - extra bit of work in this file is to drop comparators without the necessar
> y follow-up or who died before case index date============
. /*Has follow-up needs checked as there is nowhere previously where it is checked against the matched cases case index date, plus the death_date vari
> able for controls so far is only related to the
> *index date, not the case_index_date*/
. *case
. capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-2)
(53 vars, 50,000 obs)

. di "***********************FLOWCHART 1. NUMBER OF POTENTIAL CASES AND CONTROLS********************:"
***********************FLOWCHART 1. NUMBER OF POTENTIAL CASES AND CONTROLS********************:

. di "**Potential COVID-19 cases extracted from OpenSAFELY:**"
**Potential COVID-19 cases extracted from OpenSAFELY:**

. safecount
  50,000

. 
. *comparator
. capture noisily import delimited ./output/input_2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(17 vars, 50,000 obs)

. di "**Potential historical comparators extracted from OpenSAFELY:**"
**Potential historical comparators extracted from OpenSAFELY:**

. safecount
  50,000

. 
. capture noisily import delimited ./output/covid_matching_2017.csv, clear
(encoding automatically selected: ISO-8859-2)
(11 vars, 16,097 obs)

. di "*Potential COVID-19 cases after data management:*"
*Potential COVID-19 cases after data management:*

. safecount
  16,097

. 
. capture noisily import delimited ./output/2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(8 vars, 28,822 obs)

. di "Potential historical comparators after data management"
Potential historical comparators after data management

. safecount
  28,822

. 
. 
. *(1)=========Get all the (case and comparator related) variables from the matched cases and matched controls files============
. *COVID-19
. capture noisily import delimited ./output/input_combined_stps_covid_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(14 vars, 14,271 obs)

. *drop age & covid_diagnosis_date
. keep patient_id death_date date_deregistered imd stp krt_outcome_date male covid_date covid_month set_id case match_counts

. tempfile covid_2017_matched

. *for dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `covid_2017_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000001.tmp saved as .dta format

. *Number of matched COVID-19 cases
. count
  14,271

. 
. *Historical comparators
. capture noisily import delimited ./output/input_combined_stps_matches_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(11 vars, 11,714 obs)

. *drop age
. keep patient_id death_date date_deregistered imd stp krt_outcome_date male set_id case covid_date

. tempfile 2017_matched

. *for dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `2017_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000002.tmp saved as .dta format

. *Number of matched historical comparators
. count
  11,714

. 
. 
. *(2)=========Add the case and comparator information from above to the files with the rest of the information============
. *import matched COVID-19 cases with additional variables and merge with extraction file
. capture noisily import delimited ./output/input_covid_2017_additional.csv, clear
(encoding automatically selected: ISO-8859-1)
(71 vars, 14,271 obs)

. merge 1:1 patient_id using `covid_2017_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            14,271  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile covid_2017_complete

. save `covid_2017_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000003.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000003.tmp saved as .dta format

. di "***********************FLOWCHART 2. Number of matched COVID-19 cases and historical comparators****************************************:"
***********************FLOWCHART 2. Number of matched COVID-19 cases and historical comparators****************************************:

. di "**Matched COVID-19:**"
**Matched COVID-19:**

. safecount
  14,271

. 
. 
. capture noisily import delimited ./output/input_2017_additional.csv, clear
(encoding automatically selected: ISO-8859-9)
(64 vars, 11,714 obs)

. merge 1:1 patient_id using `2017_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            11,714  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile 2017_complete

. save `2017_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000004.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000004.tmp saved as .dta format

. di "**Matched comparators:**"
**Matched comparators:**

. safecount
  11,714

. 
. 
. *NOTE: Flowchart re: who was dropped here due date exclusions can be obtained from the STP matching logs (if needed)
. */
. 
. *(3)=========Append case and comparator files together============
. append using `covid_2017_complete', force

. order patient_id set_id match_count case

. gsort set_id -case

. *drop any comparators that don't have sufficient follow upon
. count if case==0
  11,714

. 
. di "***********************FLOWCHART 1. NUMBER OF MATCHED CASES AND MATCHED COMPARATORS: COMBINED FILE********************:"
***********************FLOWCHART 1. NUMBER OF MATCHED CASES AND MATCHED COMPARATORS: COMBINED FILE********************:

. safecount
  25,985

. tab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,714       45.08       45.08
          1 |     14,271       54.92      100.00
------------+-----------------------------------
      Total |     25,985      100.00

. *save a list of final cases for analysis unmatched cases in next bit
. preserve

.         keep if case==1
(11,714 observations deleted)

.         keep patient_id

.         tempfile covid_2017_matched_list

.         save `covid_2017_matched_list', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000006.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000006.tmp saved as .dta format

. restore

. 
. 
. 
. *(4)=========Create a file of unmatched cases for descriptive analysis============
. *import list of all cases (pre-matching)
. preserve

.         capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-2)
(53 vars, 50,000 obs)

.         *for dummy data, should do nothing in the real data
.         duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

.         tempfile covid_prematching

.         save `covid_prematching', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000008.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000008.tmp saved as .dta format

.         use `covid_2017_matched_list', clear

.         merge 1:1 patient_id using `covid_prematching'

    Result                      Number of obs
    -----------------------------------------
    Not matched                        61,499
        from master                    12,885  (_merge==1)
        from using                     48,614  (_merge==2)

    Matched                             1,386  (_merge==3)
    -----------------------------------------

.         *want to keep the ones not matched as they were in the original extract file but not in the list of matches
.         keep if _merge==2
(14,271 observations deleted)

.         safecount
  48,614

.         *save file for descriptive analysis
.         save output/covid_unmatched_2017.dta, replace
file output/covid_unmatched_2017.dta saved

.         di "***********************FLOWCHART 4. NUMBER OF UMATCHED CASES FROM UNMATCHED CASES FILE (TO CONFIRM IT ALIGNS WITH THE ABOVE FLOWCHART PO
> INTS)********************:"
***********************FLOWCHART 4. NUMBER OF UMATCHED CASES FROM UNMATCHED CASES FILE (TO CONFIRM IT ALIGNS WITH THE ABOVE FLOWCHART POINTS)*********
> ***********:

.         safecount
  48,614

. restore

. 
. 
. 
. 
. 
. *(5)=========VARIABLE CLEANING============
. 
. *label case variables
. label define case 0 "Comparator (historical)" ///
>                                   1 "COVID-19"

. label values case case

. safetab case 

                   case |      Freq.     Percent        Cum.
------------------------+-----------------------------------
Comparator (historical) |     11,714       45.08       45.08
               COVID-19 |     14,271       54.92      100.00
------------------------+-----------------------------------
                  Total |     25,985      100.00

. 
. *(a)===Ethnicity (5 category)====
. * Ethnicity (5 category)
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                                       ///
>                                                 3 "Asian or Asian British"      ///
>                                                 4 "Black"                                       ///
>                                                 5 "Other"                                       

.                                                 
. label values ethnicity ethnicity

. safetab ethnicity

             ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     15,617       80.13       80.13
Asian or Asian British |      1,936        9.93       90.06
                 Other |      1,937        9.94      100.00
-----------------------+-----------------------------------
                 Total |     19,490      100.00

. 
.  *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(10,368 missing values generated)

.  replace eth5=2 if ethnicity==3
(1,936 real changes made)

.  replace eth5=3 if ethnicity==4
(0 real changes made)

.  replace eth5=4 if ethnicity==2
(0 real changes made)

.  replace eth5=5 if ethnicity==5
(1,937 real changes made)

.  replace eth5=. if ethnicity==.
(0 real changes made)

. 
.  label define eth5                      1 "White"                                       ///
>                                                         2 "South Asian"                         ///                                             
>                                                         3 "Black"                                       ///
>                                                         4 "Mixed"                                       ///
>                                                         5 "Other"                                       

.                                         
. label values eth5 eth5

. safetab eth5, m

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     15,617       60.10       60.10
South Asian |      1,936        7.45       67.55
      Other |      1,937        7.45       75.00
          . |      6,495       25.00      100.00
------------+-----------------------------------
      Total |     25,985      100.00

. 
. *create an ethnicity for table 1 (includes unknown)
. *ETHNICITY
. *create an ethnicity variable with missing shown as "Unknown" just for this analysis
. generate eth5Table1=eth5
(6,495 missing values generated)

. replace eth5Table1=6 if eth5Table1==.
(6,495 real changes made)

. label define eth5Table1                         1 "White"                                       ///
>                                                                         2 "South Asian"                         ///                                 
>             
>                                                                         3 "Black"                                       ///
>                                                                         4 "Mixed"                                       ///
>                                                                         5 "Other"                                       ///
>                                                                         6 "Unknown"

.                                         
. label values eth5Table1 eth5Table1

. safetab eth5Table1, m

 eth5Table1 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     15,617       60.10       60.10
South Asian |      1,936        7.45       67.55
      Other |      1,937        7.45       75.00
    Unknown |      6,495       25.00      100.00
------------+-----------------------------------
      Total |     25,985      100.00

. 
. 
. *(b)===STP====
. *For ease of future analysis(?) am going to recode these as numerical ordered at this stage, also drop if STP is missing
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(25,954 missing values generated)

. replace stp = sum(stp)
(25,984 real changes made)

. drop stp_old

. 
. 
. 
. *(c)===IMD===
. * Reverse the order (so high is more deprived)
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,269        4.88        4.88
          1 |      4,883       18.79       23.68
          2 |      4,963       19.10       42.77
          3 |      4,957       19.08       61.85
          4 |      4,948       19.04       80.89
          5 |      4,965       19.11      100.00
------------+-----------------------------------
      Total |     25,985      100.00

. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(19759 changes made to imd)

. 
. label define imd 1 "1 Least deprived" 2 "2" 3 "3" 4 "4" 5 "5 Most deprived" .u "Unknown"

. label values imd imd

. *check after reordering
. tab imd

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |      1,269        4.88        4.88
1 Least deprived |      4,965       19.11       23.99
               2 |      4,948       19.04       43.03
               3 |      4,957       19.08       62.11
               4 |      4,963       19.10       81.21
 5 Most deprived |      4,883       18.79      100.00
-----------------+-----------------------------------
           Total |     25,985      100.00

. 
. 
. 
. 
. ***Need to calculate age from year of birth**
. 
. **Age**
. gen index_date = date(case_index_date, "YMD")

. gen index_year = yofd(index_date)

. gen age = index_year - year_of_birth

. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///                                     
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(25985 differences between age and agegroup)

. 
. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label values agegroup agegroup

. 
. 
. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. 
. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. *Sex
. gen sex = 1 if male == "Male"
(13,303 missing values generated)

. replace sex = 0 if male == "Female"
(13,303 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. safetab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     13,303       51.19       51.19
       Male |     12,682       48.81      100.00
------------+-----------------------------------
      Total |     25,985      100.00

. safecount
  25,985

. 
. 
. **BMI**
. 
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(2,680 real changes made, 2,680 to missing)

. gen     bmicat = .
(25,985 missing values generated)

. recode  bmicat . = 1 if body_mass_index<18.5
(1552 changes made to bmicat)

. recode  bmicat . = 2 if body_mass_index<25
(5763 changes made to bmicat)

. recode  bmicat . = 3 if body_mass_index<30
(6188 changes made to bmicat)

. recode  bmicat . = 4 if body_mass_index<35
(5162 changes made to bmicat)

. recode  bmicat . = 5 if body_mass_index<40
(3063 changes made to bmicat)

. recode  bmicat . = 6 if body_mass_index<.
(1577 changes made to bmicat)

. replace bmicat = . if body_mass_index>=.
(0 real changes made)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     

.                                         
. label values bmicat bmicat

. 
. recode bmicat 1/3 . = 1 4=2 5=3 6=4, gen(obese4cat)
(24433 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. gen obese4cat_withmiss = obese4cat

. replace obese4cat_withmiss =. if bmicat ==.
(2,680 real changes made, 2,680 to missing)

. 
. * Smoking
. gen ever_smoked = 1 if smoking_status=="S"
(22,882 missing values generated)

. replace ever_smoked = 1 if smoking_status=="E"
(519 real changes made)

. replace ever_smoked = 0 if smoking_status=="N"
(1,048 real changes made)

. replace ever_smoked = . if smoking_status=="M"
(0 real changes made)

. label define smoking_label 1 "Current/former smoker" 0 "Non-smoker"

. label values ever_smoked smoking_label

. label var ever_smoked "Smoking status"

. 
. *(e)===Rural-urban===
. *label the urban rural categories
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "urban major conurbation" ///
>                                                           2 "urban minor conurbation" ///
>                                                           3 "urban city and town" ///
>                                                           4 "urban city and town in a sparse setting" ///
>                                                           5 "rural town and fringe" ///
>                                                           6 "rural town and fringe in a sparse setting" ///
>                                                           7 "rural village and dispersed" ///
>                                                           8 "rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. safetab rural_urban, miss

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                urban major conurbation |      2,560        9.85        9.85
                urban minor conurbation |      2,566        9.87       19.73
                    urban city and town |      2,671       10.28       30.01
urban city and town in a sparse setting |      2,570        9.89       39.90
                  rural town and fringe |      2,597        9.99       49.89
rural town and fringe in a sparse setti |      2,550        9.81       59.70
            rural village and dispersed |      5,287       20.35       80.05
rural village and dispersed in a sparse |      5,184       19.95      100.00
----------------------------------------+-----------------------------------
                                  Total |     25,985      100.00

. 
. *generate a binary rural urban (with missing assigned to urban)
. generate rural_urbanBroad=.
(25,985 missing values generated)

. replace rural_urbanBroad=1 if rural_urban<=4|rural_urban==.
(10,367 real changes made)

. replace rural_urbanBroad=0 if rural_urban>4 & rural_urban!=.
(15,618 real changes made)

. label define rural_urbanBroad 0 "Rural" 1 "Urban"

. label values rural_urbanBroad rural_urbanBroad

. safetab rural_urbanBroad rural_urban, miss

rural_urba |                                       rural_urban
    nBroad | urban maj  urban min  urban cit  urban cit  rural tow  rural tow  rural vil  rural vil |     Total
-----------+----------------------------------------------------------------------------------------+----------
     Rural |         0          0          0          0      2,597      2,550      5,287      5,184 |    15,618 
     Urban |     2,560      2,566      2,671      2,570          0          0          0          0 |    10,367 
-----------+----------------------------------------------------------------------------------------+----------
     Total |     2,560      2,566      2,671      2,570      2,597      2,550      5,287      5,184 |    25,985 

. label var rural_urbanBroad "Rural-Urban"

. 
. *Baseline eGFR
. format index_date %td

. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                                 creatinine_mar2017 ///
>                                                                                 creatinine_apr2017 ///
>                                                                                 creatinine_may2017 ///
>                                                                                 creatinine_jun2017 ///
>                                                                                 creatinine_jul2017 ///
>                                                                                 creatinine_aug2017 ///
>                                                                                 creatinine_sep2017 ///
>                                                                                 creatinine_oct2017 ///
>                                                                                 creatinine_nov2017 ///
>                                                                                 creatinine_dec2017 ///
>                                                                                 creatinine_jan2018 ///
>                                                                                 creatinine_feb2018 ///
>                                                                                 creatinine_mar2018 ///
>                                                                                 creatinine_apr2018 ///
>                                                                                 creatinine_may2018 ///
>                                                                                 creatinine_jun2018 ///
>                                                                                 creatinine_jul2018 ///
>                                                                                 creatinine_aug2018 ///
>                                                                                 creatinine_sep2018 ///
>                                                                                 creatinine_oct2018 ///
>                                                                                 creatinine_nov2018 ///
>                                                                                 creatinine_dec2018 ///
>                                                                                 creatinine_jan2019 ///
>                                                                                 creatinine_feb2019 ///
>                                                                                 creatinine_mar2019 ///
>                                                                                 creatinine_apr2019 ///
>                                                                                 creatinine_may2019 ///
>                                                                                 creatinine_jun2019 ///
>                                                                                 creatinine_jul2019 ///
>                                                                                 creatinine_aug2019 ///
>                                                                                 creatinine_sep2019 ///
>                                                                                 creatinine_oct2019 ///
>                                                                                 creatinine_nov2019 ///
>                                                                                 creatinine_dec2019 ///
>                                                                                 creatinine_jan2020 ///
>                                                                                 creatinine_feb2020 ///
>                                                                                 creatinine_mar2020 ///
>                                                                                 creatinine_apr2020 ///
>                                                                                 creatinine_may2020 ///
>                                                                                 creatinine_jun2020 ///
>                                                                                 creatinine_jul2020 ///
>                                                                                 creatinine_aug2020 ///
>                                                                                 creatinine_sep2020 ///
>                                                                                 creatinine_oct2020 ///
>                                                                                 creatinine_nov2020 ///
>                                                                                 creatinine_dec2020 ///
>                                                                                 creatinine_jan2021 ///
>                                                                                 creatinine_feb2021 ///
>                                                                                 creatinine_mar2021 ///
>                                                                                 creatinine_apr2021 ///
>                                                                                 creatinine_may2021 ///
>                                                                                 creatinine_jun2021 ///
>                                                                                 creatinine_jul2021 ///
>                                                                                 creatinine_aug2021 ///
>                                                                                 creatinine_sep2021 ///
>                                                                                 creatinine_oct2021 ///
>                                                                                 creatinine_nov2021 ///
>                                                                                 creatinine_dec2021 ///
>                                                                                 creatinine_jan2022 ///
>                                                                                 creatinine_feb2022 ///
>                                                                                 creatinine_mar2022 ///
>                                                                                 creatinine_apr2022 ///
>                                                                                 creatinine_may2022 ///
>                                                                                 creatinine_jun2022 ///
>                                                                                 creatinine_jul2022 ///
>                                                                                 creatinine_aug2022 ///
>                                                                                 creatinine_sep2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 3000)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex==0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex==1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_monthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(5,163 real changes made, 5,163 to missing)
(19,434 missing values generated)
(25,985 missing values generated)
(3,385 real changes made)
(3,166 real changes made)
(3,385 real changes made)
(3,166 real changes made)
(4,159 real changes made)
(25,985 missing values generated)
(3,385 real changes made)
(3,166 real changes made)
(6,551 real changes made)
(21,826 real changes made)
(19,434 missing values generated)
(6,551 real changes made)
(3,385 real changes made)
(5,143 real changes made, 5,143 to missing)
(19,414 missing values generated)
(25,985 missing values generated)
(3,395 real changes made)
(3,176 real changes made)
(3,395 real changes made)
(3,175 real changes made)
(4,144 real changes made)
(25,985 missing values generated)
(3,395 real changes made)
(3,176 real changes made)
(6,570 real changes made)
(21,840 real changes made)
(19,414 missing values generated)
(6,571 real changes made)
(3,395 real changes made)
(5,131 real changes made, 5,131 to missing)
(19,402 missing values generated)
(25,985 missing values generated)
(3,376 real changes made)
(3,207 real changes made)
(3,376 real changes made)
(3,207 real changes made)
(4,206 real changes made)
(25,985 missing values generated)
(3,376 real changes made)
(3,207 real changes made)
(6,583 real changes made)
(21,779 real changes made)
(19,402 missing values generated)
(6,583 real changes made)
(3,376 real changes made)
(5,154 real changes made, 5,154 to missing)
(19,425 missing values generated)
(25,985 missing values generated)
(3,377 real changes made)
(3,183 real changes made)
(3,377 real changes made)
(3,183 real changes made)
(4,200 real changes made)
(25,985 missing values generated)
(3,377 real changes made)
(3,183 real changes made)
(6,560 real changes made)
(21,785 real changes made)
(19,425 missing values generated)
(6,560 real changes made)
(3,377 real changes made)
(5,151 real changes made, 5,151 to missing)
(19,422 missing values generated)
(25,985 missing values generated)
(3,397 real changes made)
(3,166 real changes made)
(3,397 real changes made)
(3,166 real changes made)
(4,144 real changes made)
(25,985 missing values generated)
(3,397 real changes made)
(3,166 real changes made)
(6,563 real changes made)
(21,841 real changes made)
(19,422 missing values generated)
(6,563 real changes made)
(3,397 real changes made)
(5,168 real changes made, 5,168 to missing)
(19,439 missing values generated)
(25,985 missing values generated)
(3,370 real changes made)
(3,176 real changes made)
(3,370 real changes made)
(3,176 real changes made)
(4,154 real changes made)
(25,985 missing values generated)
(3,370 real changes made)
(3,176 real changes made)
(6,546 real changes made)
(21,831 real changes made)
(19,439 missing values generated)
(6,546 real changes made)
(3,370 real changes made)
(5,124 real changes made, 5,124 to missing)
(19,395 missing values generated)
(25,985 missing values generated)
(3,384 real changes made)
(3,206 real changes made)
(3,384 real changes made)
(3,206 real changes made)
(4,250 real changes made)
(25,985 missing values generated)
(3,384 real changes made)
(3,206 real changes made)
(6,590 real changes made)
(21,735 real changes made)
(19,395 missing values generated)
(6,590 real changes made)
(3,384 real changes made)
(5,193 real changes made, 5,193 to missing)
(19,464 missing values generated)
(25,985 missing values generated)
(3,362 real changes made)
(3,159 real changes made)
(3,362 real changes made)
(3,159 real changes made)
(4,146 real changes made)
(25,985 missing values generated)
(3,362 real changes made)
(3,159 real changes made)
(6,521 real changes made)
(21,839 real changes made)
(19,464 missing values generated)
(6,521 real changes made)
(3,362 real changes made)
(5,165 real changes made, 5,165 to missing)
(19,436 missing values generated)
(25,985 missing values generated)
(3,366 real changes made)
(3,183 real changes made)
(3,366 real changes made)
(3,183 real changes made)
(4,143 real changes made)
(25,985 missing values generated)
(3,366 real changes made)
(3,183 real changes made)
(6,549 real changes made)
(21,842 real changes made)
(19,436 missing values generated)
(6,549 real changes made)
(3,366 real changes made)
(5,187 real changes made, 5,187 to missing)
(19,458 missing values generated)
(25,985 missing values generated)
(3,289 real changes made)
(3,238 real changes made)
(3,289 real changes made)
(3,238 real changes made)
(4,063 real changes made)
(25,985 missing values generated)
(3,289 real changes made)
(3,238 real changes made)
(6,527 real changes made)
(21,922 real changes made)
(19,458 missing values generated)
(6,527 real changes made)
(3,289 real changes made)
(5,148 real changes made, 5,148 to missing)
(19,419 missing values generated)
(25,985 missing values generated)
(3,385 real changes made)
(3,181 real changes made)
(3,385 real changes made)
(3,181 real changes made)
(4,194 real changes made)
(25,985 missing values generated)
(3,385 real changes made)
(3,181 real changes made)
(6,566 real changes made)
(21,791 real changes made)
(19,419 missing values generated)
(6,566 real changes made)
(3,385 real changes made)
(5,151 real changes made, 5,151 to missing)
(19,422 missing values generated)
(25,985 missing values generated)
(3,379 real changes made)
(3,184 real changes made)
(3,379 real changes made)
(3,184 real changes made)
(4,216 real changes made)
(25,985 missing values generated)
(3,379 real changes made)
(3,184 real changes made)
(6,563 real changes made)
(21,769 real changes made)
(19,422 missing values generated)
(6,563 real changes made)
(3,379 real changes made)
(5,163 real changes made, 5,163 to missing)
(19,434 missing values generated)
(25,985 missing values generated)
(3,379 real changes made)
(3,172 real changes made)
(3,379 real changes made)
(3,172 real changes made)
(4,185 real changes made)
(25,985 missing values generated)
(3,379 real changes made)
(3,172 real changes made)
(6,551 real changes made)
(21,800 real changes made)
(19,434 missing values generated)
(6,551 real changes made)
(3,379 real changes made)
(5,146 real changes made, 5,146 to missing)
(19,417 missing values generated)
(25,985 missing values generated)
(3,386 real changes made)
(3,182 real changes made)
(3,386 real changes made)
(3,182 real changes made)
(4,180 real changes made)
(25,985 missing values generated)
(3,386 real changes made)
(3,182 real changes made)
(6,568 real changes made)
(21,805 real changes made)
(19,417 missing values generated)
(6,568 real changes made)
(3,386 real changes made)
(5,178 real changes made, 5,178 to missing)
(19,449 missing values generated)
(25,985 missing values generated)
(3,424 real changes made)
(3,112 real changes made)
(3,424 real changes made)
(3,112 real changes made)
(4,142 real changes made)
(25,985 missing values generated)
(3,424 real changes made)
(3,112 real changes made)
(6,536 real changes made)
(21,843 real changes made)
(19,449 missing values generated)
(6,536 real changes made)
(3,424 real changes made)
(5,132 real changes made, 5,132 to missing)
(19,403 missing values generated)
(25,985 missing values generated)
(3,372 real changes made)
(3,210 real changes made)
(3,372 real changes made)
(3,210 real changes made)
(4,130 real changes made)
(25,985 missing values generated)
(3,372 real changes made)
(3,210 real changes made)
(6,582 real changes made)
(21,855 real changes made)
(19,403 missing values generated)
(6,582 real changes made)
(3,372 real changes made)
(5,123 real changes made, 5,123 to missing)
(19,394 missing values generated)
(25,985 missing values generated)
(3,416 real changes made)
(3,175 real changes made)
(3,416 real changes made)
(3,175 real changes made)
(4,262 real changes made)
(25,985 missing values generated)
(3,416 real changes made)
(3,175 real changes made)
(6,591 real changes made)
(21,723 real changes made)
(19,394 missing values generated)
(6,591 real changes made)
(3,416 real changes made)
(5,147 real changes made, 5,147 to missing)
(19,418 missing values generated)
(25,985 missing values generated)
(3,335 real changes made)
(3,232 real changes made)
(3,335 real changes made)
(3,232 real changes made)
(4,189 real changes made)
(25,985 missing values generated)
(3,335 real changes made)
(3,232 real changes made)
(6,567 real changes made)
(21,796 real changes made)
(19,418 missing values generated)
(6,567 real changes made)
(3,335 real changes made)
(5,159 real changes made, 5,159 to missing)
(19,430 missing values generated)
(25,985 missing values generated)
(3,407 real changes made)
(3,148 real changes made)
(3,407 real changes made)
(3,148 real changes made)
(4,137 real changes made)
(25,985 missing values generated)
(3,407 real changes made)
(3,148 real changes made)
(6,555 real changes made)
(21,848 real changes made)
(19,430 missing values generated)
(6,555 real changes made)
(3,407 real changes made)
(5,146 real changes made, 5,146 to missing)
(19,417 missing values generated)
(25,985 missing values generated)
(3,365 real changes made)
(3,203 real changes made)
(3,365 real changes made)
(3,203 real changes made)
(4,230 real changes made)
(25,985 missing values generated)
(3,365 real changes made)
(3,203 real changes made)
(6,568 real changes made)
(21,755 real changes made)
(19,417 missing values generated)
(6,568 real changes made)
(3,365 real changes made)
(5,185 real changes made, 5,185 to missing)
(19,456 missing values generated)
(25,985 missing values generated)
(3,347 real changes made)
(3,182 real changes made)
(3,347 real changes made)
(3,182 real changes made)
(4,134 real changes made)
(25,985 missing values generated)
(3,347 real changes made)
(3,182 real changes made)
(6,529 real changes made)
(21,851 real changes made)
(19,456 missing values generated)
(6,529 real changes made)
(3,347 real changes made)
(5,153 real changes made, 5,153 to missing)
(19,424 missing values generated)
(25,985 missing values generated)
(3,417 real changes made)
(3,144 real changes made)
(3,417 real changes made)
(3,144 real changes made)
(4,153 real changes made)
(25,985 missing values generated)
(3,417 real changes made)
(3,144 real changes made)
(6,561 real changes made)
(21,832 real changes made)
(19,424 missing values generated)
(6,561 real changes made)
(3,417 real changes made)
(5,114 real changes made, 5,114 to missing)
(19,385 missing values generated)
(25,985 missing values generated)
(3,366 real changes made)
(3,234 real changes made)
(3,366 real changes made)
(3,234 real changes made)
(4,169 real changes made)
(25,985 missing values generated)
(3,366 real changes made)
(3,234 real changes made)
(6,600 real changes made)
(21,816 real changes made)
(19,385 missing values generated)
(6,600 real changes made)
(3,366 real changes made)
(5,154 real changes made, 5,154 to missing)
(19,425 missing values generated)
(25,985 missing values generated)
(3,401 real changes made)
(3,159 real changes made)
(3,401 real changes made)
(3,159 real changes made)
(4,164 real changes made)
(25,985 missing values generated)
(3,401 real changes made)
(3,159 real changes made)
(6,560 real changes made)
(21,821 real changes made)
(19,425 missing values generated)
(6,560 real changes made)
(3,401 real changes made)
(5,152 real changes made, 5,152 to missing)
(19,423 missing values generated)
(25,985 missing values generated)
(3,379 real changes made)
(3,183 real changes made)
(3,379 real changes made)
(3,183 real changes made)
(4,218 real changes made)
(25,985 missing values generated)
(3,379 real changes made)
(3,183 real changes made)
(6,562 real changes made)
(21,767 real changes made)
(19,423 missing values generated)
(6,562 real changes made)
(3,379 real changes made)
(5,170 real changes made, 5,170 to missing)
(19,441 missing values generated)
(25,985 missing values generated)
(3,346 real changes made)
(3,198 real changes made)
(3,346 real changes made)
(3,198 real changes made)
(4,146 real changes made)
(25,985 missing values generated)
(3,346 real changes made)
(3,198 real changes made)
(6,544 real changes made)
(21,839 real changes made)
(19,441 missing values generated)
(6,544 real changes made)
(3,346 real changes made)
(5,174 real changes made, 5,174 to missing)
(19,445 missing values generated)
(25,985 missing values generated)
(3,357 real changes made)
(3,183 real changes made)
(3,357 real changes made)
(3,183 real changes made)
(4,147 real changes made)
(25,985 missing values generated)
(3,357 real changes made)
(3,183 real changes made)
(6,540 real changes made)
(21,838 real changes made)
(19,445 missing values generated)
(6,540 real changes made)
(3,357 real changes made)
(5,143 real changes made, 5,143 to missing)
(19,414 missing values generated)
(25,985 missing values generated)
(3,372 real changes made)
(3,199 real changes made)
(3,372 real changes made)
(3,199 real changes made)
(4,162 real changes made)
(25,985 missing values generated)
(3,372 real changes made)
(3,199 real changes made)
(6,571 real changes made)
(21,823 real changes made)
(19,414 missing values generated)
(6,571 real changes made)
(3,372 real changes made)
(5,147 real changes made, 5,147 to missing)
(19,418 missing values generated)
(25,985 missing values generated)
(3,362 real changes made)
(3,205 real changes made)
(3,362 real changes made)
(3,205 real changes made)
(4,121 real changes made)
(25,985 missing values generated)
(3,362 real changes made)
(3,205 real changes made)
(6,567 real changes made)
(21,864 real changes made)
(19,418 missing values generated)
(6,567 real changes made)
(3,362 real changes made)
(5,170 real changes made, 5,170 to missing)
(19,441 missing values generated)
(25,985 missing values generated)
(3,421 real changes made)
(3,123 real changes made)
(3,421 real changes made)
(3,123 real changes made)
(4,120 real changes made)
(25,985 missing values generated)
(3,421 real changes made)
(3,123 real changes made)
(6,544 real changes made)
(21,865 real changes made)
(19,441 missing values generated)
(6,544 real changes made)
(3,421 real changes made)
(5,149 real changes made, 5,149 to missing)
(19,420 missing values generated)
(25,985 missing values generated)
(3,357 real changes made)
(3,208 real changes made)
(3,357 real changes made)
(3,208 real changes made)
(4,135 real changes made)
(25,985 missing values generated)
(3,357 real changes made)
(3,208 real changes made)
(6,565 real changes made)
(21,850 real changes made)
(19,420 missing values generated)
(6,565 real changes made)
(3,357 real changes made)
(5,163 real changes made, 5,163 to missing)
(19,434 missing values generated)
(25,985 missing values generated)
(3,347 real changes made)
(3,204 real changes made)
(3,347 real changes made)
(3,204 real changes made)
(4,196 real changes made)
(25,985 missing values generated)
(3,347 real changes made)
(3,204 real changes made)
(6,551 real changes made)
(21,789 real changes made)
(19,434 missing values generated)
(6,551 real changes made)
(3,347 real changes made)
(5,144 real changes made, 5,144 to missing)
(19,415 missing values generated)
(25,985 missing values generated)
(3,367 real changes made)
(3,203 real changes made)
(3,367 real changes made)
(3,203 real changes made)
(4,170 real changes made)
(25,985 missing values generated)
(3,367 real changes made)
(3,203 real changes made)
(6,570 real changes made)
(21,815 real changes made)
(19,415 missing values generated)
(6,570 real changes made)
(3,367 real changes made)
(5,184 real changes made, 5,184 to missing)
(19,455 missing values generated)
(25,985 missing values generated)
(3,318 real changes made)
(3,212 real changes made)
(3,318 real changes made)
(3,212 real changes made)
(4,130 real changes made)
(25,985 missing values generated)
(3,318 real changes made)
(3,212 real changes made)
(6,530 real changes made)
(21,855 real changes made)
(19,455 missing values generated)
(6,530 real changes made)
(3,318 real changes made)
(5,175 real changes made, 5,175 to missing)
(19,446 missing values generated)
(25,985 missing values generated)
(3,415 real changes made)
(3,124 real changes made)
(3,415 real changes made)
(3,124 real changes made)
(4,206 real changes made)
(25,985 missing values generated)
(3,415 real changes made)
(3,124 real changes made)
(6,539 real changes made)
(21,779 real changes made)
(19,446 missing values generated)
(6,539 real changes made)
(3,415 real changes made)
(5,151 real changes made, 5,151 to missing)
(19,422 missing values generated)
(25,985 missing values generated)
(3,344 real changes made)
(3,219 real changes made)
(3,344 real changes made)
(3,219 real changes made)
(4,173 real changes made)
(25,985 missing values generated)
(3,344 real changes made)
(3,219 real changes made)
(6,563 real changes made)
(21,812 real changes made)
(19,422 missing values generated)
(6,563 real changes made)
(3,344 real changes made)
(6,292 real changes made, 6,292 to missing)
(18,006 missing values generated)
(25,985 missing values generated)
(4,050 real changes made)
(3,929 real changes made)
(4,050 real changes made)
(3,929 real changes made)
(5,077 real changes made)
(25,985 missing values generated)
(4,050 real changes made)
(3,929 real changes made)
(7,979 real changes made)
(20,908 real changes made)
(18,006 missing values generated)
(7,979 real changes made)
(4,050 real changes made)
(6,315 real changes made, 6,315 to missing)
(18,029 missing values generated)
(25,985 missing values generated)
(4,021 real changes made)
(3,935 real changes made)
(4,021 real changes made)
(3,935 real changes made)
(4,979 real changes made)
(25,985 missing values generated)
(4,021 real changes made)
(3,935 real changes made)
(7,956 real changes made)
(21,006 real changes made)
(18,029 missing values generated)
(7,956 real changes made)
(4,021 real changes made)
(6,304 real changes made, 6,304 to missing)
(18,018 missing values generated)
(25,985 missing values generated)
(4,072 real changes made)
(3,895 real changes made)
(4,072 real changes made)
(3,895 real changes made)
(5,070 real changes made)
(25,985 missing values generated)
(4,072 real changes made)
(3,895 real changes made)
(7,967 real changes made)
(20,915 real changes made)
(18,018 missing values generated)
(7,967 real changes made)
(4,072 real changes made)
(6,262 real changes made, 6,262 to missing)
(17,976 missing values generated)
(25,985 missing values generated)
(4,071 real changes made)
(3,938 real changes made)
(4,071 real changes made)
(3,938 real changes made)
(5,041 real changes made)
(25,985 missing values generated)
(4,071 real changes made)
(3,938 real changes made)
(8,009 real changes made)
(20,944 real changes made)
(17,976 missing values generated)
(8,009 real changes made)
(4,071 real changes made)
(6,257 real changes made, 6,257 to missing)
(17,971 missing values generated)
(25,985 missing values generated)
(4,089 real changes made)
(3,925 real changes made)
(4,089 real changes made)
(3,925 real changes made)
(5,054 real changes made)
(25,985 missing values generated)
(4,089 real changes made)
(3,925 real changes made)
(8,014 real changes made)
(20,931 real changes made)
(17,971 missing values generated)
(8,014 real changes made)
(4,089 real changes made)
(6,263 real changes made, 6,263 to missing)
(17,977 missing values generated)
(25,985 missing values generated)
(4,105 real changes made)
(3,903 real changes made)
(4,105 real changes made)
(3,903 real changes made)
(5,047 real changes made)
(25,985 missing values generated)
(4,105 real changes made)
(3,903 real changes made)
(8,008 real changes made)
(20,938 real changes made)
(17,977 missing values generated)
(8,008 real changes made)
(4,105 real changes made)
(6,245 real changes made, 6,245 to missing)
(17,959 missing values generated)
(25,985 missing values generated)
(4,102 real changes made)
(3,924 real changes made)
(4,102 real changes made)
(3,924 real changes made)
(5,043 real changes made)
(25,985 missing values generated)
(4,102 real changes made)
(3,924 real changes made)
(8,026 real changes made)
(20,942 real changes made)
(17,959 missing values generated)
(8,026 real changes made)
(4,102 real changes made)
(6,286 real changes made, 6,286 to missing)
(18,000 missing values generated)
(25,985 missing values generated)
(4,032 real changes made)
(3,953 real changes made)
(4,032 real changes made)
(3,953 real changes made)
(5,025 real changes made)
(25,985 missing values generated)
(4,032 real changes made)
(3,953 real changes made)
(7,985 real changes made)
(20,960 real changes made)
(18,000 missing values generated)
(7,985 real changes made)
(4,032 real changes made)
(6,284 real changes made, 6,284 to missing)
(17,998 missing values generated)
(25,985 missing values generated)
(4,114 real changes made)
(3,873 real changes made)
(4,114 real changes made)
(3,873 real changes made)
(5,088 real changes made)
(25,985 missing values generated)
(4,114 real changes made)
(3,873 real changes made)
(7,987 real changes made)
(20,897 real changes made)
(17,998 missing values generated)
(7,987 real changes made)
(4,114 real changes made)
(6,322 real changes made, 6,322 to missing)
(18,036 missing values generated)
(25,985 missing values generated)
(4,077 real changes made)
(3,872 real changes made)
(4,077 real changes made)
(3,872 real changes made)
(5,052 real changes made)
(25,985 missing values generated)
(4,077 real changes made)
(3,872 real changes made)
(7,949 real changes made)
(20,933 real changes made)
(18,036 missing values generated)
(7,949 real changes made)
(4,077 real changes made)
(6,268 real changes made, 6,268 to missing)
(17,982 missing values generated)
(25,985 missing values generated)
(4,109 real changes made)
(3,894 real changes made)
(4,109 real changes made)
(3,894 real changes made)
(5,090 real changes made)
(25,985 missing values generated)
(4,109 real changes made)
(3,894 real changes made)
(8,003 real changes made)
(20,895 real changes made)
(17,982 missing values generated)
(8,003 real changes made)
(4,109 real changes made)
(6,278 real changes made, 6,278 to missing)
(17,992 missing values generated)
(25,985 missing values generated)
(4,085 real changes made)
(3,908 real changes made)
(4,085 real changes made)
(3,908 real changes made)
(5,026 real changes made)
(25,985 missing values generated)
(4,085 real changes made)
(3,908 real changes made)
(7,993 real changes made)
(20,959 real changes made)
(17,992 missing values generated)
(7,993 real changes made)
(4,085 real changes made)
(6,290 real changes made, 6,290 to missing)
(18,004 missing values generated)
(25,985 missing values generated)
(4,072 real changes made)
(3,909 real changes made)
(4,072 real changes made)
(3,909 real changes made)
(5,077 real changes made)
(25,985 missing values generated)
(4,072 real changes made)
(3,909 real changes made)
(7,981 real changes made)
(20,908 real changes made)
(18,004 missing values generated)
(7,981 real changes made)
(4,072 real changes made)
(6,293 real changes made, 6,293 to missing)
(18,007 missing values generated)
(25,985 missing values generated)
(4,069 real changes made)
(3,909 real changes made)
(4,069 real changes made)
(3,909 real changes made)
(5,072 real changes made)
(25,985 missing values generated)
(4,069 real changes made)
(3,909 real changes made)
(7,978 real changes made)
(20,913 real changes made)
(18,007 missing values generated)
(7,978 real changes made)
(4,069 real changes made)
(6,265 real changes made, 6,265 to missing)
(17,979 missing values generated)
(25,985 missing values generated)
(4,104 real changes made)
(3,902 real changes made)
(4,104 real changes made)
(3,902 real changes made)
(5,043 real changes made)
(25,985 missing values generated)
(4,104 real changes made)
(3,902 real changes made)
(8,006 real changes made)
(20,942 real changes made)
(17,979 missing values generated)
(8,006 real changes made)
(4,104 real changes made)
(6,324 real changes made, 6,324 to missing)
(18,038 missing values generated)
(25,985 missing values generated)
(4,034 real changes made)
(3,913 real changes made)
(4,034 real changes made)
(3,913 real changes made)
(5,032 real changes made)
(25,985 missing values generated)
(4,034 real changes made)
(3,913 real changes made)
(7,947 real changes made)
(20,953 real changes made)
(18,038 missing values generated)
(7,947 real changes made)
(4,034 real changes made)
(6,284 real changes made, 6,284 to missing)
(17,998 missing values generated)
(25,985 missing values generated)
(4,058 real changes made)
(3,929 real changes made)
(4,058 real changes made)
(3,929 real changes made)
(5,120 real changes made)
(25,985 missing values generated)
(4,058 real changes made)
(3,929 real changes made)
(7,987 real changes made)
(20,865 real changes made)
(17,998 missing values generated)
(7,987 real changes made)
(4,058 real changes made)
(6,234 real changes made, 6,234 to missing)
(17,948 missing values generated)
(25,985 missing values generated)
(4,129 real changes made)
(3,908 real changes made)
(4,129 real changes made)
(3,908 real changes made)
(5,125 real changes made)
(25,985 missing values generated)
(4,129 real changes made)
(3,908 real changes made)
(8,037 real changes made)
(20,860 real changes made)
(17,948 missing values generated)
(8,037 real changes made)
(4,129 real changes made)
(6,233 real changes made, 6,233 to missing)
(17,947 missing values generated)
(25,985 missing values generated)
(4,094 real changes made)
(3,944 real changes made)
(4,094 real changes made)
(3,944 real changes made)
(5,123 real changes made)
(25,985 missing values generated)
(4,094 real changes made)
(3,944 real changes made)
(8,038 real changes made)
(20,862 real changes made)
(17,947 missing values generated)
(8,038 real changes made)
(4,094 real changes made)
(6,303 real changes made, 6,303 to missing)
(18,017 missing values generated)
(25,985 missing values generated)
(4,111 real changes made)
(3,857 real changes made)
(4,111 real changes made)
(3,857 real changes made)
(5,006 real changes made)
(25,985 missing values generated)
(4,111 real changes made)
(3,857 real changes made)
(7,968 real changes made)
(20,979 real changes made)
(18,017 missing values generated)
(7,968 real changes made)
(4,111 real changes made)
(6,255 real changes made, 6,255 to missing)
(17,969 missing values generated)
(25,985 missing values generated)
(4,097 real changes made)
(3,919 real changes made)
(4,097 real changes made)
(3,919 real changes made)
(5,079 real changes made)
(25,985 missing values generated)
(4,097 real changes made)
(3,919 real changes made)
(8,016 real changes made)
(20,906 real changes made)
(17,969 missing values generated)
(8,016 real changes made)
(4,097 real changes made)
(6,229 real changes made, 6,229 to missing)
(17,943 missing values generated)
(25,985 missing values generated)
(4,076 real changes made)
(3,966 real changes made)
(4,076 real changes made)
(3,966 real changes made)
(5,058 real changes made)
(25,985 missing values generated)
(4,076 real changes made)
(3,966 real changes made)
(8,042 real changes made)
(20,927 real changes made)
(17,943 missing values generated)
(8,042 real changes made)
(4,076 real changes made)
(6,331 real changes made, 6,331 to missing)
(18,045 missing values generated)
(25,985 missing values generated)
(4,032 real changes made)
(3,908 real changes made)
(4,032 real changes made)
(3,908 real changes made)
(5,034 real changes made)
(25,985 missing values generated)
(4,032 real changes made)
(3,908 real changes made)
(7,940 real changes made)
(20,951 real changes made)
(18,045 missing values generated)
(7,940 real changes made)
(4,032 real changes made)
(6,298 real changes made, 6,298 to missing)
(18,012 missing values generated)
(25,985 missing values generated)
(4,024 real changes made)
(3,949 real changes made)
(4,024 real changes made)
(3,949 real changes made)
(5,040 real changes made)
(25,985 missing values generated)
(4,024 real changes made)
(3,949 real changes made)
(7,973 real changes made)
(20,945 real changes made)
(18,012 missing values generated)
(7,973 real changes made)
(4,024 real changes made)
(6,309 real changes made, 6,309 to missing)
(18,023 missing values generated)
(25,985 missing values generated)
(4,039 real changes made)
(3,923 real changes made)
(4,039 real changes made)
(3,923 real changes made)
(5,082 real changes made)
(25,985 missing values generated)
(4,039 real changes made)
(3,923 real changes made)
(7,962 real changes made)
(20,903 real changes made)
(18,023 missing values generated)
(7,962 real changes made)
(4,039 real changes made)
(6,281 real changes made, 6,281 to missing)
(17,995 missing values generated)
(25,985 missing values generated)
(4,076 real changes made)
(3,914 real changes made)
(4,076 real changes made)
(3,914 real changes made)
(5,030 real changes made)
(25,985 missing values generated)
(4,076 real changes made)
(3,914 real changes made)
(7,990 real changes made)
(20,955 real changes made)
(17,995 missing values generated)
(7,990 real changes made)
(4,076 real changes made)
(6,288 real changes made, 6,288 to missing)
(18,002 missing values generated)
(25,985 missing values generated)
(4,086 real changes made)
(3,897 real changes made)
(4,086 real changes made)
(3,897 real changes made)
(5,062 real changes made)
(25,985 missing values generated)
(4,086 real changes made)
(3,897 real changes made)
(7,983 real changes made)
(20,923 real changes made)
(18,002 missing values generated)
(7,983 real changes made)
(4,086 real changes made)
(6,325 real changes made, 6,325 to missing)
(18,039 missing values generated)
(25,985 missing values generated)
(4,031 real changes made)
(3,915 real changes made)
(4,031 real changes made)
(3,915 real changes made)
(5,024 real changes made)
(25,985 missing values generated)
(4,031 real changes made)
(3,915 real changes made)
(7,946 real changes made)
(20,961 real changes made)
(18,039 missing values generated)
(7,946 real changes made)
(4,031 real changes made)
(6,313 real changes made, 6,313 to missing)
(18,027 missing values generated)
(25,985 missing values generated)
(4,062 real changes made)
(3,896 real changes made)
(4,062 real changes made)
(3,896 real changes made)
(5,117 real changes made)
(25,985 missing values generated)
(4,062 real changes made)
(3,896 real changes made)
(7,958 real changes made)
(20,868 real changes made)
(18,027 missing values generated)
(7,958 real changes made)
(4,062 real changes made)
(6,304 real changes made, 6,304 to missing)
(18,018 missing values generated)
(25,985 missing values generated)
(4,075 real changes made)
(3,892 real changes made)
(4,075 real changes made)
(3,892 real changes made)
(5,008 real changes made)
(25,985 missing values generated)
(4,075 real changes made)
(3,892 real changes made)
(7,967 real changes made)
(20,977 real changes made)
(18,018 missing values generated)
(7,967 real changes made)
(4,075 real changes made)
(6,227 real changes made, 6,227 to missing)
(17,941 missing values generated)
(25,985 missing values generated)
(4,098 real changes made)
(3,946 real changes made)
(4,098 real changes made)
(3,946 real changes made)
(5,144 real changes made)
(25,985 missing values generated)
(4,098 real changes made)
(3,946 real changes made)
(8,044 real changes made)
(20,841 real changes made)
(17,941 missing values generated)
(8,044 real changes made)
(4,098 real changes made)
(6,284 real changes made, 6,284 to missing)
(17,998 missing values generated)
(25,985 missing values generated)
(4,093 real changes made)
(3,894 real changes made)
(4,093 real changes made)
(3,894 real changes made)
(5,113 real changes made)
(25,985 missing values generated)
(4,093 real changes made)
(3,894 real changes made)
(7,987 real changes made)
(20,872 real changes made)
(17,998 missing values generated)
(7,987 real changes made)
(4,093 real changes made)

. 
. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)

. 
. gen baseline_egfr=.
(25,985 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 ju
> n2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 jul2019 aug2019 sep2019 oct2019 nov2019 dec201
> 9 jan2020 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 ju
> l2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022"

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_creatinine_`x' if index_month=="`x'"
  3. drop if baseline_egfr <15
  4. }
(394 real changes made)
(0 observations deleted)
(404 real changes made)
(0 observations deleted)
(361 real changes made)
(0 observations deleted)
(379 real changes made)
(0 observations deleted)
(355 real changes made)
(0 observations deleted)
(314 real changes made)
(0 observations deleted)
(310 real changes made)
(0 observations deleted)
(288 real changes made)
(0 observations deleted)
(270 real changes made)
(0 observations deleted)
(275 real changes made)
(0 observations deleted)
(235 real changes made)
(0 observations deleted)
(244 real changes made)
(0 observations deleted)
(217 real changes made)
(0 observations deleted)
(195 real changes made)
(0 observations deleted)
(216 real changes made)
(0 observations deleted)
(196 real changes made)
(0 observations deleted)
(184 real changes made)
(0 observations deleted)
(138 real changes made)
(0 observations deleted)
(159 real changes made)
(0 observations deleted)
(152 real changes made)
(0 observations deleted)
(161 real changes made)
(0 observations deleted)
(133 real changes made)
(0 observations deleted)
(136 real changes made)
(0 observations deleted)
(137 real changes made)
(0 observations deleted)
(132 real changes made)
(0 observations deleted)
(134 real changes made)
(0 observations deleted)
(100 real changes made)
(0 observations deleted)
(92 real changes made)
(0 observations deleted)
(76 real changes made)
(0 observations deleted)
(100 real changes made)
(0 observations deleted)
(88 real changes made)
(0 observations deleted)
(107 real changes made)
(0 observations deleted)
(0 real changes made)
(0 observations deleted)
(0 real changes made)
(0 observations deleted)
(0 real changes made)
(0 observations deleted)
(0 real changes made)
(0 observations deleted)
(298 real changes made)
(0 observations deleted)
(352 real changes made)
(0 observations deleted)
(306 real changes made)
(0 observations deleted)
(334 real changes made)
(0 observations deleted)
(312 real changes made)
(0 observations deleted)
(307 real changes made)
(0 observations deleted)
(318 real changes made)
(0 observations deleted)
(281 real changes made)
(0 observations deleted)
(302 real changes made)
(0 observations deleted)
(279 real changes made)
(0 observations deleted)
(281 real changes made)
(0 observations deleted)
(333 real changes made)
(0 observations deleted)
(267 real changes made)
(0 observations deleted)
(231 real changes made)
(0 observations deleted)
(281 real changes made)
(0 observations deleted)
(268 real changes made)
(0 observations deleted)
(254 real changes made)
(0 observations deleted)
(241 real changes made)
(0 observations deleted)
(255 real changes made)
(0 observations deleted)
(207 real changes made)
(0 observations deleted)
(240 real changes made)
(0 observations deleted)
(187 real changes made)
(0 observations deleted)
(218 real changes made)
(0 observations deleted)
(240 real changes made)
(0 observations deleted)
(173 real changes made)
(0 observations deleted)
(229 real changes made)
(0 observations deleted)
(180 real changes made)
(0 observations deleted)
(200 real changes made)
(0 observations deleted)
(184 real changes made)
(0 observations deleted)
(187 real changes made)
(0 observations deleted)
(173 real changes made)
(0 observations deleted)
(163 real changes made)
(0 observations deleted)

. label var baseline_egfr "Baseline eGFR"

. 
. * Baseline eGFR groups
. egen baseline_egfr_cat = cut(baseline_egfr), at(0, 15, 30, 45, 60, 75, 90, 105, 5000)
(11,222 missing values generated)

. recode baseline_egfr_cat 0=1 15=2 30=3 45=4 60=5 75=6 90=7 105=8
(14763 changes made to baseline_egfr_cat)

. label define egfr_group 1 "<15" 2 "15-29" 3 "30-44" 4 "45-59" 5 "60-74" 6 "75-89" 7 "90-104" 8 "105"

. label values baseline_egfr_cat egfr_group

. label var baseline_egfr_cat "Baseline eGFR range"

. * NB - only baseline eGFR >15 should be included
. 
. * Baseline CKD stage
. gen ckd_stage = baseline_egfr_cat
(11,222 missing values generated)

. recode ckd_stage 6/8=5 .=6
(19857 changes made to ckd_stage)

. label define ckd_stage 1 "CKD 5" 2 "CKD 4" 3 "CKD 3B" 4 "CKD 3A" 5 "No CKD" 6 "No baseline eGFR measurement"

. label values ckd_stage ckd_stage

. label var ckd_stage "Baseline CKD stage"

. 
. * eGFR <15 (earliest month)
. gen egfr_below15_outcome_date=.
(25,985 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 ju
> n2018 jul2018 aug2018 sep2018 oct2018 nov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 jul2019 aug2019 sep2019 oct2019 nov2019 dec201
> 9 jan2020 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 ju
> l2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022"

. foreach x of local month_year  {
  2.   replace egfr_below15_outcome_date=date("15`x'", "DMY") if egfr_below15_outcome_date==.& egfr_creatinine_`x'<15 & date("01`x'", "DMY")>=index_da
> te
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. format egfr_below15_outcome_date %td

. 
. * ESRD date
. gen esrd_date = egfr_below15_outcome_date
(25,985 missing values generated)

. format esrd_date %td

. gen krt_outcome = date(krt_outcome_date, "YMD")
(23,693 missing values generated)

. replace esrd_date = krt_outcome if esrd_date==.
(2,292 real changes made)

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD3670_000000.tmp"

. * Exit date
. gen death_date1 = date(death_date, "YMD")
(24,656 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen exit_date = esrd_date
(23,693 missing values generated)

. format exit_date %td

. gen deregistered_date = date(deregistered, "YMD")
deregistered not found
r(111);

end of do-file

r(111);

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD3670_000000.tmp"

. gen end_date = date("2022-09-30", "YMD") if case==1
(11,714 missing values generated)

. replace end_date = date("2019-09-30", "YMD") if case==0
(11,714 real changes made)

. format end_date %td

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD3670_000000.tmp"

. gen deregistered_date = date(date_deregistered, "YMD")
(25,223 missing values generated)

. format deregistered_date %td

. drop date_deregistered

. gen deregistered_days = (deregistered_date - index_date)
(25,223 missing values generated)

. drop if deregistered_days<0
(0 observations deleted)

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD3670_000000.tmp"

. replace exit_date = min(deregistered_date, death_date, end_date) if esrd_date==.
(23,693 real changes made)

. gen follow_up_time = (exit_date - index_date)

. label var follow_up_time "Follow-up time (Days)"

. drop if follow_up_time<0
(0 observations deleted)

. drop if follow_up_time>972
(21 observations deleted)

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD3670_000000.tmp"

. replace index_date = index_date + 28
(25,964 real changes made)

. 
end of do-file

