---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/merge_2017.log
  log type:  text
 opened on:   1 Nov 2022, 18:47:34

. 
. ** Analysis cohort selection
. capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-2)
(53 vars, 50,000 obs)

. di "Potential COVID-19 cases extracted from OpenSAFELY:"
Potential COVID-19 cases extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/input_2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(17 vars, 50,000 obs)

. di "Potential historical comparators extracted from OpenSAFELY:"
Potential historical comparators extracted from OpenSAFELY:

. safecount
  50,000

. capture noisily import delimited ./output/covid_matching_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(11 vars, 16,005 obs)

. di "Potential COVID-19 cases after application of exclusion criteria:"
Potential COVID-19 cases after application of exclusion criteria:

. safecount
  16,005

. capture noisily import delimited ./output/2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(8 vars, 29,041 obs)

. di "Potential historical comparators after application of exclusion criteria:"
Potential historical comparators after application of exclusion criteria:

. safecount
  29,041

. * Import COVID-19 dataset comprising individuals matched with historical comparators (limited matching variables only)
. capture noisily import delimited ./output/input_combined_stps_covid_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(14 vars, 14,271 obs)

. * Drop age & covid_diagnosis_date
. keep patient_id death_date date_deregistered imd stp krt_outcome_date male covid_date covid_month set_id case match_counts

. tempfile covid_2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `covid_2017_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000001.tmp saved as .dta format

. * Number of matched COVID-19 cases
. count
  14,271

. * Import matched historical comparators (limited matching variables only)
. capture noisily import delimited ./output/input_combined_stps_matches_2017.csv, clear
(encoding automatically selected: ISO-8859-1)
(11 vars, 11,714 obs)

. * Drop age
. keep patient_id death_date date_deregistered imd stp krt_outcome_date male set_id case covid_date

. tempfile 2017_matched

. * For dummy data, should do nothing in the real data
. duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

. save `2017_matched', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000002.tmp saved as .dta format

. * Number of matched historical comparators
. count
  11,714

. * Merge limited COVID-19 dataset with additional variables
. capture noisily import delimited ./output/input_covid_2017_additional.csv, clear
(encoding automatically selected: ISO-8859-1)
(70 vars, 14,271 obs)

. merge 1:1 patient_id using `covid_2017_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            14,271  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile covid_2017_complete

. save `covid_2017_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000003.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000003.tmp saved as .dta format

. di "Matched COVID-19 cases:"
Matched COVID-19 cases:

. safecount
  14,271

. * Merge limited historical comparator dataset with additional variables
. capture noisily import delimited ./output/input_2017_additional.csv, clear
(encoding automatically selected: ISO-8859-9)
(63 vars, 11,714 obs)

. merge 1:1 patient_id using `2017_matched'

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            11,714  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(0 observations deleted)

. drop _merge

. tempfile 2017_complete

. save `2017_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000004.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000004.tmp saved as .dta format

. di "Matched historical comparators:"
Matched historical comparators:

. safecount
  11,714

. * Append matched COVID-19 cases and historical comparators
. append using `covid_2017_complete', force

. order patient_id set_id match_count case

. gsort set_id -case

. count if case==0
  11,714

. di "Matched COVID-19 cases and historical comparators:"
Matched COVID-19 cases and historical comparators:

. safecount
  25,985

. tab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,714       45.08       45.08
          1 |     14,271       54.92      100.00
------------+-----------------------------------
      Total |     25,985      100.00

. * Save list of matched COVID-19 cases
. preserve

.         keep if case==1
(11,714 observations deleted)

.         keep patient_id

.         tempfile covid_2017_matched_list

.         save `covid_2017_matched_list', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000006.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000006.tmp saved as .dta format

. restore

. * Generate list of unmatched COVID-19 cases
. preserve

.         capture noisily import delimited ./output/input_covid_matching.csv, clear
(encoding automatically selected: ISO-8859-2)
(53 vars, 50,000 obs)

.         * For dummy data, should do nothing in the real data
.         duplicates drop patient_id, force

Duplicates in terms of patient_id

(0 observations are duplicates)

.         tempfile covid_prematching

.         save `covid_prematching', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000008.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_3670_000008.tmp saved as .dta format

.         use `covid_2017_matched_list', clear

.         merge 1:1 patient_id using `covid_prematching'

    Result                      Number of obs
    -----------------------------------------
    Not matched                        61,469
        from master                    12,870  (_merge==1)
        from using                     48,599  (_merge==2)

    Matched                             1,401  (_merge==3)
    -----------------------------------------

.         keep if _merge==2
(14,271 observations deleted)

.         safecount
  48,599

.         save output/covid_unmatched_2017.dta, replace
file output/covid_unmatched_2017.dta saved

.         di "Unmatched COVID-19 cases:"
Unmatched COVID-19 cases:

.         safecount
  48,599

. restore

. 
. ** Exclusions
. * Exclusions due to deregistration and kidney replacement therapy will be checked (should already have been applied from previous steps in workflow)
. gen index_date = date(case_index_date, "YMD")

. format index_date %td

. 
. * Deregistered before index_date
. gen deregistered_date = date(date_deregistered, "YMD")
(25,223 missing values generated)

. format deregistered_date %td

. drop date_deregistered 

. drop if deregistered_date < index_date
(0 observations deleted)

. 
. * Kidney replacement therapy before index_date
. gen krt_outcome = date(krt_outcome_date, "YMD")
(23,693 missing values generated)

. format krt_outcome %td

. drop krt_outcome_date

. rename krt_outcome krt_outcome_date

. drop if krt_outcome_date < index_date
(0 observations deleted)

. 
. * Death before index_date + 28 days (i.e. only include people who survived 28 days after index_date)
. gen death_date1 = date(death_date, "YMD")
(24,656 missing values generated)

. format death_date1 %td

. drop death_date

. rename death_date1 death_date

. gen index_date_28 = index_date + 28

. format index_date_28 %td

. drop if death_date < index_date_28
(51 observations deleted)

. 
. * eGFR <15 before index_date - should apply to matched historical comparators only
. gen index_year = yofd(index_date)

. gen age = index_year - year_of_birth

. gen sex = 1 if male == "Male"
(13,279 missing values generated)

. replace sex = 0 if male == "Female"
(13,279 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. foreach creatinine_monthly of varlist   creatinine_feb2017 ///
>                                                                                 creatinine_mar2017 ///
>                                                                                 creatinine_apr2017 ///
>                                                                                 creatinine_may2017 ///
>                                                                                 creatinine_jun2017 ///
>                                                                                 creatinine_jul2017 ///
>                                                                                 creatinine_aug2017 ///
>                                                                                 creatinine_sep2017 ///
>                                                                                 creatinine_oct2017 ///
>                                                                                 creatinine_nov2017 ///
>                                                                                 creatinine_dec2017 ///
>                                                                                 creatinine_jan2018 ///
>                                                                                 creatinine_feb2018 ///
>                                                                                 creatinine_mar2018 ///
>                                                                                 creatinine_apr2018 ///
>                                                                                 creatinine_may2018 ///
>                                                                                 creatinine_jun2018 ///
>                                                                                 creatinine_jul2018 ///
>                                                                                 creatinine_aug2018 ///
>                                                                                 creatinine_sep2018 ///
>                                                                                 creatinine_oct2018 ///
>                                                                                 creatinine_nov2018 ///
>                                                                                 creatinine_dec2018 ///
>                                                                                 creatinine_jan2019 ///
>                                                                                 creatinine_feb2019 ///
>                                                                                 creatinine_mar2019 ///
>                                                                                 creatinine_apr2019 ///
>                                                                                 creatinine_may2019 ///
>                                                                                 creatinine_jun2019 ///
>                                                                                 creatinine_jul2019 ///
>                                                                                 creatinine_aug2019 ///
>                                                                                 creatinine_sep2019 ///
>                                                                                 creatinine_oct2019 ///
>                                                                                 creatinine_nov2019 ///
>                                                                                 creatinine_dec2019 ///
>                                                                                 creatinine_jan2020 ///
>                                                                                 creatinine_feb2020 ///
>                                                                                 creatinine_mar2020 ///
>                                                                                 creatinine_apr2020 ///
>                                                                                 creatinine_may2020 ///
>                                                                                 creatinine_jun2020 ///
>                                                                                 creatinine_jul2020 ///
>                                                                                 creatinine_aug2020 ///
>                                                                                 creatinine_sep2020 ///
>                                                                                 creatinine_oct2020 ///
>                                                                                 creatinine_nov2020 ///
>                                                                                 creatinine_dec2020 ///
>                                                                                 creatinine_jan2021 ///
>                                                                                 creatinine_feb2021 ///
>                                                                                 creatinine_mar2021 ///
>                                                                                 creatinine_apr2021 ///
>                                                                                 creatinine_may2021 ///
>                                                                                 creatinine_jun2021 ///
>                                                                                 creatinine_jul2021 ///
>                                                                                 creatinine_aug2021 ///
>                                                                                 creatinine_sep2021 ///
>                                                                                 creatinine_oct2021 ///
>                                                                                 creatinine_nov2021 ///
>                                                                                 creatinine_dec2021 ///
>                                                                                 creatinine_jan2022 ///
>                                                                                 creatinine_feb2022 ///
>                                                                                 creatinine_mar2022 ///
>                                                                                 creatinine_apr2022 ///
>                                                                                 creatinine_may2022 ///
>                                                                                 creatinine_jun2022 ///
>                                                                                 creatinine_jul2022 ///
>                                                                                 creatinine_aug2022 ///
>                                                                                 creatinine_sep2022 {
  2. replace `creatinine_monthly' = . if !inrange(`creatinine_monthly', 20, 3000)
  3. gen mgdl_`creatinine_monthly' = `creatinine_monthly'/88.4
  4. gen min_`creatinine_monthly'=.
  5. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
  6. replace min_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
  7. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.329 if sex==0
  8. replace min_`creatinine_monthly' = min_`creatinine_monthly'^-0.411 if sex==1
  9. replace min_`creatinine_monthly' = 1 if min_`creatinine_monthly'<1
 10. gen max_`creatinine_monthly'=.
 11. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.7 if sex==0
 12. replace max_`creatinine_monthly' = mgdl_`creatinine_monthly'/0.9 if sex==1
 13. replace max_`creatinine_monthly' = max_`creatinine_monthly'^-1.209
 14. replace max_`creatinine_monthly' = 1 if max_`creatinine_monthly'>1
 15. gen egfr_`creatinine_monthly' = min_`creatinine_monthly'*max_`creatinine_monthly'*141
 16. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*(0.993^age)
 17. replace egfr_`creatinine_monthly' = egfr_`creatinine_monthly'*1.018 if sex==0
 18. drop `creatinine_monthly'
 19. drop mgdl_`creatinine_monthly'
 20. drop min_`creatinine_monthly'
 21. drop max_`creatinine_monthly'
 22. }
(5,151 real changes made, 5,151 to missing)
(19,403 missing values generated)
(25,934 missing values generated)
(3,308 real changes made)
(3,223 real changes made)
(3,308 real changes made)
(3,223 real changes made)
(4,142 real changes made)
(25,934 missing values generated)
(3,308 real changes made)
(3,223 real changes made)
(6,531 real changes made)
(21,792 real changes made)
(19,403 missing values generated)
(6,531 real changes made)
(3,308 real changes made)
(5,119 real changes made, 5,119 to missing)
(19,371 missing values generated)
(25,934 missing values generated)
(3,394 real changes made)
(3,169 real changes made)
(3,394 real changes made)
(3,169 real changes made)
(4,185 real changes made)
(25,934 missing values generated)
(3,394 real changes made)
(3,169 real changes made)
(6,563 real changes made)
(21,749 real changes made)
(19,371 missing values generated)
(6,563 real changes made)
(3,394 real changes made)
(5,116 real changes made, 5,116 to missing)
(19,368 missing values generated)
(25,934 missing values generated)
(3,368 real changes made)
(3,198 real changes made)
(3,368 real changes made)
(3,198 real changes made)
(4,268 real changes made)
(25,934 missing values generated)
(3,368 real changes made)
(3,198 real changes made)
(6,566 real changes made)
(21,666 real changes made)
(19,368 missing values generated)
(6,566 real changes made)
(3,368 real changes made)
(5,187 real changes made, 5,187 to missing)
(19,439 missing values generated)
(25,934 missing values generated)
(3,311 real changes made)
(3,184 real changes made)
(3,311 real changes made)
(3,184 real changes made)
(4,065 real changes made)
(25,934 missing values generated)
(3,311 real changes made)
(3,184 real changes made)
(6,495 real changes made)
(21,869 real changes made)
(19,439 missing values generated)
(6,495 real changes made)
(3,311 real changes made)
(5,125 real changes made, 5,125 to missing)
(19,377 missing values generated)
(25,934 missing values generated)
(3,382 real changes made)
(3,175 real changes made)
(3,382 real changes made)
(3,175 real changes made)
(4,189 real changes made)
(25,934 missing values generated)
(3,382 real changes made)
(3,175 real changes made)
(6,557 real changes made)
(21,745 real changes made)
(19,377 missing values generated)
(6,557 real changes made)
(3,382 real changes made)
(5,110 real changes made, 5,110 to missing)
(19,362 missing values generated)
(25,934 missing values generated)
(3,369 real changes made)
(3,203 real changes made)
(3,369 real changes made)
(3,203 real changes made)
(4,116 real changes made)
(25,934 missing values generated)
(3,369 real changes made)
(3,203 real changes made)
(6,572 real changes made)
(21,818 real changes made)
(19,362 missing values generated)
(6,572 real changes made)
(3,369 real changes made)
(5,170 real changes made, 5,170 to missing)
(19,422 missing values generated)
(25,934 missing values generated)
(3,347 real changes made)
(3,165 real changes made)
(3,347 real changes made)
(3,165 real changes made)
(4,163 real changes made)
(25,934 missing values generated)
(3,347 real changes made)
(3,165 real changes made)
(6,512 real changes made)
(21,771 real changes made)
(19,422 missing values generated)
(6,512 real changes made)
(3,347 real changes made)
(5,154 real changes made, 5,154 to missing)
(19,406 missing values generated)
(25,934 missing values generated)
(3,352 real changes made)
(3,176 real changes made)
(3,352 real changes made)
(3,176 real changes made)
(4,128 real changes made)
(25,934 missing values generated)
(3,352 real changes made)
(3,176 real changes made)
(6,528 real changes made)
(21,806 real changes made)
(19,406 missing values generated)
(6,528 real changes made)
(3,352 real changes made)
(5,134 real changes made, 5,134 to missing)
(19,386 missing values generated)
(25,934 missing values generated)
(3,348 real changes made)
(3,200 real changes made)
(3,348 real changes made)
(3,200 real changes made)
(4,120 real changes made)
(25,934 missing values generated)
(3,348 real changes made)
(3,200 real changes made)
(6,548 real changes made)
(21,814 real changes made)
(19,386 missing values generated)
(6,548 real changes made)
(3,348 real changes made)
(5,145 real changes made, 5,145 to missing)
(19,397 missing values generated)
(25,934 missing values generated)
(3,364 real changes made)
(3,173 real changes made)
(3,364 real changes made)
(3,173 real changes made)
(4,115 real changes made)
(25,934 missing values generated)
(3,364 real changes made)
(3,173 real changes made)
(6,537 real changes made)
(21,819 real changes made)
(19,397 missing values generated)
(6,537 real changes made)
(3,364 real changes made)
(5,108 real changes made, 5,108 to missing)
(19,360 missing values generated)
(25,934 missing values generated)
(3,366 real changes made)
(3,208 real changes made)
(3,366 real changes made)
(3,208 real changes made)
(4,194 real changes made)
(25,934 missing values generated)
(3,366 real changes made)
(3,208 real changes made)
(6,574 real changes made)
(21,740 real changes made)
(19,360 missing values generated)
(6,574 real changes made)
(3,366 real changes made)
(5,143 real changes made, 5,143 to missing)
(19,395 missing values generated)
(25,934 missing values generated)
(3,316 real changes made)
(3,223 real changes made)
(3,316 real changes made)
(3,223 real changes made)
(4,091 real changes made)
(25,934 missing values generated)
(3,316 real changes made)
(3,223 real changes made)
(6,539 real changes made)
(21,843 real changes made)
(19,395 missing values generated)
(6,539 real changes made)
(3,316 real changes made)
(5,169 real changes made, 5,169 to missing)
(19,421 missing values generated)
(25,934 missing values generated)
(3,366 real changes made)
(3,147 real changes made)
(3,366 real changes made)
(3,147 real changes made)
(4,105 real changes made)
(25,934 missing values generated)
(3,366 real changes made)
(3,147 real changes made)
(6,513 real changes made)
(21,829 real changes made)
(19,421 missing values generated)
(6,513 real changes made)
(3,366 real changes made)
(5,156 real changes made, 5,156 to missing)
(19,408 missing values generated)
(25,934 missing values generated)
(3,360 real changes made)
(3,166 real changes made)
(3,360 real changes made)
(3,166 real changes made)
(4,079 real changes made)
(25,934 missing values generated)
(3,360 real changes made)
(3,166 real changes made)
(6,526 real changes made)
(21,855 real changes made)
(19,408 missing values generated)
(6,526 real changes made)
(3,360 real changes made)
(5,147 real changes made, 5,147 to missing)
(19,399 missing values generated)
(25,934 missing values generated)
(3,317 real changes made)
(3,218 real changes made)
(3,317 real changes made)
(3,218 real changes made)
(4,180 real changes made)
(25,934 missing values generated)
(3,317 real changes made)
(3,218 real changes made)
(6,535 real changes made)
(21,754 real changes made)
(19,399 missing values generated)
(6,535 real changes made)
(3,317 real changes made)
(5,149 real changes made, 5,149 to missing)
(19,401 missing values generated)
(25,934 missing values generated)
(3,387 real changes made)
(3,146 real changes made)
(3,387 real changes made)
(3,146 real changes made)
(4,162 real changes made)
(25,934 missing values generated)
(3,387 real changes made)
(3,146 real changes made)
(6,533 real changes made)
(21,772 real changes made)
(19,401 missing values generated)
(6,533 real changes made)
(3,387 real changes made)
(5,090 real changes made, 5,090 to missing)
(19,342 missing values generated)
(25,934 missing values generated)
(3,413 real changes made)
(3,179 real changes made)
(3,413 real changes made)
(3,179 real changes made)
(4,166 real changes made)
(25,934 missing values generated)
(3,413 real changes made)
(3,179 real changes made)
(6,592 real changes made)
(21,768 real changes made)
(19,342 missing values generated)
(6,592 real changes made)
(3,413 real changes made)
(5,152 real changes made, 5,152 to missing)
(19,404 missing values generated)
(25,934 missing values generated)
(3,430 real changes made)
(3,100 real changes made)
(3,430 real changes made)
(3,100 real changes made)
(4,161 real changes made)
(25,934 missing values generated)
(3,430 real changes made)
(3,100 real changes made)
(6,530 real changes made)
(21,773 real changes made)
(19,404 missing values generated)
(6,530 real changes made)
(3,430 real changes made)
(5,115 real changes made, 5,115 to missing)
(19,367 missing values generated)
(25,934 missing values generated)
(3,340 real changes made)
(3,227 real changes made)
(3,340 real changes made)
(3,227 real changes made)
(4,136 real changes made)
(25,934 missing values generated)
(3,340 real changes made)
(3,227 real changes made)
(6,567 real changes made)
(21,798 real changes made)
(19,367 missing values generated)
(6,567 real changes made)
(3,340 real changes made)
(5,129 real changes made, 5,129 to missing)
(19,381 missing values generated)
(25,934 missing values generated)
(3,376 real changes made)
(3,177 real changes made)
(3,376 real changes made)
(3,177 real changes made)
(4,261 real changes made)
(25,934 missing values generated)
(3,376 real changes made)
(3,177 real changes made)
(6,553 real changes made)
(21,673 real changes made)
(19,381 missing values generated)
(6,553 real changes made)
(3,376 real changes made)
(5,153 real changes made, 5,153 to missing)
(19,405 missing values generated)
(25,934 missing values generated)
(3,334 real changes made)
(3,195 real changes made)
(3,334 real changes made)
(3,195 real changes made)
(4,147 real changes made)
(25,934 missing values generated)
(3,334 real changes made)
(3,195 real changes made)
(6,529 real changes made)
(21,787 real changes made)
(19,405 missing values generated)
(6,529 real changes made)
(3,334 real changes made)
(5,148 real changes made, 5,148 to missing)
(19,400 missing values generated)
(25,934 missing values generated)
(3,375 real changes made)
(3,159 real changes made)
(3,375 real changes made)
(3,159 real changes made)
(4,107 real changes made)
(25,934 missing values generated)
(3,375 real changes made)
(3,159 real changes made)
(6,534 real changes made)
(21,827 real changes made)
(19,400 missing values generated)
(6,534 real changes made)
(3,375 real changes made)
(5,100 real changes made, 5,100 to missing)
(19,352 missing values generated)
(25,934 missing values generated)
(3,390 real changes made)
(3,192 real changes made)
(3,390 real changes made)
(3,192 real changes made)
(4,208 real changes made)
(25,934 missing values generated)
(3,390 real changes made)
(3,192 real changes made)
(6,582 real changes made)
(21,726 real changes made)
(19,352 missing values generated)
(6,582 real changes made)
(3,390 real changes made)
(5,173 real changes made, 5,173 to missing)
(19,425 missing values generated)
(25,934 missing values generated)
(3,322 real changes made)
(3,187 real changes made)
(3,322 real changes made)
(3,187 real changes made)
(4,186 real changes made)
(25,934 missing values generated)
(3,322 real changes made)
(3,187 real changes made)
(6,509 real changes made)
(21,748 real changes made)
(19,425 missing values generated)
(6,509 real changes made)
(3,322 real changes made)
(5,150 real changes made, 5,150 to missing)
(19,402 missing values generated)
(25,934 missing values generated)
(3,427 real changes made)
(3,105 real changes made)
(3,427 real changes made)
(3,105 real changes made)
(4,153 real changes made)
(25,934 missing values generated)
(3,427 real changes made)
(3,105 real changes made)
(6,532 real changes made)
(21,781 real changes made)
(19,402 missing values generated)
(6,532 real changes made)
(3,427 real changes made)
(5,120 real changes made, 5,120 to missing)
(19,372 missing values generated)
(25,934 missing values generated)
(3,400 real changes made)
(3,162 real changes made)
(3,400 real changes made)
(3,162 real changes made)
(4,147 real changes made)
(25,934 missing values generated)
(3,400 real changes made)
(3,162 real changes made)
(6,562 real changes made)
(21,787 real changes made)
(19,372 missing values generated)
(6,562 real changes made)
(3,400 real changes made)
(5,119 real changes made, 5,119 to missing)
(19,371 missing values generated)
(25,934 missing values generated)
(3,374 real changes made)
(3,189 real changes made)
(3,374 real changes made)
(3,189 real changes made)
(4,134 real changes made)
(25,934 missing values generated)
(3,374 real changes made)
(3,189 real changes made)
(6,563 real changes made)
(21,800 real changes made)
(19,371 missing values generated)
(6,563 real changes made)
(3,374 real changes made)
(5,146 real changes made, 5,146 to missing)
(19,398 missing values generated)
(25,934 missing values generated)
(3,341 real changes made)
(3,195 real changes made)
(3,341 real changes made)
(3,195 real changes made)
(4,162 real changes made)
(25,934 missing values generated)
(3,341 real changes made)
(3,195 real changes made)
(6,536 real changes made)
(21,772 real changes made)
(19,398 missing values generated)
(6,536 real changes made)
(3,341 real changes made)
(5,147 real changes made, 5,147 to missing)
(19,399 missing values generated)
(25,934 missing values generated)
(3,345 real changes made)
(3,190 real changes made)
(3,345 real changes made)
(3,190 real changes made)
(4,146 real changes made)
(25,934 missing values generated)
(3,345 real changes made)
(3,190 real changes made)
(6,535 real changes made)
(21,788 real changes made)
(19,399 missing values generated)
(6,535 real changes made)
(3,345 real changes made)
(5,117 real changes made, 5,117 to missing)
(19,369 missing values generated)
(25,934 missing values generated)
(3,402 real changes made)
(3,163 real changes made)
(3,402 real changes made)
(3,163 real changes made)
(4,178 real changes made)
(25,934 missing values generated)
(3,402 real changes made)
(3,163 real changes made)
(6,565 real changes made)
(21,756 real changes made)
(19,369 missing values generated)
(6,565 real changes made)
(3,402 real changes made)
(5,115 real changes made, 5,115 to missing)
(19,367 missing values generated)
(25,934 missing values generated)
(3,378 real changes made)
(3,189 real changes made)
(3,378 real changes made)
(3,189 real changes made)
(4,144 real changes made)
(25,934 missing values generated)
(3,378 real changes made)
(3,189 real changes made)
(6,567 real changes made)
(21,790 real changes made)
(19,367 missing values generated)
(6,567 real changes made)
(3,378 real changes made)
(5,137 real changes made, 5,137 to missing)
(19,389 missing values generated)
(25,934 missing values generated)
(3,374 real changes made)
(3,171 real changes made)
(3,374 real changes made)
(3,171 real changes made)
(4,172 real changes made)
(25,934 missing values generated)
(3,374 real changes made)
(3,171 real changes made)
(6,545 real changes made)
(21,762 real changes made)
(19,389 missing values generated)
(6,545 real changes made)
(3,374 real changes made)
(5,118 real changes made, 5,118 to missing)
(19,370 missing values generated)
(25,934 missing values generated)
(3,367 real changes made)
(3,197 real changes made)
(3,367 real changes made)
(3,197 real changes made)
(4,212 real changes made)
(25,934 missing values generated)
(3,367 real changes made)
(3,197 real changes made)
(6,564 real changes made)
(21,722 real changes made)
(19,370 missing values generated)
(6,564 real changes made)
(3,367 real changes made)
(5,135 real changes made, 5,135 to missing)
(19,387 missing values generated)
(25,934 missing values generated)
(3,345 real changes made)
(3,202 real changes made)
(3,345 real changes made)
(3,202 real changes made)
(4,146 real changes made)
(25,934 missing values generated)
(3,345 real changes made)
(3,202 real changes made)
(6,547 real changes made)
(21,788 real changes made)
(19,387 missing values generated)
(6,547 real changes made)
(3,345 real changes made)
(5,176 real changes made, 5,176 to missing)
(19,428 missing values generated)
(25,934 missing values generated)
(3,367 real changes made)
(3,139 real changes made)
(3,367 real changes made)
(3,139 real changes made)
(4,110 real changes made)
(25,934 missing values generated)
(3,367 real changes made)
(3,139 real changes made)
(6,506 real changes made)
(21,824 real changes made)
(19,428 missing values generated)
(6,506 real changes made)
(3,367 real changes made)
(5,149 real changes made, 5,149 to missing)
(19,401 missing values generated)
(25,934 missing values generated)
(3,357 real changes made)
(3,176 real changes made)
(3,357 real changes made)
(3,176 real changes made)
(4,130 real changes made)
(25,934 missing values generated)
(3,357 real changes made)
(3,176 real changes made)
(6,533 real changes made)
(21,804 real changes made)
(19,401 missing values generated)
(6,533 real changes made)
(3,357 real changes made)
(6,260 real changes made, 6,260 to missing)
(17,942 missing values generated)
(25,934 missing values generated)
(4,059 real changes made)
(3,933 real changes made)
(4,059 real changes made)
(3,933 real changes made)
(5,062 real changes made)
(25,934 missing values generated)
(4,059 real changes made)
(3,933 real changes made)
(7,992 real changes made)
(20,872 real changes made)
(17,942 missing values generated)
(7,992 real changes made)
(4,059 real changes made)
(6,265 real changes made, 6,265 to missing)
(17,947 missing values generated)
(25,934 missing values generated)
(4,076 real changes made)
(3,911 real changes made)
(4,076 real changes made)
(3,911 real changes made)
(5,062 real changes made)
(25,934 missing values generated)
(4,076 real changes made)
(3,911 real changes made)
(7,987 real changes made)
(20,872 real changes made)
(17,947 missing values generated)
(7,987 real changes made)
(4,076 real changes made)
(6,254 real changes made, 6,254 to missing)
(17,936 missing values generated)
(25,934 missing values generated)
(4,064 real changes made)
(3,934 real changes made)
(4,064 real changes made)
(3,934 real changes made)
(5,155 real changes made)
(25,934 missing values generated)
(4,064 real changes made)
(3,934 real changes made)
(7,998 real changes made)
(20,779 real changes made)
(17,936 missing values generated)
(7,998 real changes made)
(4,064 real changes made)
(6,274 real changes made, 6,274 to missing)
(17,956 missing values generated)
(25,934 missing values generated)
(4,054 real changes made)
(3,924 real changes made)
(4,054 real changes made)
(3,924 real changes made)
(4,997 real changes made)
(25,934 missing values generated)
(4,054 real changes made)
(3,924 real changes made)
(7,978 real changes made)
(20,937 real changes made)
(17,956 missing values generated)
(7,978 real changes made)
(4,054 real changes made)
(6,279 real changes made, 6,279 to missing)
(17,961 missing values generated)
(25,934 missing values generated)
(4,070 real changes made)
(3,903 real changes made)
(4,070 real changes made)
(3,903 real changes made)
(5,054 real changes made)
(25,934 missing values generated)
(4,070 real changes made)
(3,903 real changes made)
(7,973 real changes made)
(20,880 real changes made)
(17,961 missing values generated)
(7,973 real changes made)
(4,070 real changes made)
(6,295 real changes made, 6,295 to missing)
(17,977 missing values generated)
(25,934 missing values generated)
(4,041 real changes made)
(3,916 real changes made)
(4,041 real changes made)
(3,916 real changes made)
(4,971 real changes made)
(25,934 missing values generated)
(4,041 real changes made)
(3,916 real changes made)
(7,957 real changes made)
(20,963 real changes made)
(17,977 missing values generated)
(7,957 real changes made)
(4,041 real changes made)
(6,289 real changes made, 6,289 to missing)
(17,971 missing values generated)
(25,934 missing values generated)
(4,033 real changes made)
(3,930 real changes made)
(4,033 real changes made)
(3,930 real changes made)
(5,001 real changes made)
(25,934 missing values generated)
(4,033 real changes made)
(3,930 real changes made)
(7,963 real changes made)
(20,933 real changes made)
(17,971 missing values generated)
(7,963 real changes made)
(4,033 real changes made)
(6,286 real changes made, 6,286 to missing)
(17,968 missing values generated)
(25,934 missing values generated)
(4,075 real changes made)
(3,891 real changes made)
(4,075 real changes made)
(3,891 real changes made)
(5,012 real changes made)
(25,934 missing values generated)
(4,075 real changes made)
(3,891 real changes made)
(7,966 real changes made)
(20,922 real changes made)
(17,968 missing values generated)
(7,966 real changes made)
(4,075 real changes made)
(6,273 real changes made, 6,273 to missing)
(17,955 missing values generated)
(25,934 missing values generated)
(4,091 real changes made)
(3,888 real changes made)
(4,091 real changes made)
(3,888 real changes made)
(5,116 real changes made)
(25,934 missing values generated)
(4,091 real changes made)
(3,888 real changes made)
(7,979 real changes made)
(20,818 real changes made)
(17,955 missing values generated)
(7,979 real changes made)
(4,091 real changes made)
(6,278 real changes made, 6,278 to missing)
(17,960 missing values generated)
(25,934 missing values generated)
(4,077 real changes made)
(3,897 real changes made)
(4,077 real changes made)
(3,897 real changes made)
(5,167 real changes made)
(25,934 missing values generated)
(4,077 real changes made)
(3,897 real changes made)
(7,974 real changes made)
(20,767 real changes made)
(17,960 missing values generated)
(7,974 real changes made)
(4,077 real changes made)
(6,273 real changes made, 6,273 to missing)
(17,955 missing values generated)
(25,934 missing values generated)
(4,079 real changes made)
(3,900 real changes made)
(4,079 real changes made)
(3,900 real changes made)
(5,055 real changes made)
(25,934 missing values generated)
(4,079 real changes made)
(3,900 real changes made)
(7,979 real changes made)
(20,879 real changes made)
(17,955 missing values generated)
(7,979 real changes made)
(4,079 real changes made)
(6,261 real changes made, 6,261 to missing)
(17,943 missing values generated)
(25,934 missing values generated)
(4,052 real changes made)
(3,939 real changes made)
(4,052 real changes made)
(3,939 real changes made)
(5,073 real changes made)
(25,934 missing values generated)
(4,052 real changes made)
(3,939 real changes made)
(7,991 real changes made)
(20,861 real changes made)
(17,943 missing values generated)
(7,991 real changes made)
(4,052 real changes made)
(6,259 real changes made, 6,259 to missing)
(17,941 missing values generated)
(25,934 missing values generated)
(4,137 real changes made)
(3,856 real changes made)
(4,137 real changes made)
(3,856 real changes made)
(5,032 real changes made)
(25,934 missing values generated)
(4,137 real changes made)
(3,856 real changes made)
(7,993 real changes made)
(20,902 real changes made)
(17,941 missing values generated)
(7,993 real changes made)
(4,137 real changes made)
(6,198 real changes made, 6,198 to missing)
(17,880 missing values generated)
(25,934 missing values generated)
(4,070 real changes made)
(3,984 real changes made)
(4,070 real changes made)
(3,984 real changes made)
(5,067 real changes made)
(25,934 missing values generated)
(4,070 real changes made)
(3,984 real changes made)
(8,054 real changes made)
(20,867 real changes made)
(17,880 missing values generated)
(8,054 real changes made)
(4,070 real changes made)
(6,280 real changes made, 6,280 to missing)
(17,962 missing values generated)
(25,934 missing values generated)
(4,071 real changes made)
(3,901 real changes made)
(4,071 real changes made)
(3,901 real changes made)
(5,066 real changes made)
(25,934 missing values generated)
(4,071 real changes made)
(3,901 real changes made)
(7,972 real changes made)
(20,868 real changes made)
(17,962 missing values generated)
(7,972 real changes made)
(4,071 real changes made)
(6,263 real changes made, 6,263 to missing)
(17,945 missing values generated)
(25,934 missing values generated)
(4,072 real changes made)
(3,917 real changes made)
(4,072 real changes made)
(3,917 real changes made)
(5,104 real changes made)
(25,934 missing values generated)
(4,072 real changes made)
(3,917 real changes made)
(7,989 real changes made)
(20,830 real changes made)
(17,945 missing values generated)
(7,989 real changes made)
(4,072 real changes made)
(6,281 real changes made, 6,281 to missing)
(17,963 missing values generated)
(25,934 missing values generated)
(4,078 real changes made)
(3,893 real changes made)
(4,078 real changes made)
(3,893 real changes made)
(5,071 real changes made)
(25,934 missing values generated)
(4,078 real changes made)
(3,893 real changes made)
(7,971 real changes made)
(20,863 real changes made)
(17,963 missing values generated)
(7,971 real changes made)
(4,078 real changes made)
(6,283 real changes made, 6,283 to missing)
(17,965 missing values generated)
(25,934 missing values generated)
(4,100 real changes made)
(3,869 real changes made)
(4,100 real changes made)
(3,869 real changes made)
(5,075 real changes made)
(25,934 missing values generated)
(4,100 real changes made)
(3,869 real changes made)
(7,969 real changes made)
(20,859 real changes made)
(17,965 missing values generated)
(7,969 real changes made)
(4,100 real changes made)
(6,252 real changes made, 6,252 to missing)
(17,934 missing values generated)
(25,934 missing values generated)
(4,066 real changes made)
(3,934 real changes made)
(4,066 real changes made)
(3,934 real changes made)
(5,025 real changes made)
(25,934 missing values generated)
(4,066 real changes made)
(3,934 real changes made)
(8,000 real changes made)
(20,909 real changes made)
(17,934 missing values generated)
(8,000 real changes made)
(4,066 real changes made)
(6,269 real changes made, 6,269 to missing)
(17,951 missing values generated)
(25,934 missing values generated)
(4,090 real changes made)
(3,893 real changes made)
(4,090 real changes made)
(3,893 real changes made)
(5,097 real changes made)
(25,934 missing values generated)
(4,090 real changes made)
(3,893 real changes made)
(7,983 real changes made)
(20,837 real changes made)
(17,951 missing values generated)
(7,983 real changes made)
(4,090 real changes made)
(6,236 real changes made, 6,236 to missing)
(17,918 missing values generated)
(25,934 missing values generated)
(4,072 real changes made)
(3,944 real changes made)
(4,072 real changes made)
(3,944 real changes made)
(5,061 real changes made)
(25,934 missing values generated)
(4,072 real changes made)
(3,944 real changes made)
(8,016 real changes made)
(20,873 real changes made)
(17,918 missing values generated)
(8,016 real changes made)
(4,072 real changes made)
(6,289 real changes made, 6,289 to missing)
(17,971 missing values generated)
(25,934 missing values generated)
(4,112 real changes made)
(3,851 real changes made)
(4,112 real changes made)
(3,851 real changes made)
(5,103 real changes made)
(25,934 missing values generated)
(4,112 real changes made)
(3,851 real changes made)
(7,963 real changes made)
(20,831 real changes made)
(17,971 missing values generated)
(7,963 real changes made)
(4,112 real changes made)
(6,278 real changes made, 6,278 to missing)
(17,960 missing values generated)
(25,934 missing values generated)
(4,051 real changes made)
(3,923 real changes made)
(4,051 real changes made)
(3,923 real changes made)
(5,027 real changes made)
(25,934 missing values generated)
(4,051 real changes made)
(3,923 real changes made)
(7,974 real changes made)
(20,907 real changes made)
(17,960 missing values generated)
(7,974 real changes made)
(4,051 real changes made)
(6,329 real changes made, 6,329 to missing)
(18,011 missing values generated)
(25,934 missing values generated)
(4,056 real changes made)
(3,867 real changes made)
(4,056 real changes made)
(3,867 real changes made)
(4,972 real changes made)
(25,934 missing values generated)
(4,056 real changes made)
(3,867 real changes made)
(7,923 real changes made)
(20,962 real changes made)
(18,011 missing values generated)
(7,923 real changes made)
(4,056 real changes made)
(6,250 real changes made, 6,250 to missing)
(17,932 missing values generated)
(25,934 missing values generated)
(4,103 real changes made)
(3,899 real changes made)
(4,103 real changes made)
(3,899 real changes made)
(5,021 real changes made)
(25,934 missing values generated)
(4,103 real changes made)
(3,899 real changes made)
(8,002 real changes made)
(20,913 real changes made)
(17,932 missing values generated)
(8,002 real changes made)
(4,103 real changes made)
(6,257 real changes made, 6,257 to missing)
(17,939 missing values generated)
(25,934 missing values generated)
(4,072 real changes made)
(3,923 real changes made)
(4,072 real changes made)
(3,923 real changes made)
(5,115 real changes made)
(25,934 missing values generated)
(4,072 real changes made)
(3,923 real changes made)
(7,995 real changes made)
(20,819 real changes made)
(17,939 missing values generated)
(7,995 real changes made)
(4,072 real changes made)
(6,270 real changes made, 6,270 to missing)
(17,952 missing values generated)
(25,934 missing values generated)
(4,033 real changes made)
(3,949 real changes made)
(4,033 real changes made)
(3,949 real changes made)
(5,055 real changes made)
(25,934 missing values generated)
(4,033 real changes made)
(3,949 real changes made)
(7,982 real changes made)
(20,879 real changes made)
(17,952 missing values generated)
(7,982 real changes made)
(4,033 real changes made)
(6,284 real changes made, 6,284 to missing)
(17,966 missing values generated)
(25,934 missing values generated)
(4,072 real changes made)
(3,896 real changes made)
(4,072 real changes made)
(3,896 real changes made)
(5,064 real changes made)
(25,934 missing values generated)
(4,072 real changes made)
(3,896 real changes made)
(7,968 real changes made)
(20,870 real changes made)
(17,966 missing values generated)
(7,968 real changes made)
(4,072 real changes made)
(6,249 real changes made, 6,249 to missing)
(17,931 missing values generated)
(25,934 missing values generated)
(4,120 real changes made)
(3,883 real changes made)
(4,120 real changes made)
(3,883 real changes made)
(5,094 real changes made)
(25,934 missing values generated)
(4,120 real changes made)
(3,883 real changes made)
(8,003 real changes made)
(20,840 real changes made)
(17,931 missing values generated)
(8,003 real changes made)
(4,120 real changes made)
(6,272 real changes made, 6,272 to missing)
(17,954 missing values generated)
(25,934 missing values generated)
(4,137 real changes made)
(3,843 real changes made)
(4,137 real changes made)
(3,843 real changes made)
(5,046 real changes made)
(25,934 missing values generated)
(4,137 real changes made)
(3,843 real changes made)
(7,980 real changes made)
(20,888 real changes made)
(17,954 missing values generated)
(7,980 real changes made)
(4,137 real changes made)
(6,245 real changes made, 6,245 to missing)
(17,927 missing values generated)
(25,934 missing values generated)
(4,047 real changes made)
(3,960 real changes made)
(4,047 real changes made)
(3,960 real changes made)
(5,169 real changes made)
(25,934 missing values generated)
(4,047 real changes made)
(3,960 real changes made)
(8,007 real changes made)
(20,765 real changes made)
(17,927 missing values generated)
(8,007 real changes made)
(4,047 real changes made)
(6,263 real changes made, 6,263 to missing)
(17,945 missing values generated)
(25,934 missing values generated)
(4,097 real changes made)
(3,892 real changes made)
(4,097 real changes made)
(3,892 real changes made)
(5,058 real changes made)
(25,934 missing values generated)
(4,097 real changes made)
(3,892 real changes made)
(7,989 real changes made)
(20,876 real changes made)
(17,945 missing values generated)
(7,989 real changes made)
(4,097 real changes made)

. gen index_date_string=string(index_date, "%td") 

. gen index_month=substr(index_date_string ,3,7)

. gen baseline_egfr=.
(25,934 missing values generated)

. local month_year "feb2017 mar2017 apr2017 may2017 jun2017 jul2017 aug2017 sep2017 oct2017 nov2017 dec2017 jan2018 feb2018 mar2018 apr2018 may2018 jun2018 jul2018 aug2018 sep2018 oct2018 n
> ov2018 dec2018 jan2019 feb2019 mar2019 apr2019 may2019 jun2019 jul2019 aug2019 sep2019 oct2019 nov2019 dec2019 jan2020 feb2020 mar2020 apr2020 may2020 jun2020 jul2020 aug2020 sep2020 oct2
> 020 nov2020 dec2020 jan2021 feb2021 mar2021 apr2021 may2021 jun2021 jul2021 aug2021 sep2021 oct2021 nov2021 dec2021 jan2022 feb2022 mar2022 apr2022 may2022 jun2022 jul2022 aug2022 sep2022
> "

. foreach x of local month_year  {
  2. replace baseline_egfr=egfr_creatinine_`x' if index_month=="`x'"
  3. drop if baseline_egfr <15
  4. }
(379 real changes made)
(0 observations deleted)
(401 real changes made)
(0 observations deleted)
(366 real changes made)
(0 observations deleted)
(367 real changes made)
(0 observations deleted)
(354 real changes made)
(0 observations deleted)
(288 real changes made)
(0 observations deleted)
(301 real changes made)
(0 observations deleted)
(270 real changes made)
(0 observations deleted)
(263 real changes made)
(0 observations deleted)
(285 real changes made)
(0 observations deleted)
(244 real changes made)
(0 observations deleted)
(263 real changes made)
(0 observations deleted)
(210 real changes made)
(0 observations deleted)
(195 real changes made)
(0 observations deleted)
(204 real changes made)
(0 observations deleted)
(176 real changes made)
(0 observations deleted)
(199 real changes made)
(0 observations deleted)
(135 real changes made)
(0 observations deleted)
(135 real changes made)
(0 observations deleted)
(130 real changes made)
(0 observations deleted)
(153 real changes made)
(0 observations deleted)
(123 real changes made)
(0 observations deleted)
(142 real changes made)
(0 observations deleted)
(114 real changes made)
(0 observations deleted)
(104 real changes made)
(0 observations deleted)
(143 real changes made)
(0 observations deleted)
(83 real changes made)
(0 observations deleted)
(86 real changes made)
(0 observations deleted)
(68 real changes made)
(0 observations deleted)
(108 real changes made)
(0 observations deleted)
(80 real changes made)
(0 observations deleted)
(105 real changes made)
(0 observations deleted)
(0 real changes made)
(0 observations deleted)
(0 real changes made)
(0 observations deleted)
(0 real changes made)
(0 observations deleted)
(0 real changes made)
(0 observations deleted)
(304 real changes made)
(0 observations deleted)
(337 real changes made)
(0 observations deleted)
(291 real changes made)
(0 observations deleted)
(326 real changes made)
(0 observations deleted)
(316 real changes made)
(0 observations deleted)
(305 real changes made)
(0 observations deleted)
(261 real changes made)
(0 observations deleted)
(263 real changes made)
(0 observations deleted)
(262 real changes made)
(0 observations deleted)
(259 real changes made)
(0 observations deleted)
(282 real changes made)
(0 observations deleted)
(292 real changes made)
(0 observations deleted)
(260 real changes made)
(0 observations deleted)
(246 real changes made)
(0 observations deleted)
(264 real changes made)
(0 observations deleted)
(269 real changes made)
(0 observations deleted)
(257 real changes made)
(0 observations deleted)
(234 real changes made)
(0 observations deleted)
(265 real changes made)
(0 observations deleted)
(202 real changes made)
(0 observations deleted)
(243 real changes made)
(0 observations deleted)
(201 real changes made)
(0 observations deleted)
(220 real changes made)
(0 observations deleted)
(231 real changes made)
(0 observations deleted)
(188 real changes made)
(0 observations deleted)
(234 real changes made)
(0 observations deleted)
(186 real changes made)
(0 observations deleted)
(179 real changes made)
(0 observations deleted)
(178 real changes made)
(0 observations deleted)
(183 real changes made)
(0 observations deleted)
(167 real changes made)
(0 observations deleted)
(162 real changes made)
(0 observations deleted)

. label var baseline_egfr "Baseline eGFR"

. 
. * Drop COVID-19 cases without any matched historical comparators after further application of exclusion criteria
. generate match_counts1=.
(25,934 missing values generated)

. order patient_id set_id match_counts match_counts1

. by set_id: replace match_counts1=_N-1
(25,934 real changes made)

. replace match_counts1=. if case==0
(11,682 real changes made, 11,682 to missing)

. drop match_counts

. rename match_counts1 match_counts

. count if match_counts==0
  7,447

. drop if match_counts==0
(7,447 observations deleted)

. safetab case

       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,682       63.19       63.19
          1 |      6,805       36.81      100.00
------------+-----------------------------------
      Total |     18,487      100.00

. tab match_counts

match_count |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,595       52.83       52.83
          2 |      2,011       29.55       82.38
          3 |        836       12.29       94.67
          4 |        273        4.01       98.68
          5 |         90        1.32      100.00
------------+-----------------------------------
      Total |      6,805      100.00

. 
. ** Exposure
. label define case 0 "Comparator (historical)" ///
>                                   1 "COVID-19"

. label values case case

. safetab case 

                   case |      Freq.     Percent        Cum.
------------------------+-----------------------------------
Comparator (historical) |     11,682       63.19       63.19
               COVID-19 |      6,805       36.81      100.00
------------------------+-----------------------------------
                  Total |     18,487      100.00

. 
. * COVID-19 severity
. gen covid_severity = case

. replace covid_severity = 2 if covid_hospitalised==1
(707 real changes made)

. replace covid_severity = 3 if covid_critical_care==1
(361 real changes made)

. replace covid_severity = 3 if covid_critical_days==1
(334 real changes made)

. label define covid_severity_label       0 "Historical comparator"               ///
>                                                                         1 "Non-hospitalised SARS-CoV-2" ///
>                                                                         2 "Hospitalised COVID-19"               ///
>                                                                         3 "Critical care COVID-19"

. label values covid_severity covid_severity_label

. label var covid_severity "SARS-CoV-2 severity"

. drop covid_critical_care

. drop covid_critical_days

. safetab covid_severity, m

        SARS-CoV-2 severity |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
      Historical comparator |     11,682       63.19       63.19
Non-hospitalised SARS-CoV-2 |      5,472       29.60       92.79
      Hospitalised COVID-19 |        638        3.45       96.24
     Critical care COVID-19 |        695        3.76      100.00
----------------------------+-----------------------------------
                      Total |     18,487      100.00

. 
. * COVID-19 acute kidney injury
. gen covid_aki = case

. replace covid_aki = 2 if covid_hospitalised==1
(707 real changes made)

. replace covid_aki = 3 if covid_acute_kidney_injury==1
(329 real changes made)

. label define covid_aki  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised SARS-CoV-2"         ///
>                                                 2 "No AKI hospitalised COVID-19"        ///
>                                                 3 "AKI hospitalised COVID-19"

. label values covid_aki covid_aki

. label var covid_aki "COVID-19 acute kidney injury"

. drop covid_acute_kidney_injury

. safetab covid_aki, m

COVID-19 acute kidney injury |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
       Historical comparator |     11,682       63.19       63.19
 Non-hospitalised SARS-CoV-2 |      5,800       31.37       94.56
No AKI hospitalised COVID-19 |        676        3.66       98.22
   AKI hospitalised COVID-19 |        329        1.78      100.00
-----------------------------+-----------------------------------
                       Total |     18,487      100.00

. 
. * COVID-19 kidney replacement therapy
. gen covid_krt_combined = covid_krt_icd_10
(11,682 missing values generated)

. replace covid_krt_combined = covid_krt_opcs_4 if covid_krt_icd_10==0
(323 real changes made)

. gen covid_krt = case

. replace covid_krt = 2 if covid_hospitalised==1
(707 real changes made)

. replace covid_krt = 3 if covid_krt_combined==1
(673 real changes made)

. label define covid_krt  0 "Historical comparator"                       ///
>                                                 1 "Non-hospitalised SARS-CoV-2"         ///
>                                                 2 "No KRT hospitalised COVID-19"        ///
>                                                 3 "KRT hospitalised COVID-19"

. label values covid_krt covid_krt

. label var covid_krt "COVID-19 kidney replacement therapy"

. drop covid_krt_icd_10

. drop covid_krt_opcs_4

. safetab covid_krt, m

 COVID-19 kidney replacement |
                     therapy |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
       Historical comparator |     11,682       63.19       63.19
 Non-hospitalised SARS-CoV-2 |      5,492       29.71       92.90
No KRT hospitalised COVID-19 |        640        3.46       96.36
   KRT hospitalised COVID-19 |        673        3.64      100.00
-----------------------------+-----------------------------------
                       Total |     18,487      100.00

. 
. * COVID-19 vaccination status
. gen covidvax1date = date(covid_vax_1_date, "YMD")
(17,171 missing values generated)

. format covidvax1date %td

. gen covidvax2date = date(covid_vax_2_date, "YMD")
(17,134 missing values generated)

. format covidvax2date %td

. gen covidvax3date = date(covid_vax_3_date, "YMD")
(17,125 missing values generated)

. format covidvax3date %td

. gen covidvax4date = date(covid_vax_4_date, "YMD")
(17,169 missing values generated)

. format covidvax4date %td

. gen covid_vax = case

. replace covid_vax = 5 if covidvax4date!=.
(1,318 real changes made)

. replace covid_vax = 4 if covid_vax==1 &covidvax3date!=.
(1,093 real changes made)

. replace covid_vax = 3 if covid_vax==1 &covidvax2date!=.
(881 real changes made)

. replace covid_vax = 2 if covid_vax==1 &covidvax1date!=.
(682 real changes made)

. drop covidvax1date

. drop covidvax2date

. drop covidvax3date

. drop covidvax4date

. label define covid_vax  0 "Historical comparator"                               ///
>                                                 1 "SARS-CoV-2 pre-vaccination"                  ///
>                                                 2 "SARS-CoV-2 1 vaccine dose"           ///
>                                                 3 "SARS-CoV-2 2 vaccine doses"  ///
>                                                 4 "SARS-CoV-2 3 vaccine doses"  ///
>                                                 5 "SARS-CoV-2 4 vaccine doses"

. label values covid_vax covid_vax

. label var covid_vax "Vaccination status"

. safetab covid_vax, m

        Vaccination status |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
     Historical comparator |     11,682       63.19       63.19
SARS-CoV-2 pre-vaccination |      2,831       15.31       78.50
 SARS-CoV-2 1 vaccine dose |        682        3.69       82.19
SARS-CoV-2 2 vaccine doses |        881        4.77       86.96
SARS-CoV-2 3 vaccine doses |      1,093        5.91       92.87
SARS-CoV-2 4 vaccine doses |      1,318        7.13      100.00
---------------------------+-----------------------------------
                     Total |     18,487      100.00

. 
. * Calendar period
. gen calendar_period = 1 if covid_month=="feb2020"
(18,125 missing values generated)

. replace calendar_period = 1 if covid_month=="mar2020"
(385 real changes made)

. replace calendar_period = 1 if covid_month=="apr2020"
(358 real changes made)

. replace calendar_period = 1 if covid_month=="may2020"
(377 real changes made)

. replace calendar_period = 1 if covid_month=="jun2020"
(360 real changes made)

. replace calendar_period = 2 if covid_month=="jul2020"
(313 real changes made)

. replace calendar_period = 2 if covid_month=="aug2020"
(312 real changes made)

. replace calendar_period = 3 if covid_month=="sep2020"
(269 real changes made)

. replace calendar_period = 3 if covid_month=="oct2020"
(268 real changes made)

. replace calendar_period = 3 if covid_month=="nov2020"
(279 real changes made)

. replace calendar_period = 4 if covid_month=="dec2020"
(255 real changes made)

. replace calendar_period = 4 if covid_month=="jan2021"
(273 real changes made)

. replace calendar_period = 4 if covid_month=="feb2021"
(222 real changes made)

. replace calendar_period = 5 if covid_month=="mar2021"
(211 real changes made)

. replace calendar_period = 5 if covid_month=="apr2021"
(215 real changes made)

. replace calendar_period = 5 if covid_month=="may2021"
(194 real changes made)

. replace calendar_period = 5 if covid_month=="jun2021"
(190 real changes made)

. replace calendar_period = 5 if covid_month=="jul2021"
(166 real changes made)

. replace calendar_period = 5 if covid_month=="aug2021"
(183 real changes made)

. replace calendar_period = 5 if covid_month=="sep2021"
(142 real changes made)

. replace calendar_period = 5 if covid_month=="oct2021"
(171 real changes made)

. replace calendar_period = 5 if covid_month=="nov2021"
(135 real changes made)

. replace calendar_period = 6 if covid_month=="dec2021"
(151 real changes made)

. replace calendar_period = 6 if covid_month=="jan2022"
(139 real changes made)

. replace calendar_period = 6 if covid_month=="feb2022"
(119 real changes made)

. replace calendar_period = 7 if covid_month=="mar2022"
(147 real changes made)

. replace calendar_period = 7 if covid_month=="apr2022"
(106 real changes made)

. replace calendar_period = 7 if covid_month=="may2022"
(93 real changes made)

. replace calendar_period = 7 if covid_month=="jun2022"
(93 real changes made)

. replace calendar_period = 7 if covid_month=="jul2022"
(115 real changes made)

. replace calendar_period = 7 if covid_month=="aug2022"
(92 real changes made)

. replace calendar_period = 7 if covid_month=="sep2022"
(110 real changes made)

. replace calendar_period = 0 if case==0
(11,682 real changes made)

. label define calendar_period    0 "Historical comparator"               ///
>                                                                 1 "Feb 20 - Jun 20 SARS-CoV-2"  ///
>                                                                 2 "Jul 20 - Aug 20 SARS-CoV-2"  ///
>                                                                 3 "Sep 20 - Nov 20 SARS-CoV-2"  ///
>                                                                 4 "Dec 20 - Feb 21 SARS-CoV-2"  ///
>                                                                 5 "Mar 21 - Nov 21 SARS-CoV-2"  ///
>                                                                 6 "Dec 21 - Feb 22 SARS-CoV-2"  ///
>                                                                 7 "Mar 22 - Sep 22 SARS-CoV-2"

. label values calendar_period calendar_period

. label var calendar_period "Calendar period"

. safetab calendar_period, m

           Calendar period |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
     Historical comparator |     11,682       63.19       63.19
Feb 20 - Jun 20 SARS-CoV-2 |      1,842        9.96       73.15
Jul 20 - Aug 20 SARS-CoV-2 |        625        3.38       76.53
Sep 20 - Nov 20 SARS-CoV-2 |        816        4.41       80.95
Dec 20 - Feb 21 SARS-CoV-2 |        750        4.06       85.01
Mar 21 - Nov 21 SARS-CoV-2 |      1,607        8.69       93.70
Dec 21 - Feb 22 SARS-CoV-2 |        409        2.21       95.91
Mar 22 - Sep 22 SARS-CoV-2 |        756        4.09      100.00
---------------------------+-----------------------------------
                     Total |     18,487      100.00

. 
. ** Covariates
. * Age
. recode  age                     min/39.9999=1   ///
>                                                 40/49.9999=2    ///
>                                                 50/59.9999=3    ///
>                                                 60/69.9999=4    ///
>                                                 70/79.9999=5    ///                                     
>                                                 80/max=6,               ///
>                                                 gen(agegroup) 
(18487 differences between age and agegroup)

. 
. label define agegroup   1 "18-39"               ///
>                                                 2 "40-49"               ///
>                                                 3 "50-59"               ///
>                                                 4 "60-69"               ///
>                                                 5 "70-79"               ///
>                                                 6 "80+"

. label values agegroup agegroup

. * Check there are no missing ages
. assert age<.

. assert agegroup<.

. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. * Sex
. safetab sex

        sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      9,489       51.33       51.33
       Male |      8,998       48.67      100.00
------------+-----------------------------------
      Total |     18,487      100.00

. safecount
  18,487

. 
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(0 real changes made)

. replace ethnicity=2 if ethnicity==3
(1,376 real changes made)

. replace ethnicity=3 if ethnicity==4
(0 real changes made)

. replace ethnicity=4 if ethnicity==6
(0 real changes made)

. label define ethnicity  1 "White"               ///
>                                                 2 "South Asian" ///                                             
>                                                 3 "Black"               ///
>                                                 4 "Mixed"               ///
>                                                 5 "Other"                                                               

. label values ethnicity ethnicity

. safetab ethnicity, m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     11,128       60.19       60.19
South Asian |      1,376        7.44       67.64
      Other |      1,350        7.30       74.94
          . |      4,633       25.06      100.00
------------+-----------------------------------
      Total |     18,487      100.00

. * Ethnicity (including unknown ethnicity)
. gen ethnicity1 = ethnicity
(4,633 missing values generated)

. replace ethnicity1=6 if ethnicity1==.
(4,633 real changes made)

. label define ethnicity1 1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity1 ethnicity1

. safetab ethnicity1, m

 ethnicity1 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     11,128       60.19       60.19
South Asian |      1,376        7.44       67.64
      Other |      1,350        7.30       74.94
    Unknown |      4,633       25.06      100.00
------------+-----------------------------------
      Total |     18,487      100.00

. 
. * Region
. rename region region_string

. assert inlist(region_string,                                                            ///
>                                         "East Midlands",                                                ///
>                                         "East",                                                                 ///
>                                         "London",                                                               ///
>                                         "North East",                                                   ///
>                                         "North West",                                                   ///
>                                         "South East",                                                   ///
>                                         "South West",                                                   ///
>                                         "West Midlands",                                                ///
>                                         "Yorkshire and The Humber") 

. gen     region = 1 if region_string=="East Midlands"
(16,665 missing values generated)

. replace region = 2 if region_string=="East"
(1,797 real changes made)

. replace region = 3 if region_string=="London"
(3,689 real changes made)

. replace region = 4 if region_string=="North East"
(1,857 real changes made)

. replace region = 5 if region_string=="North West"
(1,869 real changes made)

. replace region = 6 if region_string=="South East"
(1,877 real changes made)

. replace region = 7 if region_string=="South West"
(1,818 real changes made)

. replace region = 8 if region_string=="West Midlands"
(1,838 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(1,920 real changes made)

. 
. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"

. label values region region

. label var region "Region"

. safetab region

                  Region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      1,822        9.86        9.86
                    East |      1,797        9.72       19.58
                  London |      3,689       19.95       39.53
              North East |      1,857       10.04       49.58
              North West |      1,869       10.11       59.69
              South East |      1,877       10.15       69.84
              South West |      1,818        9.83       79.67
           West Midlands |      1,838        9.94       89.61
Yorkshire and The Humber |      1,920       10.39      100.00
-------------------------+-----------------------------------
                   Total |     18,487      100.00

. 
. * STP
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(18,456 missing values generated)

. replace stp = sum(stp)
(18,486 real changes made)

. drop stp_old

. 
. * Rural/urban
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. safetab rural_urban, m

                            rural_urban |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                Urban major conurbation |      1,852       10.02       10.02
                Urban minor conurbation |      1,818        9.83       19.85
                    Urban city and town |      1,841        9.96       29.81
Urban city and town in a sparse setting |      1,802        9.75       39.56
                  Rural town and fringe |      1,853       10.02       49.58
Rural town and fringe in a sparse setti |      1,865       10.09       59.67
            Rural village and dispersed |      3,753       20.30       79.97
Rural village and dispersed in a sparse |      3,703       20.03      100.00
----------------------------------------+-----------------------------------
                                  Total |     18,487      100.00

. * Urbanicity (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urbanicity=.
(18,487 missing values generated)

. replace urbanicity=1 if rural_urban<=4|rural_urban==.
(7,313 real changes made)

. replace urbanicity=0 if rural_urban>4 & rural_urban!=.
(11,174 real changes made)

. label define urbanicity 0 "Rural" 1 "Urban"

. label values urbanicity urbanicity

. safetab urbanicity rural_urban, m

           |                                       rural_urban
urbanicity | Urban maj  Urban min  Urban cit  Urban cit  Rural tow  Rural tow  Rural vil  Rural vil |     Total
-----------+----------------------------------------------------------------------------------------+----------
     Rural |         0          0          0          0      1,853      1,865      3,753      3,703 |    11,174 
     Urban |     1,852      1,818      1,841      1,802          0          0          0          0 |     7,313 
-----------+----------------------------------------------------------------------------------------+----------
     Total |     1,852      1,818      1,841      1,802      1,853      1,865      3,753      3,703 |    18,487 

. label var urbanicity "Urbanicity"

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived" .u "Unknown"

. label values imd imd

. safetab imd

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               0 |        926        5.01        5.01
 1 Most deprived |      3,504       18.95       23.96
               2 |      3,485       18.85       42.81
               3 |      3,599       19.47       62.28
               4 |      3,505       18.96       81.24
5 Least deprived |      3,468       18.76      100.00
-----------------+-----------------------------------
           Total |     18,487      100.00

. 
. * BMI
. replace body_mass_index = . if !inrange(body_mass_index, 15, 50)
(1,894 real changes made, 1,894 to missing)

. gen     bmicat = .
(18,487 missing values generated)

. recode  bmicat . = 1 if body_mass_index<18.5
(1091 changes made to bmicat)

. recode  bmicat . = 2 if body_mass_index<25
(4200 changes made to bmicat)

. recode  bmicat . = 3 if body_mass_index<30
(4416 changes made to bmicat)

. recode  bmicat . = 4 if body_mass_index<35
(3660 changes made to bmicat)

. recode  bmicat . = 5 if body_mass_index<40
(2164 changes made to bmicat)

. recode  bmicat . = 6 if body_mass_index<.
(1062 changes made to bmicat)

. replace bmicat = . if body_mass_index>=.
(0 real changes made)

. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                             

. label values bmicat bmicat

. * Obesity
. recode bmicat 1/3 . = 1 4=2 5=3 6=4, gen(obese4cat)
(17396 differences between bmicat and obese4cat)

. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. gen obese4cat_withmiss = obese4cat

. replace obese4cat_withmiss =. if bmicat ==.
(1,894 real changes made, 1,894 to missing)

. 
. * Smoking
. gen ever_smoked = 1 if smoking_status=="S"
(16,252 missing values generated)

. replace ever_smoked = 1 if smoking_status=="E"
(393 real changes made)

. replace ever_smoked = 0 if smoking_status=="N"
(726 real changes made)

. replace ever_smoked = . if smoking_status=="M"
(0 real changes made)

. label define smoking_label 1 "Current/former smoker" 0 "Non-smoker"

. label values ever_smoked smoking_label

. label var ever_smoked "Smoking status"

. 
end of do-file

