-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/split_stps_2017.log
  log type:  text
 opened on:   2 Dec 2022, 12:24:24

. 
. 
. *(1)=========Split cases into separate stp files============
. import delimited ./output/covid_matching_2017.csv, clear
(11 vars, 16,020 obs)

. 
. foreach i of numlist 1/4 {
  2.         preserve
  3.                 capture noisily keep if period==`i'
  4.                 capture noisily export delimited using "./output/input_cov
> id_matching_2017`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(11,882 observations deleted)
(note: file ./output/input_covid_matching_20171.csv not found)
file ./output/input_covid_matching_20171.csv saved
  4,138
(11,002 observations deleted)
(note: file ./output/input_covid_matching_20172.csv not found)
file ./output/input_covid_matching_20172.csv saved
  5,018
(13,659 observations deleted)
(note: file ./output/input_covid_matching_20173.csv not found)
file ./output/input_covid_matching_20173.csv saved
  2,361
(11,517 observations deleted)
(note: file ./output/input_covid_matching_20174.csv not found)
file ./output/input_covid_matching_20174.csv saved
  4,503

. 
. import delimited ./output/input_covid1_matching_2017.csv, clear
(11 vars, 4,138 obs)

. *stps are coded E54000005-9, 10, 12-17, 20-27, 29, 33, 35-37, 40-44, 49
. *files need to be .csv format as this is what the matching program needs as i
> nput
. foreach i of numlist 5/9 {
  2.         preserve
  3.                 capture noisily keep if stp=="E5400000`i'"
  4.                 capture noisily export delimited using "./output/input_cov
> id1_matching_2017_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(3,998 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp5.csv not found)
file ./output/input_covid1_matching_2017_stp5.csv saved
  140
(3,988 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp6.csv not found)
file ./output/input_covid1_matching_2017_stp6.csv saved
  150
(4,029 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp7.csv not found)
file ./output/input_covid1_matching_2017_stp7.csv saved
  109
(3,993 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp8.csv not found)
file ./output/input_covid1_matching_2017_stp8.csv saved
  145
(4,013 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp9.csv not found)
file ./output/input_covid1_matching_2017_stp9.csv saved
  125

. 
. foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         preserve
  3.                 capture noisily keep if stp=="E540000`i'"
  4.                 capture noisily export delimited using "./output/input_cov
> id1_matching_2017_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(3,995 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp10.csv not found)
file ./output/input_covid1_matching_2017_stp10.csv saved
  143
(4,001 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp12.csv not found)
file ./output/input_covid1_matching_2017_stp12.csv saved
  137
(4,004 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp13.csv not found)
file ./output/input_covid1_matching_2017_stp13.csv saved
  134
(4,017 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp14.csv not found)
file ./output/input_covid1_matching_2017_stp14.csv saved
  121
(4,004 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp15.csv not found)
file ./output/input_covid1_matching_2017_stp15.csv saved
  134
(3,991 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp16.csv not found)
file ./output/input_covid1_matching_2017_stp16.csv saved
  147
(4,010 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp17.csv not found)
file ./output/input_covid1_matching_2017_stp17.csv saved
  128
(4,002 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp20.csv not found)
file ./output/input_covid1_matching_2017_stp20.csv saved
  136
(3,995 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp21.csv not found)
file ./output/input_covid1_matching_2017_stp21.csv saved
  143
(3,997 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp22.csv not found)
file ./output/input_covid1_matching_2017_stp22.csv saved
  141
(4,011 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp23.csv not found)
file ./output/input_covid1_matching_2017_stp23.csv saved
  127
(3,997 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp24.csv not found)
file ./output/input_covid1_matching_2017_stp24.csv saved
  141
(4,016 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp25.csv not found)
file ./output/input_covid1_matching_2017_stp25.csv saved
  122
(4,003 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp26.csv not found)
file ./output/input_covid1_matching_2017_stp26.csv saved
  135
(4,001 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp27.csv not found)
file ./output/input_covid1_matching_2017_stp27.csv saved
  137
(4,000 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp29.csv not found)
file ./output/input_covid1_matching_2017_stp29.csv saved
  138
(4,022 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp33.csv not found)
file ./output/input_covid1_matching_2017_stp33.csv saved
  116
(3,997 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp35.csv not found)
file ./output/input_covid1_matching_2017_stp35.csv saved
  141
(4,009 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp36.csv not found)
file ./output/input_covid1_matching_2017_stp36.csv saved
  129
(4,003 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp37.csv not found)
file ./output/input_covid1_matching_2017_stp37.csv saved
  135
(4,004 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp40.csv not found)
file ./output/input_covid1_matching_2017_stp40.csv saved
  134
(4,006 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp41.csv not found)
file ./output/input_covid1_matching_2017_stp41.csv saved
  132
(3,997 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp42.csv not found)
file ./output/input_covid1_matching_2017_stp42.csv saved
  141
(4,019 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp43.csv not found)
file ./output/input_covid1_matching_2017_stp43.csv saved
  119
(4,005 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp44.csv not found)
file ./output/input_covid1_matching_2017_stp44.csv saved
  133
(4,013 observations deleted)
(note: file ./output/input_covid1_matching_2017_stp49.csv not found)
file ./output/input_covid1_matching_2017_stp49.csv saved
  125

. 
. import delimited ./output/input_covid2_matching_2017.csv, clear
(11 vars, 5,018 obs)

. foreach i of numlist 5/9 {
  2.         preserve
  3.                 capture noisily keep if stp=="E5400000`i'"
  4.                 capture noisily export delimited using "./output/input_cov
> id2_matching_2017_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(4,824 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp5.csv not found)
file ./output/input_covid2_matching_2017_stp5.csv saved
  194
(4,870 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp6.csv not found)
file ./output/input_covid2_matching_2017_stp6.csv saved
  148
(4,858 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp7.csv not found)
file ./output/input_covid2_matching_2017_stp7.csv saved
  160
(4,870 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp8.csv not found)
file ./output/input_covid2_matching_2017_stp8.csv saved
  148
(4,865 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp9.csv not found)
file ./output/input_covid2_matching_2017_stp9.csv saved
  153

. 
. foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         preserve
  3.                 capture noisily keep if stp=="E540000`i'"
  4.                 capture noisily export delimited using "./output/input_cov
> id2_matching_2017_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(4,855 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp10.csv not found)
file ./output/input_covid2_matching_2017_stp10.csv saved
  163
(4,839 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp12.csv not found)
file ./output/input_covid2_matching_2017_stp12.csv saved
  179
(4,863 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp13.csv not found)
file ./output/input_covid2_matching_2017_stp13.csv saved
  155
(4,835 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp14.csv not found)
file ./output/input_covid2_matching_2017_stp14.csv saved
  183
(4,859 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp15.csv not found)
file ./output/input_covid2_matching_2017_stp15.csv saved
  159
(4,860 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp16.csv not found)
file ./output/input_covid2_matching_2017_stp16.csv saved
  158
(4,850 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp17.csv not found)
file ./output/input_covid2_matching_2017_stp17.csv saved
  168
(4,866 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp20.csv not found)
file ./output/input_covid2_matching_2017_stp20.csv saved
  152
(4,863 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp21.csv not found)
file ./output/input_covid2_matching_2017_stp21.csv saved
  155
(4,868 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp22.csv not found)
file ./output/input_covid2_matching_2017_stp22.csv saved
  150
(4,845 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp23.csv not found)
file ./output/input_covid2_matching_2017_stp23.csv saved
  173
(4,842 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp24.csv not found)
file ./output/input_covid2_matching_2017_stp24.csv saved
  176
(4,863 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp25.csv not found)
file ./output/input_covid2_matching_2017_stp25.csv saved
  155
(4,855 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp26.csv not found)
file ./output/input_covid2_matching_2017_stp26.csv saved
  163
(4,853 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp27.csv not found)
file ./output/input_covid2_matching_2017_stp27.csv saved
  165
(4,877 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp29.csv not found)
file ./output/input_covid2_matching_2017_stp29.csv saved
  141
(4,849 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp33.csv not found)
file ./output/input_covid2_matching_2017_stp33.csv saved
  169
(4,866 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp35.csv not found)
file ./output/input_covid2_matching_2017_stp35.csv saved
  152
(4,836 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp36.csv not found)
file ./output/input_covid2_matching_2017_stp36.csv saved
  182
(4,859 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp37.csv not found)
file ./output/input_covid2_matching_2017_stp37.csv saved
  159
(4,863 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp40.csv not found)
file ./output/input_covid2_matching_2017_stp40.csv saved
  155
(4,857 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp41.csv not found)
file ./output/input_covid2_matching_2017_stp41.csv saved
  161
(4,867 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp42.csv not found)
file ./output/input_covid2_matching_2017_stp42.csv saved
  151
(4,844 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp43.csv not found)
file ./output/input_covid2_matching_2017_stp43.csv saved
  174
(4,860 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp44.csv not found)
file ./output/input_covid2_matching_2017_stp44.csv saved
  158
(4,859 observations deleted)
(note: file ./output/input_covid2_matching_2017_stp49.csv not found)
file ./output/input_covid2_matching_2017_stp49.csv saved
  159

. 
. import delimited ./output/input_covid3_matching_2017.csv, clear
(11 vars, 2,361 obs)

. foreach i of numlist 5/9 {
  2.         preserve
  3.                 capture noisily keep if stp=="E5400000`i'"
  4.                 capture noisily export delimited using "./output/input_cov
> id3_matching_2017_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(2,284 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp5.csv not found)
file ./output/input_covid3_matching_2017_stp5.csv saved
  77
(2,297 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp6.csv not found)
file ./output/input_covid3_matching_2017_stp6.csv saved
  64
(2,280 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp7.csv not found)
file ./output/input_covid3_matching_2017_stp7.csv saved
  81
(2,277 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp8.csv not found)
file ./output/input_covid3_matching_2017_stp8.csv saved
  84
(2,271 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp9.csv not found)
file ./output/input_covid3_matching_2017_stp9.csv saved
  90

. 
. foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         preserve
  3.                 capture noisily keep if stp=="E540000`i'"
  4.                 capture noisily export delimited using "./output/input_cov
> id3_matching_2017_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(2,289 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp10.csv not found)
file ./output/input_covid3_matching_2017_stp10.csv saved
  72
(2,288 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp12.csv not found)
file ./output/input_covid3_matching_2017_stp12.csv saved
  73
(2,290 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp13.csv not found)
file ./output/input_covid3_matching_2017_stp13.csv saved
  71
(2,273 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp14.csv not found)
file ./output/input_covid3_matching_2017_stp14.csv saved
  88
(2,278 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp15.csv not found)
file ./output/input_covid3_matching_2017_stp15.csv saved
  83
(2,288 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp16.csv not found)
file ./output/input_covid3_matching_2017_stp16.csv saved
  73
(2,284 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp17.csv not found)
file ./output/input_covid3_matching_2017_stp17.csv saved
  77
(2,277 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp20.csv not found)
file ./output/input_covid3_matching_2017_stp20.csv saved
  84
(2,290 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp21.csv not found)
file ./output/input_covid3_matching_2017_stp21.csv saved
  71
(2,286 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp22.csv not found)
file ./output/input_covid3_matching_2017_stp22.csv saved
  75
(2,291 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp23.csv not found)
file ./output/input_covid3_matching_2017_stp23.csv saved
  70
(2,298 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp24.csv not found)
file ./output/input_covid3_matching_2017_stp24.csv saved
  63
(2,280 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp25.csv not found)
file ./output/input_covid3_matching_2017_stp25.csv saved
  81
(2,288 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp26.csv not found)
file ./output/input_covid3_matching_2017_stp26.csv saved
  73
(2,281 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp27.csv not found)
file ./output/input_covid3_matching_2017_stp27.csv saved
  80
(2,281 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp29.csv not found)
file ./output/input_covid3_matching_2017_stp29.csv saved
  80
(2,273 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp33.csv not found)
file ./output/input_covid3_matching_2017_stp33.csv saved
  88
(2,282 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp35.csv not found)
file ./output/input_covid3_matching_2017_stp35.csv saved
  79
(2,297 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp36.csv not found)
file ./output/input_covid3_matching_2017_stp36.csv saved
  64
(2,294 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp37.csv not found)
file ./output/input_covid3_matching_2017_stp37.csv saved
  67
(2,278 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp40.csv not found)
file ./output/input_covid3_matching_2017_stp40.csv saved
  83
(2,285 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp41.csv not found)
file ./output/input_covid3_matching_2017_stp41.csv saved
  76
(2,293 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp42.csv not found)
file ./output/input_covid3_matching_2017_stp42.csv saved
  68
(2,294 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp43.csv not found)
file ./output/input_covid3_matching_2017_stp43.csv saved
  67
(2,286 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp44.csv not found)
file ./output/input_covid3_matching_2017_stp44.csv saved
  75
(2,277 observations deleted)
(note: file ./output/input_covid3_matching_2017_stp49.csv not found)
file ./output/input_covid3_matching_2017_stp49.csv saved
  84

. 
. import delimited ./output/input_covid4_matching_2017.csv, clear
(11 vars, 4,503 obs)

. foreach i of numlist 5/9 {
  2.         preserve
  3.                 capture noisily keep if stp=="E5400000`i'"
  4.                 capture noisily export delimited using "./output/input_cov
> id4_matching_2017_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(4,344 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp5.csv not found)
file ./output/input_covid4_matching_2017_stp5.csv saved
  159
(4,350 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp6.csv not found)
file ./output/input_covid4_matching_2017_stp6.csv saved
  153
(4,338 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp7.csv not found)
file ./output/input_covid4_matching_2017_stp7.csv saved
  165
(4,365 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp8.csv not found)
file ./output/input_covid4_matching_2017_stp8.csv saved
  138
(4,356 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp9.csv not found)
file ./output/input_covid4_matching_2017_stp9.csv saved
  147

. 
. foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         preserve
  3.                 capture noisily keep if stp=="E540000`i'"
  4.                 capture noisily export delimited using "./output/input_cov
> id4_matching_2017_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(4,366 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp10.csv not found)
file ./output/input_covid4_matching_2017_stp10.csv saved
  137
(4,377 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp12.csv not found)
file ./output/input_covid4_matching_2017_stp12.csv saved
  126
(4,348 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp13.csv not found)
file ./output/input_covid4_matching_2017_stp13.csv saved
  155
(4,380 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp14.csv not found)
file ./output/input_covid4_matching_2017_stp14.csv saved
  123
(4,364 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp15.csv not found)
file ./output/input_covid4_matching_2017_stp15.csv saved
  139
(4,366 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp16.csv not found)
file ./output/input_covid4_matching_2017_stp16.csv saved
  137
(4,361 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp17.csv not found)
file ./output/input_covid4_matching_2017_stp17.csv saved
  142
(4,360 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp20.csv not found)
file ./output/input_covid4_matching_2017_stp20.csv saved
  143
(4,357 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp21.csv not found)
file ./output/input_covid4_matching_2017_stp21.csv saved
  146
(4,354 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp22.csv not found)
file ./output/input_covid4_matching_2017_stp22.csv saved
  149
(4,358 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp23.csv not found)
file ./output/input_covid4_matching_2017_stp23.csv saved
  145
(4,368 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp24.csv not found)
file ./output/input_covid4_matching_2017_stp24.csv saved
  135
(4,346 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp25.csv not found)
file ./output/input_covid4_matching_2017_stp25.csv saved
  157
(4,359 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp26.csv not found)
file ./output/input_covid4_matching_2017_stp26.csv saved
  144
(4,370 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp27.csv not found)
file ./output/input_covid4_matching_2017_stp27.csv saved
  133
(4,347 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp29.csv not found)
file ./output/input_covid4_matching_2017_stp29.csv saved
  156
(4,361 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp33.csv not found)
file ./output/input_covid4_matching_2017_stp33.csv saved
  142
(4,360 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp35.csv not found)
file ./output/input_covid4_matching_2017_stp35.csv saved
  143
(4,363 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp36.csv not found)
file ./output/input_covid4_matching_2017_stp36.csv saved
  140
(4,349 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp37.csv not found)
file ./output/input_covid4_matching_2017_stp37.csv saved
  154
(4,360 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp40.csv not found)
file ./output/input_covid4_matching_2017_stp40.csv saved
  143
(4,357 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp41.csv not found)
file ./output/input_covid4_matching_2017_stp41.csv saved
  146
(4,348 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp42.csv not found)
file ./output/input_covid4_matching_2017_stp42.csv saved
  155
(4,348 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp43.csv not found)
file ./output/input_covid4_matching_2017_stp43.csv saved
  155
(4,354 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp44.csv not found)
file ./output/input_covid4_matching_2017_stp44.csv saved
  149
(4,356 observations deleted)
(note: file ./output/input_covid4_matching_2017_stp49.csv not found)
file ./output/input_covid4_matching_2017_stp49.csv saved
  147

. 
. 
. *(2)=========Split controls into separate stp files============
. import delimited ./output/2017_matching.csv, clear
(7 vars, 28,967 obs)

. 
.         *stps are coded E54000005-9, 10, 12-17, 20-27, 29, 33, 35-37, 40-44, 
> 49
. foreach i of numlist 5/9  {
  2.         preserve
  3.                 capture noisily keep if stp=="E5400000`i'"
  4.                 capture noisily export delimited using "./output/input_201
> 7_matching_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(27,990 observations deleted)
(note: file ./output/input_2017_matching_stp5.csv not found)
file ./output/input_2017_matching_stp5.csv saved
  977
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp6.csv not found)
file ./output/input_2017_matching_stp6.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp7.csv not found)
file ./output/input_2017_matching_stp7.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp8.csv not found)
file ./output/input_2017_matching_stp8.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp9.csv not found)
file ./output/input_2017_matching_stp9.csv saved
  933

. 
. foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         preserve
  3.                 capture noisily keep if stp=="E540000`i'"
  4.                 capture noisily export delimited using "./output/input_201
> 7_matching_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp10.csv not found)
file ./output/input_2017_matching_stp10.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp12.csv not found)
file ./output/input_2017_matching_stp12.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp13.csv not found)
file ./output/input_2017_matching_stp13.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp14.csv not found)
file ./output/input_2017_matching_stp14.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp15.csv not found)
file ./output/input_2017_matching_stp15.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp16.csv not found)
file ./output/input_2017_matching_stp16.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp17.csv not found)
file ./output/input_2017_matching_stp17.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp20.csv not found)
file ./output/input_2017_matching_stp20.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp21.csv not found)
file ./output/input_2017_matching_stp21.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp22.csv not found)
file ./output/input_2017_matching_stp22.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp23.csv not found)
file ./output/input_2017_matching_stp23.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp24.csv not found)
file ./output/input_2017_matching_stp24.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp25.csv not found)
file ./output/input_2017_matching_stp25.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp26.csv not found)
file ./output/input_2017_matching_stp26.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp27.csv not found)
file ./output/input_2017_matching_stp27.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp29.csv not found)
file ./output/input_2017_matching_stp29.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp33.csv not found)
file ./output/input_2017_matching_stp33.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp35.csv not found)
file ./output/input_2017_matching_stp35.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp36.csv not found)
file ./output/input_2017_matching_stp36.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp37.csv not found)
file ./output/input_2017_matching_stp37.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp40.csv not found)
file ./output/input_2017_matching_stp40.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp41.csv not found)
file ./output/input_2017_matching_stp41.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp42.csv not found)
file ./output/input_2017_matching_stp42.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp43.csv not found)
file ./output/input_2017_matching_stp43.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp44.csv not found)
file ./output/input_2017_matching_stp44.csv saved
  933
(28,034 observations deleted)
(note: file ./output/input_2017_matching_stp49.csv not found)
file ./output/input_2017_matching_stp49.csv saved
  933

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/split_stps_2017.log
  log type:  text
 closed on:   2 Dec 2022, 12:24:26
-------------------------------------------------------------------------------
