-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/split_stps_may2021.log
  log type:  text
 opened on:  20 Oct 2022, 11:03:18

. 
. 
. *(1)=========Split cases into separate stp files============
. import delimited ./output/covid_matching_may2021.csv, clear
(11 vars, 8,990 obs)

. 
. *stps are coded E54000005-9, 10, 12-17, 20-27, 29, 33, 35-37, 40-44, 49
. *files need to be .csv format as this is what the matching program needs as i
> nput
. foreach i of numlist 5/9 {
  2.         preserve
  3.                 capture noisily keep if stp=="E5400000`i'"
  4.                 capture noisily export delimited using "./output/input_cov
> id_matching_stp`i'_may2021.csv", replace
  5.                 count
  6.         restore
  7. }
(8,670 observations deleted)
(note: file ./output/input_covid_matching_stp5_may2021.csv not found)
file ./output/input_covid_matching_stp5_may2021.csv saved
  320
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp6_may2021.csv not found)
file ./output/input_covid_matching_stp6_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp7_may2021.csv not found)
file ./output/input_covid_matching_stp7_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp8_may2021.csv not found)
file ./output/input_covid_matching_stp8_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp9_may2021.csv not found)
file ./output/input_covid_matching_stp9_may2021.csv saved
  289

. 
. foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         preserve
  3.                 capture noisily keep if stp=="E540000`i'"
  4.                 capture noisily export delimited using "./output/input_cov
> id_matching_stp`i'_may2021.csv", replace
  5.                 count
  6.         restore
  7. }
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp10_may2021.csv not found)
file ./output/input_covid_matching_stp10_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp12_may2021.csv not found)
file ./output/input_covid_matching_stp12_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp13_may2021.csv not found)
file ./output/input_covid_matching_stp13_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp14_may2021.csv not found)
file ./output/input_covid_matching_stp14_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp15_may2021.csv not found)
file ./output/input_covid_matching_stp15_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp16_may2021.csv not found)
file ./output/input_covid_matching_stp16_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp17_may2021.csv not found)
file ./output/input_covid_matching_stp17_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp20_may2021.csv not found)
file ./output/input_covid_matching_stp20_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp21_may2021.csv not found)
file ./output/input_covid_matching_stp21_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp22_may2021.csv not found)
file ./output/input_covid_matching_stp22_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp23_may2021.csv not found)
file ./output/input_covid_matching_stp23_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp24_may2021.csv not found)
file ./output/input_covid_matching_stp24_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp25_may2021.csv not found)
file ./output/input_covid_matching_stp25_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp26_may2021.csv not found)
file ./output/input_covid_matching_stp26_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp27_may2021.csv not found)
file ./output/input_covid_matching_stp27_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp29_may2021.csv not found)
file ./output/input_covid_matching_stp29_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp33_may2021.csv not found)
file ./output/input_covid_matching_stp33_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp35_may2021.csv not found)
file ./output/input_covid_matching_stp35_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp36_may2021.csv not found)
file ./output/input_covid_matching_stp36_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp37_may2021.csv not found)
file ./output/input_covid_matching_stp37_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp40_may2021.csv not found)
file ./output/input_covid_matching_stp40_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp41_may2021.csv not found)
file ./output/input_covid_matching_stp41_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp42_may2021.csv not found)
file ./output/input_covid_matching_stp42_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp43_may2021.csv not found)
file ./output/input_covid_matching_stp43_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp44_may2021.csv not found)
file ./output/input_covid_matching_stp44_may2021.csv saved
  289
(8,701 observations deleted)
(note: file ./output/input_covid_matching_stp49_may2021.csv not found)
file ./output/input_covid_matching_stp49_may2021.csv saved
  289

. 
. *(2)=========Split controls into separate stp files============
. import delimited ./output/contemporary_matching_may2021.csv, clear
(15 vars, 28,901 obs)

. 
.         *stps are coded E54000005-9, 10, 12-17, 20-27, 29, 33, 35-37, 40-44, 
> 49
. foreach i of numlist 5/9  {
  2.         preserve
  3.                 capture noisily keep if stp=="E5400000`i'"
  4.                 capture noisily export delimited using "./output/input_con
> temporary_matching_stp`i'_may2021.csv", replace
  5.                 count
  6.         restore
  7. }
(27,930 observations deleted)
(note: file ./output/input_contemporary_matching_stp5_may2021.csv not found)
file ./output/input_contemporary_matching_stp5_may2021.csv saved
  971
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp6_may2021.csv not found)
file ./output/input_contemporary_matching_stp6_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp7_may2021.csv not found)
file ./output/input_contemporary_matching_stp7_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp8_may2021.csv not found)
file ./output/input_contemporary_matching_stp8_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp9_may2021.csv not found)
file ./output/input_contemporary_matching_stp9_may2021.csv saved
  931

. 
. foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         preserve
  3.                 capture noisily keep if stp=="E540000`i'"
  4.                 capture noisily export delimited using "./output/input_con
> temporary_matching_stp`i'_may2021.csv", replace
  5.                 count
  6.         restore
  7. }
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp10_may2021.csv not found)
file ./output/input_contemporary_matching_stp10_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp12_may2021.csv not found)
file ./output/input_contemporary_matching_stp12_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp13_may2021.csv not found)
file ./output/input_contemporary_matching_stp13_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp14_may2021.csv not found)
file ./output/input_contemporary_matching_stp14_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp15_may2021.csv not found)
file ./output/input_contemporary_matching_stp15_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp16_may2021.csv not found)
file ./output/input_contemporary_matching_stp16_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp17_may2021.csv not found)
file ./output/input_contemporary_matching_stp17_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp20_may2021.csv not found)
file ./output/input_contemporary_matching_stp20_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp21_may2021.csv not found)
file ./output/input_contemporary_matching_stp21_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp22_may2021.csv not found)
file ./output/input_contemporary_matching_stp22_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp23_may2021.csv not found)
file ./output/input_contemporary_matching_stp23_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp24_may2021.csv not found)
file ./output/input_contemporary_matching_stp24_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp25_may2021.csv not found)
file ./output/input_contemporary_matching_stp25_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp26_may2021.csv not found)
file ./output/input_contemporary_matching_stp26_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp27_may2021.csv not found)
file ./output/input_contemporary_matching_stp27_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp29_may2021.csv not found)
file ./output/input_contemporary_matching_stp29_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp33_may2021.csv not found)
file ./output/input_contemporary_matching_stp33_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp35_may2021.csv not found)
file ./output/input_contemporary_matching_stp35_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp36_may2021.csv not found)
file ./output/input_contemporary_matching_stp36_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp37_may2021.csv not found)
file ./output/input_contemporary_matching_stp37_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp40_may2021.csv not found)
file ./output/input_contemporary_matching_stp40_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp41_may2021.csv not found)
file ./output/input_contemporary_matching_stp41_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp42_may2021.csv not found)
file ./output/input_contemporary_matching_stp42_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp43_may2021.csv not found)
file ./output/input_contemporary_matching_stp43_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp44_may2021.csv not found)
file ./output/input_contemporary_matching_stp44_may2021.csv saved
  931
(27,970 observations deleted)
(note: file ./output/input_contemporary_matching_stp49_may2021.csv not found)
file ./output/input_contemporary_matching_stp49_may2021.csv saved
  931

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/split_stps_may2021.log
  log type:  text
 closed on:  20 Oct 2022, 11:03:19
-------------------------------------------------------------------------------
