------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/split_stps_2017.log
  log type:  text
 opened on:  24 Oct 2022, 00:53:27

. 
. 
. *(1)=========Split cases into separate stp files============
. import delimited ./output/covid_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(11 vars, 16,031 obs)

. 
. *stps are coded E54000005-9, 10, 12-17, 20-27, 29, 33, 35-37, 40-44, 49
. *files need to be .csv format as this is what the matching program needs as input
. foreach i of numlist 5/9 {
  2.         preserve
  3.                 capture noisily keep if stp=="E5400000`i'"
  4.                 capture noisily export delimited using "./output/input_covid_2017_matching_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(15,480 observations deleted)
(file ./output/input_covid_2017_matching_stp5.csv not found)
file ./output/input_covid_2017_matching_stp5.csv saved
  551
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp6.csv not found)
file ./output/input_covid_2017_matching_stp6.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp7.csv not found)
file ./output/input_covid_2017_matching_stp7.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp8.csv not found)
file ./output/input_covid_2017_matching_stp8.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp9.csv not found)
file ./output/input_covid_2017_matching_stp9.csv saved
  516

. 
. foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         preserve
  3.                 capture noisily keep if stp=="E540000`i'"
  4.                 capture noisily export delimited using "./output/input_covid_2017_matching_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp10.csv not found)
file ./output/input_covid_2017_matching_stp10.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp12.csv not found)
file ./output/input_covid_2017_matching_stp12.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp13.csv not found)
file ./output/input_covid_2017_matching_stp13.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp14.csv not found)
file ./output/input_covid_2017_matching_stp14.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp15.csv not found)
file ./output/input_covid_2017_matching_stp15.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp16.csv not found)
file ./output/input_covid_2017_matching_stp16.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp17.csv not found)
file ./output/input_covid_2017_matching_stp17.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp20.csv not found)
file ./output/input_covid_2017_matching_stp20.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp21.csv not found)
file ./output/input_covid_2017_matching_stp21.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp22.csv not found)
file ./output/input_covid_2017_matching_stp22.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp23.csv not found)
file ./output/input_covid_2017_matching_stp23.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp24.csv not found)
file ./output/input_covid_2017_matching_stp24.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp25.csv not found)
file ./output/input_covid_2017_matching_stp25.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp26.csv not found)
file ./output/input_covid_2017_matching_stp26.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp27.csv not found)
file ./output/input_covid_2017_matching_stp27.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp29.csv not found)
file ./output/input_covid_2017_matching_stp29.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp33.csv not found)
file ./output/input_covid_2017_matching_stp33.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp35.csv not found)
file ./output/input_covid_2017_matching_stp35.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp36.csv not found)
file ./output/input_covid_2017_matching_stp36.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp37.csv not found)
file ./output/input_covid_2017_matching_stp37.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp40.csv not found)
file ./output/input_covid_2017_matching_stp40.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp41.csv not found)
file ./output/input_covid_2017_matching_stp41.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp42.csv not found)
file ./output/input_covid_2017_matching_stp42.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp43.csv not found)
file ./output/input_covid_2017_matching_stp43.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp44.csv not found)
file ./output/input_covid_2017_matching_stp44.csv saved
  516
(15,515 observations deleted)
(file ./output/input_covid_2017_matching_stp49.csv not found)
file ./output/input_covid_2017_matching_stp49.csv saved
  516

. 
. *(2)=========Split controls into separate stp files============
. import delimited ./output/2017_matching.csv, clear
(encoding automatically selected: ISO-8859-1)
(8 vars, 28,888 obs)

. 
.         *stps are coded E54000005-9, 10, 12-17, 20-27, 29, 33, 35-37, 40-44, 49
. foreach i of numlist 5/9  {
  2.         preserve
  3.                 capture noisily keep if stp=="E5400000`i'"
  4.                 capture noisily export delimited using "./output/input_2017_matching_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(27,900 observations deleted)
file ./output/input_2017_matching_stp5.csv saved
  988
(27,958 observations deleted)
file ./output/input_2017_matching_stp6.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp7.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp8.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp9.csv saved
  930

. 
. foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         preserve
  3.                 capture noisily keep if stp=="E540000`i'"
  4.                 capture noisily export delimited using "./output/input_2017_matching_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(27,958 observations deleted)
file ./output/input_2017_matching_stp10.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp12.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp13.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp14.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp15.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp16.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp17.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp20.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp21.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp22.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp23.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp24.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp25.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp26.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp27.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp29.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp33.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp35.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp36.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp37.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp40.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp41.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp42.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp43.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp44.csv saved
  930
(27,958 observations deleted)
file ./output/input_2017_matching_stp49.csv saved
  930

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repos\logs/split_stps_2017.log
  log type:  text
 closed on:  24 Oct 2022, 00:53:32
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
