-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/split_stps.log
  log type:  text
 opened on:  15 Sep 2022, 14:47:48

. 
. 
. *(1)=========Split cases into separate stp files============
. import delimited ./output/covid_matching.csv, clear
(6 vars, 13,224 obs)

. 
. *stps are coded E54000005-9, 10, 12-17, 20-27, 29, 33, 35-37, 40-44, 49
. *files need to be .csv format as this is what the matching program needs as i
> nput
. foreach i of numlist 5/9 {
  2.         preserve
  3.                 capture noisily keep if stp=="E5400000`i'"
  4.                 capture noisily export delimited using "./output/input_cov
> id_matching_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(12,750 observations deleted)
(note: file ./output/input_covid_matching_stp5.csv not found)
file ./output/input_covid_matching_stp5.csv saved
  474
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp6.csv not found)
file ./output/input_covid_matching_stp6.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp7.csv not found)
file ./output/input_covid_matching_stp7.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp8.csv not found)
file ./output/input_covid_matching_stp8.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp9.csv not found)
file ./output/input_covid_matching_stp9.csv saved
  425

. 
. foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         preserve
  3.                 capture noisily keep if stp=="E540000`i'"
  4.                 capture noisily export delimited using "./output/input_cov
> id_matching_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp10.csv not found)
file ./output/input_covid_matching_stp10.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp12.csv not found)
file ./output/input_covid_matching_stp12.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp13.csv not found)
file ./output/input_covid_matching_stp13.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp14.csv not found)
file ./output/input_covid_matching_stp14.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp15.csv not found)
file ./output/input_covid_matching_stp15.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp16.csv not found)
file ./output/input_covid_matching_stp16.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp17.csv not found)
file ./output/input_covid_matching_stp17.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp20.csv not found)
file ./output/input_covid_matching_stp20.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp21.csv not found)
file ./output/input_covid_matching_stp21.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp22.csv not found)
file ./output/input_covid_matching_stp22.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp23.csv not found)
file ./output/input_covid_matching_stp23.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp24.csv not found)
file ./output/input_covid_matching_stp24.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp25.csv not found)
file ./output/input_covid_matching_stp25.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp26.csv not found)
file ./output/input_covid_matching_stp26.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp27.csv not found)
file ./output/input_covid_matching_stp27.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp29.csv not found)
file ./output/input_covid_matching_stp29.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp33.csv not found)
file ./output/input_covid_matching_stp33.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp35.csv not found)
file ./output/input_covid_matching_stp35.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp36.csv not found)
file ./output/input_covid_matching_stp36.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp37.csv not found)
file ./output/input_covid_matching_stp37.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp40.csv not found)
file ./output/input_covid_matching_stp40.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp41.csv not found)
file ./output/input_covid_matching_stp41.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp42.csv not found)
file ./output/input_covid_matching_stp42.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp43.csv not found)
file ./output/input_covid_matching_stp43.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp44.csv not found)
file ./output/input_covid_matching_stp44.csv saved
  425
(12,799 observations deleted)
(note: file ./output/input_covid_matching_stp49.csv not found)
file ./output/input_covid_matching_stp49.csv saved
  425

. 
. *(2)=========Split controls into separate stp files============
. import delimited ./output/contemporary_matching.csv, clear
(5 vars, 28,985 obs)

. 
.         *stps are coded E54000005-9, 10, 12-17, 20-27, 29, 33, 35-37, 40-44, 
> 49
. foreach i of numlist 5/9  {
  2.         preserve
  3.                 capture noisily keep if stp=="E5400000`i'"
  4.                 capture noisily export delimited using "./output/input_con
> temporary_matching_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(28,020 observations deleted)
(note: file ./output/input_contemporary_matching_stp5.csv not found)
file ./output/input_contemporary_matching_stp5.csv saved
  965
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp6.csv not found)
file ./output/input_contemporary_matching_stp6.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp7.csv not found)
file ./output/input_contemporary_matching_stp7.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp8.csv not found)
file ./output/input_contemporary_matching_stp8.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp9.csv not found)
file ./output/input_contemporary_matching_stp9.csv saved
  934

. 
. foreach i of numlist 10 12/17 20/27 29 33 35/37 40/44 49 {
  2.         preserve
  3.                 capture noisily keep if stp=="E540000`i'"
  4.                 capture noisily export delimited using "./output/input_con
> temporary_matching_stp`i'.csv", replace
  5.                 count
  6.         restore
  7. }
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp10.csv not found)
file ./output/input_contemporary_matching_stp10.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp12.csv not found)
file ./output/input_contemporary_matching_stp12.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp13.csv not found)
file ./output/input_contemporary_matching_stp13.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp14.csv not found)
file ./output/input_contemporary_matching_stp14.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp15.csv not found)
file ./output/input_contemporary_matching_stp15.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp16.csv not found)
file ./output/input_contemporary_matching_stp16.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp17.csv not found)
file ./output/input_contemporary_matching_stp17.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp20.csv not found)
file ./output/input_contemporary_matching_stp20.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp21.csv not found)
file ./output/input_contemporary_matching_stp21.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp22.csv not found)
file ./output/input_contemporary_matching_stp22.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp23.csv not found)
file ./output/input_contemporary_matching_stp23.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp24.csv not found)
file ./output/input_contemporary_matching_stp24.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp25.csv not found)
file ./output/input_contemporary_matching_stp25.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp26.csv not found)
file ./output/input_contemporary_matching_stp26.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp27.csv not found)
file ./output/input_contemporary_matching_stp27.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp29.csv not found)
file ./output/input_contemporary_matching_stp29.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp33.csv not found)
file ./output/input_contemporary_matching_stp33.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp35.csv not found)
file ./output/input_contemporary_matching_stp35.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp36.csv not found)
file ./output/input_contemporary_matching_stp36.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp37.csv not found)
file ./output/input_contemporary_matching_stp37.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp40.csv not found)
file ./output/input_contemporary_matching_stp40.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp41.csv not found)
file ./output/input_contemporary_matching_stp41.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp42.csv not found)
file ./output/input_contemporary_matching_stp42.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp43.csv not found)
file ./output/input_contemporary_matching_stp43.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp44.csv not found)
file ./output/input_contemporary_matching_stp44.csv saved
  934
(28,051 observations deleted)
(note: file ./output/input_contemporary_matching_stp49.csv not found)
file ./output/input_contemporary_matching_stp49.csv saved
  934

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/split_stps.log
  log type:  text
 closed on:  15 Sep 2022, 14:47:49
-------------------------------------------------------------------------------
